[
  {
    "avgDifficulty": 1.5,
    "avgRating": 3.5,
    "department": "Academic Services",
    "firstName": "Huy",
    "id": "VGVhY2hlci0yNjgzODcx",
    "lastName": "Nguyen",
    "legacyId": 2683871,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Nguyen is a professor , Ive learned a lot on his class and he is open to help and listen to his students. Also he gives extra time to finish homework assignments and extra credit.",
        "course": "ESEPSY1259"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "its an easy A, but the class is the equivalent of telling a depressed person to not be sad. I didnt learn any new study strategies, or become a better student. Just wasted my Tuesday and Thursday Afternoons. in person during covid which made me anxious. Prof hated zoom and would not let you use it. for a well being class there wasnt a lot of care.",
        "course": "ESEPSY1259"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "Academic Services",
    "firstName": "Robert",
    "id": "VGVhY2hlci0yNzQzMTIz",
    "lastName": "Decatur",
    "legacyId": 2743123,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "This entire class was comprised of soft-spoken lectures that no one could hear or understand. All students just went on their phones or computers as he spoke. He is also an incredibly harsh grader but doesn't tell you why you get what you get. He just puts a number on it. Everyone I know in class is really disappointed with how it ended up being.",
        "course": "DSSJ35565"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Academic Services",
    "firstName": "Joanna",
    "id": "VGVhY2hlci0yMjI2NzI4",
    "lastName": "Spanos",
    "legacyId": 2226728,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joanna is super funny and caring and she's a great advisor!! Sorry to say that survey class is boring but it does help you figure out your schedule. Joanna really helps you plan out everything.",
        "course": "ASC1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joanna is extremely good at her job; she knows an insane amount of course codes off of the top of her head and definitely knows what shes doing. Shes a great advisor and survey with her is as fun as a survey course can be.",
        "course": "SURVEY1100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great adviser and does a great job teaching survey!",
        "course": "SURVEY1000H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I LOVE JOANNA! She is a great advisor and always willing to help. Her office is always open (during walk-ins or if you schedule an appt). She is funny and caring. Helpful when scheduling and planning ahead becomes stressful. Survey is required so why not take it with the best advisor ever?!?!",
        "course": "SURVEY1100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Academic Services",
    "firstName": "Zac",
    "id": "VGVhY2hlci0yNjU4MTEx",
    "lastName": "Patterson",
    "legacyId": 2658111,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Zac is fire. Super laid back, cares about us STEM scholars and is always trying to give us opportunities. Plus he gets us food! ",
        "course": "ARTSSCI1120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "great person, very calm and just overall has a great energy",
        "course": "ARTSSCI1120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.3,
    "department": "Academic Services",
    "firstName": "Lorraine",
    "id": "VGVhY2hlci0yMzYyMDk2",
    "lastName": "Wallace",
    "legacyId": 2362096,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Wallace is amazing. She is so easy to talk to, and this was one of the only classes I had that were under 20 students. Throughout the whole course we did one project, and (a year later) it was all worth it because we were published! Dr. Wallace also helped me tremendously during the med school application cycle and is just a great person!",
        "course": "MEDCOLL3998"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr. Wallace was a fine professor but she took on more than she could chew with this course. She had to be in charge of 7 different academic papers. Every week we would go over the same things because she couldn't remember what we discussed previously. We would only meet for about ten minutes each week.",
        "course": "MEDCOLL3998"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class to add an extra credit hour to my week. It ended up being very enjoyable, classes weren't every single week, assignments were doable, and the professor cares and is super friendly. Opened my eyes to different kinds of research&amp; you can get to watch Mythbusters! 10/10 would recommend!",
        "course": "ARTSSCI1137"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Academic Services",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yODI2NTA4",
    "lastName": "Oilar",
    "legacyId": 2826508,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Brian was a very nice and kind professor! He cares a lot about his students.",
        "course": "EXP1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.7,
    "department": "Academic Services",
    "firstName": "Benjamin",
    "id": "VGVhY2hlci0xNzc3NDMy",
    "lastName": "Fortman",
    "legacyId": 1777432,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had Ben Fortman for my Humanities Scholars seminar, and he was great. He was really in-touch with the students, he was very helpful, and the class was really fun. There's not much to say other than I think he's pretty cool.",
        "course": "ARTSSCI112003"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "I had Ben for my Humanities Scholars Seminar. He is a very clear communicator. And you can tell he absolutely cares about his students. Go to his office hours. If he doesn't know the answer to your question, he has the resources to know who can help you. ",
        "course": "ARTSSCI112003"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ben is great! He is so fun and really cares about his students.",
        "course": "ARTSSCI112003"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "My humanities friends and I loved Ben! He's super super nice and pretty much universally adored by the scholars. He loves to get to know his students and tries to orient the class lectures in ways that will help our university careers. He has kind of a weird energy - like, he's just a little bit awkward.",
        "course": "ARTSCI2000"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Some of the classes are a little boring, but if you don't like one, the next week will be totally different. Group film project is the only difficult assignment and it's still fairly easy, just a little more time consuming. Ben is a great guy, you'll come to love him as a Humanities Scholar",
        "course": "ARTSCI2000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ben cares a lot about the Humanities Scholars and takes the time to get to know them. He's the best!!",
        "course": "ARTSCI2000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Every Humanities Scholar loves Ben! Incredibly nice and caring guy",
        "course": "ARTSC2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.8,
    "department": "Academic Services",
    "firstName": "Jorge Eduardo",
    "id": "VGVhY2hlci0yMjM5NjU1",
    "lastName": "Mendoza",
    "legacyId": 2239655,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jorge Eduardo is awesome! He really wants to help students succeed in college.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "His class can be challenging if you are not ready to work or keep up with deadlines. If you do the work and put the effort you will end up with an A. The interview project is the most challenging assignment, be sure to follow instructions and write professionally. He will give you feedback and give you the chance to revise it.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "The assignments are fun and do not take much time. The only one that takes time is the interview assignment but he gives you 8 weeks to finish it. Some of my friends complained about the work and their grade but they were lazy and left everything to the last minute.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "At first I thought this class was a waste of time but then things got better. The assignments are actually beneficial to the students. I got a research position through the interview project.",
        "course": "SCHOLARS1100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He legitimately cares about the students. He is strict on deadlines submissions.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ill rather take this class over chemistry",
        "course": "SCHOLAR1100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "His grading can be slow, but gives good feedback. Keep up with deadlines!! Sometimes he sends emails with deadline reminders but not all the time. I missed two assignments and hurt my grade.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I think he gives more assignments to students than other scholar programs. Don't be lazy and you'll be ok.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I did not love the class but he is funny and cares about the students. Do the work, keep up with the deadlines, and you will do good.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jorge Eduardo gives mostly assignment that help you become a better student, get acquainted with the university, or about internships. As long as you do the work and put an effort you will get an A.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jorge Eduardo is a very funny instructor and tries to vary the class dynamic. He is comprehensive, but he expects you to turn in your assignments on time. He is also wants you to do well in all of your classes, and he will provide study tips if you ask for them.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jorge Eduardo cares a lot about the Scholars and takes the time to get to know them. The class format varies from the typical lecture to group presentations, or discussions.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jorge Eduardo is funny and cares about his students. You get what you invest from this class. His class allowed me to think about aspects of science that I had not consider in the past. I learned about internships, diversity and inclusion, and communicating properly with professors. Ignore the entitled students with negative reviews.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jorge Eduardo, encourages us to learn about internships, along with different useful things related to science.",
        "course": "SCHOLAR1100"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 2,
        "comment": "All he wants to talk about is diversity and how women and minorities are victimized in STEM. Class was very unstructured and I would say I learned almost nothing and wasted 90% of the time I spent in his class. If you just show up he wants to and will give you an easy A though.",
        "course": "SCHOLAR1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.5,
    "department": "Academic Services",
    "firstName": "Jamie",
    "id": "VGVhY2hlci0xNjQ5MDQz",
    "lastName": "Paulson",
    "legacyId": 1649043,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Jamie is probably the one professor I dislike. I had her for my Survey class for exploration and she treats all her students like pre-schoolers. Beware. She also cannot stop smiling when she talks. Creepy at times",
        "course": "EXP101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.4,
    "department": "Academic Services",
    "firstName": "Lorraine",
    "id": "VGVhY2hlci01NDY5OTE=",
    "lastName": "Pennyman",
    "legacyId": 546991,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "The class was worthless but as a freshman you have to take it. Lorraine does an okay job but it is a boring class so that could be why I think so.",
        "course": "BUSAD100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best teacher and advisor in the world! Seriously!",
        "course": "BADM100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great teacher, very helpful and really cares about students. go to the class, its easy if you go + attendance is required. an easy A",
        "course": "BUS100G"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "i LOVE Lorraine. Even though this is just a survery class, she is so helpful and so dedicated to her students. She is also really young and funny so lectures are fine. YOU WANT HER!",
        "course": "BUS100G"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Survey class: Go to class, some of the information is useful.  Easy if you show up to class and do the minimum amount of work.  Its pretty hard not to get an A or B",
        "course": "BUS100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "COS220"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Best instructor i've ever had.  I miss Lorraine!",
        "course": "BUSINESSSURVEY"
      }
    ],
    "SEI": []
  }
]