[
  {
    "avgDifficulty": 1,
    "avgRating": 4.7,
    "department": "Academic Services",
    "firstName": "Benjamin",
    "id": "VGVhY2hlci0xNzc3NDMy",
    "lastName": "Fortman",
    "legacyId": 1777432,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had Ben Fortman for my Humanities Scholars seminar, and he was great. He was really in-touch with the students, he was very helpful, and the class was really fun. There's not much to say other than I think he's pretty cool.",
        "course": "ARTSSCI112003"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "I had Ben for my Humanities Scholars Seminar. He is a very clear communicator. And you can tell he absolutely cares about his students. Go to his office hours. If he doesn't know the answer to your question, he has the resources to know who can help you. ",
        "course": "ARTSSCI112003"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ben is great! He is so fun and really cares about his students.",
        "course": "ARTSSCI112003"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "My humanities friends and I loved Ben! He's super super nice and pretty much universally adored by the scholars. He loves to get to know his students and tries to orient the class lectures in ways that will help our university careers. He has kind of a weird energy - like, he's just a little bit awkward.",
        "course": "ARTSCI2000"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Some of the classes are a little boring, but if you don't like one, the next week will be totally different. Group film project is the only difficult assignment and it's still fairly easy, just a little more time consuming. Ben is a great guy, you'll come to love him as a Humanities Scholar",
        "course": "ARTSCI2000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ben cares a lot about the Humanities Scholars and takes the time to get to know them. He's the best!!",
        "course": "ARTSCI2000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Every Humanities Scholar loves Ben! Incredibly nice and caring guy",
        "course": "ARTSC2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Academic Services",
    "firstName": "Zac",
    "id": "VGVhY2hlci0yNjU4MTEx",
    "lastName": "Patterson",
    "legacyId": 2658111,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Zac is fire. Super laid back, cares about us STEM scholars and is always trying to give us opportunities. Plus he gets us food! ",
        "course": "ARTSSCI1120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "great person, very calm and just overall has a great energy",
        "course": "ARTSSCI1120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.3,
    "department": "Academic Services",
    "firstName": "Lorraine",
    "id": "VGVhY2hlci0yMzYyMDk2",
    "lastName": "Wallace",
    "legacyId": 2362096,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Wallace is amazing. She is so easy to talk to, and this was one of the only classes I had that were under 20 students. Throughout the whole course we did one project, and (a year later) it was all worth it because we were published! Dr. Wallace also helped me tremendously during the med school application cycle and is just a great person!",
        "course": "MEDCOLL3998"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr. Wallace was a fine professor but she took on more than she could chew with this course. She had to be in charge of 7 different academic papers. Every week we would go over the same things because she couldn't remember what we discussed previously. We would only meet for about ten minutes each week.",
        "course": "MEDCOLL3998"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class to add an extra credit hour to my week. It ended up being very enjoyable, classes weren't every single week, assignments were doable, and the professor cares and is super friendly. Opened my eyes to different kinds of research&amp; you can get to watch Mythbusters! 10/10 would recommend!",
        "course": "ARTSSCI1137"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Academic Services",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yODI2NTA4",
    "lastName": "Oilar",
    "legacyId": 2826508,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Brian was a very nice and kind professor! He cares a lot about his students.",
        "course": "EXP1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "Academic Services",
    "firstName": "Robert",
    "id": "VGVhY2hlci0yNzQzMTIz",
    "lastName": "Decatur",
    "legacyId": 2743123,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "This entire class was comprised of soft-spoken lectures that no one could hear or understand. All students just went on their phones or computers as he spoke. He is also an incredibly harsh grader but doesn't tell you why you get what you get. He just puts a number on it. Everyone I know in class is really disappointed with how it ended up being.",
        "course": "DSSJ35565"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 3.5,
    "department": "Academic Services",
    "firstName": "Huy",
    "id": "VGVhY2hlci0yNjgzODcx",
    "lastName": "Nguyen",
    "legacyId": 2683871,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Nguyen is a professor , Ive learned a lot on his class and he is open to help and listen to his students. Also he gives extra time to finish homework assignments and extra credit.",
        "course": "ESEPSY1259"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "its an easy A, but the class is the equivalent of telling a depressed person to not be sad. I didnt learn any new study strategies, or become a better student. Just wasted my Tuesday and Thursday Afternoons. in person during covid which made me anxious. Prof hated zoom and would not let you use it. for a well being class there wasnt a lot of care.",
        "course": "ESEPSY1259"
      }
    ],
    "SEI": []
  }
]