[
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.8,
    "department": "Aerospace Engineering",
    "firstName": "Mrinal",
    "id": "VGVhY2hlci0yMjg0NTUy",
    "lastName": "Kumar",
    "legacyId": 2284552,
    "numRatings": 9,
    "summary_comment": "Dr. Zhuang is a knowledgeable and dedicated professor who provides fair assessments and useful resources. Her classes can be dry and equation-heavy, but she effectively supports her students, especially through review sessions and clear exam preparation guidance. However, lectures may benefit from more engagement to keep students interested.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Kumar is a masterclass in teaching an engineering course. A refreshing contrast to monotone lectures from other prof's, his lectures are lively and enthusiastic, keeping my attention and inspiring me to learn the content. Course notes are downright excellent; effectively their own textbook. Exams are fair yet conceptual. Brilliant all around",
        "course": "AE3522"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not good, just not good. Get ready for his holy bible of astronautics notes that the entire class is based on and that he basically just reads every lecture.",
        "course": "AE3522"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst professor I've had. He makes so many mistakes and rude also. Faculty at the university he used to teach at before OSU told him to stop researching astrodynamics....he should have listened",
        "course": "AE3522"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is incredibly slow at grading anything (roughly 1 month to grade a single midterm). His lectures/notes are completely irrelevant to the homework...there is a huge disconnect between the notes and hw material. He also has a very strange test format.",
        "course": "AE3522"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not good and very mean",
        "course": "AAE3520"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Kumar is genuinely an amazing professor for orbital mechanics. His exams are fair and graded easily, and he often records solutions to the homework problems. His lecture notes are some of the best I have ever seen (Typed, neat, equations numbered), and he is very approachable. Def. one of the best profs at OSU.",
        "course": "AE5626"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Kumar's class is very difficult because he keeps his exams very conceptual and his homeworks are high level. That being said, i've learned more from him than in most of my other classes. His lectures are very comprehensive and he explains the concepts very well. He asks a lot of you but if you keep up, it is well worth the effort.",
        "course": "AAE3520"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "this guy is a horrible. He gives you homeworks that super tedious and long and not really helpful for his exams. His online notes are super long and too detailed which is not really helpful as well. He thinks everyone is so smart and understands materials straight forward - which is not true. I suffered a lot, bet u gonna suffer a lot so good luck.",
        "course": "AAE3520"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Kumar is exceptional in all regards. He has incredible online notes, but going to class helps out tremendously because he explains everything in a slightly different way than the notes. Homework and tests are conceptually difficult at first, but once you get the hang of it the class isn't bad at all. Would recommend.",
        "course": "AAE3520"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "5626",
        "Class Name": "Orbital Mechanics for Engineers",
        "Class Number": "10543",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.86"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5626",
        "Class Name": "Orbital Mechanics for Engineers",
        "Class Number": "33349",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "37",
        "Rating": "4.95"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5626",
        "Class Name": "Orbital Mechanics for Engineers",
        "Class Number": "11529",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "38",
        "Rating": "4.92"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "8830",
        "Class Name": "Random Dynamical Systems",
        "Class Number": "37190",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.6,
    "department": "Aerospace Engineering",
    "firstName": "Jack",
    "id": "VGVhY2hlci0xMzQ2NDc5",
    "lastName": "MacNamara",
    "legacyId": 1346479,
    "numRatings": 17,
    "summary_comment": "Andrew is highly regarded for his exceptional teaching skills and ability to make complex mathematical concepts accessible and engaging. Students consistently praise his knowledge, friendliness, and willingness to help, noting that he goes above and beyond to assist them both in and out of class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "His grading scheme is so weird. The homeworks he assigns takes hours cause he does easy problems in class and challenging ones on the homework. Then he puts harder ones on the exam. Horrible class",
        "course": "AAE3542"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "The dude does not want to teach ",
        "course": "AAE3542"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The material in this class can be super boring and the homeworks he assigns take super long cause he does such simple examples in class which don't relate at all with the homework. Not helpful at all in office hours and treats people like they are stupid. Historically, exams are near impossible but this semester, he made them not too bad. ",
        "course": "AAE3542"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Good luck!",
        "course": "AAE3542"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dude is rough",
        "course": "AAE3543"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "only flight vehicle structures prof in aero program. Material is interesting, but lecture is boring. Osu should probably replace him",
        "course": "AAE3543"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Tough class, cant take it with other profs so you have to deal with him. Avoid if possible.",
        "course": "AAE3543"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Makes tests difficult and assigns a couple HomeWorks a semester which take hours because the examples done in class don&#39;t relate to the homework very well. He is open and honest about having horrible test averages. His grading system is very awful. Get ready to be disappointed by this class no matter how many hours you study. Avoid if possible.",
        "course": "AAE3543"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great guy. Lectures can be derivation heavy at times, but he breaks the monotony by cracking a few jokes and going off topic.",
        "course": "AAE5645"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best professor at OSU, actually learned something in this class",
        "course": "AAE5645"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Structures 1 is very out there and much of it makes no sense at all to be honest.  Structures 2 is much more tangible and actually his tests weren't bad.  The final was very fair. I hope he publishes his notes into a textbook someday.",
        "course": "AAE3543"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very upfront about how hard this class is, which is an understatement. While he was funny and a relatively good teacher, unless you go to every office hour be prepared to do abysmally in the class. Homeworks were a pain in the ass, final was impossible.",
        "course": "AAE543"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very difficult course.  You know the class will be difficult when he tells you the first day that the averages usually range between 40% and 50% and he curves from there.  If you crack some jokes with him and participate in class, things are easier on you.",
        "course": "AAE543"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "I got an A in the class but I can't say it was easy because I worked my ass off for it. The lectures were a bit boring but he broke it up every once in a while and cracked some jokes. The exams were simple besides his picky T/F and the final question was always extremely hard. Good intro professor, I enjoyed his class and his approach to questions.",
        "course": "AAE200"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "It was his first time teaching AAE 200 (normally teaches jr level or higher). It seemed harder than a 200 level class, but it is aero. His homeworks are nothing like the midterm or final. All he does during lectures is deriving equations.",
        "course": "AERO200"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Jack Mc....he went to Michigan",
        "course": "AAE200"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 2,
        "comment": ":/",
        "course": "AAE200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2.7,
    "department": "Aerospace Engineering",
    "firstName": "Ken",
    "id": "VGVhY2hlci0yMTMwOTQ5",
    "lastName": "Gordon",
    "legacyId": 2130949,
    "numRatings": 22,
    "summary_comment": "Ken Gordon is a fair but demanding professor who grades tests leniently but is strict with early coursework and homework. His lectures are often criticized for being confusing and poorly delivered, leading to inconsistent understanding among students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Good luck. ",
        "course": "ME2040"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good and fair professor, grade tests leniently, just make sure to score high on the first half of this class since that is the easy half.",
        "course": "ME2040"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you have disability services avoid this prof at all costs. He does not respect people with disability services. His lectures suck but if you dont go then you fail. His homework is graded by 5 year olds. There is no consistency in grading. His exams are hard but graded fairly. He really enjoys bulling students for asking questions. HES CANADIAN",
        "course": "ME2040"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is his ME2040 class which was not available choice. Don't skip class unless you enjoy self-learning. He doesn't have any recorded lectures, only online notes. Regarding exams, his exams are hard. I wish i had the other prof. He also doesn't give practice exams. This class is also not curved but is close to the level of physics. ",
        "course": "ME2850"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "he bullies students for asking questions",
        "course": "ME2850"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I honestly wish every professor was like Dr. Gordon. He had the clearest grading criteria for homework I've ever seen! You couldn't miss a requirement, and you didn't have to guess what he wanted: he tells you EXACTLY what he wants on EVERY homework.",
        "course": "AE3581"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Ken Gordon has good intentions but doesnt comprehend the fact that 80% of his students dont understand what he is saying. He teaches concepts by using abstract examples and leaves us more confused than before. Homework takes 6-8 hours and his questions are worded in a very annoying manner. Expects a lot, and exams are horrendously paced.",
        "course": "ME2850"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "Ken Gordon is an incredible lecturer. He makes the content clear and you will learn the content. Although you learn the content, it is still very easy to get a poor grade. The assignments are very long and graded harshly, and while the midterms are straightforward, they are graded harshly as well. He is cool but a bit twitchy and passive aggressive",
        "course": "AAE3581"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "He's just not a very good teacher and doesn't understand how students don't get what he's saying. He expects a lot of his students but is a very harsh grader on even the smallest of assignments.",
        "course": "ME2850"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Kenny G has some weird vibes like he seems really nice but it's like fake nice. The concept quizzes kind of suck since he only gives you a few minutes to answer some tricky questions. The homework can sometimes take a while since it can be hard to understand how to answer the questions using what he says in lecture. The exams aren't too bad though",
        "course": "ME2850"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Gordon is a fair professor who clearly explains the course material. Passionate about his subject matter and very knowledgeable. Make sure to understand the homework and concept quizzes and you will be fine.",
        "course": "ME2850"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very enthusiastic, but also a lot harder than needs to be. Likes to ask trick questions. Sometimes says he won't go further on a subject because it's something on our homework and we should learn it on our own.",
        "course": "ME2850"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Ken Gordon is one of the most knowledgeable and well prepared professors I have had the pleasure of learning from. His homeworks, while many, are fair and if you take the time to actually do them they are actually quite helpful. His exams are difficult, but not because he tries to trick you or because he intends them to be.",
        "course": "AERO3581"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 5,
        "comment": "Nice guy, smart, very enthusiastic about subject and seems to care about students. But he isn't always the best at explaining things, and the class is very difficult. Some things seemed to be made more difficult than they needed to be.",
        "course": "ME2850"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "He seems to love the material and is smart, but the pros end there. He has a very petty vibe/ mannerisms, which includes lecture, emails, answering questions, and through the tricky worded tests and HWs. I found this material to be difficult, and his condescending approach and single one hour office hours didn't help. Overall didn't enjoy the class",
        "course": "ME2850"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "I fully believe that Ken loves teaching and is insanely smart but he cannot explain anything on a basic, first time seeing the material level (which is what this class is). He makes you feel stupid for asking any questions and then doesn't answer them. The exams honestly weren't bad but the average homework grade was a D after spending hours on it.",
        "course": "ME2850"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "I prefer to study myself with aid of textbook and online free sources. He made this course harder than it should be. Heat transfer is no rocket science, I would prefer another lecturer for this course. This dog does not know how to respect students.",
        "course": "ME4510"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "I found his lectures and homework assignments to be very confusing. He sent many clarifications for homework as the instructions were hard to understand. Be ready to write long Matlab codes for homework which are strictly graded. When you ask a question in class he doesn't like to give a direct answer which is really frustrating.",
        "course": "ME2850"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "Choose another instructor if you have other options. He makes you lose all your interests to your major, tough grader, boring classes, not posting the grades on Carmen, limit office hours!",
        "course": "ME2850"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy was put on this earth to be a teacher. His class is in no way easy but he doesn't create any roadblocks to you succeeding. If you fail, it's on you. I wish every professor followed his format of teaching.",
        "course": "AAE3581"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I've had. He made thermo much easier than what everybody was depicting it to be. Great guy as well. Don't skip class because those lectures are some of the best you'll ever get to listen to in your life and are vital to success in the class. Would take again in a heartbeat. Homework can be long but it's worth every point.",
        "course": "AE2405"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Made what I thought was going to be an absolutely terrible/difficult class something I looked forward to each week. Lectures are some of the best I've ever been to. Key points are well defined and the entire thought process behind a problem was presented very clearly. He is clearly passionate about the material and it makes class fun.",
        "course": "AEROENG2405"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "3581",
        "Class Name": "Numerical Methods in Aerospace Engineering",
        "Class Number": "6957",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "56",
        "Rating": "4.8"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "2850.01",
        "Class Name": "Numerical Methods in Mechanical Engineering",
        "Class Number": "6705",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "47",
        "Rating": "4.26"
      }
    ]
  },
  {
    "avgDifficulty": 5,
    "avgRating": 5,
    "department": "Aerospace Engineering",
    "firstName": "John",
    "id": "VGVhY2hlci0zMDA2Njc4",
    "lastName": "Cherry",
    "legacyId": 3006678,
    "numRatings": 1,
    "summary_comment": "The professor is highly regarded for their overall teaching quality, consistently receiving positive feedback from students for their expertise and clarity in instruction.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "great professor overall ",
        "course": "lecture"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.4,
    "department": "Aerospace Engineering",
    "firstName": "Brandon",
    "id": "VGVhY2hlci0xNzY2NjQ3",
    "lastName": "Cesul",
    "legacyId": 1766647,
    "numRatings": 5,
    "summary_comment": "BT Cesul is highly regarded as an exceptional and knowledgeable professor, known for his engaging and relatable teaching style and willingness to go above and beyond in supporting students' career goals. However, some students found his classes to cover material superficially, particularly in freshman-level courses, which may not provide sufficient depth for advanced study.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "BT Cesul is an INCREDIBLE professor! He's relatable and doesn't take himself too seriously. He is an excellent resource and although I took him for a required course, I would easily take him again just for fun.",
        "course": "EDSGN100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Cesul was hired to teach a SENIOR DESIGN CLASS.  He ended up teaching at a FRESHMAN level.  While the alternative air option class turned in a 50 page paper, his space option class final paper had a 4 page MAX limit.  Most of the subject matter covered wasn't in depth enough to be useful and has set us back for the rest of the year.",
        "course": "AAE4517"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wow, just wow.  What an amazing prof for the Aero dept.  He was like a breath of fresh vacuum, to our astronautical minds.  But seriously, he was a very knowledgeable prof who provided us with vast amounts of information, but more than that he instilled motivation in our class to learn.",
        "course": "AAE4517"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I was fortunate enough to have Dr. Cesul teach my senior design class for a semester. Though it was his first time teaching, he did an excellent job covering a vast quantity of material that none of my other courses had begun to teach. It's obvious he's very knowledgeable on satellite design. I would definitely take another course taught by him.",
        "course": "AAE4517"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Cesul taught our S/C Design class for the semester. He is very interested in teaching and helping students learn. He was also very willing to help students apply for jobs or graduate school. He went above and beyond just the teaching roll.  Dr. Cesul will be a great addition to any University that is smart enough to hire him.",
        "course": "AAE4517"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 1.9,
    "department": "Aerospace Engineering",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yNjUyMDgw",
    "lastName": "Ritchie",
    "legacyId": 2652080,
    "numRatings": 10,
    "summary_comment": "Dr. Ritchie is widely regarded as a poor instructor, with students criticizing his unhelpful lectures, strict and inflexible grading policies, and condescending attitude. Many found his teaching methods ineffective and his interactions with students to be rude and unproductive.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "He was helpful, supporting and very friendly ",
        "course": "AE2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "He's great. ",
        "course": "AERO2200"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ritchie is easily not only the worst professor but the worst teacher I've ever had. He does not grade crucial material on time, then he blames you for it. He is incredibly lazy; don't expect him to go out of his way to do ANYTHING. Don't bother having a grade dispute, because I have documentation proving he doesn't even follow his own policy.",
        "course": "AE4510"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ritchie is probably one of the worst professors at Ohio State. He is condescending in class, doesn't follow his own grading policy, doesn't meet his own time requirements for grading things, and gives terrible lectures. He fell asleep during my group's final presentation, like come on dude. Labs take way too long to complete and are super vague",
        "course": "AE4510"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Actually a ridiculously bad teacher. I've had him for 4 total classes (by far the most out of every professor I've had), and each class is just filled with pointless and vague busy work, terrible and un-instructive lectures, and hostile, lengthy, unhelpful answers to questions... all of which are delivered in a condescending tone by Ritchie.",
        "course": "AAE4511"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ritchie will break you. I was an optimist, bordering on happy, until this class. 12 hours in the lab twice a week, 15 assignments over the course of 14 days (a week before graduation) and enough bureaucratic pointless assignments to make a congressman cry. Dr. Ritchie will pit your group against eachother with CATME, and then laugh. Life sucks.",
        "course": "AAE4512"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Brian Ritchie was unfit to teach heat transfer b/c: 1. He doesnt know how to teach students 2. He doesnt know heat transfer I would recommend choosing any other professor over him b/c his lectures are unhelpful (just clicks thru textbook slides), his assignments arent even relevant, and to top it off, hes rude and condescending. Avoid him",
        "course": "ME4510"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "You will be watching a series of videos each week, and he will just poorly repeat what is in those videos. He wastes a lot of time ranting about things like football, so he ends up skipping a lot of slides about example problems. He seems bored during these lectures and acts rude when asked questions. My TA was much more helpful than him.",
        "course": "AERO2200"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "All he does is read from the slides, I learned more from the videos and my TA then from him. He is also very rude and ignorant sometimes. Maybe, it was because the class was changed to online, but I would not take his class again. I also think he just pretend to care about the student and the course, but in reality doesn't do anything to help us.",
        "course": "AE2200"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dont expect to learn much from lectures youll learn 90% from the pre recorded lectures from the previous professor. Changes exam style last minute for final from other exams. He will help you if you ask for it. I give credit for adapting to online instruction but clicking through pre made slides was not helpful.",
        "course": "AERO2200"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "11061",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "125",
        "Rating": "4.16"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4510",
        "Class Name": "Experimental Projects I",
        "Class Number": "10542",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "54",
        "Rating": "3"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4511",
        "Class Name": "Experimental Projects II",
        "Class Number": "6857",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "58",
        "Rating": "3.36"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5752",
        "Class Name": "Advanced Space Propulsion",
        "Class Number": "6966",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "3.63"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "33358",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "67",
        "Rating": "3.45"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "36094",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "73",
        "Rating": "3.05"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4510",
        "Class Name": "Experimental Projects I",
        "Class Number": "33348",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "72",
        "Rating": "2.73"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2405",
        "Class Name": "Thermodynamics",
        "Class Number": "29967",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "105",
        "Rating": "4"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4511",
        "Class Name": "Experimental Projects II",
        "Class Number": "29971",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "61",
        "Rating": "3.07"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "11912",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "112",
        "Rating": "4.34"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4510",
        "Class Name": "Experimental Projects I",
        "Class Number": "11528",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "79",
        "Rating": "3.47"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4511",
        "Class Name": "Experimental Projects II",
        "Class Number": "11357",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "84",
        "Rating": "3.73"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5610",
        "Class Name": "Helicopter Aerodynamics",
        "Class Number": "11458",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "19",
        "Rating": "3.89"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "11797",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "137",
        "Rating": "4.13"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "39025",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4510",
        "Class Name": "Experimental Projects I",
        "Class Number": "11480",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "77",
        "Rating": "3.96"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4511",
        "Class Name": "Experimental Projects II",
        "Class Number": "11240",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "70",
        "Rating": "3.91"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5610",
        "Class Name": "Helicopter Aerodynamics",
        "Class Number": "11338",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.33"
      }
    ]
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 1.5,
    "department": "Aerospace Engineering",
    "firstName": "Rama",
    "id": "VGVhY2hlci0xMTI4Njgw",
    "lastName": "Yedavalli",
    "legacyId": 1128680,
    "numRatings": 34,
    "summary_comment": "Based on student comments, Professor Rama is widely regarded as having poor teaching quality and unfair grading practices, leading to a highly negative learning experience. Students describe him as confusing, unhelpful, and intentionally difficult, with one comment suggesting he should not be teaching at all.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "You wont have a good grade if you skip class but in the same time, you wont understand being in the class. Either way, you lose.",
        "course": "AAE3520"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Rama did not tell us how he gave our final grade.",
        "course": "AAE3520"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Super terrible person!",
        "course": "AAE3520"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Rama tried all the ways to fail you in the class.",
        "course": "AAE3520"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Good luck if you have him!",
        "course": "AAE3520"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst class Ive had in my life",
        "course": "AAE3520"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "This person shouldnt teach or grade at all",
        "course": "AAE3520"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Emailed him politely about course questions and then he just turned crazy in his reply. This guy needs to see a doctor not teaching a class. If you had him, good luck! Remember just dont interact with him at all to avoid potential brain injuries.",
        "course": "AAE3520"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Never knew what he talked about",
        "course": "AAE3520"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Wouldve transfer to another school in my senior year if I knew Ill be taught by him.",
        "course": "AAE3520"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Screams all the time. If you caught a mistake on his textbook, he started dancing around and turning mad in the class. It makes no difference attending or not attending his class. Youll get bad grades no matter how hard you tried.",
        "course": "AAE3520"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Just impossible to do well",
        "course": "AAE3520"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worse than the worst",
        "course": "AAE3520"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worest professor I've ever had. Would give a 0 if I can. Don't know why the department hasn't replaced him. He gave his textbook and exams with printing and written mistakes which he called remarks. Appeears to be welling to help until you asked him questions, he started yelling at you. Wish I could've avoid it.",
        "course": "AAE3520"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "My group had Yedevalli for Intro to Aero II and Flight Dynamics. In the time we had him, he stated that we were the worst students he had taught. He would not state how he calculated final grades and was consistantly arguing with students in class. He had no prepared lecture notes, only read from his textbook. If you get him, enjoy his circus.",
        "course": "AAE3520"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "Best professor I've had in my life. Encourages self learning throughout the course by making it hard for his students to listen in class so they are forced to study on their own.",
        "course": "AAE3520"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "If there's one word to describe Rama, it is consistent. Over the course of the semester he consistently berated students for misunderstanding material, ranted about how we were failing as engineering students, uploaded incomplete reading material that he calls his &quot;textbook&quot;, and on and on. By far the worst professor I've had at OSU. Stay away.",
        "course": "AAE3520"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "Literally the worst professor Ive ever had.",
        "course": "AAE3520"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "Absolutely awful. Stay as far away as possible from him. Terrible teacher and his class was a terrible learning environment. Worst professor Ive ever had and its not even close.",
        "course": "AAE3520"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "By far the worst professor at OSU",
        "course": "AAE3520"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "I wish I could give him a 0. One of the most belligerent professors Ive encountered. Expects you to have a deep understanding of the material just by reading his awful book which is riddled with typos and formatting errors.",
        "course": "AAE3520"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 3,
        "comment": "He is confrontational, has anger issues, and refuses to answer most questions. Lectures have zero organization or structure. His custom textbook is beyond useless. You are going to learn controls by watching youtube and googling. The only professor that legitimately wasted my time and money at OSU. He should not be teaching.",
        "course": "AAE3521"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 3,
        "comment": "SCREAMS A LOT. You will want to laugh in his face all the time.  Subj: Great Teaching: Terrible  Wants to help: Yes But does he ? NOPE. Exams will be easy. Just be careful. ",
        "course": "AAE3520"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unprofessional. I was not understanding a main topic in the course, I went to his office hours to ask about it. When I asked he got upset I wasn't understanding, and proceeded on to the other student in the room how dumb of a question it was and how stupid I was. His \"book\" is a scanned illegible handwritten copy of his notes. ",
        "course": "3520"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't sit front row. He might spit on you while he's yelling at the class. But second row he might call you up to the front of the class. But back row he might yell at you for talking. His lectures are confusing, but he tells you exactly what is going to be on the tests. He really does want to see students succeed. He will help if you ask",
        "course": "AAE3520"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "Gets really into some of things he teaches, aka matrices. Likes to yell and jump around, keeps you awake. Really drives in and emphasizes the concepts. Accent isn't too terribly bad. Exams are hard, but if you go to class, study, and read his notes, you'll survive. ",
        "course": "AAE3521"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 3,
        "comment": "Don't even get me started... RK will yell at you if you don't know exactly what is going on. Good luck, dudes. Some exams are super easy, others are ridiculous. Unpredictable and not the most helpful. The course content itself is actually pretty awesome, but he doesn't convey it well nor does actually use the textbook you're supposed to buy...",
        "course": "AAE3521"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 4,
        "comment": "Truly awful professor. Yells and dances around when the class doesn't understand something. Don't turn your homework in until after his lecture is over; he usually goes through the homework pile, picks a homework where someone didn't get all the right answers, and goes through their homework saying how stupid/silly their answers were. Terrible.",
        "course": "AAE3520"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 3,
        "comment": "Spends more time yelling at the class than teaching. Gets angry if the class doesnt have knowledge of a class that isn't a prereq. Views days off as time for an extra assignment. Clearly doesn't look at HW before assigning as they sometimes cover material not in curriculum, or if he made them may be missing data required to solve. Just doesnt care.",
        "course": "AAE3520"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 3,
        "comment": "I literally have no idea what he talked about for the entire class although he did make some pretty funny noises in class.",
        "course": "AAE3520"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 2,
        "comment": "Had him for 3520 (flight dynamics), 3521 (controls), and 5626 (orbital mechanics).  He's very, very into what he does and he would go irate if we did bad as a class in 3520.  However, the next semester he took a cue from the SEIs and mellowed out. He was a very great prof from there on out.",
        "course": "AAE3520"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 3,
        "comment": "He speaks with a very strong Indian accent and is very hard to comprehend what he is saying. His tests are not well balanced at all, e.g. our first test was really easy so he made the second test really difficult with a ridiculous point system with little partial credit. He is completely unpredictable and there is no way to judge how you are doing",
        "course": "AAE580"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is the matrix guy. Very good teacher, has a great expertise in his field. AAE 621 is a lot on linear algebra and it's application in Controls. He is quite helpful as well.",
        "course": "AAE621"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 3,
        "comment": "one of his better classes",
        "course": "AAE626"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "5621",
        "Class Name": "Guidance, Navigation, and Control of Aerospace Vehicles",
        "Class Number": "33621",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "1"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3521",
        "Class Name": "Fundamentals of Flight Vehicle Control",
        "Class Number": "6943",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "65",
        "Rating": "1.48"
      }
    ]
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 5,
    "department": "Aerospace Engineering",
    "firstName": "John",
    "id": "VGVhY2hlci0yMjg2OTY5",
    "lastName": "Horack",
    "legacyId": 2286969,
    "numRatings": 7,
    "summary_comment": "Dr. Horack is highly regarded for his exceptional teaching quality, demonstrating a deep commitment to his students and a passion for leadership education. Students consistently praise his engaging lectures, real-world insights, and genuine care for their well-being and success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took a class with him that wasn't for credit in my major just because he was teaching it. I mean, yes, I was interested in the class, but the main reason was that Dr. Horack was the teacher.",
        "course": "PUBAFRS3620"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is build to lecture then discuss leadership. Gives great stories and life advive. He really cares and demostrates unconventional leadership.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Horack is awesome. He cares about his students, even for online classes. He understands the challenges of students and is willing to adjust the course as needed in light of that. I definitely hope to take another class with Dr. Horack before graduating.",
        "course": "AVIATN2000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very cool and fun guy; makes lectures fun. Unfortunately he has a lot on his plate, so the second professor for the class gave almost every lecture save for a couple.",
        "course": "AAE5626"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors at Ohio State. Dr. Horack is extremely enthusiastic about teaching, and as a student in this class, you'll become enthusiastic too. He cares about his students deeply and is also extremely knowledgeable.",
        "course": "AEROENG5625"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hands down one of the best professors EVER! Usually, I dont like classes that are less structured, but this class is super engaging and you will learn so much in each session. He will teach you so much about leadership; not by some textbook definition, but real, insightful takeaways about character and decision-making. Great class for any major!",
        "course": "PUBAFRS2130"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you plan on working in the space industry at all, taking a class from Horack is an absolute must. He literally knows everyone, and can help you at every step of the way. His lectures are interesting and overall a good guy",
        "course": "AE5626"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "5752",
        "Class Name": "Advanced Space Propulsion",
        "Class Number": "30079",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5752",
        "Class Name": "Advanced Space Propulsion",
        "Class Number": "30080",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.86"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5752",
        "Class Name": "Advanced Space Propulsion",
        "Class Number": "11460",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4517",
        "Class Name": "Design of Space Vehicles and Systems I",
        "Class Number": "11501",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.92"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4517",
        "Class Name": "Design of Space Vehicles and Systems I",
        "Class Number": "11502",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.9"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4518",
        "Class Name": "Design of Space Vehicles and Systems II",
        "Class Number": "11357",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.83"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4518",
        "Class Name": "Design of Space Vehicles and Systems II",
        "Class Number": "11358",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.88"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5752",
        "Class Name": "Advanced Space Propulsion",
        "Class Number": "11339",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5752",
        "Class Name": "Advanced Space Propulsion",
        "Class Number": "11340",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "21",
        "Rating": "4.43"
      },
      {
        "Subject": "ARTSSCI",
        "Catalog": "1138.01",
        "Class Name": "First-Year Seminar",
        "Class Number": "35193",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.92"
      },
      {
        "Subject": "AVIATN",
        "Catalog": "2000",
        "Class Name": "Introduction to the Aviation Industry",
        "Class Number": "36992",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aviation",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "AVIATN",
        "Catalog": "4500",
        "Class Name": "Aviation Capstone",
        "Class Number": "25933",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aviation",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.05"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3620",
        "Class Name": "US Space Policy and the Global Space Economy",
        "Class Number": "35371",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3620",
        "Class Name": "US Space Policy and the Global Space Economy",
        "Class Number": "34368",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3620",
        "Class Name": "US Space Policy and the Global Space Economy",
        "Class Number": "35842",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Aerospace Engineering",
    "firstName": "Colin",
    "id": "VGVhY2hlci0yOTYyNjEw",
    "lastName": "Trussa",
    "legacyId": 2962610,
    "numRatings": 1,
    "summary_comment": "Colin is an excellent lecturer who delivers engaging and interesting material, though his handwriting can be challenging to read. Despite this, he is thorough in clarifying concepts. Exams combine both calculation and conceptual questions, and consistent attendance and attention are key to success in the course. Overall, it is a demanding but rewarding class that students highly recommend.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great lecturer, really interesting material. Colin's handwriting was tricky to follow sometimes, but he was always happy to clarify. \nThe exams were a mix of calculation and conceptual questions.\nShow up to every lecture and pay attention, and you'll do well. It's a tough class - but what did you expect? Highly recommend.",
        "course": "AEROENG3560"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.2,
    "department": "Aerospace Engineering",
    "firstName": "Ali",
    "id": "VGVhY2hlci0yMjEzMTI5",
    "lastName": "Jhemi",
    "legacyId": 2213129,
    "numRatings": 22,
    "summary_comment": "Professor Jhemi is generally considered to be disorganized and ineffective in delivering clear lectures, often reading directly from PowerPoint slides filled with mistakes and tangents. Despite being accessible during office hours and having straightforward exams and homework, many students found his teaching style confusing and unsatisfactory.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Is it a requirement for male professors in the engineering department to be condescending towards women? There are already so few women in aero and this guy had me one rude comment away from switching majors. MAE professors decided to schedule 4 exams on the same day and he proceeded to make fun of me in front of people for not performing well. ",
        "course": "AAE3520"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of my peers did not like Dr. Jhemi, however I found him to be a good prof all around. I did not miss a lecture and I believe this greatly contributed to my success in the class. The exams often had problems from homework, and quizzes often had MC from the lecture notes. He tells you what questions will be on the exam, easy to pass if you try.",
        "course": "MECHENG2010"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Talks over slides and diagrams without doing problems or showing how to approach the material, often goes off on tangents unrelated to anything. Only positive was that he communicated grading criteria very clearly. Attendance was taken usually once a week and quizzes were given semi-regularly. Often complained about students performance on tests.",
        "course": "MECHENG2010"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Lectures are just rambling over PowerPoint slides, goes very slow, and doesn't cover all the material. Has attendance about once a week and 5 min quizzes every so often. The class would be horrible if the tests weren't easy to learn on your own for. Promised a curve on final grades and did not curve unless your grade was within 0.09%",
        "course": "MECHENG2010"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unorganized and didnt seem to care that this is a pre req for lots of students. We were extremely far behind and instead of catching up, he decided to drop content. He understands the content very well but he is a terrible teacher he only knows how to solve the problems not explain. He also expects you to illegally access the course textbook.",
        "course": "MECHENG2010"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Jhemi's a great guy and his exams and homeworks are usually straightforward. However, he's probably the most disorganized lecturer I've had. He corrected his own notes mid-class 10-20 times throughout the semester, and reads right off of his derivation-heavy powerpoint slides. Very confusing lectures. Unintentionally hilarious prof. though",
        "course": "AAE3520"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "His lecture slides were very long and very crowded with a bunch of things that were very confusing. He gives us way too much than we need for the homework and it's super hard sometimes to find what we need for the homework. He's really nice and good at explaining things in office hours and the class is pretty fair as long as you put in some effort.",
        "course": "AAE3520"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Jhemi mainly read from a PowerPoint. Every now and then he would find a mistake and we would have to wait or help him solve it. He was quite lenient with grading his midterms and often would give you points that the graders wouldn't. The textbook wasn't really needed, since he provided all of the problems for the homework. ",
        "course": "MECHENG2010"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Jhemi was a good professor. He always had examples to assist you in class and was available outside of class, too. The homework was generally simple and great practice for exams. The exams were simple, too, like the homework, and packed with lenient grading. For instance, a FBD granted 60% of the points for a question. Good class, good prof.",
        "course": "MECHENG2010"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Prof. Jhemi has industry experience and clearly is an intelligent person, however, that does not make him a good professor. His lecture slides are disorganized, filled with typos and computational errors. He does not explain the materials well for the exams. He spends too much time going off topic. ",
        "course": "AAE3520"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Jhemi is one of my favorite professors. He's not the best teacher, and he makes a lot of spelling errors on all his documents; however, he has fantastic industry experience, is very wise, and his feedback should be followed to the letter. He's also very funny; I enjoy going to his office hours just to talk to him. Highly recommend him!",
        "course": "AE4517"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a good professor, this class just has content that is really hard and you will need to improve on how you view things. 3D thinking when working on problems but he cares and understand and will work with students. I recommend to have him as your professor",
        "course": "AAE3520"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a caring and understanding professor, he cares about his students and his exams are exactly as he taught. he will teach you and explain everything clear. mostly his lectures are fun",
        "course": "AAE2201"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. Just show up to class and he will make sure you know everything you need to know for all the homeworks and exams. If you don't understand something he is very accessible via office hours.",
        "course": "AAE2201"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Cares about student learning. I learned a lot from him, brings good industrial experience to the class.",
        "course": "AAE4510"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "Had Jhemi a couple other times in my academic career and wasn't impressed, but he runs project classes a little better than standard &quot;test&quot; classes. Still very unclear about what he wants for things.",
        "course": "AAE45104517"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 3,
        "comment": "His lectures are pointless and makes mistakes and is corrected by the students. His exams vary from a D average to an A- average and are poorly written and he often has to announce to the class what he means on a certain problem DURING the exam. He emails you the day before what's going to be on his exams and even those emails are misleading.",
        "course": "AAE3542"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Had Jhemi for Aero 3542 as well as Aero 2201. He is incredibly disorganized and is an awful lecturer. On the bright side, the homeworks are usually very straightforward. He seems incapable of creating a fair test though, as they are extremely long and sometimes filled with errors. Blames the students for doing poorly.",
        "course": "AAE3542"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "Rambles sometimes about his past and his experience(Apache main rotors if you want to get on his good side). MATLAB Assignment later in semester is very vague, and he expects students to &quot;experience what he did&quot; PPT's are mixture of atrocious walls of text, and excellent diagrams",
        "course": "AERO2201"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 3,
        "comment": "I took it last sem and it was so bad. Class was easy tbh, but i dont think ive learned anything really useful from him.. anyway yeah i got B+ so thats all it matters  i guess",
        "course": "AERO2201"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "The beginning of the semester was rather chaotic, although a good portion of that was not the fault of the professor. Overall, the man knows what he's talking about and you can learn a lot from him if you're willing to put in the effort. Read the material and go to class. The course content itself isn't too bad, if you paid attention in linear alg.",
        "course": "AAE3520"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Had a rough start to the semester but he improved greatly as time went on. He took our feedback seriously and cared about how we were learning. Class was not too difficult as long you attend his lectures and make sure to read through his notes outside of class. Overall, a pretty solid professor.",
        "course": "AAE3520"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "4517",
        "Class Name": "Design of Space Vehicles and Systems I",
        "Class Number": "11388",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "3.42"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2201",
        "Class Name": "Introduction to Aerospace Engineering II",
        "Class Number": "6852",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "96",
        "Rating": "4.38"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5610",
        "Class Name": "Helicopter Aerodynamics",
        "Class Number": "6964",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "3.88"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3520",
        "Class Name": "Flight Vehicle Dynamics",
        "Class Number": "33264",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "85",
        "Rating": "3.51"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4517",
        "Class Name": "Design of Space Vehicles and Systems I",
        "Class Number": "33375",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "3.63"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3520",
        "Class Name": "Flight Vehicle Dynamics",
        "Class Number": "33071",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "91",
        "Rating": "3.84"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4518",
        "Class Name": "Design of Space Vehicles and Systems II",
        "Class Number": "30101",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "3.46"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5610",
        "Class Name": "Helicopter Aerodynamics",
        "Class Number": "30078",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.13"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3521",
        "Class Name": "Fundamentals of Flight Vehicle Control",
        "Class Number": "34783",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "54",
        "Rating": "3.48"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4517",
        "Class Name": "Design of Space Vehicles and Systems I",
        "Class Number": "11554",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "36",
        "Rating": "3.08"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3520",
        "Class Name": "Flight Vehicle Dynamics",
        "Class Number": "11794",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "69",
        "Rating": "3.38"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4518",
        "Class Name": "Design of Space Vehicles and Systems II",
        "Class Number": "11480",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "33",
        "Rating": "3"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5610",
        "Class Name": "Helicopter Aerodynamics",
        "Class Number": "38835",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.2"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5620",
        "Class Name": "Stability and Control of Flight Vehicles",
        "Class Number": "12430",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.18"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "2010",
        "Class Name": "Statics",
        "Class Number": "30174",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "115",
        "Rating": "3.32"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "2010",
        "Class Name": "Statics",
        "Class Number": "8658",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "91",
        "Rating": "3.9"
      }
    ]
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 3.5,
    "department": "Aerospace Engineering",
    "firstName": "Jeffery",
    "id": "VGVhY2hlci0xNTUxMzYw",
    "lastName": "Bons",
    "legacyId": 1551360,
    "numRatings": 9,
    "summary_comment": "Dr. Bons is highly regarded as an incredibly knowledgeable and passionate professor, particularly in aerodynamics, though his classes are challenging and require significant effort. Despite occasional confusion and unclear requirements, students find his lectures and approach to the subject matter invaluable, despite the difficulty level.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really good class",
        "course": "AE3570"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Bons is amazing. Yes his class is hard but that's more due to the nature of aerospace engineering. He really peaked my interest in everything related to aerodynamics. Tests are tricky but not unreasonable. He's incredibly knowledgeable and smart and does a great job and effectively communicating the mat",
        "course": "AE3570"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "The best professor I've had here at OSU, and definitely the best one in the department. His lectures were downright fantastic, and it is evident that he cares a great deal about students. His class is hard (because Aerospace Engineering is hard), but it is very manageable, and certainly worth taking. You'll learn a ton from Dr. Bons, for sure.",
        "course": "AE3570"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Bons is an incredible professor. He's probably the smartest person I've ever met, but that is his greatest downfall. He had trouble relaying some of the fundamentals to us undergrads as he is mainly a graduate professor. Homeworks would take days to complete and exams were incredibly difficult, I would recommend only taking him as a grad.",
        "course": "AAE3560"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "The homeworks were barely relatable to things learned in the course, and the grading guidelines were hard to follow. The exams seemed to be written by a different professor, maybe for a different course entirely. Would not recommend.",
        "course": "AERO3560"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "His requirements for homework are not very clear, and his test questions are more difficult than you'll expect, no matter how well you prepare. He often gets side-tracked during lectures; he even forgot the semester was shortened by a week, so we did not cover all the material he wanted to. Very difficult undergraduate professor; you will struggle.",
        "course": "AE3560"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very confusing as a person, I have no idea how he still works here",
        "course": "AAE5612"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "He is probably the smartest professor I've had. He is so smart that he has unbelievably high expectations for his students. This is a good thing, but most of the students will not meet his expectations and receive mediocre grades. You must be very proactive in his class and go get help all the time.",
        "course": "AERO201"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "He has very bad handwriting so you should sit in the front of the class. The best way to understand the material would be to read the book right before or right after his lectures. He isn't the best at explaining ideas so talk to your TA's. However, he still is a good teacher",
        "course": "AERO201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.5,
    "department": "Aerospace Engineering",
    "firstName": "Jen-Ping",
    "id": "VGVhY2hlci0xODI1NDQ1",
    "lastName": "Chen",
    "legacyId": 1825445,
    "numRatings": 20,
    "summary_comment": "Professor Chen is highly regarded for his fairness and clarity in explaining complex concepts, making the class manageable despite its difficulty. Students appreciate his humor and care, though some find the class occasionally boring due to the heavy reliance on lectures and textbook material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was pretty boring, but Chen was really funny. We also had test corrections on our midterm and a non-cumulative final that our class averages an 88 on. There was a lot of annoying work, but the class was a cool intro to all of the aerospace engineering topics. ",
        "course": "AAE2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ez class, Dr. Chen awsm prof. Go to lectures, and key to success: make sure to kno how to do every hw by urself. hw problems r basically the midterm problems. Utilize test corrections, go to office hours if needed. Plz get a good lab grp, don't wry abt final, non cumulative. use recitations to ask questions. Rly equation hvy midterms. cheat shet ok",
        "course": "AAE2200"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "AE2200 with Chen wasn't bad. He is unfastening and will show mercy if things come up. The homeworks and exams are fair and reflect the lecture content well. The labs, which Chen doesn't control, are the worst though. They can be very time consuming if you do the code and are often very vague in their direction.\nChen is good. The labs suck",
        "course": "AAE2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Chen is a very caring professor who wants his students to succeed. He explains concepts well, and his exams are very fair. ",
        "course": "AAE2200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is great!",
        "course": "AAE2200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chen's the best. He has fair homeworks and exams that actually match lecture content. On top of that, he's very kind and funny. Made a slideshow of pictures of his dogs to show us at the beginning of lecture after one of our midterms. What a guy",
        "course": "AAE2405"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Taught thermodynamics really well and made the class fair. 5/5 in my opinion. ",
        "course": "AAE2405"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's a great professor and he's also very funny. He cares about all his students and he's a very nice person. ",
        "course": "AAE2405"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's very funny and caring in class as well as office hours. Definitely one of the better aerospace professors at OSU. He made such a hard subject and class very easy as long as you put in the work. ",
        "course": "AAE2405"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "He's a very caring guy and he knows his stuff. Sometimes, he would rely too much on the textbook during lectures which cause them to be boring. Overall lectures were okay. Make sure to do the homework as they help a lot for midterms and the final. ",
        "course": "AAE2200"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "His lectures do not cover anything needed for the homework",
        "course": "AAE2405"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is amazing, his exams are exactly as his lecture. he is caring and accesible outside of class",
        "course": "AAE2405"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "If Rama Y deserves my tuitions, Dr. Chen deserves my credit card.",
        "course": "AAE3560"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. Dont know what other low ratings talking about",
        "course": "AAE3560"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the rarely good professor you can find in OSU AAE department. Wish could have more classes taught by him.",
        "course": "AAE3560"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Chen is great. He is kind and outgoing, don't hesitate to ask him to turn his microphone up, as sometimes he gets a bit quiet. He lectures very slowly. If you read the textbook as it helps a lot. There is very little homework and it is graded easily. The exams are half multiple choice and straightforward if you studied. Work hard and you'll do well",
        "course": "AAE3560"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "The only negative I could possibly give is that he teaches directly out of the textbook, so even though he grades for attendance sometimes, you could technically learn everything by just reading the book. He's got very clear lectures, though, and a nice relaxed pace to his teaching. Would love to take more of his courses.",
        "course": "AAE3560"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great lectures, easy to understand, clear hand writing. Doesn't give ridiculous amounts of homework, and is always willing to help in office hours. Follows the book heavily, so you don't really need to be in lectures (except on the days he checks attendance). One of the better instructors in the MAE department I've had so far.",
        "course": "AAE3580"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Chen goes slow in class, but follows the textbook heavily, which is VERY helpful. He is occasionally hard to understand with all of his \"um\" and pauses in class, but he goes slow and is typically very clear. First midterm was easy, second was a bit more difficult. If he hands something out in class, you should study it and the theory behind it.",
        "course": "AAE3570"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "He went so slow I actually lost interest in the class and stopped caring. That being said he made it a little better by having us do labs in the supersonic wind tunnel. Real helpful guy and good teacher, just wish he went at a faster pace.",
        "course": "AAE3570"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "7025",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "7026",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.75"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2405",
        "Class Name": "Thermodynamics",
        "Class Number": "6853",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "86",
        "Rating": "4.42"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3560",
        "Class Name": "Fundamentals of Aerodynamics",
        "Class Number": "33266",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "85",
        "Rating": "4.64"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4550",
        "Class Name": "Principles of Flight Vehicle Propulsion",
        "Class Number": "33268",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "52",
        "Rating": "4.58"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3580",
        "Class Name": "Heat Transfer",
        "Class Number": "29970",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "75",
        "Rating": "4.71"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "3560",
        "Class Name": "Fundamentals of Aerodynamics",
        "Class Number": "11446",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "53",
        "Rating": "4.68"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "11449",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "11450",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.78"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2405",
        "Class Name": "Thermodynamics",
        "Class Number": "11353",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "70",
        "Rating": "4.87"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "11797",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "140",
        "Rating": "4.43"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2200",
        "Class Name": "Introduction to Aerospace Engineering I",
        "Class Number": "39025",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "11402",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.62"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "2405",
        "Class Name": "Thermodynamics",
        "Class Number": "11236",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "94",
        "Rating": "4.64"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "3500",
        "Class Name": "Engineering Thermal Sciences",
        "Class Number": "6927",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.32"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "4510",
        "Class Name": "Heat Transfer",
        "Class Number": "10741",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "37",
        "Rating": "4.65"
      }
    ]
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.5,
    "department": "Aerospace Engineering",
    "firstName": "Datta",
    "id": "VGVhY2hlci0xODI1NDQ0",
    "lastName": "Gaitonde",
    "legacyId": 1825444,
    "numRatings": 10,
    "summary_comment": "Dr. Gaitonde is an exceptionally knowledgeable and caring professor, particularly adept at explaining complex topics like hypersonics. While his lectures can be challenging and his handwriting sometimes difficult to read, students consistently praise his willingness to help outside of class and his dedication to ensuring student success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Gaitonde is extremely good at teaching tough topics like hypersonics. He is accessible well into the evening as needed to help students. He is a little quiet, but other than that no complaints. Great professor, wish I had more classes with him.",
        "course": "AEROENG5775"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Definitely a tough class. Materials were compiled from 2 different textbooks. Homework was tough and required plenty of reading. Lots of content was covered in such a short class! Exams were tough as well. The professor was caring and genuinely interested in teaching. The only downside was lecture notes were handwritten and very bad handwriting!",
        "course": "AEROENG5775"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. G is incredibly smart and well spoken, albeit a tad quiet. He is always willing to sit down and work out any problems you are having. His one detraction is he does not do example problems in lecture, making it difficult sometimes to find your way.",
        "course": "AERO3560"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great guy, but in my opinion it was still a difficult class. Conceptually difficult material is sometimes hard to grasp, and he really does his best to explain it but sometimes it just falls a little short. Still a great professor.",
        "course": "AAE3560"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Never had a professor that genuinely cares about his students like Dr. G. As long as you attend class, pay attention, do the homework, and go to office hours, you should be fine.",
        "course": "AAE3560"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "The best professor I have had at OSU. Will do anything to help you do good. Understands the material is not the easiest and that you have other classes and definitely takes that into consideration when grading.",
        "course": "AAE2201"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "One of the few professors I've had who has actually acknowledged that college is a tough time for a lot of people in and out of the classroom. He will bend over backwards to help and make sure that you understand material. His handwriting can be messy and he sometimes gets a too caught up in derivations. Reading the book clears up any questions.",
        "course": "AEROENG2201"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "The subject matter he teaches is very mathematically involved and lectures are long but he's up front & understanding about it; devotes lectures to re-iterating previously taught material. Incredibly helpful if you go to see him in office hours, will put aside anything/everything to help you. Sets you up for success. Take his class.",
        "course": "AAE3560"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take his class! He is super smart and super nice, you wont regret it :)",
        "course": "AAE3560"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Shame this guy worked at the AFRL for so long since he makes such a great prof. Take advantage of his knowledge. He goes above and beyond to help students.",
        "course": "AAE3560"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "9607",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.65"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "9608",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "33334",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "8873",
        "Class Name": "Advanced Computational Fluid Dynamics",
        "Class Number": "30097",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "11514",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.41"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "11515",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "11466",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "3.78"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5775",
        "Class Name": "Hypersonic Flow",
        "Class Number": "11467",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "8873",
        "Class Name": "Advanced Computational Fluid Dynamics",
        "Class Number": "35648",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "8902",
        "Class Name": "Future Academic Scholars Training II for MAE",
        "Class Number": "10884",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Aerospace Engineering",
    "firstName": "Randall",
    "id": "VGVhY2hlci0yNTQxNzYx",
    "lastName": "Mathison",
    "legacyId": 2541761,
    "numRatings": 1,
    "summary_comment": "The professor is known for grading harshly and complicating conceptual topics, which students find challenging. Additionally, he is criticized for being slow in grading and failing to submit final grades to the registrar in a timely manner.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "He grades pretty harshly and convolutes a lot of the conceptual topics from his class. He's also pretty slow at grading, he didn't even get final grades submitted to the registrar in time",
        "course": "4550"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "5751",
        "Class Name": "Advanced Air-Breathing Propulsion",
        "Class Number": "6859",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.75"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5751",
        "Class Name": "Advanced Air-Breathing Propulsion",
        "Class Number": "29973",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.56"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4550",
        "Class Name": "Principles of Flight Vehicle Propulsion",
        "Class Number": "11448",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "66",
        "Rating": "4.71"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5751",
        "Class Name": "Advanced Air-Breathing Propulsion",
        "Class Number": "11359",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.61"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5751",
        "Class Name": "Advanced Air-Breathing Propulsion",
        "Class Number": "11360",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "4550",
        "Class Name": "Principles of Flight Vehicle Propulsion",
        "Class Number": "11400",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "45",
        "Rating": "4.61"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5751",
        "Class Name": "Advanced Air-Breathing Propulsion",
        "Class Number": "11241",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.7"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "7527",
        "Class Name": "Jet Propulsion",
        "Class Number": "30249",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.4"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Aerospace Engineering",
    "firstName": "Jolanta",
    "id": "VGVhY2hlci0xNDYwODM4",
    "lastName": "Janiszewska",
    "legacyId": 1460838,
    "numRatings": 2,
    "summary_comment": "The professor is highly regarded for her fairness in assignments and assessments, her dedication to her students, and her availability outside of class. Students appreciate her personal connections and the knowledge they gain, though some find the class setup challenging.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "For 1181 and 1182, all assignments and assessments were fair. Cares about her students, class, and research. Handles so many students on her own and still makes time for us outside of class time. I learned a lot from her, and other students and I made a personal connection with her. Wish I could have her as a professor again!",
        "course": "ENGR1182"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was easy to understand however the basic setup of the class is difficult",
        "course": "ENGR1181"
      }
    ],
    "SEI": [
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "6128",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "Hybrid Delivery",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "3.36"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "11142",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "3.56"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "11144",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "3.44"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "5992",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.25"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "11097",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "11099",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "28274",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.43"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "35892",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "35894",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "3.43"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "26419",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.57"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "26572",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "3.67"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "26574",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.14"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "26577",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "3.8"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "6920",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "35690",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.33"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "35692",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.25"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8078",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.17"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8211",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.5"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8213",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8216",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "12438",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "3.6"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "12440",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1181.01",
        "Class Name": "Fundamentals of Engineering I",
        "Class Number": "7086",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8090",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8219",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1182.01",
        "Class Name": "Fundamentals of Engineering II",
        "Class Number": "8221",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Newark Campus",
        "Medium": "In Person",
        "Campus": "NWK",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      }
    ]
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.1,
    "department": "Aerospace Engineering",
    "firstName": "Mei",
    "id": "VGVhY2hlci0xNzAwMTg4",
    "lastName": "Zhuang",
    "legacyId": 1700188,
    "numRatings": 11,
    "summary_comment": "Dr. Zhuang is a knowledgeable and effective professor who provides clear, albeit sometimes dry, lectures focused heavily on the textbook. Her exams are challenging but fair, and she offers helpful review sessions and allows cheat sheets, which aids in student preparation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She'a a good professor. Homework and exams were tough, but fair. She does good review session that give us an idea of what's gonna be on each exam.There were some topics that were confusing, however overall, the material made sense. She also uses the textbook a lot.",
        "course": "AERO3560"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Had Zhuang for Numerical Methods as well as Thermodynamics. She's nice, but her lectures are often pretty dry. She teaches very equation-heavy subjects, so as long as you can figure out what you're doing you'll be fine in her classes. Cheat sheets are a life saver on tests, so they aren't too difficult.",
        "course": "AAE3581"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's good. Exams were hard but I think it is cause I did not understand the subject well at first. You gotta read a lot and be prepared. She does pop quiz almost every friday so be aware of that.",
        "course": "AAE2405"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Zhuang is the embodiment of success. She inspires her students to do well in class and they learn a tremendous amount of knowledge. If I had a golden coin for every intellectual comment she made, I would be richer than Capt. Jack Sparrow (or King Midas). ",
        "course": "AAE3581"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Zhuang is an all right professor. Her accent isn't too bad and she enjoys teaching. However, all she does is examples straight from the book that have already been worked out making lectures pretty boring. Class is very straightforward and not very hard. The book and a good knowledge of MATLAB is all you need in order to pass this class.",
        "course": "AAE3581"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a really good professor. She talks a little quiet and with an accent, so sit towards the front. Her exams are very fair. She lets you have a sheet of notes front and back for exams. A fairly large amount of homework (not overwhelming), but it prepares you very well for the exams",
        "course": "AAE2405"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Go for attendance. Seriously, if you have taken linear algebra before, are decent at MATLAB, and do the homework without copying solutions, you should be okay without even paying attention. Homework isn't like the exams in terms of MATLAB, but she gives great hints of what theory is on exams via lectures and homeworks. Make good cheat sheets!",
        "course": "AAE3581"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Incredibly straight forward class, very few went to lecture since there wasn't much to gain. I only went for required attendance. Not a bad prof but one could pretty easily learn everything in the class just by reading the book a few minutes per topic (good text though).",
        "course": "AAE3581"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "As long as your algebra is good you will have no problem in this class.  The textbook is amazing and exams are luckily open book.  Very interesting content, I'm surprised attendance was like 40% every day.",
        "course": "AERO3581"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Thermo I for you all on semesters now.  Slightly easy class, but there were a few logical hurdles and Zhuang is good at helping you over them. Homeworks were pretty short but got gradually more difficult.  Exams didn't really get harder just more complex.",
        "course": "AAE405"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Knows what she is talking about and explains things pretty clearly, for an engineering class. Sometimes the homework can be annoying, but I never felt that she was unfairly hard on her students.",
        "course": "AAE581"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "6771",
        "Class Name": "Viscous Fluid Flow: Laminar and Transitional",
        "Class Number": "33787",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "3.55"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "33269",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "4.25"
      },
      {
        "Subject": "AEROENG",
        "Catalog": "5615",
        "Class Name": "Introduction to Computational Aerodynamics",
        "Class Number": "33270",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.44"
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Aerospace Engineering",
    "firstName": "Debdipta",
    "id": "VGVhY2hlci0zMDA3MDYx",
    "lastName": "Goswami",
    "legacyId": 3007061,
    "numRatings": 2,
    "summary_comment": "The professor is knowledgeable but struggles with lecture delivery, making them confusing or boring for students. Despite this, they are highly supportive during office hours and the homework, while challenging, is balanced by easier tests, making the overall course more manageable.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's alright. Lectures were very confusing or boring. There were a couple homework assignments that took some time, but he was very helpful in office hours and answered any question I had. Very smart guy. ",
        "course": "AE3521"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "His lectures were dull and he was quiet. Didn't really communicate the material well. The homework was somewhat difficult but the tests were easier than a lot of high school tests were which really helped for such a difficult year in aerospace engineering. Definitely recommend taking a class from him",
        "course": "AE3521"
      }
    ],
    "SEI": [
      {
        "Subject": "AEROENG",
        "Catalog": "3521",
        "Class Name": "Fundamentals of Flight Vehicle Control",
        "Class Number": "12364",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Aerospace Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "59",
        "Rating": "4.02"
      },
      {
        "Subject": "MECHENG",
        "Catalog": "8220",
        "Class Name": "Continuous Time Optimal Control",
        "Class Number": "35863",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Mechanical Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.9"
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.6,
    "department": "Aerospace Engineering",
    "firstName": "James",
    "id": "VGVhY2hlci0xNDc5NTk2",
    "lastName": "Gregory",
    "legacyId": 1479596,
    "numRatings": 24,
    "summary_comment": "The professor is highly regarded by many students for his passion and dedication to teaching aerospace engineering, though his teaching methods and assignments are often criticized for being overly complex and time-consuming. Some students find his lectures and assignments challenging and redundant, while others appreciate his accessibility and genuine interest in the subject matter.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really liked the flipped classroom design because it forced me to take my notes and made sure I paid attention and understood the material. Homework pertained to the videos you watched that week. Mandatory attendance for lectures was dumb. I took him for granted, the 2201 professor is much worse. I miss airplane Jim and wish i had him again.",
        "course": "AERO2200"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "His lectures are a major waste of time and he assigns countless assignments which are frequently irrelevant when compared to course material. The labs for this class are lengthy and redundant and his homework assignments are unnecessarily difficult. If you can avoid taking him as a professor do it!",
        "course": "AERO2200"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "If I could give this man a 0 I would. Going to his lecture was such a waste of time and energy but attendance is taken every morning. He makes you watch countless hours of lecture videos and then repeats everything in lecture just to be redundant. His exams are unnecessarily difficult and he does not give any grading rubrics.",
        "course": "AERO2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "I've been going through quite a few personal issues this semester that affected my ability to do well in class, but he was always accessible and tried as best he could (within his own parameters) to help me succeed. He truly loves aerospace, and it's easy to see that when attending his lectures.",
        "course": "AERO2200"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is passionate about the subject and seems to know a lot but he over complicates every assignment and doesn't make good use of in class lecture time. You have to watch 1-2 hours of online videos for a quiz and then he repeats it all in class. He wastes too much class time especially for the lectures being everyday at 8am.",
        "course": "AERO2200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy knows what he is doing and is a genius in Aerospace. Takes a students love of Aerospace and turns it into a functioning skill. The labs were long, but were rewarding. The homeworks were hard and sucked. The online lectures are mandatory to get a good grade. Some exams were impossible, others easy. The final project is fun and is rewarding",
        "course": "AERO2200"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "By no means, is Jim a bad professor, however, for some reason, he seems to unnecessarily complicate things. He doesn't give you an equation sheet, despite the entire class being dependent on it. Homework is graded for correctness and is very challenging. The labs are long and tiresome and if you get stuck with a bad group... Good luck Charlie.",
        "course": "AAE2200"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "His lecture notes don't make sense outside of class without hours of online research.  The course is Matlab heavy despite much of the MatLab not being taught in his class or the intro to MatLab class. But the worst of all was the final project he assigned during finals week that was worth 10% of your final grade and he didn't teach you how to do.",
        "course": "AAE2200"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor. One of the best I've ever had. Really cares about teaching the subject. Very helpful during office hours also.",
        "course": "AAE2200"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "VERY good professor, especially compared to some of the third year profs. He said on the first day that he hoped we would have fun through our class and I legitimately did. He did a great job teaching the fundamental concepts of AE. The negative reviews baffle me, must be from the 50% dropout rate in AE -most remaining students thought he was great",
        "course": "AAE2200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "By far, the BEST professor I've ever had. The material covered in this class was extremely difficult, but I mean, come on, it's aerospace engineering... Dr. Gregory knows his stuff and is able to break down difficult concepts into clear and intuitive notes. I can't say enough about him. I wish every class I take from here on out was taught by him.",
        "course": "AERO2200"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 5,
        "comment": "Gave us alot of homeworks which should have been worth more than the exams, Lab are overloaded, Exams are impossible to destruction Whenever you ask him a question, most of the time doesn't know the answer to it. Our TA asked him a question nd he didnt give him answer,he just said good question! And that was it.",
        "course": "AAE2200"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "absolutely the worst professor. I think he hates middle easterns, on a first assignment he took a point of becuase i dont even know the reason, when i asked him why, he replied saying you didnt follow directions, the directions were to upload a pic and decribe your self. I did exactly what was said. He then said my pic was not good.",
        "course": "AAE2200"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr Gregory was not the best professor. He would not even give you a review sheet or go over what will be on the exam. Totally avoid him.",
        "course": "AERO2200"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 5,
        "comment": "Was a very hard class. Intentionally made the exams more difficult after the class did well on the first exam. Not very clear in his notes. Labs are more work then they are worth",
        "course": "AERO2200"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fun guy, super helpful both in and out of class. He spends about ten minutes reviewing the previous lecture every time which really helps the concepts sink in. Exams are very fair, sometimes the homework is hard but it's good preparation.",
        "course": "AERO2200"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "The exams are not that bad but the stuff he expected us to do in Matlab for the labs and homework was insane. If you're not skilled with matlab good luck getting above a 60% on the labs and homework",
        "course": "AERO201"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great teacher. He's able to engage students and hold their attention. His only weakness seems to be his homework and exams. The homework is complicated with the use of matlab, making it horrendous. 2nd exam problems were nothing like the books, and the review session didn't cover the test well. I'd suggest finding old ones,but that's not allowed.",
        "course": "AERO201"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 5,
        "comment": "Great guy but really hard exams and overloads on work on some weeks which sucks, but overall a good teacher",
        "course": "AERO201"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is a very good professor and is very helpful. He grades fairly the exams are not very hard.",
        "course": "AERO201"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great, friendly professor who is passionate about teaching. Homework assignment and labs are great resources. MUST attend lecture to get notes. Midterms and final are challenging but rewarding for those who study and try. Considers students efforts if you come to him for help often. WILL call you out if you are sleeping or texting.",
        "course": "AERO200"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great teacher. Teaches well and presents material clearly. He is definitely old-school and will call you out in front of class if your sleeping or texting on your phone, however, its only to keep the students focused. The class is challenging, but you will learn a lot.",
        "course": "AERO200"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very helpful, always glad to point in the right direction, every question is a good question. Homeworks are relatively hard. Labs are VERY hard.make use of carmen discussion boards.Very enthusiastic/passionate about the subject in general.Derivation lectures are VERY boring but useful in tests.",
        "course": "AERO200"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "AAE405"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 3.5,
    "department": "Aerospace Engineering",
    "firstName": "Joseph",
    "id": "VGVhY2hlci05NTczMDE=",
    "lastName": "Haritonidis",
    "legacyId": 957301,
    "numRatings": 3,
    "summary_comment": "This professor is highly analytical and demanding, known for his intense focus on detail and strict classroom policies, including severe reactions to cell phones. His lectures are heavily focused on derivations, which students find more effective to study independently rather than in class, and he often comes across as superior to his students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 5,
        "comment": "He is a professor.",
        "course": "AAE69"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Wow this guy is ANAL about everything! He actually screams at you for your cell phones.  He just derive equations all through class, you'll learn a lot more from reading the books.  Just a nightmare to sit through his class when he always think he's better than the students",
        "course": "AERO661"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 5,
        "comment": "Don't forget to turn off your cell phone before entering his class, or else you're doomed!",
        "course": "AAE560"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.2,
    "department": "Aerospace Engineering",
    "firstName": "Ran",
    "id": "VGVhY2hlci0yNDM2MDU1",
    "lastName": "Dai",
    "legacyId": 2436055,
    "numRatings": 6,
    "summary_comment": "Ran Dai is widely regarded as one of the weaker professors in the OSU aerospace department, particularly for communication and lecture delivery, despite some organization in class structure and being helpful in office hours. However, some acknowledge her as one of the better aerospace professors at OSU compared to others.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Ran Dai is simply the worst professor I have ever had. Although the class is easy enough due to extra credit opportunities, It is the worst academic experience I have had at OSU by far. Dr. Dai is extremely bad at communicating information to students and you will feel lost during pretty much every lecture.",
        "course": "AAE3521"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the better aerospace professor at OSU.",
        "course": "AAE3521"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Dai actually organized this class pretty well compare to what we had for other aerospace classes last semester.",
        "course": "AAE3521"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the good professor in the OSU aerospace department. Its unfortunately that the prerequisite for this class, FVD, was taught by Rama Y before Ran Dai. Otherwise, this class would make much more sense but its still good.",
        "course": "AAE3521"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "So the lectures are pointless, she just puts her head down and talk at her iPad. The posted notes are virtually impossible to follow. Be prepared to learn from someone else. Nice person though.",
        "course": "AAE3521"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "You will learn nothing from the lectures. Lecture notes pretty useless too. But she's helpful in office hours. Good luck.",
        "course": "AERO3521"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2.2,
    "department": "Aerospace Engineering",
    "firstName": "Carl",
    "id": "VGVhY2hlci0xODI1NDQ2",
    "lastName": "Hartsfield",
    "legacyId": 1825446,
    "numRatings": 5,
    "summary_comment": "This professor is known for incorporating humor into lectures and sharing interesting aerospace systems examples, which students find engaging. However, his teaching style is primarily lecture-based with minimal explanation, leading many to rely heavily on self-study and re-reading materials to grasp the content effectively.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I always enjoy going to class because he always has jokes that go along well with the material. The 'airplane of the day' is always cool too. But, don't expect to have a good understanding of the material just because you attended the lecture. Re-reading his slides on Carmen and reading the textbook before exams are a MUST.",
        "course": "AAE2201"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Probably one of the worst professors I have ever had. Lectures are boring, power points are not clear, and exams are impossible and way too long. ",
        "course": "AAE2201"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Best part of class is the Aerospace System of the Day. Spends the rest of class deriving or writing formulas on the board with little explanation. You are guaranteed to fall asleep, but may wake back up when he starts talking about industry experiences. AWESOME dude, not the best professor. Take him to the bar, not the lecture hall.",
        "course": "AAE2201"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst lecturer ever. Flew through slides did not explain how to use the formulas. Exams were impossible and not nearly enough time to finish them.",
        "course": "AAE2201"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "For some reason his online notes were compact and clear, but in class he was the complete opposite. Heat Transfer has a crapton of empirical formulas and you will spend 60 minutes a lecture writing them down with no explanation of what's going on. My final cheat-sheet was literally just a flowchart of formulas to use... worked though.",
        "course": "AAE3580"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Aerospace Engineering",
    "firstName": "Paul",
    "id": "VGVhY2hlci0xMDM5MjYw",
    "lastName": "Penko",
    "legacyId": 1039260,
    "numRatings": 2,
    "summary_comment": "Dr. Penko is an outstanding educator known for his deep wisdom, extensive industry experience at NASA, and genuine care for his students. His clear teaching style, combined with practical advice and accessible study materials, makes him highly effective in fostering lifelong learning.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am still in touch with Dr. Penko 5 years after graduation. He has great wisdom, industry experience 20 years in NASA and real cares for his students, aside from a dry sense of humor. I am a lifetime learner from Dr. Penko- he is a true educator. ",
        "course": "AERO571"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great Prof. prints out notes for you. just do the hw it's easy and you will be ok",
        "course": "AAE530"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.9,
    "department": "Aerospace Engineering",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0yMDA4ODcx",
    "lastName": "Schermerhorn",
    "legacyId": 2008871,
    "numRatings": 7,
    "summary_comment": "Andrew is highly regarded as an excellent instructor, known for his knowledge, approachability, and humor. Students consistently praise his ability to explain complex concepts clearly and his genuine interest in their success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Andrew was the best teacher I had at Ohio State. He is awesome!",
        "course": "ME2030"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's actually only a TA, but he's very knowledgeable, friendly, approachable, and helpful. We usually had a quiz every week, that for me was very easy. I actually wish the quizzes were harder in order to prep better for the exams. Some people like the easier points I guess. To each their own.",
        "course": "MATH1075"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "He's very helpful and definitely cares about the students sucess! He is very funny and the class is very interesting and he encourages me to try my best.",
        "course": "MATH1075"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Let me start by saying I hate math. Andrew makes it way easier to understand this thing we call math and class is actually interesting and pretty funny. He even had office hours that he would work if there was anything you were struggling on. Awesome guy!",
        "course": "MATH1075"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best math teachers I've had. Always super willing to help everyone! He explains concepts that I've spent 3 hours on and I get it in less then 10 min :) Very personable and hilarious. ",
        "course": "MATH1075"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great at explaining concepts! And he's hilarious.",
        "course": "ME2030"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class was pretty tough, in general, but he tried to do the best he could. He did not create the tests or grade anything, but he was helpful in office hours. ",
        "course": "ME2030"
      }
    ],
    "SEI": []
  }
]