[
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.8,
    "department": "Aerospace Engineering",
    "firstName": "Mrinal",
    "lastName": "Kumar",
    "legacyId": 2284552,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Dr. Kumar is a masterclass in teaching an engineering course. A refreshing contrast to monotone lectures from other prof's, his lectures are lively and enthusiastic, keeping my attention and inspiring me to learn the content. Course notes are downright excellent; effectively their own textbook. Exams are fair yet conceptual. Brilliant all around"
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Not good, just not good. Get ready for his holy bible of astronautics notes that the entire class is based on and that he basically just reads every lecture."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Worst professor I've had. He makes so many mistakes and rude also. Faculty at the university he used to teach at before OSU told him to stop researching astrodynamics....he should have listened"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "He is incredibly slow at grading anything (roughly 1 month to grade a single midterm). His lectures/notes are completely irrelevant to the homework...there is a huge disconnect between the notes and hw material. He also has a very strange test format."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Not good and very mean"
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Dr. Kumar is genuinely an amazing professor for orbital mechanics. His exams are fair and graded easily, and he often records solutions to the homework problems. His lecture notes are some of the best I have ever seen (Typed, neat, equations numbered), and he is very approachable. Def. one of the best profs at OSU."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Professor Kumar's class is very difficult because he keeps his exams very conceptual and his homeworks are high level. That being said, i've learned more from him than in most of my other classes. His lectures are very comprehensive and he explains the concepts very well. He asks a lot of you but if you keep up, it is well worth the effort."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "this guy is a horrible. He gives you homeworks that super tedious and long and not really helpful for his exams. His online notes are super long and too detailed which is not really helpful as well. He thinks everyone is so smart and understands materials straight forward - which is not true. I suffered a lot, bet u gonna suffer a lot so good luck."
      },
      {
        "index": 8,
        "rating": "4.0",
        "comment": "Professor Kumar is exceptional in all regards. He has incredible online notes, but going to class helps out tremendously because he explains everything in a slightly different way than the notes. Homework and tests are conceptually difficult at first, but once you get the hang of it the class isn't bad at all. Would recommend."
      }
    ]
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.6,
    "department": "Aerospace Engineering",
    "firstName": "Jack",
    "lastName": "MacNamara",
    "legacyId": 1346479,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "His grading scheme is so weird. The homeworks he assigns takes hours cause he does easy problems in class and challenging ones on the homework. Then he puts harder ones on the exam. Horrible class"
      },
      {
        "index": 1,
        "rating": null,
        "comment": "The dude does not want to teach"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "The material in this class can be super boring and the homeworks he assigns take super long cause he does such simple examples in class which don't relate at all with the homework. Not helpful at all in office hours and treats people like they are stupid. Historically, exams are near impossible but this semester, he made them not too bad."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Good luck!"
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Dude is rough"
      },
      {
        "index": 5,
        "rating": null,
        "comment": "only flight vehicle structures prof in aero program. Material is interesting, but lecture is boring. Osu should probably replace him"
      },
      {
        "index": 6,
        "rating": null,
        "comment": "Tough class, cant take it with other profs so you have to deal with him. Avoid if possible."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "Makes tests difficult and assigns a couple HomeWorks a semester which take hours because the examples done in class don't relate to the homework very well. He is open and honest about having horrible test averages. His grading system is very awful. Get ready to be disappointed by this class no matter how many hours you study. Avoid if possible."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Great guy. Lectures can be derivation heavy at times, but he breaks the monotony by cracking a few jokes and going off topic."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Best professor at OSU, actually learned something in this class"
      },
      {
        "index": 10,
        "rating": "4.5",
        "comment": "Structures 1 is very out there and much of it makes no sense at all to be honest.  Structures 2 is much more tangible and actually his tests weren't bad.  The final was very fair. I hope he publishes his notes into a textbook someday."
      },
      {
        "index": 11,
        "rating": null,
        "comment": "Very upfront about how hard this class is, which is an understatement. While he was funny and a relatively good teacher, unless you go to every office hour be prepared to do abysmally in the class. Homeworks were a pain in the ass, final was impossible."
      },
      {
        "index": 12,
        "rating": null,
        "comment": "Very difficult course.  You know the class will be difficult when he tells you the first day that the averages usually range between 40% and 50% and he curves from there.  If you crack some jokes with him and participate in class, things are easier on you."
      },
      {
        "index": 13,
        "rating": "4.0",
        "comment": "I got an A in the class but I can't say it was easy because I worked my ass off for it. The lectures were a bit boring but he broke it up every once in a while and cracked some jokes. The exams were simple besides his picky T/F and the final question was always extremely hard. Good intro professor, I enjoyed his class and his approach to questions."
      },
      {
        "index": 14,
        "rating": null,
        "comment": "It was his first time teaching AAE 200 (normally teaches jr level or higher). It seemed harder than a 200 level class, but it is aero. His homeworks are nothing like the midterm or final. All he does during lectures is deriving equations."
      },
      {
        "index": 15,
        "rating": "4.5",
        "comment": "Jack Mc....he went to Michigan"
      },
      {
        "index": 16,
        "rating": null,
        "comment": ":/"
      }
    ]
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2.7,
    "department": "Aerospace Engineering",
    "firstName": "Ken",
    "lastName": "Gordon",
    "legacyId": 2130949,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Good luck."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Good and fair professor, grade tests leniently, just make sure to score high on the first half of this class since that is the easy half."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "If you have disability services avoid this prof at all costs. He does not respect people with disability services. His lectures suck but if you dont go then you fail. His homework is graded by 5 year olds. There is no consistency in grading. His exams are hard but graded fairly. He really enjoys bulling students for asking questions. HES CANADIAN"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "This is his ME2040 class which was not available choice. Don't skip class unless you enjoy self-learning. He doesn't have any recorded lectures, only online notes. Regarding exams, his exams are hard. I wish i had the other prof. He also doesn't give practice exams. This class is also not curved but is close to the level of physics."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "he bullies students for asking questions"
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "I honestly wish every professor was like Dr. Gordon. He had the clearest grading criteria for homework I've ever seen! You couldn't miss a requirement, and you didn't have to guess what he wanted: he tells you EXACTLY what he wants on EVERY homework."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "Ken Gordon has good intentions but doesnt comprehend the fact that 80% of his students dont understand what he is saying. He teaches concepts by using abstract examples and leaves us more confused than before. Homework takes 6-8 hours and his questions are worded in a very annoying manner. Expects a lot, and exams are horrendously paced."
      },
      {
        "index": 7,
        "rating": "4.0",
        "comment": "Ken Gordon is an incredible lecturer. He makes the content clear and you will learn the content. Although you learn the content, it is still very easy to get a poor grade. The assignments are very long and graded harshly, and while the midterms are straightforward, they are graded harshly as well. He is cool but a bit twitchy and passive aggressive"
      },
      {
        "index": 8,
        "rating": null,
        "comment": "He's just not a very good teacher and doesn't understand how students don't get what he's saying. He expects a lot of his students but is a very harsh grader on even the smallest of assignments."
      },
      {
        "index": 9,
        "rating": null,
        "comment": "Kenny G has some weird vibes like he seems really nice but it's like fake nice. The concept quizzes kind of suck since he only gives you a few minutes to answer some tricky questions. The homework can sometimes take a while since it can be hard to understand how to answer the questions using what he says in lecture. The exams aren't too bad though"
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "Gordon is a fair professor who clearly explains the course material. Passionate about his subject matter and very knowledgeable. Make sure to understand the homework and concept quizzes and you will be fine."
      },
      {
        "index": 11,
        "rating": null,
        "comment": "Very enthusiastic, but also a lot harder than needs to be. Likes to ask trick questions. Sometimes says he won't go further on a subject because it's something on our homework and we should learn it on our own."
      },
      {
        "index": 12,
        "rating": "4.0",
        "comment": "Ken Gordon is one of the most knowledgeable and well prepared professors I have had the pleasure of learning from. His homeworks, while many, are fair and if you take the time to actually do them they are actually quite helpful. His exams are difficult, but not because he tries to trick you or because he intends them to be."
      },
      {
        "index": 13,
        "rating": null,
        "comment": "Nice guy, smart, very enthusiastic about subject and seems to care about students. But he isn't always the best at explaining things, and the class is very difficult. Some things seemed to be made more difficult than they needed to be."
      },
      {
        "index": 14,
        "rating": null,
        "comment": "He seems to love the material and is smart, but the pros end there. He has a very petty vibe/ mannerisms, which includes lecture, emails, answering questions, and through the tricky worded tests and HWs. I found this material to be difficult, and his condescending approach and single one hour office hours didn't help. Overall didn't enjoy the class"
      },
      {
        "index": 15,
        "rating": null,
        "comment": "I fully believe that Ken loves teaching and is insanely smart but he cannot explain anything on a basic, first time seeing the material level (which is what this class is). He makes you feel stupid for asking any questions and then doesn't answer them. The exams honestly weren't bad but the average homework grade was a D after spending hours on it."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "I prefer to study myself with aid of textbook and online free sources. He made this course harder than it should be. Heat transfer is no rocket science, I would prefer another lecturer for this course. This dog does not know how to respect students."
      },
      {
        "index": 17,
        "rating": null,
        "comment": "I found his lectures and homework assignments to be very confusing. He sent many clarifications for homework as the instructions were hard to understand. Be ready to write long Matlab codes for homework which are strictly graded. When you ask a question in class he doesn't like to give a direct answer which is really frustrating."
      },
      {
        "index": 18,
        "rating": null,
        "comment": "Choose another instructor if you have other options. He makes you lose all your interests to your major, tough grader, boring classes, not posting the grades on Carmen, limit office hours!"
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "This guy was put on this earth to be a teacher. His class is in no way easy but he doesn't create any roadblocks to you succeeding. If you fail, it's on you. I wish every professor followed his format of teaching."
      }
    ]
  },
  {
    "avgDifficulty": 5,
    "avgRating": 5,
    "department": "Aerospace Engineering",
    "firstName": "John",
    "lastName": "Cherry",
    "legacyId": 3006678,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "great professor overall"
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.3,
    "department": "Aerospace Engineering",
    "firstName": "Ali",
    "lastName": "Jhemi",
    "legacyId": 2213129,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "A lot of my peers did not like Dr. Jhemi, however I found him to be a good prof all around. I did not miss a lecture and I believe this greatly contributed to my success in the class. The exams often had problems from homework, and quizzes often had MC from the lecture notes. He tells you what questions will be on the exam, easy to pass if you try."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Talks over slides and diagrams without doing problems or showing how to approach the material, often goes off on tangents unrelated to anything. Only positive was that he communicated grading criteria very clearly. Attendance was taken usually once a week and quizzes were given semi-regularly. Often complained about students performance on tests."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Lectures are just rambling over PowerPoint slides, goes very slow, and doesn't cover all the material. Has attendance about once a week and 5 min quizzes every so often. The class would be horrible if the tests weren't easy to learn on your own for. Promised a curve on final grades and did not curve unless your grade was within 0.09%"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Very unorganized and didnt seem to care that this is a pre req for lots of students. We were extremely far behind and instead of catching up, he decided to drop content. He understands the content very well but he is a terrible teacher he only knows how to solve the problems not explain. He also expects you to illegally access the course textbook."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Jhemi's a great guy and his exams and homeworks are usually straightforward. However, he's probably the most disorganized lecturer I've had. He corrected his own notes mid-class 10-20 times throughout the semester, and reads right off of his derivation-heavy powerpoint slides. Very confusing lectures. Unintentionally hilarious prof. though"
      },
      {
        "index": 5,
        "rating": "4.0",
        "comment": "His lecture slides were very long and very crowded with a bunch of things that were very confusing. He gives us way too much than we need for the homework and it's super hard sometimes to find what we need for the homework. He's really nice and good at explaining things in office hours and the class is pretty fair as long as you put in some effort."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "Professor Jhemi mainly read from a PowerPoint. Every now and then he would find a mistake and we would have to wait or help him solve it. He was quite lenient with grading his midterms and often would give you points that the graders wouldn't. The textbook wasn't really needed, since he provided all of the problems for the homework."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Dr. Jhemi was a good professor. He always had examples to assist you in class and was available outside of class, too. The homework was generally simple and great practice for exams. The exams were simple, too, like the homework, and packed with lenient grading. For instance, a FBD granted 60% of the points for a question. Good class, good prof."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "Prof. Jhemi has industry experience and clearly is an intelligent person, however, that does not make him a good professor. His lecture slides are disorganized, filled with typos and computational errors. He does not explain the materials well for the exams. He spends too much time going off topic."
      },
      {
        "index": 9,
        "rating": "4.0",
        "comment": "Dr. Jhemi is one of my favorite professors. He's not the best teacher, and he makes a lot of spelling errors on all his documents; however, he has fantastic industry experience, is very wise, and his feedback should be followed to the letter. He's also very funny; I enjoy going to his office hours just to talk to him. Highly recommend him!"
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "He is a good professor, this class just has content that is really hard and you will need to improve on how you view things. 3D thinking when working on problems but he cares and understand and will work with students. I recommend to have him as your professor"
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "He is a caring and understanding professor, he cares about his students and his exams are exactly as he taught. he will teach you and explain everything clear. mostly his lectures are fun"
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "Great professor. Just show up to class and he will make sure you know everything you need to know for all the homeworks and exams. If you don't understand something he is very accessible via office hours."
      },
      {
        "index": 13,
        "rating": "4.0",
        "comment": "Cares about student learning. I learned a lot from him, brings good industrial experience to the class."
      },
      {
        "index": 14,
        "rating": null,
        "comment": "Had Jhemi a couple other times in my academic career and wasn't impressed, but he runs project classes a little better than standard \"test\" classes. Still very unclear about what he wants for things."
      },
      {
        "index": 15,
        "rating": null,
        "comment": "His lectures are pointless and makes mistakes and is corrected by the students. His exams vary from a D average to an A- average and are poorly written and he often has to announce to the class what he means on a certain problem DURING the exam. He emails you the day before what's going to be on his exams and even those emails are misleading."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "Had Jhemi for Aero 3542 as well as Aero 2201. He is incredibly disorganized and is an awful lecturer. On the bright side, the homeworks are usually very straightforward. He seems incapable of creating a fair test though, as they are extremely long and sometimes filled with errors. Blames the students for doing poorly."
      },
      {
        "index": 17,
        "rating": null,
        "comment": "Rambles sometimes about his past and his experience(Apache main rotors if you want to get on his good side). MATLAB Assignment later in semester is very vague, and he expects students to \"experience what he did\" PPT's are mixture of atrocious walls of text, and excellent diagrams"
      },
      {
        "index": 18,
        "rating": null,
        "comment": "I took it last sem and it was so bad. Class was easy tbh, but i dont think ive learned anything really useful from him.. anyway yeah i got B+ so thats all it matters  i guess"
      },
      {
        "index": 19,
        "rating": "4.0",
        "comment": "The beginning of the semester was rather chaotic, although a good portion of that was not the fault of the professor. Overall, the man knows what he's talking about and you can learn a lot from him if you're willing to put in the effort. Read the material and go to class. The course content itself isn't too bad, if you paid attention in linear alg."
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.2,
    "department": "Aerospace Engineering",
    "firstName": "Ali",
    "id": "VGVhY2hlci0yMjEzMTI5",
    "lastName": "Jhemi",
    "legacyId": 2213129,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Is it a requirement for male professors in the engineering department to be condescending towards women? There are already so few women in aero and this guy had me one rude comment away from switching majors. MAE professors decided to schedule 4 exams on the same day and he proceeded to make fun of me in front of people for not performing well. ",
        "course": "AAE3520"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of my peers did not like Dr. Jhemi, however I found him to be a good prof all around. I did not miss a lecture and I believe this greatly contributed to my success in the class. The exams often had problems from homework, and quizzes often had MC from the lecture notes. He tells you what questions will be on the exam, easy to pass if you try.",
        "course": "MECHENG2010"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Talks over slides and diagrams without doing problems or showing how to approach the material, often goes off on tangents unrelated to anything. Only positive was that he communicated grading criteria very clearly. Attendance was taken usually once a week and quizzes were given semi-regularly. Often complained about students performance on tests.",
        "course": "MECHENG2010"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Lectures are just rambling over PowerPoint slides, goes very slow, and doesn't cover all the material. Has attendance about once a week and 5 min quizzes every so often. The class would be horrible if the tests weren't easy to learn on your own for. Promised a curve on final grades and did not curve unless your grade was within 0.09%",
        "course": "MECHENG2010"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unorganized and didnt seem to care that this is a pre req for lots of students. We were extremely far behind and instead of catching up, he decided to drop content. He understands the content very well but he is a terrible teacher he only knows how to solve the problems not explain. He also expects you to illegally access the course textbook.",
        "course": "MECHENG2010"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Jhemi's a great guy and his exams and homeworks are usually straightforward. However, he's probably the most disorganized lecturer I've had. He corrected his own notes mid-class 10-20 times throughout the semester, and reads right off of his derivation-heavy powerpoint slides. Very confusing lectures. Unintentionally hilarious prof. though",
        "course": "AAE3520"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "His lecture slides were very long and very crowded with a bunch of things that were very confusing. He gives us way too much than we need for the homework and it's super hard sometimes to find what we need for the homework. He's really nice and good at explaining things in office hours and the class is pretty fair as long as you put in some effort.",
        "course": "AAE3520"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Jhemi mainly read from a PowerPoint. Every now and then he would find a mistake and we would have to wait or help him solve it. He was quite lenient with grading his midterms and often would give you points that the graders wouldn't. The textbook wasn't really needed, since he provided all of the problems for the homework. ",
        "course": "MECHENG2010"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Jhemi was a good professor. He always had examples to assist you in class and was available outside of class, too. The homework was generally simple and great practice for exams. The exams were simple, too, like the homework, and packed with lenient grading. For instance, a FBD granted 60% of the points for a question. Good class, good prof.",
        "course": "MECHENG2010"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Prof. Jhemi has industry experience and clearly is an intelligent person, however, that does not make him a good professor. His lecture slides are disorganized, filled with typos and computational errors. He does not explain the materials well for the exams. He spends too much time going off topic. ",
        "course": "AAE3520"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Jhemi is one of my favorite professors. He's not the best teacher, and he makes a lot of spelling errors on all his documents; however, he has fantastic industry experience, is very wise, and his feedback should be followed to the letter. He's also very funny; I enjoy going to his office hours just to talk to him. Highly recommend him!",
        "course": "AE4517"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a good professor, this class just has content that is really hard and you will need to improve on how you view things. 3D thinking when working on problems but he cares and understand and will work with students. I recommend to have him as your professor",
        "course": "AAE3520"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a caring and understanding professor, he cares about his students and his exams are exactly as he taught. he will teach you and explain everything clear. mostly his lectures are fun",
        "course": "AAE2201"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. Just show up to class and he will make sure you know everything you need to know for all the homeworks and exams. If you don't understand something he is very accessible via office hours.",
        "course": "AAE2201"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Cares about student learning. I learned a lot from him, brings good industrial experience to the class.",
        "course": "AAE4510"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "Had Jhemi a couple other times in my academic career and wasn't impressed, but he runs project classes a little better than standard &quot;test&quot; classes. Still very unclear about what he wants for things.",
        "course": "AAE45104517"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 3,
        "comment": "His lectures are pointless and makes mistakes and is corrected by the students. His exams vary from a D average to an A- average and are poorly written and he often has to announce to the class what he means on a certain problem DURING the exam. He emails you the day before what's going to be on his exams and even those emails are misleading.",
        "course": "AAE3542"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Had Jhemi for Aero 3542 as well as Aero 2201. He is incredibly disorganized and is an awful lecturer. On the bright side, the homeworks are usually very straightforward. He seems incapable of creating a fair test though, as they are extremely long and sometimes filled with errors. Blames the students for doing poorly.",
        "course": "AAE3542"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "Rambles sometimes about his past and his experience(Apache main rotors if you want to get on his good side). MATLAB Assignment later in semester is very vague, and he expects students to &quot;experience what he did&quot; PPT's are mixture of atrocious walls of text, and excellent diagrams",
        "course": "AERO2201"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 3,
        "comment": "I took it last sem and it was so bad. Class was easy tbh, but i dont think ive learned anything really useful from him.. anyway yeah i got B+ so thats all it matters  i guess",
        "course": "AERO2201"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "The beginning of the semester was rather chaotic, although a good portion of that was not the fault of the professor. Overall, the man knows what he's talking about and you can learn a lot from him if you're willing to put in the effort. Read the material and go to class. The course content itself isn't too bad, if you paid attention in linear alg.",
        "course": "AAE3520"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Had a rough start to the semester but he improved greatly as time went on. He took our feedback seriously and cared about how we were learning. Class was not too difficult as long you attend his lectures and make sure to read through his notes outside of class. Overall, a pretty solid professor.",
        "course": "AAE3520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.8,
    "department": "Aerospace Engineering",
    "firstName": "Mrinal",
    "id": "VGVhY2hlci0yMjg0NTUy",
    "lastName": "Kumar",
    "legacyId": 2284552,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Kumar is a masterclass in teaching an engineering course. A refreshing contrast to monotone lectures from other prof's, his lectures are lively and enthusiastic, keeping my attention and inspiring me to learn the content. Course notes are downright excellent; effectively their own textbook. Exams are fair yet conceptual. Brilliant all around",
        "course": "AE3522"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not good, just not good. Get ready for his holy bible of astronautics notes that the entire class is based on and that he basically just reads every lecture.",
        "course": "AE3522"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst professor I've had. He makes so many mistakes and rude also. Faculty at the university he used to teach at before OSU told him to stop researching astrodynamics....he should have listened",
        "course": "AE3522"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is incredibly slow at grading anything (roughly 1 month to grade a single midterm). His lectures/notes are completely irrelevant to the homework...there is a huge disconnect between the notes and hw material. He also has a very strange test format.",
        "course": "AE3522"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not good and very mean",
        "course": "AAE3520"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Kumar is genuinely an amazing professor for orbital mechanics. His exams are fair and graded easily, and he often records solutions to the homework problems. His lecture notes are some of the best I have ever seen (Typed, neat, equations numbered), and he is very approachable. Def. one of the best profs at OSU.",
        "course": "AE5626"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Kumar's class is very difficult because he keeps his exams very conceptual and his homeworks are high level. That being said, i've learned more from him than in most of my other classes. His lectures are very comprehensive and he explains the concepts very well. He asks a lot of you but if you keep up, it is well worth the effort.",
        "course": "AAE3520"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "this guy is a horrible. He gives you homeworks that super tedious and long and not really helpful for his exams. His online notes are super long and too detailed which is not really helpful as well. He thinks everyone is so smart and understands materials straight forward - which is not true. I suffered a lot, bet u gonna suffer a lot so good luck.",
        "course": "AAE3520"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Kumar is exceptional in all regards. He has incredible online notes, but going to class helps out tremendously because he explains everything in a slightly different way than the notes. Homework and tests are conceptually difficult at first, but once you get the hang of it the class isn't bad at all. Would recommend.",
        "course": "AAE3520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.6,
    "department": "Aerospace Engineering",
    "firstName": "Jack",
    "id": "VGVhY2hlci0xMzQ2NDc5",
    "lastName": "MacNamara",
    "legacyId": 1346479,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "His grading scheme is so weird. The homeworks he assigns takes hours cause he does easy problems in class and challenging ones on the homework. Then he puts harder ones on the exam. Horrible class",
        "course": "AAE3542"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "The dude does not want to teach ",
        "course": "AAE3542"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The material in this class can be super boring and the homeworks he assigns take super long cause he does such simple examples in class which don't relate at all with the homework. Not helpful at all in office hours and treats people like they are stupid. Historically, exams are near impossible but this semester, he made them not too bad. ",
        "course": "AAE3542"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Good luck!",
        "course": "AAE3542"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dude is rough",
        "course": "AAE3543"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "only flight vehicle structures prof in aero program. Material is interesting, but lecture is boring. Osu should probably replace him",
        "course": "AAE3543"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Tough class, cant take it with other profs so you have to deal with him. Avoid if possible.",
        "course": "AAE3543"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Makes tests difficult and assigns a couple HomeWorks a semester which take hours because the examples done in class don&#39;t relate to the homework very well. He is open and honest about having horrible test averages. His grading system is very awful. Get ready to be disappointed by this class no matter how many hours you study. Avoid if possible.",
        "course": "AAE3543"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great guy. Lectures can be derivation heavy at times, but he breaks the monotony by cracking a few jokes and going off topic.",
        "course": "AAE5645"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best professor at OSU, actually learned something in this class",
        "course": "AAE5645"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Structures 1 is very out there and much of it makes no sense at all to be honest.  Structures 2 is much more tangible and actually his tests weren't bad.  The final was very fair. I hope he publishes his notes into a textbook someday.",
        "course": "AAE3543"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very upfront about how hard this class is, which is an understatement. While he was funny and a relatively good teacher, unless you go to every office hour be prepared to do abysmally in the class. Homeworks were a pain in the ass, final was impossible.",
        "course": "AAE543"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very difficult course.  You know the class will be difficult when he tells you the first day that the averages usually range between 40% and 50% and he curves from there.  If you crack some jokes with him and participate in class, things are easier on you.",
        "course": "AAE543"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "I got an A in the class but I can't say it was easy because I worked my ass off for it. The lectures were a bit boring but he broke it up every once in a while and cracked some jokes. The exams were simple besides his picky T/F and the final question was always extremely hard. Good intro professor, I enjoyed his class and his approach to questions.",
        "course": "AAE200"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "It was his first time teaching AAE 200 (normally teaches jr level or higher). It seemed harder than a 200 level class, but it is aero. His homeworks are nothing like the midterm or final. All he does during lectures is deriving equations.",
        "course": "AERO200"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Jack Mc....he went to Michigan",
        "course": "AAE200"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 2,
        "comment": ":/",
        "course": "AAE200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2.7,
    "department": "Aerospace Engineering",
    "firstName": "Ken",
    "id": "VGVhY2hlci0yMTMwOTQ5",
    "lastName": "Gordon",
    "legacyId": 2130949,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Good luck. ",
        "course": "ME2040"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good and fair professor, grade tests leniently, just make sure to score high on the first half of this class since that is the easy half.",
        "course": "ME2040"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you have disability services avoid this prof at all costs. He does not respect people with disability services. His lectures suck but if you dont go then you fail. His homework is graded by 5 year olds. There is no consistency in grading. His exams are hard but graded fairly. He really enjoys bulling students for asking questions. HES CANADIAN",
        "course": "ME2040"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is his ME2040 class which was not available choice. Don't skip class unless you enjoy self-learning. He doesn't have any recorded lectures, only online notes. Regarding exams, his exams are hard. I wish i had the other prof. He also doesn't give practice exams. This class is also not curved but is close to the level of physics. ",
        "course": "ME2850"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "he bullies students for asking questions",
        "course": "ME2850"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I honestly wish every professor was like Dr. Gordon. He had the clearest grading criteria for homework I've ever seen! You couldn't miss a requirement, and you didn't have to guess what he wanted: he tells you EXACTLY what he wants on EVERY homework.",
        "course": "AE3581"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Ken Gordon has good intentions but doesnt comprehend the fact that 80% of his students dont understand what he is saying. He teaches concepts by using abstract examples and leaves us more confused than before. Homework takes 6-8 hours and his questions are worded in a very annoying manner. Expects a lot, and exams are horrendously paced.",
        "course": "ME2850"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "Ken Gordon is an incredible lecturer. He makes the content clear and you will learn the content. Although you learn the content, it is still very easy to get a poor grade. The assignments are very long and graded harshly, and while the midterms are straightforward, they are graded harshly as well. He is cool but a bit twitchy and passive aggressive",
        "course": "AAE3581"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "He's just not a very good teacher and doesn't understand how students don't get what he's saying. He expects a lot of his students but is a very harsh grader on even the smallest of assignments.",
        "course": "ME2850"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Kenny G has some weird vibes like he seems really nice but it's like fake nice. The concept quizzes kind of suck since he only gives you a few minutes to answer some tricky questions. The homework can sometimes take a while since it can be hard to understand how to answer the questions using what he says in lecture. The exams aren't too bad though",
        "course": "ME2850"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Gordon is a fair professor who clearly explains the course material. Passionate about his subject matter and very knowledgeable. Make sure to understand the homework and concept quizzes and you will be fine.",
        "course": "ME2850"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very enthusiastic, but also a lot harder than needs to be. Likes to ask trick questions. Sometimes says he won't go further on a subject because it's something on our homework and we should learn it on our own.",
        "course": "ME2850"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Ken Gordon is one of the most knowledgeable and well prepared professors I have had the pleasure of learning from. His homeworks, while many, are fair and if you take the time to actually do them they are actually quite helpful. His exams are difficult, but not because he tries to trick you or because he intends them to be.",
        "course": "AERO3581"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 5,
        "comment": "Nice guy, smart, very enthusiastic about subject and seems to care about students. But he isn't always the best at explaining things, and the class is very difficult. Some things seemed to be made more difficult than they needed to be.",
        "course": "ME2850"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "He seems to love the material and is smart, but the pros end there. He has a very petty vibe/ mannerisms, which includes lecture, emails, answering questions, and through the tricky worded tests and HWs. I found this material to be difficult, and his condescending approach and single one hour office hours didn't help. Overall didn't enjoy the class",
        "course": "ME2850"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "I fully believe that Ken loves teaching and is insanely smart but he cannot explain anything on a basic, first time seeing the material level (which is what this class is). He makes you feel stupid for asking any questions and then doesn't answer them. The exams honestly weren't bad but the average homework grade was a D after spending hours on it.",
        "course": "ME2850"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "I prefer to study myself with aid of textbook and online free sources. He made this course harder than it should be. Heat transfer is no rocket science, I would prefer another lecturer for this course. This dog does not know how to respect students.",
        "course": "ME4510"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "I found his lectures and homework assignments to be very confusing. He sent many clarifications for homework as the instructions were hard to understand. Be ready to write long Matlab codes for homework which are strictly graded. When you ask a question in class he doesn't like to give a direct answer which is really frustrating.",
        "course": "ME2850"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "Choose another instructor if you have other options. He makes you lose all your interests to your major, tough grader, boring classes, not posting the grades on Carmen, limit office hours!",
        "course": "ME2850"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy was put on this earth to be a teacher. His class is in no way easy but he doesn't create any roadblocks to you succeeding. If you fail, it's on you. I wish every professor followed his format of teaching.",
        "course": "AAE3581"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I've had. He made thermo much easier than what everybody was depicting it to be. Great guy as well. Don't skip class because those lectures are some of the best you'll ever get to listen to in your life and are vital to success in the class. Would take again in a heartbeat. Homework can be long but it's worth every point.",
        "course": "AE2405"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Made what I thought was going to be an absolutely terrible/difficult class something I looked forward to each week. Lectures are some of the best I've ever been to. Key points are well defined and the entire thought process behind a problem was presented very clearly. He is clearly passionate about the material and it makes class fun.",
        "course": "AEROENG2405"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 5,
    "department": "Aerospace Engineering",
    "firstName": "John",
    "id": "VGVhY2hlci0zMDA2Njc4",
    "lastName": "Cherry",
    "legacyId": 3006678,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "great professor overall ",
        "course": "lecture"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.5,
    "department": "Aerospace Engineering",
    "firstName": "Jen-Ping",
    "id": "VGVhY2hlci0xODI1NDQ1",
    "lastName": "Chen",
    "legacyId": 1825445,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was pretty boring, but Chen was really funny. We also had test corrections on our midterm and a non-cumulative final that our class averages an 88 on. There was a lot of annoying work, but the class was a cool intro to all of the aerospace engineering topics. ",
        "course": "AAE2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ez class, Dr. Chen awsm prof. Go to lectures, and key to success: make sure to kno how to do every hw by urself. hw problems r basically the midterm problems. Utilize test corrections, go to office hours if needed. Plz get a good lab grp, don't wry abt final, non cumulative. use recitations to ask questions. Rly equation hvy midterms. cheat shet ok",
        "course": "AAE2200"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "AE2200 with Chen wasn't bad. He is unfastening and will show mercy if things come up. The homeworks and exams are fair and reflect the lecture content well. The labs, which Chen doesn't control, are the worst though. They can be very time consuming if you do the code and are often very vague in their direction.\nChen is good. The labs suck",
        "course": "AAE2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Chen is a very caring professor who wants his students to succeed. He explains concepts well, and his exams are very fair. ",
        "course": "AAE2200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is great!",
        "course": "AAE2200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chen's the best. He has fair homeworks and exams that actually match lecture content. On top of that, he's very kind and funny. Made a slideshow of pictures of his dogs to show us at the beginning of lecture after one of our midterms. What a guy",
        "course": "AAE2405"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Taught thermodynamics really well and made the class fair. 5/5 in my opinion. ",
        "course": "AAE2405"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's a great professor and he's also very funny. He cares about all his students and he's a very nice person. ",
        "course": "AAE2405"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's very funny and caring in class as well as office hours. Definitely one of the better aerospace professors at OSU. He made such a hard subject and class very easy as long as you put in the work. ",
        "course": "AAE2405"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "He's a very caring guy and he knows his stuff. Sometimes, he would rely too much on the textbook during lectures which cause them to be boring. Overall lectures were okay. Make sure to do the homework as they help a lot for midterms and the final. ",
        "course": "AAE2200"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "His lectures do not cover anything needed for the homework",
        "course": "AAE2405"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is amazing, his exams are exactly as his lecture. he is caring and accesible outside of class",
        "course": "AAE2405"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "If Rama Y deserves my tuitions, Dr. Chen deserves my credit card.",
        "course": "AAE3560"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. Dont know what other low ratings talking about",
        "course": "AAE3560"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the rarely good professor you can find in OSU AAE department. Wish could have more classes taught by him.",
        "course": "AAE3560"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Chen is great. He is kind and outgoing, don't hesitate to ask him to turn his microphone up, as sometimes he gets a bit quiet. He lectures very slowly. If you read the textbook as it helps a lot. There is very little homework and it is graded easily. The exams are half multiple choice and straightforward if you studied. Work hard and you'll do well",
        "course": "AAE3560"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "The only negative I could possibly give is that he teaches directly out of the textbook, so even though he grades for attendance sometimes, you could technically learn everything by just reading the book. He's got very clear lectures, though, and a nice relaxed pace to his teaching. Would love to take more of his courses.",
        "course": "AAE3560"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great lectures, easy to understand, clear hand writing. Doesn't give ridiculous amounts of homework, and is always willing to help in office hours. Follows the book heavily, so you don't really need to be in lectures (except on the days he checks attendance). One of the better instructors in the MAE department I've had so far.",
        "course": "AAE3580"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Chen goes slow in class, but follows the textbook heavily, which is VERY helpful. He is occasionally hard to understand with all of his \"um\" and pauses in class, but he goes slow and is typically very clear. First midterm was easy, second was a bit more difficult. If he hands something out in class, you should study it and the theory behind it.",
        "course": "AAE3570"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "He went so slow I actually lost interest in the class and stopped caring. That being said he made it a little better by having us do labs in the supersonic wind tunnel. Real helpful guy and good teacher, just wish he went at a faster pace.",
        "course": "AAE3570"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.5,
    "department": "Aerospace Engineering",
    "firstName": "Datta",
    "id": "VGVhY2hlci0xODI1NDQ0",
    "lastName": "Gaitonde",
    "legacyId": 1825444,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Gaitonde is extremely good at teaching tough topics like hypersonics. He is accessible well into the evening as needed to help students. He is a little quiet, but other than that no complaints. Great professor, wish I had more classes with him.",
        "course": "AEROENG5775"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Definitely a tough class. Materials were compiled from 2 different textbooks. Homework was tough and required plenty of reading. Lots of content was covered in such a short class! Exams were tough as well. The professor was caring and genuinely interested in teaching. The only downside was lecture notes were handwritten and very bad handwriting!",
        "course": "AEROENG5775"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. G is incredibly smart and well spoken, albeit a tad quiet. He is always willing to sit down and work out any problems you are having. His one detraction is he does not do example problems in lecture, making it difficult sometimes to find your way.",
        "course": "AERO3560"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great guy, but in my opinion it was still a difficult class. Conceptually difficult material is sometimes hard to grasp, and he really does his best to explain it but sometimes it just falls a little short. Still a great professor.",
        "course": "AAE3560"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Never had a professor that genuinely cares about his students like Dr. G. As long as you attend class, pay attention, do the homework, and go to office hours, you should be fine.",
        "course": "AAE3560"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "The best professor I have had at OSU. Will do anything to help you do good. Understands the material is not the easiest and that you have other classes and definitely takes that into consideration when grading.",
        "course": "AAE2201"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "One of the few professors I've had who has actually acknowledged that college is a tough time for a lot of people in and out of the classroom. He will bend over backwards to help and make sure that you understand material. His handwriting can be messy and he sometimes gets a too caught up in derivations. Reading the book clears up any questions.",
        "course": "AEROENG2201"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "The subject matter he teaches is very mathematically involved and lectures are long but he's up front & understanding about it; devotes lectures to re-iterating previously taught material. Incredibly helpful if you go to see him in office hours, will put aside anything/everything to help you. Sets you up for success. Take his class.",
        "course": "AAE3560"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take his class! He is super smart and super nice, you wont regret it :)",
        "course": "AAE3560"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Shame this guy worked at the AFRL for so long since he makes such a great prof. Take advantage of his knowledge. He goes above and beyond to help students.",
        "course": "AAE3560"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Aerospace Engineering",
    "firstName": "Randall",
    "id": "VGVhY2hlci0yNTQxNzYx",
    "lastName": "Mathison",
    "legacyId": 2541761,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "He grades pretty harshly and convolutes a lot of the conceptual topics from his class. He's also pretty slow at grading, he didn't even get final grades submitted to the registrar in time",
        "course": "4550"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Aerospace Engineering",
    "firstName": "Jolanta",
    "id": "VGVhY2hlci0xNDYwODM4",
    "lastName": "Janiszewska",
    "legacyId": 1460838,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "For 1181 and 1182, all assignments and assessments were fair. Cares about her students, class, and research. Handles so many students on her own and still makes time for us outside of class time. I learned a lot from her, and other students and I made a personal connection with her. Wish I could have her as a professor again!",
        "course": "ENGR1182"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was easy to understand however the basic setup of the class is difficult",
        "course": "ENGR1181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 3.5,
    "department": "Aerospace Engineering",
    "firstName": "Jeffery",
    "id": "VGVhY2hlci0xNTUxMzYw",
    "lastName": "Bons",
    "legacyId": 1551360,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really good class",
        "course": "AE3570"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Bons is amazing. Yes his class is hard but that's more due to the nature of aerospace engineering. He really peaked my interest in everything related to aerodynamics. Tests are tricky but not unreasonable. He's incredibly knowledgeable and smart and does a great job and effectively communicating the mat",
        "course": "AE3570"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "The best professor I've had here at OSU, and definitely the best one in the department. His lectures were downright fantastic, and it is evident that he cares a great deal about students. His class is hard (because Aerospace Engineering is hard), but it is very manageable, and certainly worth taking. You'll learn a ton from Dr. Bons, for sure.",
        "course": "AE3570"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Bons is an incredible professor. He's probably the smartest person I've ever met, but that is his greatest downfall. He had trouble relaying some of the fundamentals to us undergrads as he is mainly a graduate professor. Homeworks would take days to complete and exams were incredibly difficult, I would recommend only taking him as a grad.",
        "course": "AAE3560"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "The homeworks were barely relatable to things learned in the course, and the grading guidelines were hard to follow. The exams seemed to be written by a different professor, maybe for a different course entirely. Would not recommend.",
        "course": "AERO3560"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "His requirements for homework are not very clear, and his test questions are more difficult than you'll expect, no matter how well you prepare. He often gets side-tracked during lectures; he even forgot the semester was shortened by a week, so we did not cover all the material he wanted to. Very difficult undergraduate professor; you will struggle.",
        "course": "AE3560"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very confusing as a person, I have no idea how he still works here",
        "course": "AAE5612"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "He is probably the smartest professor I've had. He is so smart that he has unbelievably high expectations for his students. This is a good thing, but most of the students will not meet his expectations and receive mediocre grades. You must be very proactive in his class and go get help all the time.",
        "course": "AERO201"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "He has very bad handwriting so you should sit in the front of the class. The best way to understand the material would be to read the book right before or right after his lectures. He isn't the best at explaining ideas so talk to your TA's. However, he still is a good teacher",
        "course": "AERO201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.1,
    "department": "Aerospace Engineering",
    "firstName": "Mei",
    "id": "VGVhY2hlci0xNzAwMTg4",
    "lastName": "Zhuang",
    "legacyId": 1700188,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She'a a good professor. Homework and exams were tough, but fair. She does good review session that give us an idea of what's gonna be on each exam.There were some topics that were confusing, however overall, the material made sense. She also uses the textbook a lot.",
        "course": "AERO3560"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Had Zhuang for Numerical Methods as well as Thermodynamics. She's nice, but her lectures are often pretty dry. She teaches very equation-heavy subjects, so as long as you can figure out what you're doing you'll be fine in her classes. Cheat sheets are a life saver on tests, so they aren't too difficult.",
        "course": "AAE3581"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's good. Exams were hard but I think it is cause I did not understand the subject well at first. You gotta read a lot and be prepared. She does pop quiz almost every friday so be aware of that.",
        "course": "AAE2405"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Zhuang is the embodiment of success. She inspires her students to do well in class and they learn a tremendous amount of knowledge. If I had a golden coin for every intellectual comment she made, I would be richer than Capt. Jack Sparrow (or King Midas). ",
        "course": "AAE3581"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Zhuang is an all right professor. Her accent isn't too bad and she enjoys teaching. However, all she does is examples straight from the book that have already been worked out making lectures pretty boring. Class is very straightforward and not very hard. The book and a good knowledge of MATLAB is all you need in order to pass this class.",
        "course": "AAE3581"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a really good professor. She talks a little quiet and with an accent, so sit towards the front. Her exams are very fair. She lets you have a sheet of notes front and back for exams. A fairly large amount of homework (not overwhelming), but it prepares you very well for the exams",
        "course": "AAE2405"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Go for attendance. Seriously, if you have taken linear algebra before, are decent at MATLAB, and do the homework without copying solutions, you should be okay without even paying attention. Homework isn't like the exams in terms of MATLAB, but she gives great hints of what theory is on exams via lectures and homeworks. Make good cheat sheets!",
        "course": "AAE3581"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Incredibly straight forward class, very few went to lecture since there wasn't much to gain. I only went for required attendance. Not a bad prof but one could pretty easily learn everything in the class just by reading the book a few minutes per topic (good text though).",
        "course": "AAE3581"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "As long as your algebra is good you will have no problem in this class.  The textbook is amazing and exams are luckily open book.  Very interesting content, I'm surprised attendance was like 40% every day.",
        "course": "AERO3581"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Thermo I for you all on semesters now.  Slightly easy class, but there were a few logical hurdles and Zhuang is good at helping you over them. Homeworks were pretty short but got gradually more difficult.  Exams didn't really get harder just more complex.",
        "course": "AAE405"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Knows what she is talking about and explains things pretty clearly, for an engineering class. Sometimes the homework can be annoying, but I never felt that she was unfairly hard on her students.",
        "course": "AAE581"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Aerospace Engineering",
    "firstName": "Debdipta",
    "id": "VGVhY2hlci0zMDA3MDYx",
    "lastName": "Goswami",
    "legacyId": 3007061,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's alright. Lectures were very confusing or boring. There were a couple homework assignments that took some time, but he was very helpful in office hours and answered any question I had. Very smart guy. ",
        "course": "AE3521"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "His lectures were dull and he was quiet. Didn't really communicate the material well. The homework was somewhat difficult but the tests were easier than a lot of high school tests were which really helped for such a difficult year in aerospace engineering. Definitely recommend taking a class from him",
        "course": "AE3521"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Aerospace Engineering",
    "firstName": "Colin",
    "id": "VGVhY2hlci0yOTYyNjEw",
    "lastName": "Trussa",
    "legacyId": 2962610,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great lecturer, really interesting material. Colin's handwriting was tricky to follow sometimes, but he was always happy to clarify. \nThe exams were a mix of calculation and conceptual questions.\nShow up to every lecture and pay attention, and you'll do well. It's a tough class - but what did you expect? Highly recommend.",
        "course": "AEROENG3560"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 1.9,
    "department": "Aerospace Engineering",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yNjUyMDgw",
    "lastName": "Ritchie",
    "legacyId": 2652080,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "He was helpful, supporting and very friendly ",
        "course": "AE2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "He's great. ",
        "course": "AERO2200"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ritchie is easily not only the worst professor but the worst teacher I've ever had. He does not grade crucial material on time, then he blames you for it. He is incredibly lazy; don't expect him to go out of his way to do ANYTHING. Don't bother having a grade dispute, because I have documentation proving he doesn't even follow his own policy.",
        "course": "AE4510"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ritchie is probably one of the worst professors at Ohio State. He is condescending in class, doesn't follow his own grading policy, doesn't meet his own time requirements for grading things, and gives terrible lectures. He fell asleep during my group's final presentation, like come on dude. Labs take way too long to complete and are super vague",
        "course": "AE4510"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Actually a ridiculously bad teacher. I've had him for 4 total classes (by far the most out of every professor I've had), and each class is just filled with pointless and vague busy work, terrible and un-instructive lectures, and hostile, lengthy, unhelpful answers to questions... all of which are delivered in a condescending tone by Ritchie.",
        "course": "AAE4511"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ritchie will break you. I was an optimist, bordering on happy, until this class. 12 hours in the lab twice a week, 15 assignments over the course of 14 days (a week before graduation) and enough bureaucratic pointless assignments to make a congressman cry. Dr. Ritchie will pit your group against eachother with CATME, and then laugh. Life sucks.",
        "course": "AAE4512"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Brian Ritchie was unfit to teach heat transfer b/c: 1. He doesnt know how to teach students 2. He doesnt know heat transfer I would recommend choosing any other professor over him b/c his lectures are unhelpful (just clicks thru textbook slides), his assignments arent even relevant, and to top it off, hes rude and condescending. Avoid him",
        "course": "ME4510"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "You will be watching a series of videos each week, and he will just poorly repeat what is in those videos. He wastes a lot of time ranting about things like football, so he ends up skipping a lot of slides about example problems. He seems bored during these lectures and acts rude when asked questions. My TA was much more helpful than him.",
        "course": "AERO2200"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "All he does is read from the slides, I learned more from the videos and my TA then from him. He is also very rude and ignorant sometimes. Maybe, it was because the class was changed to online, but I would not take his class again. I also think he just pretend to care about the student and the course, but in reality doesn't do anything to help us.",
        "course": "AE2200"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dont expect to learn much from lectures youll learn 90% from the pre recorded lectures from the previous professor. Changes exam style last minute for final from other exams. He will help you if you ask for it. I give credit for adapting to online instruction but clicking through pre made slides was not helpful.",
        "course": "AERO2200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.4,
    "department": "Aerospace Engineering",
    "firstName": "Brandon",
    "id": "VGVhY2hlci0xNzY2NjQ3",
    "lastName": "Cesul",
    "legacyId": 1766647,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "BT Cesul is an INCREDIBLE professor! He's relatable and doesn't take himself too seriously. He is an excellent resource and although I took him for a required course, I would easily take him again just for fun.",
        "course": "EDSGN100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Cesul was hired to teach a SENIOR DESIGN CLASS.  He ended up teaching at a FRESHMAN level.  While the alternative air option class turned in a 50 page paper, his space option class final paper had a 4 page MAX limit.  Most of the subject matter covered wasn't in depth enough to be useful and has set us back for the rest of the year.",
        "course": "AAE4517"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wow, just wow.  What an amazing prof for the Aero dept.  He was like a breath of fresh vacuum, to our astronautical minds.  But seriously, he was a very knowledgeable prof who provided us with vast amounts of information, but more than that he instilled motivation in our class to learn.",
        "course": "AAE4517"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I was fortunate enough to have Dr. Cesul teach my senior design class for a semester. Though it was his first time teaching, he did an excellent job covering a vast quantity of material that none of my other courses had begun to teach. It's obvious he's very knowledgeable on satellite design. I would definitely take another course taught by him.",
        "course": "AAE4517"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Cesul taught our S/C Design class for the semester. He is very interested in teaching and helping students learn. He was also very willing to help students apply for jobs or graduate school. He went above and beyond just the teaching roll.  Dr. Cesul will be a great addition to any University that is smart enough to hire him.",
        "course": "AAE4517"
      }
    ],
    "SEI": []
  }
]