[
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "African Studies",
    "firstName": "Omar",
    "id": "VGVhY2hlci0yNDEyNjU1",
    "lastName": "Dieng",
    "legacyId": 2412655,
    "numRatings": 3,
    "summary_comment": "Professor Dieng offers a highly engaging and accessible course with a focus on interesting reading materials. His teaching style is praised for its personal touch and enthusiasm, making the class enjoyable and easy to follow. Students recommend the course for its balanced grading system and potential for earning good grades with consistent effort.",
    "summary_comment_short": "Professor Dieng offers a highly engaging and interesting course with a focus on historical study and literature. His lectures are well-received, and students appreciate his enthusiasm and personal insights, though the course is reading-heavy with a significant emphasis on participation and a few papers for grading.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The books for the course are pretty interesting. Hardly any quizzes, but a few papers so most of your grade is participation and two papers.",
        "course": "AFAMAST2251"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved this class! You want an easy GE, this is the one. Professor Dieng is super nice. He really loves the topics he teaches and loves sharing his own personal experience with us. The course is reading heavy so get ready to read. The individual reading for each day isn't too much to handle and is super interesting! Totally Recommend!",
        "course": "AFAMAST2251"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "A really great class! Would recommend for students looking for an easy GE which covers both Historical Study and Literature. Very interesting and the books were all very good. An easy A if you keep up with the readings and pay attention to what is said in lecture.",
        "course": "AFAMAST2251"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "African Studies",
    "firstName": "Frida",
    "id": "VGVhY2hlci0yMzc1NzM1",
    "lastName": "Tungaraza",
    "legacyId": 2375735,
    "numRatings": 1,
    "summary_comment": "Professor Tungaraza, often referred to as \"Mama Frida,\" is highly regarded for her exceptional teaching quality and genuine care for her students. She creates an engaging and supportive learning environment that motivates students to perform well, and her dedication extends beyond the classroom. Students consistently praise her for her commitment and willingness to go above and beyond for her classes.",
    "summary_comment_short": "Professor Tungaraza is highly regarded for her exceptional teaching quality and genuine care for her students. Students consistently praise her dedication and commitment to their success, often noting that her passion for teaching makes it difficult not to engage and excel in her classes.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mama Frida is truly the most amazing prof at OSU she cares about all of her students. If you show up you will get a B without even trying but honestly, it's so hard not to want to try because she puts so much love into her classes. She will go to the moon and back for any of her students. Do yourself a huge favor and take her classes.",
        "course": "SWAHILI1103"
      }
    ],
    "SEI": [
      {
        "Subject": "SWAHILI",
        "Catalog": "1101",
        "Class Name": "Elementary Swahili I",
        "Class Number": "21826",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1102",
        "Class Name": "Elementary Swahili II",
        "Class Number": "20521",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.36"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1103",
        "Class Name": "Elementary Swahili III",
        "Class Number": "22951",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1101",
        "Class Name": "Elementary Swahili I",
        "Class Number": "20456",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1102",
        "Class Name": "Elementary Swahili II",
        "Class Number": "20455",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1103",
        "Class Name": "Elementary Swahili III",
        "Class Number": "28280",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.64"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1101",
        "Class Name": "Elementary Swahili I",
        "Class Number": "19849",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1102",
        "Class Name": "Elementary Swahili II",
        "Class Number": "18544",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1103",
        "Class Name": "Elementary Swahili III",
        "Class Number": "20974",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1101",
        "Class Name": "Elementary Swahili I",
        "Class Number": "14583",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1102",
        "Class Name": "Elementary Swahili II",
        "Class Number": "14582",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.82"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1103",
        "Class Name": "Elementary Swahili III",
        "Class Number": "22401",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1102",
        "Class Name": "Elementary Swahili II",
        "Class Number": "22239",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1103",
        "Class Name": "Elementary Swahili III",
        "Class Number": "22623",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.78"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1103",
        "Class Name": "Elementary Swahili III",
        "Class Number": "24543",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1101",
        "Class Name": "Elementary Swahili I",
        "Class Number": "20757",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "SWAHILI",
        "Catalog": "1102",
        "Class Name": "Elementary Swahili II",
        "Class Number": "20756",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.2,
    "department": "African Studies",
    "firstName": "Lupenga",
    "id": "VGVhY2hlci02Mzg2MTc=",
    "lastName": "Mphande",
    "legacyId": 638617,
    "numRatings": 23,
    "summary_comment": "Professor Mphande is widely regarded as disorganized and ineffective in terms of lecture delivery and class management, with many students finding his classes unstructured and irrelevant. Despite some positive comments noting his knowledge and kindness, the majority of feedback emphasizes the difficulty in contacting him, the lack of clear guidance, and the overall poor organizational skills, leading to significant stress for students.",
    "summary_comment_short": "Professor Mphande is widely regarded as disorganized and ineffective in structuring his lectures, which often lack relevance to the course material. Students find his classes confusing and stressful, with many suggesting he needs significant support from a teaching assistant to improve the learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Such a sweet man but has no idea whats he's doing at all times. Lectures are pointless and unorganized with no real information that is relevant to the class. The only thing you will be graded on is 8 random papers that you have no idea what to do with. Doesn't know how to use Carmen. Good luck getting an email response. ",
        "course": "AFAMAST2251"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't take this. Not by far, but likely the worst professor I have had.",
        "course": "AFAMAST3376"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "He should get a TA its exhausting.",
        "course": "AFAMAST3376"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very disorganized class doesn't know what he is talking about ever responds to email. Class isn't to difficult, but not worth the stress.",
        "course": "AAAS2251"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Mphande is a great professor. His class is lecture heavy but he truly is brilliant. The department is severely understaffed and he has trouble with technology, but we got a TA a few weeks in and it made the world of difference. ",
        "course": "AAAS2251"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mphande is an incredibly knowledgeable professor and just a wonderful person. While the class is a bit unorganized at times, and while he most definitely requires a TA, my experience in this class as well as 3310 (Global Perspectives of the African Diaspora) has been nothing but incredible. He is so kind and he offers indispensable info to us. ",
        "course": "AFAMAST3376"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "This is the most unorganized and unproductive class I've ever had the misfortune of attending in my entire college career. Professor Mphande is occasionally enjoyable and had good stories, but his class structure is extremely uncoordinated. He has quite literally zero grasp on using technology, and the lectures are convoluted and hard to follow. ",
        "course": "AAAS2251"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Although this class was interesting a pretty easy, the professor was almost entirely inaccessible outside of class and the class did not line up with the syllabus at all. We never knew when anything was due or what we were supposed to be reading. ",
        "course": "AFAMAST2251"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 2,
        "comment": "I am a first year and I was so excited to take this class. However, it is the worst class I have taken so far this semester. It's a hybrid class, so half in person and half on Zoom. He does not know how to use technology and relies on his students to do everything for him. He does not check email or Canvas messages. He is also not understanding.",
        "course": "AAAS3310"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "The work load was manageable and so was class twice a week. However, the professor is unreachable. His email does not work, does not respond on carmen canvas, and no office hours. Essay prompts are usually confusing and hard to understand at first. Grades fairly reasonable, as I ended with an A- and I tried my best. Very nice man, needs a TA.",
        "course": "AFAMS251"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Mphande is really amazing! He is incredibly knowledgeable and his stories are fascinating. He was a great professor, and Fungisai Musoni was an excellent TA!",
        "course": "AFAM251"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "can be tough to get used to at first and lectures can be long and boring but as long as you show up to class, do the work, and FOLLOW THE RUBRIC!!! you should be on track to an A. He can be funny at times too. 5 books, 5 essays and a few easy homework assignments.",
        "course": "AAAS2251"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Truely the worst professor and experience I have had at OSU. I was excited for this class, but he doesn't give instructions on papers and then grades then tough even though he gave you either no guidance or 4 contradicting ways to do the work. He was never clear on due dates and would never accept 'late' work when he changed the due dates.",
        "course": "AAAS3310"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Honestly this class was amazing and it opened my eyes to the conflicts happening around the world and how it relates to youth in general. Especially with the election that happened. There are some papers you have to write and you have to read to participate in the discussion. If you are like me and hate writing papers, don't procrastinate.",
        "course": "AFAMAST2251"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "He seems to be a very nice and flexible professor, however his TA M Crum seems to counter everything Lupenga Mphande stands for. She is just terrible and will not budge on any assignment given.",
        "course": "AAS251"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "He great. He is very passionate about the subject. I would love to hear is full biography, he has had a interesting life. BUT his TA M. Crum is HORRIBLE! She ruins everything good about the class. She is mean, not flexible, on a power trip, etc.",
        "course": "AFAMS251"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "You're graded on 3 essays. The lectures were a drag because you really don't have to go to class to do well on what's graded (the papers). But if you miss class, you're grade will be suffer. Simply go to class, and do your own research. Please spend time with him in his office and talk about South Africa. His firsthand experience is truly unique.",
        "course": "AAAS485"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "This is the best professor I've ever had!",
        "course": "AFR100"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 1,
        "comment": "I was really excited to take  this class, not only because of my interest in Africa, but also because of the entries I read here. He's a nice enough guy, and is passionate about Africa, but instead of giving facts he often goes into stories that just don't seem historically accurate. He might just be getting older as he also often repeats himself.",
        "course": "AAAS485"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Dr. Mphande. He is the greatest professor ever. He's so nice and helpful, also very intelligent and knowledgeable",
        "course": "AFAM485"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 1,
        "comment": "Boring, but somehow interesting!",
        "course": "AFAM251"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is amazing! He actually helped end Apartheid in South Africa, and he has so much wisdom and passion to share with his students. It's an incredible opportunity to learn history from someone who experienced and helped make it happen. He deserves the greatest respect possible, and I have been blessed to have him as a teacher.",
        "course": "48501"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "The BEST teacher I've had at OSU. Very smart, knows a lot about EVERYTHING. Very funny, nice, and helpful. Is famous in his own right, he is also a prince of the Zulu tribe. Take him if you can, you'll never be the same. Ended our class 5 WEEKS EARLY b/c he was going to Africa. No midterms, finals or quizes.  Just 5 papers made up the class. The be",
        "course": "AFAMST48501"
      }
    ],
    "SEI": [
      {
        "Subject": "AFAMAST",
        "Catalog": "3310",
        "Class Name": "Global Perspectives on the African Diaspora",
        "Class Number": "22258",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "3.9"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3376",
        "Class Name": "Arts and Cultures of Africa and the Diaspora",
        "Class Number": "22456",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.35"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "20031",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "3.76"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "36268",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.06"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "18471",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "2.86"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3376",
        "Class Name": "Arts and Cultures of Africa and the Diaspora",
        "Class Number": "20479",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "3.75"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "37499",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "3.86"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2253",
        "Class Name": "Introduction to Caribbean Literature",
        "Class Number": "22476",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "3.86"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "22166",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "3.04"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3310",
        "Class Name": "Global Perspectives on the African Diaspora",
        "Class Number": "23906",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "3.11"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "30557",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "3.06"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3376",
        "Class Name": "Arts and Cultures of Africa and the Diaspora",
        "Class Number": "33954",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "3.86"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2253",
        "Class Name": "Introduction to Caribbean Literature",
        "Class Number": "35390",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "3.25"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3376",
        "Class Name": "Arts and Cultures of Africa and the Diaspora",
        "Class Number": "35394",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "3.47"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "29580",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3310",
        "Class Name": "Global Perspectives on the African Diaspora",
        "Class Number": "29994",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "3"
      },
      {
        "Subject": "HISTART",
        "Catalog": "3102",
        "Class Name": "Arts and Cultures of Africa and the Diaspora",
        "Class Number": "37084",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "History of Art",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "3.67"
      }
    ]
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.7,
    "department": "African Studies",
    "firstName": "Ousman",
    "id": "VGVhY2hlci05OTE4MDc=",
    "lastName": "Kobo",
    "legacyId": 991807,
    "numRatings": 24,
    "summary_comment": "Professor Kobo is highly regarded for his well-organized and informative courses, which are described as enjoyable and manageable despite the significant reading load. Students appreciate his accessibility and supportive nature, though some find the quiz questions vague and challenging. His classes are recommended for those deeply interested in the subject matter, as they require substantial engagement and effort.",
    "summary_comment_short": "Professor Kobo is highly regarded for his organization and accessibility, providing a structured yet flexible learning environment with clear expectations and supportive feedback. Despite some criticism regarding vague quiz questions and extensive reading requirements, students generally find him knowledgeable, approachable, and genuinely invested in their success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took his 4 week course and it was well organized. This course was super informational, fun, and easy to do when taking lots of hours. One big essay due at the end but he is super accessible and wants to help. Quizzes were easy, weekly assesments were just talking about what you found interesting or new. The essays are simple as long as you try. ",
        "course": "HIST3301"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've taken a couple classes with Prof. Kobo and even though he's outside my concentration, he is one of my favorite profs at OSU. He's extremely kind, gives great feedback, and is sympathetic to the stresses of being a student and allows for extensions when needed. It's a lot of reading but it's not so bad when you have such a nice prof.",
        "course": "HIST3304"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The questions on quizzes and assignments are so vague and not straight to the point at all. All questions are either all right or all wrong, and it is really hard to distinguish between the correct answer. He makes the MCAT seem far more easier than his quiz questions. Not a bad professor, but he just needs to make the questions less severe. ",
        "course": "HIST3306"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Don't sign up for his class if you only want to do the bare minimum, but if you're okay with working a moderate amount then it's really not that hard. He structures his class in a way that's thought provoking, so I only recommend if your genuinely interested in history. Super nice guy, gives lots of good feedback, actually cares about your success.",
        "course": "HIST2800"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took his four-week classes and it was pretty simple. As long as you keep up with the readings and assignments you'll be fine. I also learned a lot from this class. Definitely not the Eurocentric view of African history most of us are used to.",
        "course": "HIST3301"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Kobo is very knowledgeable, but it is hard for me to recommend a professor that uses Wikipedia for lecture material. Another issue is that the quiz questions are vague which makes it hard to know the correct answer, BUT he gives you 45 minutes for ten questions. I honestly have not retained very much of the lectures and I am a 4.0 student.",
        "course": "HIST3301"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Prof Kobo seemed like he knew a lot about the subject and enjoyed it, but I don't feel like I learned a lot. The questions on his quizzes were often very vague with multiple correct answers or sometimes flat out incorrect, which led to a lot of anxiety when taking the weekly quizzes. The final was very difficult (essay questions and proctored).",
        "course": "HIST3306"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "The guy seems nice, his reminders and announcements are helpful. However, there is a LOT of stuff to do. Readings are very, very long, and he requires a discussion post based on them by noon on Wednesday. I'm talking like 100+ pages total. The stuff is interesting, but hard to grasp. Unless you're super into the topic, avoid.",
        "course": "HIST3306"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 5,
        "comment": "I'm taking the online 4 week session. Seems like a nice guy, but the class is way too intense. He obviously doesn't take into account that you are taking other classes at the same time. Also, his TA gives you no breaks. Hard grader",
        "course": "HIST3301"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Ousman is one of the more caring professors i've had. In this online class it was apparent to me that he wanted us to succeed and actually learn about Africa. He would send reminders almost daily to ensure no one forgot about an assignment. I once got a 6/10 on a quiz and he changed it to a 10/10. His reason was &quot;the questions you missed were bad&quot;",
        "course": "HIST2303"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Just avoid it...",
        "course": "HIST3301"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Well, he is quite a nice guy, but his tests were insanely hard and it takes a lot of videos to look at for just ten questions. Anyway, he is quite passionate to his students. If you want an easy GE for History, he is not your guy. Just take another professor.",
        "course": "HIST3301"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Kobo really wants his students to succeed. The online class was an extremely easy A, but I'm good at history so it might be more work for some. I took it to fulfill my history GE (counts for honors), and I'd recommend it to anyone. Great may-mester class.",
        "course": "HIST3301"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 5,
        "comment": "he is nice..  always nice.... strongly recommended...",
        "course": "HIST3301"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "He really wants everyone to do well. Lots of emails to make sure no one misses/forgets anything!",
        "course": "HIST3301"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "I have very mixed feeling about his class.  He isn't the best professor but his class is fairly easy. However don't be fooled he can screw you over. Most of your grade comes from a few assignments and if you get a low grade you're screwed.",
        "course": "HIS3333"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Kobo is very thorough in his lectures, and frequently provides lots of readings and documentaries in addition. It is a lot of material to learn and can be difficult at times, but if you put in enough effort you can get an A. He is clearly very knowledgeable and it's very clear what he expects each week, just get ready to read a lot.",
        "course": "HIST2303"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 2,
        "comment": "Some weeks were easier than others. Definitely not a bad Maymester choice.",
        "course": "HIST3301"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor",
        "course": "HIST2303"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher. Genuinely cares about his students and assigns a reasonable amount of work. Interesting material and always responds to emails and discussion posts ASAP. Excellent class, cool guy.",
        "course": "HIST3301"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "Kobo is one the best professors Ohio State has to offer. Extremely knowledgeable. Cares for his students a LOT. His main aspect of his class is for his students to come out and have learned something about Africa. Would highly recommend!!",
        "course": "HIST2303"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class has taught me so much, not only did he dispell many of the general myths abotu Africa, but he also taught me things I would have never learned about Africa. The quizzes are really easy as long as you go to lecture and the midterm and final are relatively easy as long as you put some effort into them. His lectures are long but informative",
        "course": "AA0010"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class has taught me so much stuff it is unbelievable. I would recommend this class to everyone that is interested in Africa and even those who are not because he is the type of professor who clarifies a lot of myths about Africa. overall the quizzes were easy as long as you paid attention to lecture and the midterm and final are relatively eas",
        "course": "AFRHI0010"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "Interesting class, but a little tough for those without a background in the subject. Go to class, he takes attendance.  Lectures posted online.  Tough grader, don't let his accent fool you, his English is grammatically perfect and he will call you on yours if it isn't. Expect to put forth effort on papers if you want a decent grade.",
        "course": "AAAS350"
      }
    ],
    "SEI": [
      {
        "Subject": "AFAMAST",
        "Catalog": "3304",
        "Class Name": "History of Islam in Africa",
        "Class Number": "37526",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "2",
        "Rating": "4"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3301",
        "Class Name": "History of Modern West Africa, post 1800",
        "Class Number": "18285",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3306",
        "Class Name": "History of African Christianity",
        "Class Number": "18286",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "2800",
        "Class Name": "Introduction to the Discipline of History",
        "Class Number": "23708",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "7305",
        "Class Name": "Studies in African Religions",
        "Class Number": "33914",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3301",
        "Class Name": "History of Modern West Africa, post 1800",
        "Class Number": "18880",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.89"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3306",
        "Class Name": "History of African Christianity",
        "Class Number": "18881",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.5"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3306",
        "Class Name": "History of African Christianity",
        "Class Number": "18849",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3301",
        "Class Name": "History of Modern West Africa, post 1800",
        "Class Number": "18848",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.63"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "4325",
        "Class Name": "Seminar in African History",
        "Class Number": "33287",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3301",
        "Class Name": "History of Modern West Africa, post 1800",
        "Class Number": "18945",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.39"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3306",
        "Class Name": "History of African Christianity",
        "Class Number": "18946",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3304",
        "Class Name": "History of Islam in Africa",
        "Class Number": "35897",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.71"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3301",
        "Class Name": "History of Modern West Africa, post 1800",
        "Class Number": "18868",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3306",
        "Class Name": "History of African Christianity",
        "Class Number": "18869",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.6"
      },
      {
        "Subject": "HISTORY",
        "Catalog": "3304",
        "Class Name": "History of Islam in Africa",
        "Class Number": "34595",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "History",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.39"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.7,
    "department": "African Studies",
    "firstName": "Kwaku",
    "id": "VGVhY2hlci01NDkyMzQ=",
    "lastName": "Korang",
    "legacyId": 549234,
    "numRatings": 21,
    "summary_comment": "Professor Korang is generally perceived as unorganized and difficult to follow, with lectures often leaving students with more questions than answers. Students found his classes lacking structure and criticized his grading methods and communication, though some appreciated the group projects and discussions on complex texts. Overall, opinions vary widely, with some finding the class challenging yet rewarding, while others strongly advise against it.",
    "summary_comment_short": "Professor Korang is widely perceived as unorganized and difficult to follow, with lectures often leaving students with more questions than answers. Students also note that his grading and communication can be inconsistent, leading to frustration and confusion.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "He was very unorganized, and his lectures often left me with more questions than when I started. His lectures usually involve talking at us for an hour and a half. You get five grades all semester, and 3 of them are tests. I would not recommend this class. ",
        "course": "AAAS251"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Class was not very structured, and there were so so many readings. Biggest problem I had with him is that he showed very graphic movies during class without any sort of warnings. I did all the readings and studied to get an A, it's not hard content just a lot of it. ",
        "course": "1100H"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr.Korang was unfortunately not a good experience for me. I had to take a makeup exam and it took a long time for me to get ahold of him. When I did the exam, I'm very certain that I aced it; as the material was not altered. Yet, I got no feedback and my grade did not change. He is hard to understand and does not communicate. Nice guy though. ",
        "course": "AAAS251"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was awesome. Got an 89.8 after not doing any reading until the exam night and went through an existential crises. I sent him 2 emails and a canvas reply asking him to round up to an A-. IDK if he did it before or after my messages but it ended up an A-. I don't say this lightly when if that man ever needed a kidney I got him. Korang I love you.",
        "course": "AAAS251"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "was stressed in the beginning bc I thought this class was unorganized, but I learned that he is well-prepared, he just organized carmen a little differently than others. Had a group project to record 4 podcasts about race, which I felt helped me understand so much and learn to articulate my thoughts better. Loved this class, great guy!",
        "course": "AAAS3440"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Korang has a funny and unique personality. However, his thick accent does make it hard in class when he is discussing things. He does grade hard on essays and midterms. The books and readings for the class were absolutely horrible! The texts were loooong and very hard to decipher. He expects everyone to learn the way he teaches. pay attention!",
        "course": "AFAMAST1101"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Prof. Korang is a great guy, but as a professor, he is terrible. Lectures made no sense and had no correlation to the quizzes or midterms. Does not show up on time to lecture or office hours. He goes off topic a lot and does not follow the syllabus at all and does not put in the correct grades. Could have an A all semester and end up with a C.",
        "course": "AAAS1101"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took this class because I couldn't get into Honors Classical Mythology and I'm glad I did. It's a solid choice, it's just a lot of reading on colonialism/feminism novels. I actually read all but one book, but I know people just spark noted through. Classes are just discussions on the books. His main grades are your essays, which aren't too bad.",
        "course": "1100H"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 1,
        "comment": "just straight up did not like this class the books were amazing and Korang is a really nice guy other than that lectures are confusing and boring only had 6 grades in the entire class (3 exams, a worksheet, attendance, and a debate) so you lose points fast he takes attendance every class but you could easily skip class and still do well on exams",
        "course": "COMPSTDS2015"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Note taking was difficult as he would just stand in front of the class and talk. There was no outline or direction about the notes besides when he would just write words in all caps on the chalkboard and then blab on. He is a nice guy though and his class isnt hard if you go to class and participate.",
        "course": "COMPSTDS2105"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "Laid back class. Most of books you can get spark notes, shmoop, or other abbreviate notes for. 5-7 books we read. Don't bother buying because you can find PDFs online. Graded papers a bit tough with not much feedback but this is offset by the generous grading scale (85 percent was an A-). Participation matters, worth 15 percent of final grade",
        "course": "2101H"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very hard to understand his accent.  Can tell he is a very smart man. Teaches in full lecturegroup discussion. He has very interesting points and teaches in a very unorthodox manner. With that being said, I have no idea what my grade in that class will be. Could be a D, could be an A. He doesn't follow his syllabus whatsoever. ",
        "course": "1100H"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Did not follow his own syllabus. Very irrelevant lectures. Hard to understand and also very inappropriate. Makes me feel weirded out. ",
        "course": "2101H"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "This guy is absolutely rediculous! He is about as helpful to me as the rapping bum on high street. I scheduled appointments with him to have them cancelled, Emailed him and never received Emails back, and had no feedback on papers whatsoever. He makes you read 5 books and compare two or three of them in your final 10 page paper.",
        "course": "HCPST201"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr Korang was pretty cool. It was an easy class and pretty laid back. It was alot of class discussion. There's quite a few books to read but they are high school material and there are alot of notes online you can get that are helpful for the tests. Just attend class, do the readings and you should get an A. I got a B+ by barelyl trying.",
        "course": "AAAS251"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "the class was easy, all we did was discuss the books we read.  it is a very light work load, some of the books are really good, but the downside is that its all about post-colonialism (and mostly focusing on Africa in some way or antoher). but korang is really nice and i like him.",
        "course": "CSH201"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 3,
        "comment": "He gave us about seven short books to read, from 100-250 pages a piece. I simply used spark notes for each, nothing too strenuous. He graded us on two papers, neither of which took too much strain. It was good to have the experience of having a class with someone from Africa, it gave me a new perspective and I enjoyed the class and him. He's funny.",
        "course": "CMPSTH201"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a very intelligent man who seems dedicated to teaching - he's helpful in explaining something if you don't understand. Our workload was not too high (we read 5 or 6 novels) and was mostly based around class discussions. We talked about interesting things in this class and overall, I enjoyed it.",
        "course": "CS510"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 2,
        "comment": "Seemed like a nice professor. His teaching style isnt too great though. Hard to keep interest in class. Easy grader with a nice grading scale, but I dred going to class at times, beacause it is repetitive.",
        "course": "AAAS451"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class wasnt bad at all; we just read a lot, watched movies, and had class discussions. Our grades were a few random easy assignments and 3papers (2 short, one 6 pages). Easy grader, the only thing I didn't like was the content: it was like an African history class with some random other cultures",
        "course": "COMPSTDSH201"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "I dropped this class after the first day, as did 6 other people in the class.  The guy seems like a nice guy, but that's it.  He has a very, very strong African accent and the course load was insane..7 very large African novels in a 10 week quarter! Do not, under any circumstances, take his class!",
        "course": "COMPSTUDH201"
      }
    ],
    "SEI": [
      {
        "Subject": "AFAMAST",
        "Catalog": "4551",
        "Class Name": "Topics in Africana Literature",
        "Class Number": "34414",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.2"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3440",
        "Class Name": "Theorizing Race",
        "Class Number": "28202",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.29"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "38425",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3440",
        "Class Name": "Theorizing Race",
        "Class Number": "22323",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "4.67"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2251",
        "Class Name": "Introduction to African Literature",
        "Class Number": "28755",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.74"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "3440",
        "Class Name": "Theorizing Race",
        "Class Number": "28020",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.38"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2105",
        "Class Name": "Literature and Ethnicity",
        "Class Number": "14387",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "N/A",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "34891",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "6100",
        "Class Name": "Critical Foundations: Comparative Analysis",
        "Class Number": "34913",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.29"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2105",
        "Class Name": "Literature and Ethnicity",
        "Class Number": "22339",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.67"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100H",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "27807",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.29"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2105",
        "Class Name": "Literature and Ethnicity",
        "Class Number": "28029",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.43"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100H",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "29694",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "3.5"
      },
      {
        "Subject": "PHILOS",
        "Catalog": "3440",
        "Class Name": "Theorizing Race",
        "Class Number": "33975",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Philosophy",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.5"
      },
      {
        "Subject": "PHILOS",
        "Catalog": "3440",
        "Class Name": "Theorizing Race",
        "Class Number": "29804",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Philosophy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.29"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "African Studies",
    "firstName": "Paulette",
    "id": "VGVhY2hlci0xMjYwODM=",
    "lastName": "Pierce",
    "legacyId": 126083,
    "numRatings": 20,
    "summary_comment": "Professor Pierce is widely regarded as one of the top educators, with students praising her passion for teaching and her ability to engage and inspire them. Her classes are noted for being both informative and engaging, with many students crediting her with significant personal and academic growth. Her dedication to fostering a deep understanding of the subject matter and teaching effective learning skills has left a lasting positive impact on her students.",
    "summary_comment_short": "Professor Pierce is widely regarded as one of the top teachers, known for her engaging and passionate approach to instruction that fosters deep learning and personal growth among her students. Students consistently praise her for making classes enjoyable and attention-grabbing, and many credit her with significant positive impacts on their lives both academically and personally.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Pierce was one of the best professors I ever had in my life. I wish I could contact her now, but I can't find her contact information anywhere. Thank you Dr. Pierce for making me a better person and teaching me not just about the topic but also how to learn and really analyze.",
        "course": "AAAS101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is the best teacher/professor I ever had, I've thought of her classes many times throughout my life.",
        "course": "AFAM100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "This professor changed my life! I had her class 14 years ago, it wasn't a major class, but it has helped me in life over and over.  She cares about teaching/learning and positive change.  If I were a teacher, I would model myself after her style.",
        "course": "AAAS101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was my professor for the first Black Studies class I took and the last one a few quarters before graduating.  The material she presented was very interesting and she had a teaching style which made every student enjoy attending class.  I would have taken one of her classes every quarter if I could!",
        "course": "AMFAM101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors i ever had the chance to work with.  Trully passionate about people and what she does.  As stated before, she is a very classy woman and always keeps her lectures real and interesting.  I highly reccommend her.  Thanks Dr. Pierce!!",
        "course": "AAAS495"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very passionate about the class material",
        "course": "AFAMAST101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Easily the best teacher I have ever experienced at OSU. She is the classiest, most sincere professor I've ever had. The way she speaks makes her students WANT to care and WANT to understand. As good as it gets.",
        "course": "AFAM"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was able to keep my attention during lecture, which is hard to do. Her classes were never boring.",
        "course": "AFAM100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is amazing! She is a truly caring and inspiring woman.",
        "course": "218101495"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is very easy to understand, and she's a captivating speaker.  I LOVE her class, and she's a wonderful professor.  You cannot just slide by, but the class is not hard...maybe borderline of easy to medium.  Take every class  you can with her and you will not regret it.  Shes very classy and a woman of integrity.",
        "course": "AFAM101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely love the class!!!!",
        "course": "AFRICANSTUDIES"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was the best teacher I have ever had. I wish she taught more courses at OSU. Unfortunately, the one course I took as an elective limits my chances of having her again. If she offers a class u need to take, take it!!!! You won't regret it",
        "course": "AFAM218"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is the best teacher at OSU",
        "course": "AAAS218"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "GREATEST PROFESSOR I'VE HAD. CAPTIVATING TEACHING STYLE. YOU WANT TO HEAR HER WHAT SHE HAS TO SAY.",
        "course": "AFAM"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best teacher i've had here",
        "course": "AAAS101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was an awesome African-American and African Studies Professor. She is full of energy and you can tell she loves teaching if you go to her lecture. I recommend this teacher.",
        "course": "AAAS101"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was very very inspired and communicated real well.  Loved it when students participated and encouraged everyone to do so.  I was a little skeptical when I went in to the class, but she made class enjoyable.",
        "course": "AAAS101"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome prof!  Full of energy and very enthusiastic!  I reccommend her course...Read the material, take some notes and go to class and you should have no problem!",
        "course": "AAAS101"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was a g8 prof!  If you dd the readings, took notes, and attended class you'll get a good grade.",
        "course": "AAAS101"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very negative outlook was presented to our class",
        "course": "230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 3.5,
    "department": "African Studies",
    "firstName": "Kenneth",
    "id": "VGVhY2hlci0xNzkwNjA0",
    "lastName": "Goings",
    "legacyId": 1790604,
    "numRatings": 7,
    "summary_comment": "Professor Goings is known for making his course challenging, particularly for students without prior background in African American studies or history. He emphasizes active participation, frequent quizzes, and extensive reading, which require significant dedication. Despite the difficulty, many students find him knowledgeable and engaging, noting that his high expectations lead to a deeper understanding of the subject matter.",
    "summary_comment_short": "Professor Goings is known for making his course challenging, particularly for general education students, due to extensive reading requirements and frequent quizzes. He is highly regarded for his depth of knowledge and ability to engage students, though students find the course demanding and recommend having prior background in African American studies or history to succeed.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Many people say that this professor his hard. I'm going, to be honest. I barely read any of the books. All I did was pay attention, took notes, did any extra credit offered, and study for the midterm &amp; final(I got 100% on both of them). I failed about most of the quizzes so I'm surprised I got an A; Just study hard for exams and do extra credit.",
        "course": "AFAMAST3083"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I came into this course very anxious/nervous due to the posts that claim Prof Goingss classes are hard and impossible to pass if you arent an African American Studies major. I regret these feelings I had because Prof Goings made the course interesting and easy to pass (if you pay attention). The pop quizzes come straight from lecture, go to class",
        "course": "HIST3083"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "have readings everyday, along with presentations on readings. pop quizzes frequently on readings, and if you miss class you get a 0 on the quiz, however he doesnt take attendence. he grades badly, says a grade for a test or presentation will be based in your behavior/attendance/participation??? which doesnt make sense and shouldnt be allowed.",
        "course": "HIST3083"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "A LOT of readings!!! If you can't keep up... good luck. Do NOT take it as a GE and don't take it if you haven't taken a previous African American class. If you answer a question don't be surprised if he replies &quot;WRONG&quot; or &quot;NO&quot;.",
        "course": "HISTORY3083"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very intelligent, and a very good teacher. Very old-school, expects you to really think. Great if you are a history major, or but not just for a GE. Lots of quizzes, reading, etc.",
        "course": "HISTORY3083"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "He makes this a very hard course. I took it as a GEC, this was a mistake! If you have previous African American Studies knowledge or are history major this might be ok. He expects a lot of reading and he wants you to understand very deep meaning of the reading. A lot of quizzes and HW! Beware!",
        "course": "HISTORY3083"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very interesting, very knowledgeable. Quizzes are very hard, read material closely! An expert in his field though, and very helpful.",
        "course": "HIST3083"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "African Studies",
    "firstName": "Viola",
    "id": "VGVhY2hlci0xMDkxODU=",
    "lastName": "Newton",
    "legacyId": 109185,
    "numRatings": 38,
    "summary_comment": "Professor Newton is widely regarded as the best teacher at OSU, known for her engaging and entertaining lectures, clear expectations for assignments, and a generous extra credit policy. Students consistently praise her for making class both enjoyable and easy to excel in, often earning an \"easy A\" with minimal effort beyond attendance and participation.",
    "summary_comment_short": "Professor Newton is widely regarded as the best professor at any university, known for her engaging and entertaining teaching style, clear expectations for assignments, and high level of knowledge. Students consistently praise her for making class enjoyable, providing ample extra credit, and ensuring an easy A for those who attend and participate.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best.",
        "course": "BWS105"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor at any university.",
        "course": "BWS105"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "You have to write a lot of papers but she tells you EXACTLY how she wants them to be, so they're a breeze to write. You can only miss 3 classes, but I never found myself wanting to skip. She's super entertaining, sassy, and makes class hilarious! She gives a lot of extra credit. You do have to participate in class and get the book. Easy A!",
        "course": "236702"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best teacheres I had at OSU!! Class was an easy A if you attended and made an effort to participate. Mrs. Newton wrote my letter of rec for law school and helped me get into USC, couldn't be more grateful for the good-will off Mrs. Newton!",
        "course": "AAS367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easiest A ever! Just attend class and write the papers how she tells you to and you'll walk away with an A. She has a bold personality so be prepared. Despite the craziness, an extremely enjoyable class and you'll learn a lot.",
        "course": "AFAM367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best Professor I have ever had at OSU. Speak clearly when asked questions and always provide an answer. First impressions are important with her. One of the only classes I enjoyed attending. She provides constant amusement and will keep you on your toes.",
        "course": "AFAMA367"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Just attend class. Be on time. Pay attention (or pretend to) and smile. You will walk away with 350+ extra credit points and the easiest A ever!",
        "course": "AFAM3673"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Newton is absoulutely one of OSU's best professor they have ever & may ever have.  I took Newton my sophomore year, I'm a senior now, but I have never had any instructor even come close to the knowledge and the superior level of education that Dr. Newton provides to her students.  HIGHLY RECOMMEND!!!",
        "course": "AFR367"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Best writing class ever! You just cannot get below 95 on your papers. I'd recommend her; you'll learn and have fun!",
        "course": "AAAS367"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 1,
        "comment": "I know she cares students and she would like to make students learn from the class but you should be be patient to be made fun of and lots of yelling in the class. Then, you will get A from her.",
        "course": "AAAS367"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "You can't get below A!",
        "course": "AFAMA367"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Real fun in the class although little extra work",
        "course": "AAAS451"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely love Dr. Newton.  She is very knowledgeable and possesses a wonderful gift to quickly open your understanding.  She also has an sparking personality that keeps the class interesting and keeps you fully engaged in the class and material.  Take her class and you will NOT regret it.  I HIGHLY RECOMMEND DR. NEWTON, SHE IS EXTRAORDINARY!!",
        "course": "AAAS254"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor.  Does a good job keeping class interesting.  Not very difficult, her goal is to give her students A's because, &quot;Your momma didn't send you to school to get bad grades.&quot;  Definitely take if you have the opportunity.",
        "course": "AFAM367"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "AAAS 367.03, u may need to work hard in her class, but its all worth the A you get finally",
        "course": "AAAS367"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "I LOVE mrs. newton. one of the BEST teachers on campus. there is no way u cant get an A from her class, its like her goal to give everyone an A. Plus the class is really interesting. Ive taken her twice and will probably a 3rd. her classes have definitely boosted my GPA",
        "course": "AFAM365"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "I came into this class without a clue or appreciation for writing, I left with just the opposite. She is a teacher and I mean that!!!! She is knowlegeable and she cares. If you ever take her class you will develop an appreciation for learning.",
        "course": "AAA367"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome class and teacher, not a class that you dread going to, not very often does she keep you the whole period, a very helpful professor, she is funny, and has a meal for her students in the last  class of the qtr!",
        "course": "AAAS367"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 2,
        "comment": "Terrific Professor! Extremely intelligent and helpful to her students. I was expecting this second writing course to be a bore, but she was hilarious and I learned a lot more than I expected to. I will hopefully be taking her again in the spring!",
        "course": "AAAS367"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 1,
        "comment": "She's an easy professor. Assignments are easy, and as long as you'll do them you'll get a good grade. She has a crazy sense of humor, which at times is funny, but at others is just plain abrasive.",
        "course": "AAAS367"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very intelligent, but is so funny and crazy that you can just never be bored.  There is homeowrk but it is really simple, she tells you exactly how to do it.  I am taking another class from her next quarter...oh and she gives alot of bonus points especially if you area good writer",
        "course": "AFAM254"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "Such a wonderful professor.  Dedicated and extremely knowledgable - not to mention hysterical.  I would absolutely reccomend a class with Dr. Newton and hope to take another, myself, in the near future.",
        "course": "AAAS254"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "One of my favorite professors as an undergraduate. Dr. Newton's classes can be challenging, but she rewards your hard work. I am now a graduate student, and Dr. Newton still remembers and acknowledges me when I see her.  She even wrote one of my recommendation letters for graduate application.",
        "course": "AFAM36704"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest professor ever",
        "course": "AFAMSTD36703"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "She has a CRAZY sense of humor but if you take her class and do all the work on time you should get an A (unless your're lazy).",
        "course": "AAAS36703"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy and fun class... Take it if you can!",
        "course": "AAS254"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "Viola Newton is hilarous. Never a dull moment in this class. And if u spean Patois (West Indian Dialect), youll laugh even more when she starts babbling. Only bad thing about it is the amount of dumb ass football players that take her courses. Love the lady tho!",
        "course": "AAAS"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "A wonderful teacher!!!",
        "course": "36703"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher lots of fun! She will rag on you if you act too cocky. I loved her.",
        "course": "AAAS"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "easiest professor on earth. class is fun to go to, assignments are easy. perfect class to help a sagging GPA. i would consider dropping out of college if you get below an A- in this class.",
        "course": "351"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "EASY A\r Just do the writing stuff (which is easy) and follow the schedule... She grades really good and helps get extra credit.\r Fun Person too...didnt mind going to her class at all.",
        "course": "36703"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "i had viola soph. yr for 367.03.  it was an awesome class and i did extremely well.  she challenged us all and was very effective.  she wants u to participate and understand the subject matter.  don't take it unless u r serious.  i will now have her next qtr. for another class;looking forward to it!",
        "course": "AAAS36703"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "I don't think that anyone got below a B+, and that's just because they didn't do their work.  This is the easiest class that I've ever taken.  It's a literature class for those that don't like to read that much and a writing class for those with poor writing skills.  Newton is hallarious!",
        "course": "AAAS36703"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 1,
        "comment": "Interesting lady...makes class enjoyable.  Easy class if you do the homeworks.  Easy grader.",
        "course": "AAAS254"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "great teacher--a little wild, but very cool and funny",
        "course": "AFMAMSTD"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 1,
        "comment": "Viola is a trip.  All you really have to do for this class is show up, but she'll probably make you participate a little, too.",
        "course": "AAAS254"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 3,
        "comment": "very funny, yet extremely effective teacher! I learned a great deal from her.",
        "course": "AAAS367"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "AAAS3670"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "African Studies",
    "firstName": "Hannah",
    "id": "VGVhY2hlci0yMTE2NDE4",
    "lastName": "Vidmar",
    "legacyId": 2116418,
    "numRatings": 2,
    "summary_comment": "Professor Vidmar is highly regarded for her exceptional teaching quality, with students consistently praising her passion and recommending her class. She is considered one of the best professors at Ohio State University.",
    "summary_comment_short": "Professor Vidmar is highly regarded for her excellent teaching quality and passion for the subject, making her one of the best professors at OSU. Students strongly recommend her General Education course.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "A really great GE to take. Hannah is a great professor and is really passionate about the class. Would definitely recommend!",
        "course": "AFAMAST1122"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors Ive had at OSU. Amazing, definitely take her.",
        "course": "AFAMAST3376"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.6,
    "department": "African Studies",
    "firstName": "Padmore",
    "id": "VGVhY2hlci03OTI5ODU=",
    "lastName": "Agbemebiese",
    "legacyId": 792985,
    "numRatings": 9,
    "summary_comment": "Professor Agbemebiese is known for his high standards and passionate teaching style, which commands attention. He strictly enforces attendance and expects students to be punctual and engaged, offering support to help students succeed. While some find his lectures confusing and the class structure unclear, others appreciate his fairness, ease of grading, and willingness to assist students.",
    "summary_comment_short": "Professor Agbemebiese is known for his strict attendance policy and passionate teaching style, which commands attention and respect from students. Despite some reports of confusion in class, many find him fair, approachable, and effective in helping students succeed with minimal homework and a few key assignments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Attendance is mandatory or you will fail he class. Overall, he is one of those teachers then when he speaks you listen. He is very pasionate about his work and I love him for it. There was not the many papers to write only 2 for us, but make sure you polish them up before you give it to him.",
        "course": "ENGLISH1010"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is one of the very few teachers that when he says something, you listen. He is very wise and just wants to see people pass his class. He is strict on attendance and atire (make sure you pants are pull up, when you are in his class). I found him to be fair and highly fun to be around.",
        "course": "ENG1010"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "He was pretty confusing and there was no real plan for the class.",
        "course": "AAAS251"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Really easy. Just be sure to not miss more than 2 days of class, or your grade will suffer. Participate in class discussions and you will be fine",
        "course": "AFAM100"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "This is by far the easiest professor i ever had through my undergrad education till now, i received an A by just simply doing the work and showing up for classes. We didn't have classes 4 times.There are only 3 papers to turn in throughout the quarter, thats's it.He is really nice, and i would strongly recommend that anyone wanting to get an A,take",
        "course": "AAAS251"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Padmore is a great guy and seems to always be willing to help out his students when he can. Class discussion is a must and if you don't participate he'll be sure to call on you anyway. Make sure you show up for class as he takes attendance very seriously. Just have fun and try and you should do well.",
        "course": "AAAS251"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "awesome......no work thru out.jus one final paper..jus take active part in class discussions and u'll ace the class",
        "course": "AAAST367"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "nice guy, hates slackers, but do ur best and he'll love you. often cancles class.",
        "course": "AFAMS101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "This guy is great! great sense of humor, really into what he's doing. he'll keep you entertained; i learned a lot from him. good at presenting different view point in life with a spoonfull of sugar. be aware that he may milk you for everything you have by dropping funny hints that you're not doing so well, when you actually are. do the assignments.",
        "course": "AFAM251ETC"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.8,
    "avgRating": 4.6,
    "department": "African Studies",
    "firstName": "Walter",
    "id": "VGVhY2hlci02Mjk2Mjc=",
    "lastName": "Rucker",
    "legacyId": 629627,
    "numRatings": 8,
    "summary_comment": "Professor Rucker is highly regarded for his clear and engaging lectures, making every class both challenging and interesting. Students find his courses demanding but rewarding, with many emphasizing the significant amount of learning and the importance of hard work. Overall, he is recommended by students as an excellent educator who pushes them to excel.",
    "summary_comment_short": "Professor Rucker is highly regarded for his clear and engaging lectures, making every class both challenging and fascinating. Students consistently praise his ability to impart significant knowledge, though they also note that his classes require substantial effort and are not easy A's.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Best professor I've had at UNC! He speaks with clarity and EVERY class is beyond interesting. It isnt an easy A class. You will have to work for it but you will learn a alot! I recommend taking his class. There is never a dull moment.",
        "course": "AFAM101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "very demanding, and at times  patronizing, yet an extremely good lecturer! one of the best professors I've had!",
        "course": "AAS332"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 5,
        "comment": "By far the best prof I've had at OSU - I learned more from him than any other. Class was challenging, interesting, and made you think. I highly recommend Dr. Rucker!",
        "course": "AAAS485"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Amazing class.  Challenging and difficult at times, but if you work hard you will do well. I learned a LOT from this proffessor and recommend him to anyone!",
        "course": "AAAS485"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "This guy is INCREDIBLY HARD. Don't take him for a GEC--you'll be getting more than you bargain for workwise. If you plan on going to grad school in history or Af am studies, he's your guy. I think luck is an important factor in doing well in his class. Here's hoping he curves.",
        "course": "AAS32302"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "AAS32302"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 5,
        "comment": "Very difficult class. Do not recommend unless you are not taking any other classes, the amount of work can be overwhelming at times. He is very knowlegeable however his (or rather his T.A.'s) grading is questionable.",
        "course": "AAAS101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Not your typical AAAS professor. If you want an easy A, don't take his class. You will definitely have to work. He expects you to come to class and do the readings. He's articulate and speaks with conviction. Every lecture was interesting. If you want to actually LEARN a lot, he's your man. Hard work, but it pays off. I loved his class!",
        "course": "AAAS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.8,
    "department": "African Studies",
    "firstName": "Emeka",
    "id": "VGVhY2hlci0yMDAxODI3",
    "lastName": "Aniagolu",
    "legacyId": 2001827,
    "numRatings": 3,
    "summary_comment": "Professor Aniagolu is known for his rigorous approach to teaching, requiring students to read extensively and write lengthy papers, often without clear guidance from the syllabus. While he expects a high level of engagement and effort, his assessments can be challenging, with quizzes based on minor details from the readings. Despite these demands, some students find him to be a competent and effective instructor.",
    "summary_comment_short": "Professor Aniagolu is known for his rigorous and demanding approach to teaching, requiring extensive reading and producing lengthy written assignments. While he expects a high level of engagement and effort from students, his assessments can be challenging, with questions often based on minor details from the readings.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "The reading material is not mentioned in the syllabus. You have to write 10 papers that are usually 12-15 pages long.  Start reading",
        "course": "AFAMAST2201"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "He puts questions on his quizzes about characters that are mentioned once in the book, for less than a paragraph. He is condescending about work habits as well as life habits. He will happily spend class lecturing you about attendance and then arrive 20-30 minutes late for the next class. ",
        "course": "AFAMAST2251"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "He's a great professor. You have to put forth your best effort though. Tons of reading and quizzes based off what you read. No homework but needs to attend class to pass.",
        "course": "AFAMAST2251"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.8,
    "department": "African Studies",
    "firstName": "Umbisa",
    "id": "VGVhY2hlci0xMDUwOTM4",
    "lastName": "Gusa",
    "legacyId": 1050938,
    "numRatings": 16,
    "summary_comment": "Professor Gusa is highly regarded for his effective teaching methods and engaging approach, making complex material accessible and enjoyable. Students consistently praise his attentiveness, willingness to help, and ability to connect with them personally, leading to positive academic outcomes and a fun learning environment.",
    "summary_comment_short": "Professor Gusa is highly regarded for his effective teaching methods, making complex concepts accessible and engaging. Students consistently praise his approachability, humor, and dedication to helping each student succeed.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mzee is the ish.  I learned alot & got a good grade. Can't go wrong taking him.",
        "course": "SWAH101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was dreading taking Swahili because I had already failed Spanish & I hate foreign language classes. However, Mzee is funny, attentive, and one of those rare professors who understands his class is not your only class. Ask him to say \"Bird\" or \"Word\", also. Participation is key, quizzes and exams are easy. Class is fast and fun. I love Mzee! :) ",
        "course": "1101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "He's great! I'm taking his class all the way through 1103! ",
        "course": "1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Gusa is by far the best professor I have ever had. I had previously struggled in other foreign languages. However, Professor Gusa is an excellent educator and went far and beyond to help me. He makes time for all of his students. I would highly recommend him to anyone. If you take his class you will definitely not have any regrets.",
        "course": "SWAHILI101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "The BEST teacher i have ever had!! Class was fairly easy if you paid attention and went to class. Gives a helping hand every step of the way",
        "course": "SWAHILI110110"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's my favorite professor I've ever had in college. He's extremely helpful, approachable, and absolutely hilarious. He makes class fun, and is one of the nicest people you'll ever meet. I highly recommend taking Swahili with him.",
        "course": "SWAHILI1101"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Mzee is an outstanding professor, and while he lacks in clarity due to his native 'culture' and way of understanding things, 99% of the time he gets his point across. BEWARE! Many football players take this class to get their foreign language credit because of it's easiness, and Mzee is a softie when it comes to classroom discipline.",
        "course": "SWAH102"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Mzee is fun and energetic. He loves getting to know his students and takes an interest in them as a person. He, unlike most, understands that your life does not focus around his class. He makes the language easy to learn and he makes you really want to learn the language. He is also a wonderful person with great morals. Bax juu- very good!!",
        "course": "SWAH102"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mzee is a fantastic teacher and treats you like a friend, not a stranger. Understands that school is not a lifestyle and makes time outside the class to make sure you are successful in the language. BEWARE! Because this language is considered easy, many football players and athletes enroll and make the class difficult for both you and mzee.",
        "course": "SWAH101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "GREAT!",
        "course": "AFR1"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mzee Umbisa is a quality instructor and he creates a fun and educational atmosphere.  He is excellent at modifying his teaching style based on the needs of the class and there is a lot of repetition to help learn Kiswahili.  This course is great for those aren't so found of learning a foreign language or want something different.",
        "course": "SWAH101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mzee is an awesome teacher, he makes Swahili fun and easy to learn. He is really nice and he makes class very fun and interesting. In his class you will really want to learn this language. I feel as if i have learned so much in this class. There is not much I can say about this teacher except that he is AWESOME!!!!!",
        "course": "SWAHI010"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely loved Mwalimu Umbisa. He's always happy to help at any time and makes the class enjoyable.",
        "course": "SWAHI101"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mwalimu Gusa is a truly inspiring individual and a great professor.",
        "course": "SWAHI104"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "One of the nicest teachers I've ever had!  Very interesting and entertaining.   He's awesome.",
        "course": "SWAHI101"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "SO NICE and very helpful.  Makes you sing and dance at the end of every class.",
        "course": "SWAHI101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.6,
    "department": "African Studies",
    "firstName": "Horace",
    "id": "VGVhY2hlci01NzA3Njg=",
    "lastName": "Newsum",
    "legacyId": 570768,
    "numRatings": 6,
    "summary_comment": "Professor Newsum is a passionate and knowledgeable instructor who encourages active participation in his discussions. He is highly committed to his students' learning and expects a significant level of engagement. While some find his classes challenging and his grading rigorous, many appreciate his enthusiasm and care for their development.",
    "summary_comment_short": "Professor Newsum is known for his passion and extensive knowledge, often leading to detailed discussions and challenging assignments. His teaching style is engaging but can be demanding, suitable for students who thrive in interactive and discussion-based environments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "He was once a English teacher, beware of grading. Be prepared to talk a lot in his class. If you are shy or quite, you might want to choose another professor. If you talk a lot and are really good at writing papers, then he's your guy. Great professor, loves to talk, I liked him.",
        "course": "AFAM254"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "This instructor makes a 200-level course way too difficult. He grades papers like an English professor and just generally makes the whole class experience more trouble than it's worth. He lectures over and over, for entire class periods at at time, about really simple concepts. There's too much reading for a 200-level class. Don't take this class.",
        "course": "AFAM254"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr.Newsum is an excellent teacher who is passionate about the subject and that his students actually learn something. I loved going to class everyday and enjoyed the discussion based format. He is very helpful but excpects 100% commitment from his all students. Take the class and all assignements seriously and  you will do VERY well in the class.",
        "course": "AAAS571"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Newsum is obviously extremely interested in teaching and knows his stuff. He is a very sweet, caring man who is genuinely interested in helping his students. If given the opportunity, take one of his classes. I've had him for 2 classes and I've greatly enjoyed both of them. He helped to make my senior year great. I'll miss him!",
        "course": "AFAM571"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "great prof. that truly enjoys what he is teaching.",
        "course": "AAAS375"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "not sure if he's around this quarter but class was very interesting! dealt with several controversial topics that need to be discussed outside of black studies(racism, stereotypes etc.). newsum is a very nice and knowledgable guy. likes people to speak up and don't skip class, he'll def notice.",
        "course": "AAAS571"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.8,
    "department": "African Studies",
    "firstName": "Abdirahim",
    "id": "VGVhY2hlci0xMTE2MTYy",
    "lastName": "Abdi",
    "legacyId": 1116162,
    "numRatings": 5,
    "summary_comment": "Professor Abdi is highly regarded as one of the best teachers at Ohio State University, known for his humor and laid-back teaching style. Students consistently praise his ability to make learning enjoyable while ensuring they gain significant knowledge, with exams reported to be relatively easy.",
    "summary_comment_short": "Professor Abdi is highly regarded for his exceptional teaching quality, being both humorous and relaxed in his approach. Students consistently praise his ability to make learning enjoyable while ensuring they gain significant knowledge, often resulting in easy exams and high grades.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "take what ever class he is teaching, he is the best teacher at osu. he is funny and laid back",
        "course": "SOMAL104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take any class he's teaching!!! Wonderful guy.",
        "course": "SOMAL103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "This teacher is extremly hilarious... and you'll learn alot....exams are very easy...if you want to boost your GPA, take this class",
        "course": "SOM104"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "I love this guy. I took Somali 102, 103, and 104 with him! He is very education and laid back. Easy A+",
        "course": "SOMAL104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very nice teacher.",
        "course": "SOMAL103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.9,
    "department": "African Studies",
    "firstName": "Maurice",
    "id": "VGVhY2hlci01MzM3MDM=",
    "lastName": "Shipley",
    "legacyId": 533703,
    "numRatings": 10,
    "summary_comment": "Professor Shipley generally receives high praise for his teaching effectiveness, though with some caveats. Students find his classes manageable with minimal required readings, often focusing on key themes rather than extensive texts. His exams can be challenging, particularly due to questions on minor details, but overall, students who attend class regularly and take thorough notes can perform well. However, his lectures can be disorganized and he frequently goes off-topic, which can make understanding his content difficult.",
    "summary_comment_short": "Professor Shipley offers a manageable workload with accessible textbooks and emphasizes in-class engagement over extensive preparation. His exams focus on lecture content rather than the textbook, making attendance crucial. Students find his classes challenging and disorganized, with some noting his tendency to go off-topic and speak quickly, which can be difficult to follow.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class doesn't require a ton of readings. Books are normally like 200+ pages, so no biggie.  Majority of books he chooses are on cliff notes or sparknotes, so being able to refresh yourself with the themes isn't too hard. Just pay attention and go to class and you will easily earn a B+ or A-.",
        "course": "AFAMS154"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "Text books in 201 are a waste of $, just take notes on everything he says.  Be prepared to just memorize any &quot;important term&quot; you can find in your notes for his exams, if you do that, and bs your way through his pre-assigned essays, you'll land in A range.  I found this class easy that way, most of the class struggled to prepare well for his exams.",
        "course": "AFAM201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 5,
        "comment": "This was the best instructor I had while at The Ohio State University. I was a Sophomore when I took his class and he challenged me to get an A and after that class I began to raise my GPA. I am a white female and I felt extremely comfortable in class. Everyone was willing to share thoughts with no judgments from anyone in class. Best class ever.",
        "course": "LIT315"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "The exams are difficult due to questions about small facts that occur only once in the book and have no plot significance. Good at finding deap meaning in texts, but also finds &quot;hidden meaning&quot; where there is none to be found. Claims he penalizes you for being late to class, but people are late every single day and nothing happens.",
        "course": "AAAS154"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "gets out of topic ALL THE TIME! he gives out essay question before exams which can be helpful. still...avoide this professor if you can...",
        "course": "AFAML154"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Avoid this professor if you can. He speaks very quickly and also has a stutter, so it can be impossible to understand him sometimes. He also tends to go off topic a lot, and doesn't teach his classes with any central theme; it's all very disorganized. You must go to class as the tests are only over his lectures and not the text.",
        "course": "AAAS201"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "He assigned interesting and quality reading. Tends to babble and you might have to get used to his stuttering. If you read and come to class, the tests can be easy, but he's very picky. Nice guy and willing to help if you seek him out.",
        "course": "AAAS154"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Not a bad teacher, come prepared to class and try not to miss many classes. Overall a fair professor.",
        "course": "AFAMAST"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 5,
        "comment": "Made the class very hard by asking useless facts on his tests.  Very hard to meet out of class and didnt respond to any emails.  Overall, i would recomend taking another teacher if you want to learn and get a solid grade.",
        "course": "254"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good teacher, very passoniate about the material, and makes you think about the material.  Is pretty helpful if you go to his office.  Does not respond to students emails, but says that he recieves them. (Kinda annoying).  Good teacher over all, but be ready to work hard.",
        "course": "AAAS154"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.8,
    "department": "African Studies",
    "firstName": "Ruthmarie",
    "id": "VGVhY2hlci0xMDU0MDY4",
    "lastName": "Mitsch",
    "legacyId": 1054068,
    "numRatings": 4,
    "summary_comment": "Professor Mitsch is highly regarded as a passionate and dedicated educator who ensures that her exam questions align closely with her lectures. While her classes can be lengthy and sometimes monotonous, students appreciate her thorough coverage of the material and her ability to learn their names quickly. Despite her challenging teaching style, she is described as a genuinely nice person deeply committed to her subject.",
    "summary_comment_short": "Professor Mitsch is a highly recommended and passionate educator known for her dedication to her subject matter and ability to learn students' names quickly. While her lectures can be lengthy and sometimes monotonous, the majority of her test material comes directly from class, making her classes manageable with consistent attendance.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "such a nice lady, great teacher, lectures can be long and boring but all of her test material comes straight from what she says during class. definitely recommend her!",
        "course": "AAAS251"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "A passionate, wonderful educator. Ohio State is lucky to have her.",
        "course": "AAAS251"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Mitsch is a very nice woman who is very passionate about the material, and learns the names of all of her students within the first couple weeks. Attendance is mandatory, but most of the tests come straight from what she says in class, rather than the books you read. Get on her good side and you should have an easy A!",
        "course": "AAAS251"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Forcing yourself to sit through one of her lectures makes you feel sorry for yourself. But when you think more about it, you begin to feel sorry for her. She is a bonafide candidate for a midlife visit to a mental institution yet can do nothing about it. To her credit, though, she is a nice woman who is sincerely interested in the subject matter.",
        "course": "AAAS251"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "African Studies",
    "firstName": "Linda",
    "id": "VGVhY2hlci01NjU0OTQ=",
    "lastName": "Myers",
    "legacyId": 565494,
    "numRatings": 1,
    "summary_comment": "Professor Myers is known for her extensive knowledge but lacks in structuring lectures coherently and providing clear expectations for assignments and exams. Students find her assignments vague and due dates inconsistent, often leading to confusion. Additionally, she is frequently late to class and grades subjectively, which contributes to an overall challenging learning experience.",
    "summary_comment_short": "Professor Myers possesses extensive knowledge but lacks a structured approach to teaching, leading to vague assignments, inconsistent grading, and frequent tardiness. Due dates and syllabus guidelines are often ignored, making it challenging for students to prepare effectively for tests and assessments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Myers is not your average professor, in a horrible way. Assignments are vague at best, due dates are never followed and she never adheres to the syllabi. She has a lot of knowledge but no coherent pattern of lecturing. There is no way to know what info she expects you to know for tests. Grades subjectively, always late for class.",
        "course": "AFAMA261"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.7,
    "department": "African Studies",
    "firstName": "Martin",
    "id": "VGVhY2hlci0xMjYwODk0",
    "lastName": "Shanguhyia",
    "legacyId": 1260894,
    "numRatings": 3,
    "summary_comment": "Professor Shanguhyia is highly regarded by some students for his approachable demeanor and comprehensive knowledge of African history, though others find his lectures dry and unengaging, with subpar TA support.",
    "summary_comment_short": "Professor Shanguhyia is highly regarded by some students for his approachable demeanor and comprehensive knowledge of African history, though others find his lectures dry and unengaging, with subpar teaching assistants.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "This professor was very dry and boring during lecture. His TA selection was HORRIBLE. I have never had a worse TA in my life.",
        "course": "AFAM122"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took Martin for African Studies 121, and am taking him again this quarter for 122. He's a lovely man and a great professor. No cumulative exams, he provides study guides for his exams, and all exam questions are objective. You won't mind showing up to class at all!",
        "course": "AFAM122"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love this man! He's so adorable and has the cutest Kenyan accent. He is a really good professor and he knows a lot about African history. I had him for 121 as well and I took him again because his class is very easy. He doesn't try to trick you and none of his tests are cumulative. Take him!",
        "course": "AFAM122"
      }
    ],
    "SEI": []
  }
]