[
  {
    "avgDifficulty": 2,
    "avgRating": 1,
    "department": "Agriculture",
    "firstName": "Grazyne",
    "lastName": "Tresoldi ",
    "legacyId": 3076760,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Tresoldi gives no flexibility for missing class, continuously says phrases that makes you want to zone out (eg., \"right?\" after EVERY sentence, saying \"OMG!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\" whenever she forgets an english word (it happens alot), and just reading off slides). I was gods strongest soldier showing up to nearly every lecture. Avoid!!!!"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.4,
    "department": "Agriculture",
    "firstName": "Cara",
    "lastName": "Lawson",
    "legacyId": 2936013,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Dr. Lawson is an incredible professor! I've had the privilege of taking two of her courses, and both were outstanding. Her passion for teaching and genuine care for her students set her apart. She is one of the most effective educators I've ever had, making every lesson engaging and meaningful. I truly appreciate her commitment to student success!"
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Dr. Lawson was great, I have taken two other courses with her and they were awesome! One of the best professors at Ohio State, she is passionate about what she is teaching about. Very friendly and understanding as long as there is communication."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "Dr. Lawson is an AMAZING professor! This trip was an amazing opportunity to learn more about the culture of the Dominican Republic. Dr. Lawson was keen on keeping us all safe in the foreign country and making sure we all had a good time! I would highly recommend taking a class with Dr. Lawson and making a connection with her!"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Went abroad to the D.R. with this professor and she publicly shamed a group of us who went to an already scheduled tour (cancelled cuz students got wasted) with our guide during our free time. We double checked with both professors before leaving and they said it was okay however when we got back she yelled at us in front of the class, trip ruined."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Would talk down to students and was very disrespectful on our trip. She would stay in the back of the group during tours and talk very loudly. There are a fair amount of homework assignments and they are pretty easy. My favorite part of this course was being in country. My least favorite was Dr.Lawson."
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Jason",
    "lastName": "Slot",
    "legacyId": 3073978,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Dr. Slot teaches with participation- your grade will be better if you speak up. I've taken three Mycology classes from him and would happily take another. You *will* learn the material. His exams require a lot of thought, but there's a week to take them. Great guy, very approachable. Knows his stuff. Definitely my favorite professor."
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.4,
    "department": "Agriculture",
    "firstName": "Paul",
    "lastName": "Heimmberger",
    "legacyId": 902018,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Very easy class and helps to get you more acquainted with the university and getting involved."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "He takes FOREVER to enter grades in and expects you to devote time outside of class to go to mandated activities. I'm all for getting involved on campus and all but I have a full time job and that made it impossible to do what he expects. Also, he doesn't seem to understand replying to emails. At least he basically goes over the final with you..."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "I felt that this professor was not very helpful, and ignored questions from students."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "He's very nice and helpful."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "This course had the potential to really help freshmen students but Paul failed miserably. Dr. Pfister would be much more suited to teach this course."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "I agree. Very boring."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Paul is the cheesiest man I've ever met in my life. His class is boring and pointless, but incomming freshman have to take it for agriculture. At least it's easy."
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.4,
    "department": "Agriculture",
    "firstName": "Paul",
    "id": "VGVhY2hlci05MDIwMTg=",
    "lastName": "Heimmberger",
    "legacyId": 902018,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very easy class and helps to get you more acquainted with the university and getting involved.",
        "course": "FAES100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "He takes FOREVER to enter grades in and expects you to devote time outside of class to go to mandated activities. I'm all for getting involved on campus and all but I have a full time job and that made it impossible to do what he expects. Also, he doesn't seem to understand replying to emails. At least he basically goes over the final with you...",
        "course": "FAES1500"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "I felt that this professor was not very helpful, and ignored questions from students.",
        "course": "FAES100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's very nice and helpful.",
        "course": "FAES100"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "This course had the potential to really help freshmen students but Paul failed miserably. Dr. Pfister would be much more suited to teach this course.",
        "course": "FAES100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I agree. Very boring.",
        "course": "FAES100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Paul is the cheesiest man I've ever met in my life. His class is boring and pointless, but incomming freshman have to take it for agriculture. At least it's easy.",
        "course": "FAES100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2.6,
    "department": "Agriculture",
    "firstName": "Pasha",
    "id": "VGVhY2hlci05MzI1MjY=",
    "lastName": "Lyvers-Peffer",
    "legacyId": 932526,
    "numRatings": 45,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst class I gave ever taken hands down\n",
        "course": "ANIMSCI2200"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "One of the worst professors that OSU has to offer. Extremely tough and nit-picky grader with an average of 50-60% on her exams, which are majority fill-in-the-blank. She expects students to memorize every detail and recite them. The study guides she provides do not help. There are little to no chances to bolster your grade outside of these exams. ",
        "course": "ANIMSCI3130"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "She lacks communication skills, and her teaching abilities are limited. Modules are extensive and will require a lot of reading. The grading system seems arbitrary, and if you request for an explanation regarding grades, you will likely encounter hostility. Avoid at all costs because she does not care if you pass or fail.",
        "course": "ANIMSCI3130"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "I currently have a B- in her class, and take the final soon. This was one of the worst professors I have had. For being 3 credit hours, she acts like it is 5. The exams are extremely content-heavy, and if you do not go to class you will miss the minutia. Not friendly or easy to contact. Take with another teacher if you can.",
        "course": "ANIMSCI3130"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful. Has me genuinely thinking about dropping out, moving across the country and never talking to anyone again. I don't even know what I'm reading half the time. Her lectures are disorganized and she goes on little tangents that don't make any sense. And notes are so disorganized and hard to look through. Good luck. I may drop out.",
        "course": "ANIMSCI3130"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was content heavy!!! All information is textbook modules with LOTS of reading. Also she grades super hard on the weekly discussion posts if your answer is not through. The assignments are super unclear and the TAs won't respond to your emails asking for help. ",
        "course": "ANIMSCI3130"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "N/a",
        "course": "ANMSC2200"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst",
        "course": "ANSCI220001"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Was quite possibly the hardest class I have ever taken. Figured since it was an intro class paired with my animal knowledge it wouldn't be terribly hard.. ya I was WRONG. Exams had practically the same amount of time as there were questions. When asked for help she replied &quot;Try and study harder&quot; STUDY WHAT!! She gave us weekly modules of 15+ slides",
        "course": "ANMSC2200"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Pasha cares but doesnt give much advice. You need to write a lot of detailed info to get 5 on discussion posts. Summarize and analyze discussion articles. Write every single word from her notes bc everything is free game on the exams. I used ctrl+F on my notes. Exams are open note but study and review quiz Qs and crossword Qs",
        "course": "ANSCI220001"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "I'll keep this short and sweet. If you need a GE credit and this class fits the criteria, just find another class. It is supposed to be an enjoyable class where you can get a good grade and learn about Animal Science. False. It was terrible. Got Cs and Ds on the exams and used the notes word for word. Just do not take this class. Seriously just don",
        "course": "ANSCI220001"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class was terrible. She was not very helpful at all for this class. The test question are extremely specific. The homework question are always unclear. She grades incredibly hard for the discussion posts that we have every week. Overall, this class is the worst online class I have ever taken! I will never take a class with this prof again.",
        "course": "ANIMSCI3130"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "The group chat is filled with complaining. Frustrating disaster. Materials are poorly organized, paragraph after paragraph. Sometimes the grammar is off. She asks about details that don't even matter, like &quot;WHO discovered what&quot;. You may pass with no understanding but just reciting; you may fail after spending TONS of time, effort, and patience.",
        "course": "ANIMSCI3130"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have ever had at Ohio State University. She is absolutely terrible and should never be teaching anything.",
        "course": "ANSCI2200"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "The reading is way too much for summer term!",
        "course": "ANSCI220001"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 4,
        "comment": "This was a 6 week online summer course. Not terrible considering the amount of information crammed into a small time frame. Exams aren't terrible and have a lot of the same questions from quizzes. You definitely have to work for the grade though. Take thorough notes. Honestly interesting content but hard for an intro GE course.",
        "course": "ANMSC2200"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took this class as a 6 week summer course, and I thought it was a ton of fun! Dr. Peffer definitely makes you put in the work in order to succeed, but if you are willing to take the time to read the lectures and study, everything in the class will be super easy! Exams are very reasonable and open-note. Overall, be willing to work hard to get an A",
        "course": "ANSCI220001"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 5,
        "comment": "This was such a hard class for an introductory level class. I took this class during the summer, so it was a full semesters worth of material crammed into 6 weeks, all online. The exams were all open note, and the quizzes were unlimited attempts which was nice. Exams are HARD. Know your stuff. She was overall a good prof, just a very hard class.",
        "course": "ANISC2000"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 5,
        "comment": "Class was ridiculously hard. Exams were so specific for an online class. She was accessible for help but there wasn't really anything she could do for you. Class is a lot of work but there is a good amount of busy work to help grade for bad test scores. Weekly discussions were annoying but make sure to do them to help you grade.",
        "course": "ANIMSCI2200"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "She talks very fast and expects attention to detail. Write everything she says down. Half of each exam is online and half is in person but she curves the exams. Read over your notes and ask the TA what you should know for the exam because she reuses material. Half a week of good studying should be enough for an exam. Take AS2100 first if you can!",
        "course": "ANMSC2200"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "I taught myself everything through the text book,  she was awful.",
        "course": "ANMSC2200"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "Attend every lecture, and be prepared to write. Lectures notes are majority based on what she says, mostly quoted directly from the book. She speaks at a quick pace, so pay attention. Reading the textbook will be most beneficial to absorb every little detail for the exams. Exams are very difficult, study hard. You'll need to WORK for a good grade. ",
        "course": "ANMSC2200"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very difficult tests. However, if you pay attention to her lectures, you will do well! Expect lectures to be packed with information. She is very knowledgable and it makes her class interesting. Take note of what she says about her family/personal life in her examples, shows up as extra credit on exams!",
        "course": "AS2200"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 4,
        "comment": "Purposely makes a separate slideshow of notes with blanks so you have no choice but to attend every lecture. Tests and quizzes cover the smallest details mentioned in lectures that seem completely unimportant. Forces you to buy her self-written textbook that is littered with misspellings and formatted horribly.",
        "course": "ANIMSCI2200.01"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Peffer is an extremely smart individual. Her class will be challenging, but you get out what you put into it.  Come up with a system that will work for you in retaining all of the information she gives - you WILL see it ALL on the tests. That being said, you will learn so much more. You will be more prepared than if taken with other professors!",
        "course": "ANIMSCI3130"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 4,
        "comment": "Do not take as a GE. Nice professor, but definitely not a class you want to take if you don't have to. To succeed, you need to listen to her every fact and statistic and hope you remember it all for the tests.",
        "course": "220001"
      },
      {
        "index": 27,
        "rating": 3,
        "difficulty": 4,
        "comment": "Really nice person but dear god the tests are a nightmare. Just ridiculously random material that you minimally cover in class. DO NOT SKIP and take extremely detailed notes in class.",
        "course": "220001"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "Decent as a person, kind of hellish as a professor. Her tests are ridiculously difficult and never actually what you expect. You'll learn a lot, but it'll be painful doing it, and don't expect too much help from her. Definitely take good notes, and write down every little thing she says. Do well on your quizzes so you don't drown in test grades.",
        "course": "2200H3130"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very nice as a prof and gives you LOTS of info about animal science.Make sure you write down everything shes says, not just whats on the slide. Review sessions were very helpful and Duane one of the TA's was always upbeat and willing to answer any questions. I recommend her if you want to learn animal science, but not for an easy A.",
        "course": "ANSCI220001"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 5,
        "comment": "Nice as a person, not so much as a teacher. She makes you memorize every little detail, fact, chart, statistic, of your notes. Take good notes, write down what she says, not what's just on the slide. Study in advance for exams, and go to her office hours.",
        "course": "ANSCI2200"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lyvers-Peffer is definitely one of my favorite professors. She makes you work hard to earn the grade. This is not an easy class for sure, but she pushes you and challenges you. She helped me with internships and gave me a lot of advice for the future. I highly recommend this professor, but not if you want an easy A.",
        "course": "ANISC2000"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 4,
        "comment": "I absolutely loved Dr. Peffer! Her lectures were very interesting, but do take VERY detailed notes. Don't take this class unless you're motivated and ready to work hard. You don't need to study every night, but like I said.. pay attention to the details!! Tests are not MC. Pretty good curve, getting an A or high B isn't difficult at all.",
        "course": "ANMSC2200"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 5,
        "comment": "Not very helpful. Covers WAY to much material and tests on the most random parts of it. All tests are mainly fill in the blank, and often don't make sense. Grades the tests extremely hard.",
        "course": "ANSCI2200"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor. I took her Intro to Animal Sciences in the honors level and I would definitely recommend her. Material is extensive, but not at all difficult. Coming to every class and asking questions will provide a great grade. She really cares about her students.",
        "course": "INTRO200H"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad! Too much work.  Take it in winter with Dr Day.",
        "course": "AS200"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Peffer is a wonderful professor! Her lectures are very clear, and she keeps your attention.  Although her tests can be hard, easy lab points can balance this out. I highly recommend her for this class.",
        "course": "ANSCI200"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Peffer is a very good professor. She does expect students to study and know the material but she is very clear on what you must know for the exams. Her labs are interesting and fun, and she is knowledgeable and helpful.I strongly recommed Dr. Peffer, you will learn alot from her.",
        "course": "AS200H"
      },
      {
        "index": 38,
        "rating": 1,
        "difficulty": 4,
        "comment": "This teacher is terrible.  It's a 200 level class and she grades tests and papers like it's ANSCI 600.  Waay too much information covered on tests, way too much detail required for 5 point questions.  And she will take off over half the points if she thinks you didn't put enough detail.  Obsessed with pigs.  Take Dr. Day!!!",
        "course": "ANSCI200"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor.  The workload isn't too much at all-- be reasonable, we're in college!  Dr. Peffer is a great lecturer, answers questions and is always very helpful and attentive to student needs.  I really enjoyed her class and would highly recommend her as a professor.",
        "course": "ANSCI200"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 5,
        "comment": "Seems very nice but her class is a little rough. Would definitely recommend taking winter quarter so you have Dr. Day who is REALLY easy. Her tests are pretty hard and the amount of info for an intro class is unacceptable.  Labs are interesting but-if you skip she will know & you WILL lose points and it will lower ur grade.",
        "course": "ANSCI200"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 5,
        "comment": "Yes, her tests are very hard, but she DOES say &quot;you need to know this&quot; or &quot;you do not need to know this&quot;.  Also, all the information I learned in that class, I have gone on to use in my other animal science classes.  I liked her a LOT and if you are willing to put in the work, you will do well :)",
        "course": "AS200"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 2,
        "comment": "Too much work for a 200 level course, but she's a pretty good teacher. I think she's more interested in her own research but took time to help me when I needed it. She also had some pretty interesting labs",
        "course": "ANSCI200"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 4,
        "comment": "Exams covered entirely too much information. Grading was very subjective, and I found it to be extremely unfair. Watch for participation points which will bring your final score down an entire letter grade if you do not participate in class. Overall, I really did not like this professor as a teacher for an introductory course.",
        "course": "ANSCI200"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 4,
        "comment": "Horrible professor. For a 200 level class, she overloaded you with work. Graded very poorly on the lab journals (didn't tell us what she wanted, then gave everyone poor grades on the first 3 labs) and overloaded you on the notes during class so you never knew what to study for the midterms/final",
        "course": "ANSCI200"
      },
      {
        "index": 45,
        "rating": 3,
        "difficulty": 3,
        "comment": "She overloads you with soooo much information that come exam time, it is very stressful. Her powerpoints are helpful, but sometimes they are not clear. She is always willing to help if someone gets confused and she adds extra points in so the grade isn't based entirely on the exams. She will memorize your name/face so don't even think about skippin",
        "course": "ANSCI200E"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 1,
    "department": "Agriculture",
    "firstName": "Grazyne",
    "id": "VGVhY2hlci0zMDc2NzYw",
    "lastName": "Tresoldi ",
    "legacyId": 3076760,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Tresoldi gives no flexibility for missing class, continuously says phrases that makes you want to zone out (eg., \"right?\" after EVERY sentence, saying \"OMG!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\" whenever she forgets an english word (it happens alot), and just reading off slides). I was gods strongest soldier showing up to nearly every lecture. Avoid!!!!",
        "course": "ANISCI-3180"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.4,
    "department": "Agriculture",
    "firstName": "Cara",
    "id": "VGVhY2hlci0yOTM2MDEz",
    "lastName": "Lawson",
    "legacyId": 2936013,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lawson is an incredible professor! I've had the privilege of taking two of her courses, and both were outstanding. Her passion for teaching and genuine care for her students set her apart. She is one of the most effective educators I've ever had, making every lesson engaging and meaningful. I truly appreciate her commitment to student success!",
        "course": "FAES3797"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lawson was great, I have taken two other courses with her and they were awesome! One of the best professors at Ohio State, she is passionate about what she is teaching about. Very friendly and understanding as long as there is communication. ",
        "course": "FAES3797"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lawson is an AMAZING professor! This trip was an amazing opportunity to learn more about the culture of the Dominican Republic. Dr. Lawson was keen on keeping us all safe in the foreign country and making sure we all had a good time! I would highly recommend taking a class with Dr. Lawson and making a connection with her!",
        "course": "FAES3797"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Went abroad to the D.R. with this professor and she publicly shamed a group of us who went to an already scheduled tour (cancelled cuz students got wasted) with our guide during our free time. We double checked with both professors before leaving and they said it was okay however when we got back she yelled at us in front of the class, trip ruined.",
        "course": "FAES3797"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "Would talk down to students and was very disrespectful on our trip. She would stay in the back of the group during tours and talk very loudly. There are a fair amount of homework assignments and they are pretty easy. My favorite part of this course was being in country. My least favorite was Dr.Lawson.",
        "course": "FAES3797"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Jason",
    "id": "VGVhY2hlci0zMDczOTc4",
    "lastName": "Slot",
    "legacyId": 3073978,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Slot teaches with participation- your grade will be better if you speak up. I've taken three Mycology classes from him and would happily take another. You *will* learn the material. His exams require a lot of thought, but there's a week to take them. Great guy, very approachable. Knows his stuff. Definitely my favorite professor.",
        "course": "PLNTPTH-5040"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 3.9,
    "department": "Agriculture",
    "firstName": "Francesca",
    "id": "VGVhY2hlci0yNjIzNTc0",
    "lastName": "Hand",
    "legacyId": 2623574,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I received a 93% (A) in this class. There is an opportunity for 2% bonus but I didn't need to use it. You will not do well on the exams or be able to do the extra credit if you don't attend class. This is the best class I have taken, really breaks down the topics to be simple and easy. I have used everything I learned in this class in other classes",
        "course": "PLNTPTH3001"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you want to pass her class, take her advice & study hard the first half of the semester. Like 3x harder than u normally would. If you do & you have an A+ later in the semester you're exempt from the last two exams! She made grading clear, this is just difficult content &  based on tests only so if you focus on doing well on those you'll be good!",
        "course": "PLNTPTH3001"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "Really difficult for an intro plant pathology class. You'd be well served by a good understanding of molecular bio&#8212;the professor is clearly passionate about the material but the lecture style and review sessions do not prepare you well for quizzes and exams making up the entirety of your grade. Exams are very challenging.",
        "course": "PLNTPTH3001"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Hand was very caring and passionate about what she taught. The only grades came from weekly quizzes and exams but if you attended lecture and studied the slides you will do well in the class. She always made sure the class understood the material before moving on. This was my first class in Plant Pathology and I ended up loving it thanks to her",
        "course": "PLNTPTH3001"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love Dr. Hand! She is an amazing professor who really cares for her students. She loves answering questions so don't be afraid to speak up in her class if you have questions. Yes, the tests may be difficult, but the content itself is difficult. Dr. Hand gives you all the resources you need to succeed, like review sessions and study guides.",
        "course": "PLNTPTH3001"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "Really difficult professor. Exams are typically on Mondays and there is no exam review. She will not be able to answer any questions on the Friday before an exam because she doesn't make the exam that far in advance and she will not reply to emails on weekends because it's her family time. Recordings of class are also not posted on carmen.",
        "course": "HCS3001"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "The class is way too content heavy per lecture and is hard to keep up with. There is no exam review or any sample problems so it is not clear what she expects for the exams which make them really hard to study for and she is also an extremely difficult grader. Dr. Hand seems very passionate but made the class way too difficult for most students.",
        "course": "PLNTPTH3001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Agriculture",
    "firstName": "Jera",
    "id": "VGVhY2hlci0yNDM5NTUz",
    "lastName": "Niewoehner-Green",
    "legacyId": 2439553,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. N-G is a great professor who is obviously very knowledgeable about the lecture topics. I was pleasantly surprised by the amount that I learned in the class and I believe that what I did learn will help me in the future. The class was very content heavy, with a midterm and final, but if you study based on the study guide, you will do well. ",
        "course": "COMLDR3530"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. NG is an amazing professor and person! The content can be slightly boring but she always comes up with ways to make it more interesting. Midterm was slightly difficult, but if you participate and go to class, you'll be fine.",
        "course": "COMLDR3530"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. N-G will give you everything you need to be successful in her course. Two exams that are open note and based on case studies. They are timed, so you should know the material well. Group project worth a lot. A lot of extra credit opportunities if you take advantage. 4-5 Papers worth 100 points. ",
        "course": "COMLDR3530"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Jera is a great teacher, but is very set in her ways. She has a very strict attendance policy which made my experience with her difficult. She finds new ways to make her classes fun, interactive, and interesting instead of boring and just sitting, listening to a lecture. She is a very candid educator but gets the job done.",
        "course": "COMLDR3530"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is, hands down, MY FAVORITE! She is very personal, caring, and fun. Her lectures are interesting. I've learned a great deal from her, even when the class is an easy A. Attendance is mandatory and there are a lot of reading quizzes. It's a very engaging class.",
        "course": "COMLDR3530"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great class and professor! There is a reading or two every week and you have to do them because there are reading quizzes before the lecture. Papers are written every few weeks. There are many extra credit opportunities as well.",
        "course": "COMLDR3530"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.8,
    "department": "Agriculture",
    "firstName": "Karl",
    "id": "VGVhY2hlci02NzEzMzM=",
    "lastName": "Danneberger",
    "legacyId": 671333,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took turf grass management with Karl.  He is my favorite professor and this class was my favorite class I've taken at OSU.",
        "course": "TURF"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class is really good...enough said. :)",
        "course": "HCS3475"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor is really good, the course is easy. The most important is the professor is always quick to reply to your messages.",
        "course": "HCS2270"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "prof is so nice!!! and this class is incredibly easy and you can complete it at your own pace. you have 13 quizzes and 10 packback posts, 20 packback responses and thats it. you watch videos for each module then take an exam, which you have 2 attempts for. very easy A and i thought the material was interesting :)",
        "course": "HCS3475"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Karl is really a great professor. It's an online class, but he does his best to communicate as much as possible throughout the semester. 12 modules with a 25 question quiz at the end (2 attempts). Each module takes about 1-2 hours to complete if you watch the videos. Packback questions and responses each module as well. Very easy A. Awesome guy!",
        "course": "HCS3475"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Karl is the best professor ever! If you email him he usually gets back to you within 3-5 minutes, which I wish all professors could do. Super easy class and a good GPA boost if you need it, I'm taking a second class of him right now and I can't wait. The videos may be a bit slow for some people but he's so adorable and an understanding professor!",
        "course": "HCS3475"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Such a great guy and wants everyone to succeed. Very good GPA booster and also learn some random interesting things.",
        "course": "HCS2270"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "The best thing about this class is that there are no due dates. Don't wait and have to do it all in 24 hours like I did though! There are 12 modules with a quiz (each took me about an hour) and a discussion question and 2 responses (short, 15 min total). Danneberger is so quirky and funny in his videos. Nothing is confusing; I would recommend!",
        "course": "HCS3475"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took HCS 2270 online with Dr. Danneberger and it is super easy! It is self-paced and it took me about 4 days to complete. All you have to do is take 8 module quizzes and write 1 question per module and answer 2 questions per module (written by other students) through Packback! 100% recommend this course if you need a GPA booster!!",
        "course": "HCS2270"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "easiest A at osu.",
        "course": "HCS3475"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took this class as a maymester class and was able to complete the class in a total of probably five hours online. Watch the lecture videos, take the simple quizzes, receive an A. The course also offers easy extra credit that takes little to no time at all. Amazing GPA booster for maymester and you don't even have to be on campus to take it. ",
        "course": "HCS2270"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "this is an awesome GPA booster class. it was one day a week and attendence is worth 33% of your grade. you also have small simple assignments and online quizzes which he allows you to take 3 times a piece. he is all about giving A's. just do your work and its an awesome and pretty interesting class.",
        "course": "HCS270"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Karl is a great teacher. He has a personality that makes class a blast. But, more importantly he really knows what he is doing. Take full advantage of his knowledge. I would highly recommend this class for anyone that is really into the golf industry. All in all a great teacher.",
        "course": "HCS270"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Has the driest sense of humor and is just a cool guy.  Great stories and good laughs. He's a must take professor.",
        "course": "HCS270"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. D is the bomb.",
        "course": "TURF"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "This guy is funny as hell, register for any of his classes if you love it when the professor gets sidetracked with random stories that don't necessarily have anything to do with the subject.",
        "course": "HCS570"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yOTg5Nzk5",
    "lastName": "Raison",
    "legacyId": 2989799,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He took us on a tour of THE ohio stadium. Class was awesome. Really an awesome professor.",
        "course": "step"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "Agriculture",
    "firstName": "Joy",
    "id": "VGVhY2hlci0yOTIwMzQ5",
    "lastName": "Rumble",
    "legacyId": 2920349,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "I had to take this course. It was a terrible class. Avoid if you can, you won't learn anything new. Dr. Rumble was also just not a good professor in general and lacked real life experience. I got an A, with minimal effort due to the low-level material in the class. ",
        "course": "ACEL7700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4,
    "department": "Agriculture",
    "firstName": "Scott",
    "id": "VGVhY2hlci0yNDgzNzYy",
    "lastName": "Scheer",
    "legacyId": 2483762,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "This class was very easy. You do not need to watch any lectures or do the readings to get an A. You probably will not learn anything. Almost all the readings are outdated from the 70's, so my suggestion is to use Youtube or google searchs. He is a nice guy. ",
        "course": "ACEL7520"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best professor I have had at OSU. He is so caring and I very much enjoyed going to his classes.",
        "course": "COMLDR5350"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Scheer is truly one of the most kind and compassionate professors at Ohio State. He wants his students to not only succeed, but be good professionals. His classes are like any others - lectures, readings, papers, etc. His classes aren't hard at all and he's always willing to meet with students to help them out. Great guy!",
        "course": "COMLDR3330"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mr. Scheer has probably been one of my favorite professors I have ever had. His lectures aren't overly entertaining, but he truly cares about the students and wants them to succeed. I wish I could take more classes with him, highly recommend!",
        "course": "COMLDR5350"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "I feel like this class is a recap of all other courses required for the youth development minor. That made this extremely easy. You do not have to do the readings. There is a reflection every class. You get out early every time. The lectures are rather boring, BUT, Dr. Scheer is very nice and really cares about the students!",
        "course": "COMLDR5350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Agriculture",
    "firstName": "Mary",
    "id": "VGVhY2hlci0yNTQ2NTc0",
    "lastName": "Rodriguez",
    "legacyId": 2546574,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's so nice + genuinely cares about her students, she makes you WANT to learn and go to class. Most assignments require a lot of writing, but they are mainly reflection based. She is slow with grading and made a few mistakes in grading I had to point out bc they affected my grade by a whole sign (eg A to A-). Attendance mandatory. ",
        "course": "COMLDR3535"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good class. Cares a lot and gives us the opportunity to participate in hands on activities, making an open ended class engaging and fun. Material is interesting and applicable to anyone. Highly recommend. Only real catch is how sometimes the grading can be subjective and you loose points with only vague explanations if any at all.",
        "course": "COMLDR3535"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Only one lecture a week so its not a lot of in person stuff. She makes sure to give us a break because she knows how long the class is and makes sure we are all comfortable and can take a break whenever we feel is needed due to heavy subject matter.",
        "course": "COMLDR3535"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "(Teaching in non-formal environments) - not as many quizzes and etc, you create a lesson plan and then go teach youth what you prepared, and then you create a fun campus tour and teach your classmates about it. Mary is nice, truly cares about the students, teaching, and the topic. One of the better classes, assignments just take time to create.",
        "course": "COMLDR5330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Denise",
    "id": "VGVhY2hlci0yMzI5Mjc2",
    "lastName": "Kestner",
    "legacyId": 2329276,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Denise is hands down the best prof I've had in the AEDE department at OSU. She genuinely cares about the professional development of her students not just about teaching the class. 10/10 recommend for any ag student. ",
        "course": "AEDECON3101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Show up and pass. So so so easy, plus Denise is a great professor.",
        "course": "AEDECON3101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.9,
    "department": "Agriculture",
    "firstName": "David",
    "id": "VGVhY2hlci05Mzg3ODY=",
    "lastName": "Gardner",
    "legacyId": 938786,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a fun and easy class to take with Dr. Gardner. He explains the material very well and since the lectures were online, nothing can be missed. Tests are a little difficult because there's a lot of content to cover and require good retention of information, but the homework is a breeze and actually quite fun to do since you go outside.",
        "course": "HCS3220"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Gardner was very accommodating and understanding throughout the semester. Although I am not the best at stats, he was always willing to answer my questions. He takes time to make sure his students truly understand a tough subject. His grading is also flexible.",
        "course": "HCS2260"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Gardner was okay but the lectures were a bit confusing and tedious. He was not very lenient on the grading and the class was just difficult for no reason. He says that the textbook is optional but I highly recommend getting it and working through all the problems in order to get an A in the class since his lectures alone won't help. ",
        "course": "HCS2260"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "I have taken other stats classes in the past with no problems. He expects you to do it all by hand, not with calculator functions, and it is extremely difficult and confusing. The examples are not helpful and lectures are not very in-depth. The class is NOT horticulture or crop science related at all, just an unnecessarily hard stats class.",
        "course": "HCS2260"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "I am not a fan at all. He uploads lectures beforehand and also unloads zoom lectures, but they are identical and he reads directly off the slides. Examples often are confusing and he does not elaborate. I passed my other stats class with flying colors but this class just complicates everything. He also doesn't offer much in bonus points.",
        "course": "HCS2260"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have long struggled with anything math-related (and this is a statistics course). Dr. Gardner was very helpful, cares about students, provides excellent one-on-one feedback, and genuinely cares about your success. I am so very grateful for him helping me be successful in this course. He really went out of his way to help me. ",
        "course": "HCS2260"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Let me just preface this by saying that i've struggled with a math learning disability for the last 10 years and I still was able to get a B in Dr. Gardners class. You'll easily pass as long as you complete all of the homework (I barely had a C average on exams). Seriously, take this class if you can! He genuinely wants you to pass the class.",
        "course": "HCS2260"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Willing and able to help. Clear goals and fair grading. Tests are tough, but not unreasonable. Highly recommend attending review days. Extra credit available. Highly recommend book for extra material to study. Combined with Annotated teacher's copy or online resources, it's a grade saver. Would take again. Would recommend for statistics.",
        "course": "HCS2260"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "I'd like to preface this review by saying that i'm terrible at math. So when I enrolled in HCS statistics, I had some reservations. However, those reservations completely disappeared as the semester progressed because Dr. Gardner not only made the class easy(I ended up with an A) but moderately enjoyable as well. I highly recommend him.",
        "course": "HCS2260"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great teacher. He is very intelligent and knows the material very well. He is clear and lets you know what is filler and what is important. His tests are hard mostly essay questions which require alot of thought. If you work hard and go to class you should be able to do reasonable well. Must go to class though. Would recommend him to other students",
        "course": "HCS470"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Identification of landscape plants. Awesome! Really cool guy who drinks WAY too much coffee, lol!!! He really made it fun.",
        "course": "HCS234"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "Good prof.  Definately knows his stuff.  However, if you are not familar with the information it can be tough.  Helps to have worked on a golf course.  Tests are kinda tough but he curves a lot.  Should be able to get at least a B wtihout too much extra effort.  Lab was pointless at times but I did learn a lot about grasses.",
        "course": "HCS470"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.5,
    "department": "Agriculture",
    "firstName": "Stephen",
    "id": "VGVhY2hlci02NTk4MTQ=",
    "lastName": "Boyles",
    "legacyId": 659814,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Boyles had to pick up this class at the last minute, but overall did a good job. Super chill professor, and the course load is insanely easy. Only gripe with him is if you miss class because you're sick, you HAVE to have a doctors note. Not really achievable when you suffer from chronic migraines. Still happy to have him as my prof. though!",
        "course": "ANISCI2367"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easiest college capstone in CFAES. Graduating senior? Take it. Dr. Boyles is funny albeit rather awkward. Show up to class exercises, put in the effort for the 2 papers, and study for the 2 exams. You'll do fine. ",
        "course": "ANSCI4597"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very fair grader on the 2 papers you have to type, quizzes with 5 questions every week which are directly from the lecture notes which he gives you. Midterm and final was a little rough, aside from that he's a real cool guy and even if you don't have an interest in the class he does well to keep you entertained....recommend!",
        "course": "ANMSC2"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nice guy.  Very helpful and interested in teaching.",
        "course": "ANSC597"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class, great teacher!  Really cares about students and the subject.  Very interesting class.  It will really change your view of animals and the modern meat industry.",
        "course": "ANISC597"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "awesome teacher, very easy class. two very short papers, midterm and final with 33 questions each. i learned so much about animal issues in this class and wish i could take it again.",
        "course": "ANSCI597"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great teacher... really loves what he does.  The class is pretty easy if you go to class everyday, although he does post the lectures online.  I definitely learned a lot in this class, though!",
        "course": "ANSCI597"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Class wasn't hard except the midterm and final were only 30 multiple choice questions so you have to cram half a quarter into those 30 questions... All the other assignments are pretty simple.  He was nice, overly excited perhaps.  Definitely less work than other 597s",
        "course": "ANSCI597"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class last summer, but I liked it so much that when I finally got an account on ratemyprofessors I wanted to say something about the class.It's an awesome class, not because people may think it's easy, because you do have to read your book, come to class, and do the assignments, but this guy makes it interesting. I learned a lot.Thanks",
        "course": "ANISC597"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great class- all the lecture notes are posted online, the tests are very detailed from book and notes.  Good guest lecturers. He makes the class fun, there are points for attendence.  A little effort will get an A.  Picked a cheap textbook too!",
        "course": "ANSCI597"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's awesome. Very enthusiastic and enjoys what he's doing. He loves interacting with the students and actually gets to know everyone's name in the class which is pretty amazing because the class I was in had about 200 people in it.",
        "course": "AS597"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Boyles is a great teacher for Animal Science 597. He enjoys teaching the class and has the students participate. Makes the class very interesting and fun to attend. Very laid back. Nice guy.",
        "course": "ANISCI597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.3,
    "department": "Agriculture",
    "firstName": "Dave",
    "id": "VGVhY2hlci0yNDI2NzU=",
    "lastName": "Barker",
    "legacyId": 242675,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Barker's class is very relaxed and easygoing. However, his lectures are a bit difficult to pay attention to since you get a lot of materials that seem unrelated. The tests are kind of difficult but the labs are easy.",
        "course": "HCS2201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. The labs are super easy and the professor really wants the students to learn so he answers all the questions in depth and gives answers. He also really loves his job and is interesting to talk to. A little older so he talks kinda slow but he's a great person and teacher and cares. would take again.",
        "course": "HCS2201"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lecture's are very dry and not interesting. Attendance was not mandatory for lecture. Lab was lead by TA's and were fine, mandatory attendance for lab. If you took the midterm you didn't have to take the final. No one showed up after the midterm. Still an interesting class, professor cares about students and teaching. Just kind of boring",
        "course": "HCS2201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Barker is willing to help you outside of class.  All of the notes are available online, but going to class helps one remember the material better.  He is very personable and likes to tell stories of his travels.",
        "course": "HCS2201"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Barker's class, though often boring, was made a bit more interesting by his humor and occasional jokes. The class is a good general overview of agriculture, and Dr. Barker was always willing to answer questions and emails. All of his lecture slides (which he just reads in class) are posted online, so going to lecture is pretty much optional. ",
        "course": "HCS2201"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Be sure to do the practice tests, the actual exams are almost the same! He is a really great professor-- funny and respectable. ",
        "course": "HCS2201"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Barker is a great professor and has an easy class. ",
        "course": "HCS2201"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Barker is provides a lot for students but can sometimes go off on tangets. It is easy to zone out in class but the information is all on his webpage.",
        "course": "HCS2201"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Barker is an awesome professor! He is really funny, but he does get his facts mixed up sometimes. He does not know that much about ornamental plants but he'll be more than happy to talk your ear off about forage crops. He reads off of his online pdfs so you don't really have to go to class.",
        "course": "HCS2201"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Barker is an excellent instructor. He is extremely well organized, fantastically knowledgeable, does a great job of conveying the material and writes fair exams and assignments. His lectures can get a bit boring at times because he has a tendency to read directly from the slides but it's not unbearable.",
        "course": "HCS2201"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 5,
        "comment": "He allows you to use a cheat sheet with the exams,but is very picky about giving full credit for the answers.",
        "course": "AEE402"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 1,
        "comment": "I took this class online but we did meet with Barker once a week.  I felt that the classtime was useless and did not support the lectures.  If you're not familar with agriculture expect the B range because the exams require a general understanding of Ag. which the lectures don't help with.  Overall an easy A for anyone who is from a farm.",
        "course": "HCS200C"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is good.  If you miss class, you miss learning.  I enjoyed HCS 612, and use that material in my current work.  Thanks!",
        "course": "HCS612"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Interesting class.  He's a great teacher.",
        "course": "HCS612"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "A very good teacher, modest and helpful",
        "course": "HCS6XX"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took the course during the summer - 1st term.  I think it would have been easier/less work if I had taken the regular 12-week class.  However, Dr. Barker is really nice and helpful and cares about the students.  He has a great New Zealand accent too, but he is really easy to understand.",
        "course": "HCS200"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "HCS412"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Chris",
    "id": "VGVhY2hlci0yMjE4OTA1",
    "lastName": "Williams",
    "legacyId": 2218905,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite classes I have taken at OSU. Everything he teaches prepares you for a future in sales. ",
        "course": "AEDECON3121"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best professor Ive ever had. He relates everything in class back to real life. I wish he taught more classes at OSU. He allows for real world networking that helps students immensely. If you show up you are guaranteed an A.",
        "course": "AEDECON3121"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was an Agriculture Sales class as his first semester teaching it.  Was really interesting and enjoyed the class greatly.  He really cared about the students and tried to help us out in class and life in general.",
        "course": "AEDECON3121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 1.4,
    "department": "Agriculture",
    "firstName": "Mario",
    "id": "VGVhY2hlci0xMDMyMDY5",
    "lastName": "Miranda",
    "legacyId": 1032069,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "He sits in a chair the whole class facing away from the students just reading off slides. You will not be able to hear him and he can't hear you as well. Gets mad when he can't hear you but does not care if you can't hear him. Tells you to just talk to his TA he will not meet on zoom. Overall just a lack of caring for students. AWFUL!",
        "course": "AEDE3000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I've ever had. Bullies students and makes you feel stupid if you don't know an answer right away. Exams and problem sets are extremely difficult, and he is not helpful if you need help. Often has things written down wrong and does not show work. I would recommend avoiding him because I didn't get a thing out of his class.",
        "course": "AEDE3000"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "He reads off slides, doesnt show work&amp; hes rude. Worst Professor Ive ever had. Doesnt show up for office hours, makes you feel like an idiot for not knowing the answers or asking questions, grades are weighted 65% by 2 exams midterm&amp;final, rest is 6 hw sets that are HARD. Ended up getting a tutor. Would never take another course with him again.",
        "course": "AEDECON3000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely horrible. Reads off of powerpoints but calls on people in class. If you get it wrong he basically says you are stupid. Doesnt even have office hours, and the poor TA tries to help as much as he can. It is clear he doesnt like him either. The final is worth 55% of your grade and the homeworks are impossible to figure out.",
        "course": "AEDE4002"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very dry method of teaching Has a very high ego. He is never and never in his office to assist students even during his listed office hours. I don't understand how the department let him get away with it. Typical to miss his appointments. He make too many mistakes in the class because he is hardly and poorly prepares for his class.",
        "course": "AEDE7110"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very clear. Funny.",
        "course": "AEDE712"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Ian",
    "id": "VGVhY2hlci0xODQ1NzEw",
    "lastName": "Sheldon",
    "legacyId": 1845710,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Sheldon has a great sense of humor and knows how to strike a balance between seriousness and lightheartedness, while still packing in a lot of information. Really cares about helping students understand the material. Also threw in extra credit for those who frequently attended and participated. The man is an absolute riot in the best way.",
        "course": "INTSDS4540"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Sheldon is the best professor I've had at OSU. He explains everything very well and has a lot of experience and interesting stories that tie into the course subject which makes it genuinely interesting. Great guy, loves to joke around and talk about soccer. If you come to class and put in a little effort in you will learn a lot and get an A",
        "course": "INTSDS4540"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Sheldon is an amazing professor who is extremely knowledgable and passionate about the information he teaches. He spends a lot of time explaining the material but also moves through lectures efficiently. The material is inherently tough to understand, but Dr. Sheldon welcomes questions and also is very accessible outside of class!",
        "course": "INTSDS4540"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Sheldon was one of my favorite professors. He was funny and engaging, but he also worked to make sure we understood the material.",
        "course": "AEDE4003"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's one of the best professors I have had at tOSU.  He is very thorough in all of his lectures, and is hilarious the whole way through.  Some of the concepts in his class can be thought of as dry and difficult at times, but he does a great job at explaining everything and making sure the class understands.  I actually looked forward to his class.",
        "course": "AEDE4003"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr. Sheldon was one of my favorite teachers I've had at OSU. Although economics can be very dry Mr. Sheldon explains things in a manner that everyone can easily understand and he does this by way of a nice British accent. He adds a lot of genuine personality and humor to all of his lectures. One of the most relatable teachers I've ever had. A**!",
        "course": "AEDECON4540"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wonderful professor. He will do just about anything to get you an A in the course. He dropped one of our exam grades, gave tons of extra credit, and always has bonus questions. If you show up to class and pay attention you will do fine. No book and he prints off all of the lecture slides. He is also British and has a good sense of humor. Good class",
        "course": "INTSDS4540"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Sheldon is one of the best economics teachers you could ever ask to have. He teaches his information and excessively reviews it during class  periods to ensure that the students understand each and every concept. He takes his time, and does not rush through material. I highly recommend taking his 4003 & 4597 (International Trade) class.",
        "course": "AEDE4003"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prior to taking this class I was seriously considering changing my major. Dr. Sheldon taught me that economics doesn't have to be difficult. Plus, what's not to love about a hilarious Englishman? I highly, highly recommend taking Dr. Sheldon at some point during your college career. You won't regret it!",
        "course": "AEDE4003"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Alexander",
    "id": "VGVhY2hlci0yMjc0NjI2",
    "lastName": "Lindsey",
    "legacyId": 2274626,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is really good. Knows what he is talking about",
        "course": "HCS3420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.7,
    "department": "Agriculture",
    "firstName": "Monica",
    "id": "VGVhY2hlci0yNDIxMDA0",
    "lastName": "Lewandowski",
    "legacyId": 2421004,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved Dr. Lewandowski. I took this class as a GE and knew nothing about agriculture going into it, but her lectures are broken up into small parts and are fun and very digestible. Mostly short assignments and quizzes with unlimited chances, but a few essays and one long term paper at the end of the semester, as well as one midterm and a final.",
        "course": "PLNTPTH4597"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lewandowski is the best online professor I've had in my four years of college. She is very thorough and if you ever have any issues, whether it be computer related, questions on homework, or an emergency health issue, she is very understanding. She also explains why you loose points on your homework (very few do this)!",
        "course": "PLNTPTH4597"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Monica definitely loves her job and focus, but knowing a subject does not immediately qualify you to teach the subject. The work load is not proportionate throughout the semester. The related readings structure the bulk assignments, but do not apply on quizzes. The entire carmen page is formatted in a way that is clunky and hard to understand.",
        "course": "PLNTPTH4597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 2.9,
    "department": "Agriculture",
    "firstName": "Robert",
    "id": "VGVhY2hlci03MDU1MTY=",
    "lastName": "Agunga",
    "legacyId": 705516,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Although Professor Agunga's very sweet and always has positive energy, I really didn't feel that I learned anything in this class. The assignments we were graded on were easy enough to get an A as long as you put in effort, but they felt kind of pointless since they were essentially summaries of our reading assignments.",
        "course": "ARTS1137"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Agunga is a horrible professor, this class offered absolutely no extra value to my academics. I feel as though the class was a waste of time. Not worth the time or money, DO NOT take it unless you have to.",
        "course": "AGRCOMM5150"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "He's really a happy and chatty guy but he never remember what he said. Both TAs and the professor are lazy that they never return  some our assignments back. What the worst is that they even made grading error on our final grade!!!",
        "course": "AGCOM2367"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "not an easy class. TA and him know very little when I ask question. professor is a happy guy and will brings food to class?but his assignment is pointless.",
        "course": "AGCOM2367"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Really a bad pro, he is so bad at teaching, and all the assignments are pointless. To be honest, I dont think getting A is easy. and most of my friends get B. He is the worst pro I have ever know",
        "course": "AGRCO2367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interested in the success of his student. Very energetic and generous guy, would bring coffee and donuts in!  Passionate and knowledgeable about his work.",
        "course": "FRESHSEM"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "He is a very happy and chatty guy, but one of the worst teachers i have ever had. He lectures and notes are worthless and incomprehensible. His assignments are pointless and what little subject matter he covers is no where related to the course description. If you ask a question that contradicts his view, he gets very short with you.",
        "course": "AGCOM367"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 1,
        "comment": "Easy class, but not a particularly interesting one.",
        "course": "AG367"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy GPA booster and fufills 2nd year writing course.",
        "course": "AGCOM367"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 1,
        "comment": "disorganized. easy prof, but dont expect to learn much. more concerned about logistical details than about content of the course",
        "course": "ARTS137"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "a really interesting seminar very helpful",
        "course": "ARTSC136"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr. Agunga is without a doubt one of the nicest people you will ever meet.  He's a bit disorganized, but the class is a lot of fun and very easy.  The group project may seem a bit overwhelming, but as long as you break it down and take it step by step, you'll be fine.  In a world of cold, distant professors, Agunga is a breath of fresh air.",
        "course": "AGCOM367"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very little reading compared to other 2nd writing courses and largest assignment is a 4 page paper.  Attendance is mandatory, however.  But is an easy A.",
        "course": "AGR367"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very cool teacher, goofy guy who always brings snacks to class and makes all feel welcome. Easy assignments, as long as you attend class its a guarantee A...",
        "course": "AGR367"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "I didn't like this class too much while i was in it, but afterwards i realized that it was a good one. He's a pretty goofy guy, but overall a good class that was pretty easy if you went to class and did the work.",
        "course": "AGCOM367"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very helpful and knowledgable. He tries to work with you in every way possible. He has great contacts and is very helpful if you want to do anything that relates to international topics.",
        "course": "ADVISOR"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 1,
        "comment": "Prof. Agunga is a real fun guy.  His philosophy is everyone is an A student and if you turn in everything he asks for then you receive an A.  MT and Final are easy and all other assignments (solo and group) do not require much effort.  Highly recommended!",
        "course": "AGCOMM367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Jeff",
    "id": "VGVhY2hlci0yNzU2MDI1",
    "lastName": "King",
    "legacyId": 2756025,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Jeff King is a wonderful professor, although his lectures can be somewhat boring. If you have questions, he tries his best to answer them and relates course content to real life scenarios. Jeff has a lot of life experience and is always willing to share that with students. I appreciated his courses so much as an undergrad!",
        "course": "COMLDR5430"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Alyssa",
    "id": "VGVhY2hlci0yNjU1MDcy",
    "lastName": "Rockers",
    "legacyId": 2655072,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fun class, very interesting class wonderful attitude and very helpful when needed!",
        "course": "AGRCOMM5530"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Agriculture",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0yNzUxNzI2",
    "lastName": "Griffin",
    "legacyId": 2751726,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Matt is great! I wish he taught more classes.",
        "course": "AEDECON1200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4,
    "department": "Agriculture",
    "firstName": "Mike",
    "id": "VGVhY2hlci04MDI5MjM=",
    "lastName": "Rowan",
    "legacyId": 802923,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Surveying labs were fun and enjoyable. Material is pretty straight forward. Overall, really fun class.",
        "course": "ASM2371"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "A fine professor, explains topics okay. Hard to contact outside of class, does not seem to respond to emails.",
        "course": "FABENG2710"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wonderful professor!",
        "course": "FABE5410"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Never responds to emails. Exams barely reflect material from homework. Has a cool beard though.",
        "course": "FABE3510"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "We only had one midterm. As long as you show up to get class, you basically get points for being there. He is really easy to talk to and really helps. Also you will normally get out of lab early.",
        "course": "FABENG2710"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is extremely helpful.",
        "course": "FABE225"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was really easy.  Rowan didn't care about this class though.  He didn't seem to know what he was talking about most of the time.  Just make sure to copy every single equation on your equation sheet.",
        "course": "FABE225"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very nice guy, willing to help you",
        "course": "FABE225"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Teaches right from the book in class. I can do that too,  I guess that makes me equally qualified for the job compared to a Ph.D. What the hell are we paying him for&#63;&#63;",
        "course": "ASM310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.8,
    "department": "Agriculture",
    "firstName": "Annie",
    "id": "VGVhY2hlci0yMzk0ODgx",
    "lastName": "Specht",
    "legacyId": 2394881,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "The synchronous lectures were non-mandatory Q+A/lab sessions for the weekly projects, and then she included recorded lectures going over how to do those assignments, each around 10 minutes. Very easy class, but I ended up learning quite a bit about graphic design and deeply enjoyed it.",
        "course": "AGRCOMM4130"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Specht is amazing! She is such a great instructor. She is always there to help and this course is so well designed. If you put in the effort, you will learn so many great skills and get a good grade. She also gives great advice and tips for assignments, not to mention she throws a good joke in or two.",
        "course": "AGCOMM4130"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Specht is a wonderful professor! She gives great feedback and is always willing to help you with assignments or general questions. Very accessible outside of class and responds to emails very quickly. Would highly recommend!",
        "course": "AGRCOMM4130"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Spect is super caring! The class is also pretty easy. She is able to teach adobe creative cloud to a class of people that are starting at ground zero to advanced. There isn't any homework, as all of it can be completed in class and/or on work days.",
        "course": "AGRCOMM4130"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "This professor truly cares for her students. She is a fair grader and has reasonable expectations. I felt challenged in a good way and learned a lot, but it wasn't too much for me to handle. Would definitely recommend this professor and this class.",
        "course": "AEE8100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 1.9,
    "department": "Agriculture",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0yMDk1MDk4",
    "lastName": "Briggs",
    "legacyId": 2095098,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "All the assignments were easy, but sometimes time consuming. She posted recorded lectures that taught you step by step how to do the assignments. The midterm project took about 30 hours to complete, but was fairly easy content wise. Go to office hours and she will either give you the answers or tell you exactly what you did wrong.",
        "course": "AEDE2015"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely terrible experience. Would not recommend this class. Never answers emails and class is way too challenging for an intro to accounting class.",
        "course": "AEDECON2105"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took Briggs' INTRO to accounting (AEDE 2105) at OSU and Briggs can only be described as a miserable excuse for a teacher, especially at a school such as OSU. Briggs simply does not teach, she uses TopHat as a way to get out of doing HER JOB while still getting paid. Doesn't post lectures, doesn't respond to emails, doesn't give grade feedback.",
        "course": "AEDE2105"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lisa Briggs might be a great woman, however I would never ever know because she doesn't teach. I took her online accounting class and it was difficult for my 3rd year accounting major roommate. She said that she felt the content was impossible for an entry level class, and this professor never posts lectures. Literally ever. We learn from the book.",
        "course": "AEDECON2015"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst class and professor. Midterm is really hard, do work and study all semester beforehand, then you might get a good grade on it. You can pass the class with like a B or C if you get an A on everything and still fail the midterm. Good luck yall.",
        "course": "AED2105"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "Worst professor ever. Had to retake the course and she chooses to uses tophat, which is an online format for the class. Useless system and she is terrible at email. TA's are not always prepared unless you reach out to them ahead of time.",
        "course": "AED2105"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "This professor is a little unreasonable. They stopped offering this class in person so by default I had to take it online. Her office hours are at awful times and she posts no content on how to do anything, especially the harder material towards the middle of the course. Her midterm is pretty brutal.",
        "course": "AEDECON2105"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Took the online AEDE2105 class. I recommend taking literally any other class you can. Briggs doesn't reply to emails asking for help and doesn't give clear directions (or really any at all). Midterm is very rough. The class is VERY time-consuming. I had to do more for this class than all my others combined.",
        "course": "AEDE2105"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "Lousy excuse of what is expected out of an OSU professor. She's on her third marriage which is revealing enough. I feel bad for anyone that has to take her for 2105.",
        "course": "AEDECON2105"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Briggs is a great teacher. The course has about 2 assignments per week, that are generally easy just time consuming. If you go to class and actually pay attention you will be fine. Quizzes weekly in a lab (you leave once they're done). Midterm is rough but the final is easy!",
        "course": "AEDECON2105"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Expect homework and be ready to work, but she is helpful. She explains everything in class so be sure to attend.",
        "course": "AEDE2105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 2.7,
    "department": "Agriculture",
    "firstName": "M E",
    "id": "VGVhY2hlci04MTgwNzM=",
    "lastName": "Davis",
    "legacyId": 818073,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class was so dry. Lectures were hard to watch. Exams were difficult and contained a lot of calculations. If you dont have to take this class, dont take it!!!",
        "course": "ANIMSCI3150"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "If you are resorting to this site after not doing so well on the first exam--take a deep breath. IT GETS BETTER, I promise!Everyone seemed to do poorly on the first exam. Lecture slides are very dull and boring, but I'm not sure how you could spice up genetics. Pretty tough course so don't expect an easy A.",
        "course": "ANISCI3150"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "Quizzes were unfairly weighted. Online video lectures were dull and boring and I could never get through them. Topics don't cover stuff in depth. Literally the worst class I have ever taken. ",
        "course": "3150"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Davis teaches two online classes here at OSU. I highly recommend avoiding them. He is very boring and hard to listen to, and in stats he uses a lot of variables instead of the actual terms, which can be very confusing. It's also very hard to get help and he explains little to nothing about outside work. Would not recommend.",
        "course": "ANSCI22603150"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very boring lecture. Drones on and takes 30min to realize someone has had their hand up for a question. Many lectures seemed like his stats class all over again, not genetics. Cowgame was kind of silly. Exams were moderately hard, final is cumulative, but allowed equation sheets.",
        "course": "ANSCI320"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 1,
        "comment": "Took the course online, never watched the lectures just took notes from the powerpoint slides. Class is easy as tests are online. Rec was ridiculous as it was taught by a TA that could not speak English and didn't explain things well.  Prof responds to e-mails quickly but not very helpful.",
        "course": "ANSCI260"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "If you take the online version of this class with the rec he does not teach the rec. He has a TA do it. My TA was asian and impossible to understand. Davis had no interest in helping out students AT ALL. You were on your own. I got an A-, but if you take 260, yes its easier online because the tests are online, but rec is almost impossible with TA.",
        "course": "ANIMS260"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Stats class. Not an exciting presenter, but strieghtforward and professional. Good teacher.",
        "course": "HCS260"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Teaching skills are clear and tests are straight forward.",
        "course": "AS320"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very easy to listen to.  He follows his online notes.  Find someone with past tests. Tests resemble same quiz questions.  Final is comprehensive.",
        "course": "ANIMALSCI320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Agriculture",
    "firstName": "Anne",
    "id": "VGVhY2hlci0yMzUxNzYw",
    "lastName": "Parkman",
    "legacyId": 2351760,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Parkman loves what she does, and it shows in her work. She genuinely cares about the students in her class and her goal isn't for you to fail, but to try your best and pass. There have been a few occasions where I missed assignments because of mental health reasons. She was more than understanding and worked with me. Take this class!!",
        "course": "AEDECON2400"
      }
    ],
    "SEI": []
  }
]