[
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.9,
    "department": "Agricultural Engineering",
    "firstName": "Dewey",
    "id": "VGVhY2hlci0xODUxMDAx",
    "lastName": "Mann",
    "legacyId": 1851001,
    "numRatings": 30,
    "summary_comment": "Professor Mann is highly regarded for his exceptional teaching quality and genuine care for his students' success. He presents complex content in an accessible manner and emphasizes practical, real-world skills through hands-on labs and fieldwork. Students consistently praise his dedication, passion, and willingness to help, making his courses some of the most enjoyable and beneficial at The Ohio State University.",
    "summary_comment_short": "Professor Mann is an exceptional and caring instructor who breaks down complex content into understandable pieces, though students note the class can be demanding early on. He is highly respected for his passion, experience, and dedication to his students' success, making him a standout professor at The Ohio State University.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mann is an exceptional professor that cares about his students and strives to break down and present content in a way that anyone could understand it. Dr. Mann front loads the class, so be prepared to be busy at the start of the semester.",
        "course": "AGSYSMT4300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Mann is an amazing lecturer and mentor. He is passionate about what he does, and its comforting to know that a professor truly cares about your success as a student and future agricultural educator. He is well respected and has a lot of experience making him a great asset to The Ohio State University.",
        "course": "AGSYSMT4300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dewey has been by far my favorite professor. He has impacted me in a positive way and truly made me a stronger professional after taking his class.",
        "course": "ASM4300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dewey is a great professor who takes his job very seriously and does an excellent job",
        "course": "ASM3360"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mann is an incredible instructor and very willing to work with his students. He wants everyone to be successful and will work to get you on the level that you need to be. While class isn't mandatory, it is incredibly beneficial to attend. Great class, great dude, really knowledgeable on his content area and always willing to help",
        "course": "ASM3360"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dewey emphasizes getting the &quot;transferable/real world&quot; skills in his teaching; this is reflected in his teaching methodology. ASM3360: One of the best classes I've taken in the department. Ask questions, show up to class, and be interested and you'll have a good time. Labs bring you out to the field and let you run equipment. Gives extra credit",
        "course": "AGSYSMT3360"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "This has been by far my favorite course at Ohio State. Dewey is passionate about the material and genuinely cares about his students. Labs are very hands on and fun. Highly recommend this course and professor!",
        "course": "AGSYSMT3360"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, care about teaching students and is thorough on topics. One of the best professors I've had at The Ohio State University.",
        "course": "AGSYSMT3360"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor, great guy, and after you've taken his class a great friend. He really cares about what he teaches and is always interested in what the class thinks. Will help wherever and whenever he can. Really cares for students success while making sure they learn something.",
        "course": "AGSYSMT3360"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor I have had. Great person outside of school as well.",
        "course": "AGSYSMT3360"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Before taking a class with Dewey, I definitely respected him for the networking and education outside of the classroom he offered to ASM students. I would recommend his classes to anyone hoping to get into production agriculture on or off the farm. Also an expert at dad jokes and the occasional pun.",
        "course": "AGSYSMT3360"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "ASM 4300 has such an effect on Real World Applications. This class was required for my Production Agriculture minor. And I am so very blessed to have an opportunity to learn through so many different lectures and course topics. This class does take a lot of time but what you put in you will take away from this course and instructor. Awesome Class!!",
        "course": "ASM4300"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mann is not only a great professor, but an outstanding resource for students throughout the Ag college. Taking any of his classes will not be something a student will regret.",
        "course": "ASM3360"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Don't be afraid to approach with questions and concerns. Dr. Mann is caring and will spend extra time with you without hesitation or annoyance. I loved taking his classes and working with him on projects.",
        "course": "ASM3360"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Looking back on my college experience, Dewey was one who I learned the most from. I learned more about teaching from Dewey than most of my education professors, and he wasn't even an education professor! He is a solid choice, the classes are tough, but he definitely makes it manageable and meaningful for the future.",
        "course": "ASM4300"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dewey is an amazing teacher. I learned a lot during my time with him. He really cares about his students. The two classes I took with him we not too difficult but did require some work. I defiantly grew from my experience with him as my teacher.",
        "course": "ASM4300"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dewey really encouraged us to think and be hands on. This class was taken by suggestion for the content. It was not my major. I learned so much and he really cared about how you learned and wanted us to be involved. We were never bored and while it was challenging, I wouldn't have wanted it any other way. I wanted to take more classes, but no time.",
        "course": "AGSYSMT4580"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best teachers I've ever had, genuinely cares about the material.",
        "course": "AGSYSMT3360"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great class to take because Dewey makes it fun to learn. There is some time commitment for a 4 hour class and you must attend class. If you go and participate you will learn a lot and should have no problem getting a good grade.",
        "course": "ASM4300"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the most awesome professors at the university. He gives regular homeworks and quizzes which are based on the homeworks. Quizzes and HWs are relatively easy. Gives a lot of extra credit. Very difficult to get a grade below A- or an A. He is always available for doubts and is very clear in what he says",
        "course": "ASM3360"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor and great guy! Really passionate about what he teaches and really interested in topics and student feedback. Keeps everyone involved and having fun. True grader and great helper. Cares for students and their grades!",
        "course": "AGSYSMT3360"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dewey is genuinely interested in helping his students succeed. Dont be afraid to ask him for help. Dewey is also very good at breaking down complex topics to make them easy to understand.",
        "course": "ASM3360"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Always there to answer questions. Made class work interesting. ",
        "course": "ASM104PURDUE"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was time consuming out of class.  There were lab reports and homework due almost every week, along with weekly quizzes before spring break.  No excuse not to get all 50 bonus points for the class.  Fairly easy overall if you put a little bit of time into it.  Dewey will help you out anytime if you just ask and not just about the class.  ",
        "course": "AGSYSMT3360"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dewey is am amazing and well respected professor. He does a great job keeping the learing material interesting and hands on. The class was able to get acquainted with many different types of precision equipment. One of my favorite classes during my time at OSU. Dewey is also always available to help with questions at anytime with assignments.",
        "course": "ASM4580"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "Course material and lab assignments were very helpful in preparing me for a career in agriculture. This professor does an excellent job of tailoring the class to current events in ag and the interest of the students. Easy A if you apply yourself and attend classes.",
        "course": "ASM4580"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Enjoyed this class thoroughly. Very informative. Dewey is very entertaining down to earth an can related coursework with students very well. Can relate with students well too. Great instructor.",
        "course": "ASM3360"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dewey is great at getting the material to make sense to everyone and in return helps people to participate more in class.",
        "course": "ASM3360"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you are looking for a professor that you need to get a hold of or asks questions about assignments or anything in general Dewey is your guy. He's always looking to improve classes and keep his students active in the classroom as well as out. Best professor I have had here at Ohio State. Thanks Dewey!",
        "course": "AGSYSMT4580"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was a great professor.",
        "course": "ASM104PURDUE"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4,
    "department": "Agricultural Engineering",
    "firstName": "S. Dee",
    "id": "VGVhY2hlci0xMTMzMjQy",
    "lastName": "Jepsen",
    "legacyId": 1133242,
    "numRatings": 4,
    "summary_comment": "Professor Jepsen is highly regarded for her effective communication and ability to make complex topics accessible, as evidenced by students finding her classes enjoyable and well-structured. Her expertise in the field, combined with her offering of extra credit, contributes to a positive learning experience. However, some students have noted that her teaching style can sometimes come across as unprofessional.",
    "summary_comment_short": "Professor Jepsen is highly regarded for her effective communication and ability to make complex topics accessible, as evidenced by students finding her classes enjoyable and well-structured. Her approach includes offering substantial extra credit opportunities and maintaining a supportive learning environment with manageable assessments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really learned a lot during this safety class.  I thought it wouldn't be a good class since it was over ag safety and OSHA but Dr. Jepsen did a really good job of making class enjoyable and easy for us to learn.  Lots of extra credit offered and I got over 100% in the class.",
        "course": "AGSYSMT4560"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Communicates the subject matter very well. She knows a lot about the course she is teaching since she is herself in that line professionally. She has biweekly quizzes, some assignments and a final. All are not very tough. If you are attentive in class, you wont need to bother much about the quizzes and assignments. Very helpful.",
        "course": "ASM5600"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "CSM600"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Proud of her degree...doesn't communicate subject matter very well.  Tries too hard to act/dress like a college student rather than a professor.",
        "course": "AMS600"
      }
    ],
    "SEI": [
      {
        "Subject": "AGSYSMT",
        "Catalog": "5600",
        "Class Name": "Agricultural Safety and Health",
        "Class Number": "31260",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.93"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "5600",
        "Class Name": "Agricultural Safety and Health",
        "Class Number": "8613",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "18",
        "Rating": "4.61"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "5600",
        "Class Name": "Agricultural Safety and Health",
        "Class Number": "31617",
        "Term": "SP 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.6"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "5600",
        "Class Name": "Agricultural Safety and Health",
        "Class Number": "32481",
        "Term": "SP 24",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.44"
      }
    ]
  }
]