[
  {
    "avgDifficulty": 2.6,
    "avgRating": 5,
    "department": "Anatomy",
    "firstName": "Claudia",
    "lastName": "Mosley",
    "legacyId": 2762648,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "All of her lectures are posted online, so no need to go to class. She is very good at telling you what is expected, as there are no trick questions on the exams. That being said, it is anatomy, and you will have to put in the work to do well."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Well Dr. Mosley is absolutely phenomenal! She is very straightforward, does not try to trick you and is very concise and clear in what she wants you to know for her tests. The textbook was never used and her exams were purely based on her lecture slides. She is also super approachable outside of class. She is very good at simplifying complex topics"
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "I loved this class! The tests were based directly off the slides, so very direct. There was a lot of material but mostly/all memorization. I studied HARD just the day before every test and ended with an A. I would definitely recommend!"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Dr. Mosley was an amazing teacher. She was always helpful and her tests were based off the slides she gave. She made anatomy fun. Even though it was a fast paced class she made it easier and the TA's were amazing! I'm going to miss this class a lot"
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "Claudia was AMAZING!!! Her lectures are fast paced, but very concise. They are also always recorded and posted on Carmen, so attendance is not mandatory. Labs are required, but you can miss up to three without loosing points. Her exams and practicals are incredibly fair. If you have any questions she is so helpful! One of my favourite classes yet!"
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Get points for showing up to lab while lecture attendance is not mandatory. Almost everything on the exams are on the slides and the lab instructors/assistants will help you understand what's going on and give tips on what might be on exams based on prior experience. Make diagrams/drawings to study muscles or vessels and remember the acronyms."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Super clear and concise. Does go through material fast, but explains everything super well. The course itself is information heavy, but she does a good job of answering questions and will hint at what to study. She's amazing!"
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "There is a ton of information associated with this course. Claudia makes it very clear what is important and what isn't. One of my best professors yet."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Anatomy 3300 is definitely a very difficult class, but her lectures were really helpful and in-depth. Her exams were not meant to trick you, she goes over everything you're tested on. She was always there if you had any questions and she really enjoys teaching the class. I really loved her lectures, they quickly became my favorite!"
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Dr. Mosley is an amazing professor. Yes, anatomy can be a hard subject, but she is very fair with the tests and practicals; they are super straightforward - she doesn't want to trick you. Week 1 is a lot of work with a test and lecture videos, but after that, the rest of the year is very enjoyable. She makes all the material easily understandable."
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 5,
    "department": "Anatomy",
    "firstName": "Kristin",
    "lastName": "Stover",
    "legacyId": 2845591,
    "numRatings": 38,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Dr. Stover's lectures were very easy to understand, and she offered many helpful ways to memorize things as we learned. Weekly lab attendance was mandatory with 2 unexcused drops, and lecture was all online (recorded and posted) at 8AM but attendance was not mandatory. The exams were all multiple choice and extremely easy as long as you studied."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Dr Stover was great! There are good extra credit opportunities that can help with studying the content. She does not try to trick you with exams, so if you study you will do well. There are homework assignments due at the end of the unit for completion. Lab TA's will give you hints to what is on the exam. Loved this class, made anatomy interesting."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "I loved her! She was honestly such a great professor, she made things easy to understand and gave us resources to use to help us study for the exams."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "I had a great experience with Kristen. Lectures are online and not mandatory; she records them, and you need to watch them to succeed. She explains the material in a very relevant way to the tests, and she wants to ensure that every student is successful. It is a lot of course material to memorize, but she gives you every opportunity to succeed."
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "She genuinely cares about her students and doesn't want them to fail. There are five exams, though, and that is pretty much the bulk of your grade, so be sure to study those. Everything on her slides is on the exams, so study the slides, and you will be fine. Lots of content, but not hard. Attendance isn't mandatory & all lectures are recorded."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Dr. Stover does an amazing job teaching anatomy. This class was the most organized/straightforward course I've ever taken. The lectures are so well put together that I never felt like I needed to find other resources to do well in the class."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Best professor I have ever had. She clearly loved teaching and truly wanted the best for her students. Anatomy is a difficult topic, but her lectures were very clear in what you needed to know and they were very informative. She essentially made learning anatomy easy. Absolute 5/5, no doubt."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Such a great professor! TONS of studying but Dr. Stover breaks it down in a way to make it easy and understandable. Gives tons of study tools and tips to succeed. Lectures are great, lots of active note-taking which helps to learn. Exams are fair. Labs are interesting."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "1. Watch Dr. Stover's lectures in 2x speed while having the slides open on my Ipad. \n2. Make a condensed set of notes for each lecture. Include as many tables, charts, figures and pictures. \n3. Memorize your notes. I did this on notability by using the tape tool. \n4. Quiz myself using the hw, unit quizzes, lecture quizzes, and unit review lecture."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Dr. Stover was one of the best professors I have had. Her learning objectives are super clear and are the most accurate I have seen on exams. Watch 2x speed and MAKE QUIZLETS/FLASHCARDS that exactly match the objectives and you will get an A."
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "By far my favorite class this semester! Dr. Stover is a very fair professor - each lecture begins with a list of objectives, and her exams are based off of these objectives so that there will never be test questions out of left field. 5 non-cumulative exams."
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "Great professor! Content is divided into 5 units. Material is straight forward, and lectures are via zoom recordings so we could watch them whenever. Lab is helpful. Stay up-to-date with material, so there are not loads of info to study the night before the exams. Assignments are helpful and accurately reflect the exams!"
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "Dr. Stover is an amazing professor. As long as you keep up with the lectures and study in advance you should be fine. I would 100% take her class again."
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "Dr. Stover is an amazing professor. As long as you keep up with the lectures and study in advance you'll be fine. I would 100% take her class again if I could."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Dr. Stover is an amazing professor. The exams are not bad if you study. Anki was really helpful for this class. It is just a lot of memorization."
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "Dr. Stover is one of the anatomy 2300 professors and is amazing. Although I didn't do as good as I hoped in the class, she really conveys the information very well. The only thing I would say is how hard her exams are. They are worded in a very particular way that makes you think outside of the book so make sure you know your material."
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "Dr. Stover was an excellent professor. Anatomy is definitely not an easy course, however if you watch her lectures, start studying a week in advance, and actively take notes/make Quizlets - you will be okay! I enjoyed this class very much and truthfully did not try as hard as I could have and still did fine in the class."
      },
      {
        "index": 17,
        "rating": "5.0",
        "comment": "LOVE HER!!! Literally made me want to continue taking Anatomy courses. This class is memorization heavy (duh) and honestly if you do bad in the class, it's probably a lack of trying on your part bc. Stover tells you exactly what you can do to succeed."
      },
      {
        "index": 18,
        "rating": "5.0",
        "comment": "I have had Prof Stover for 2 years because I had to retake anatomy. I was actually happy to be taking the class a second time because of how interesting the class is. Stover is super sweet and despite such a big class if you are not doing well she will go out of her way to check on you. Exams are fair but a lot. Start studying weeks before."
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "Dr. Stover is great. Anatomy is a lot to learn but her and the rest of the teaching staff clearly presented the content and tried to make it as easy and interesting as possible to learn. Most of your grade comes from exams so as long as you stay on top of things and study you'll do fine."
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 5,
    "department": "Anatomy",
    "firstName": "Kristin",
    "id": "VGVhY2hlci0yODQ1NTkx",
    "lastName": "Stover",
    "legacyId": 2845591,
    "numRatings": 40,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is challenging but if you actually study and take the time to draw your own diagrams, make your own quizlets, and find a way that you can actually retain the information. Then I found the exams fairly easy. So far, I have gotten above a 90% on 4 exams. Great lecturer, and lectures are recorded so you can watch them anytime. Lab is fun. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's the best! The class is a lot of information and memorizing, but she made it easier to grasp and has such a positive personality each lecture that makes them enjoyable. Lectures are online and recorded so not mandatory but they're the only way to get the information. She also posts her annotated notes after lecture which is very helpful",
        "course": "ANATOMY2300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Stover's lectures were very easy to understand, and she offered many helpful ways to memorize things as we learned. Weekly lab attendance was mandatory with 2 unexcused drops, and lecture was all online (recorded and posted) at 8AM but attendance was not mandatory. The exams were all multiple choice and extremely easy as long as you studied.",
        "course": "ANATOMY2300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Stover was great! There are good extra credit opportunities that can help with studying the content. She does not try to trick you with exams, so if you study you will do well. There are homework assignments due at the end of the unit for completion. Lab TA's will give you hints to what is on the exam. Loved this class, made anatomy interesting.",
        "course": "ANATOMY2300"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved her! She was honestly such a great professor, she made things easy to understand and gave us resources to use to help us study for the exams.",
        "course": "ANATOMY2300"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had a great experience with Kristen. Lectures are online and not mandatory; she records them, and you need to watch them to succeed. She explains the material in a very relevant way to the tests, and she wants to ensure that every student is successful. It is a lot of course material to memorize, but she gives you every opportunity to succeed. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "She genuinely cares about her students and doesn't want them to fail. There are five exams, though, and that is pretty much the bulk of your grade, so be sure to study those. Everything on her slides is on the exams, so study the slides, and you will be fine. Lots of content, but not hard. Attendance isn't mandatory & all lectures are recorded.",
        "course": "ANATOMY2300"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Stover does an amazing job teaching anatomy. This class was the most organized/straightforward course I've ever taken. The lectures are so well put together that I never felt like I needed to find other resources to do well in the class. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor I have ever had. She clearly loved teaching and truly wanted the best for her students. Anatomy is a difficult topic, but her lectures were very clear in what you needed to know and they were very informative. She essentially made learning anatomy easy. Absolute 5/5, no doubt. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such a great professor! TONS of studying but Dr. Stover breaks it down in a way to make it easy and understandable. Gives tons of study tools and tips to succeed. Lectures are great, lots of active note-taking which helps to learn. Exams are fair. Labs are interesting.",
        "course": "ANATOMY2300"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "1. Watch Dr. Stover's lectures in 2x speed while having the slides open on my Ipad. \n2. Make a condensed set of notes for each lecture. Include as many tables, charts, figures and pictures. \n3. Memorize your notes. I did this on notability by using the tape tool. \n4. Quiz myself using the hw, unit quizzes, lecture quizzes, and unit review lecture. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Stover was one of the best professors I have had. Her learning objectives are super clear and are the most accurate I have seen on exams. Watch 2x speed and MAKE QUIZLETS/FLASHCARDS that exactly match the objectives and you will get an A. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "By far my favorite class this semester! Dr. Stover is a very fair professor - each lecture begins with a list of objectives, and her exams are based off of these objectives so that there will never be test questions out of left field. 5 non-cumulative exams.",
        "course": "ANATOMY2300"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor! Content is divided into 5 units. Material is straight forward, and lectures are via zoom recordings so we could watch them whenever. Lab is helpful. Stay up-to-date with material, so there are not loads of info to study the night before the exams. Assignments are helpful and accurately reflect the exams!",
        "course": "ANATOMY2300"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Stover is an amazing professor. As long as you keep up with the lectures and study in advance you should be fine. I would 100% take her class again.",
        "course": "ANATOMY2300"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Stover is an amazing professor. As long as you keep up with the lectures and study in advance you'll be fine. I would 100% take her class again if I could. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Stover is an amazing professor. The exams are not bad if you study. Anki was really helpful for this class. It is just a lot of memorization.",
        "course": "ANATOMY2300"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Stover is one of the anatomy 2300 professors and is amazing. Although I didn't do as good as I hoped in the class, she really conveys the information very well. The only thing I would say is how hard her exams are. They are worded in a very particular way that makes you think outside of the book so make sure you know your material. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Stover was an excellent professor. Anatomy is definitely not an easy course, however if you watch her lectures, start studying a week in advance, and actively take notes/make Quizlets - you will be okay! I enjoyed this class very much and truthfully did not try as hard as I could have and still did fine in the class.",
        "course": "ANATOMY2300"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "LOVE HER!!! Literally made me want to continue taking Anatomy courses. This class is memorization heavy (duh) and honestly if you do bad in the class, it's probably a lack of trying on your part bc. Stover tells you exactly what you can do to succeed.",
        "course": "ANATOMY2300"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have had Prof Stover for 2 years because I had to retake anatomy. I was actually happy to be taking the class a second time because of how interesting the class is. Stover is super sweet and despite such a big class if you are not doing well she will go out of her way to check on you. Exams are fair but a lot. Start studying weeks before.",
        "course": "ANATOMY2300"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Stover is great. Anatomy is a lot to learn but her and the rest of the teaching staff clearly presented the content and tried to make it as easy and interesting as possible to learn. Most of your grade comes from exams so as long as you stay on top of things and study you'll do fine.",
        "course": "ANATOMY2300"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "as long as you keep up with the lectures it's totally doable. can skip 3 labs. super nice prof. almost now hw besides studying so exams are important. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "great prof!!!",
        "course": "ANATOMY2300"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very organized class, expectations are clear. Almost now homework, studying and test heavy. 3/11 labs get dropped which is so nice. If you stay on top of your studying, not too bad. Lectures at 8 am online, but posted on carmen to watch later.",
        "course": "ANATOMY2300"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent professor, best I've had at OSU. Makes it extremely clear what you need to learn, and what will be on the exams. Exams are thorough, but if you use her checklists they're very easy. 10/10.",
        "course": "ANATOMY2300"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Stover is incredibly knowledgable and a great professor! Lectures were stressful to understand at first, but she makes the material very interesting and relatively simple enough for us to grasp for the tests. The class is definitely difficult, but Dr. Stover is a great person to learn from.",
        "course": "ANATOMY2300"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor! For anatomy being the rigorous course that it is, she does an great job of breaking down concepts into a way that is easy to understand. Online lectures were always recorded. Although you have to put in some time to study, the exam questions were very fair. Exam content was easy to find by just studying the lecture notes given. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "The best professor I have ever had! Dr. Stover is amazing at teaching anatomy. She actively hand writes/ draws notes and this is incredibly helpful. Anatomy isn't an easy class but if you review and know the muscle tables and flow charts by heart then you'll do good. STUDY!!",
        "course": "ANATOMY2300"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "Anatomy 2300 with Kristin Stover was a great class. There are not many assignments to overwhelm students and you'll only get a good grade if you study because most of your grade comes from the exams. Everything on the exams is in the written notes and some is from labs, so if you study that, then you have all of the information you need to succeed.",
        "course": "ANATOMY2300"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "Stover is great at lecturing, makes things clear and lets students know what will be on the exams. There is barely homework, one little multiple-choice assignment every Friday with some exam study assignment before midterms. Love her energy at 8 in the morning.",
        "course": "ANATOMY2300"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "Anatomy is a difficult class in any form, but Dr. Stover truly cares about students and makes the class as manageable as possible (i.e. telling you what you do and don't need to know, hands on lectures, memorization techniques). I would not have passed this class without that. It gets easier as the course goes on which was a big relief as well!",
        "course": "ANATOMY2300"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 3,
        "comment": "Please please be nice to Dr. Stover! She is absolutely amazing and we students love her.",
        "course": "ANATOMY2300"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Stover actually cared about her students and made our lectures more active learning style after seeing that many did bad on the first exam. This class has a lot of content that needs to be memorized, if you do not study you will not do well. I found the labs to be the best part of the class!",
        "course": "ANATOMY2300"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "I am a student who retook the course and she was a very caring professor who was willing to see her class succeed. After she saw we did not do well on the first exam she changed her lecturing style and content format to be more straightforward. She was one of the best professors I've ever had at osu. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 5,
        "comment": "Anatomy 2300 will be a tough class regardless of who you have. But Dr. Stover made the course as bearable as possible. The exams were online and fully multiple choice or matching. At the end of the semester, I was 0.35% off from a C+. Even though the syllabus says no additional curve was in place, she curved me up after I emailed her.  ",
        "course": "ANATOMY2300"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 5,
        "comment": "Anatomy 2300 was a difficult class, however Professor Stover made it as bearable as possible. She genuinely cares about her students. While the class was a lot of memorization, she posted the lecture videos for students to rewatch,and provided plenty of materials and resources to assist her students with studying. I would 100% recommend her!",
        "course": "ANATOMY2300"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an amazing teacher in terms of the way she does lecture and sets up the class. She's also an amazing human.She really cares about the whole class and genuinely cares about the teaching which makes the teaching that much better. She is one of the most memorable teachers I have had. I highly recommend if you have the chance to take her, do it.",
        "course": "ANATOMY2300"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 4,
        "comment": "Stover is GREAT. Anatomy is just a hard class in general but stover is great at explanations. The class is offered online at 8am Monday, Wednesday, and Friday. BUT it is reordered so you can miss and watch later. Labs are once a week for 2 hours and 30 minutes. The labs don't necessarily help but they are mandatory. Tests are hard but manageable. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Stover was a great Anatomy professor. The course was only offered online with weekly labs, but she explained the material very clearly even though anatomy can be a difficult subject. This class is really just memorizing A LOT of stuff, but if you put in a good amount of effort you will be fine!",
        "course": "ANATOMY2300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 5,
    "department": "Anatomy",
    "firstName": "Claudia",
    "id": "VGVhY2hlci0yNzYyNjQ4",
    "lastName": "Mosley",
    "legacyId": 2762648,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "All of her lectures are posted online, so no need to go to class. She is very good at telling you what is expected, as there are no trick questions on the exams. That being said, it is anatomy, and you will have to put in the work to do well. ",
        "course": "ANATOMY3300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Well Dr. Mosley is absolutely phenomenal! She is very straightforward, does not try to trick you and is very concise and clear in what she wants you to know for her tests. The textbook was never used and her exams were purely based on her lecture slides. She is also super approachable outside of class. She is very good at simplifying complex topics",
        "course": "ANATOMY3300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved this class! The tests were based directly off the slides, so very direct. There was a lot of material but mostly/all memorization. I studied HARD just the day before every test and ended with an A. I would definitely recommend!",
        "course": "ANATOMY3300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mosley was an amazing teacher. She was always helpful and her tests were based off the slides she gave. She made anatomy fun. Even though it was a fast paced class she made it easier and the TA's were amazing! I'm going to miss this class a lot",
        "course": "ANATOMY3300"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Claudia was AMAZING!!! Her lectures are fast paced, but very concise. They are also always recorded and posted on Carmen, so attendance is not mandatory. Labs are required, but you can miss up to three without loosing points. Her exams and practicals are incredibly fair. If you have any questions she is so helpful! One of my favourite classes yet!",
        "course": "ANATOMY3300"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Get points for showing up to lab while lecture attendance is not mandatory. Almost everything on the exams are on the slides and the lab instructors/assistants will help you understand what's going on and give tips on what might be on exams based on prior experience. Make diagrams/drawings to study muscles or vessels and remember the acronyms. ",
        "course": "ANATOMY3300"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Super clear and concise. Does go through material fast, but explains everything super well. The course itself is information heavy, but she does a good job of answering questions and will hint at what to study. She's amazing!",
        "course": "ANATOMY3300"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "There is a ton of information associated with this course. Claudia makes it very clear what is important and what isn't. One of my best professors yet. ",
        "course": "ANATOMY3300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Anatomy 3300 is definitely a very difficult class, but her lectures were really helpful and in-depth. Her exams were not meant to trick you, she goes over everything you're tested on. She was always there if you had any questions and she really enjoys teaching the class. I really loved her lectures, they quickly became my favorite!",
        "course": "ANATOMY3300"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mosley is an amazing professor. Yes, anatomy can be a hard subject, but she is very fair with the tests and practicals; they are super straightforward - she doesn't want to trick you. Week 1 is a lot of work with a test and lecture videos, but after that, the rest of the year is very enjoyable. She makes all the material easily understandable.",
        "course": "ANATOMY3300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.4,
    "department": "Anatomy",
    "firstName": "Leslie",
    "id": "VGVhY2hlci0yNDQ3NDQ1",
    "lastName": "Sewell",
    "legacyId": 2447445,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I thought this prof was very nice and approachable. She is very self-deprecating. Sometimes I couldn't tell if she was joking or is really hard on herself.  I really liked her analogies and mnemonics to remember things. ",
        "course": "Anatomy2300"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "It really amazes me how some prof can be nasty to students they barely know. I heard this prof make a nasty comment to a student who complimented her outfit. She responded \"Complimenting me bc your exam is next week?\" No prof should be talking to a student that way. Also, side comments about dentpath and medpath students was wildly unprofessional. ",
        "course": "Anatomy2300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Sewell is great at keeping lectures entertaining and informative even if lectures did tend to run over a bit. She has a pneumatic for everything that are incredibly useful for studying and she breaks down content well. I hope I can take more anatomy classes with her in the future.  ",
        "course": "Anatomy2300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "A little self deprecating, but funny and enjoyable to listen to. Very helpful. ",
        "course": "Anatomy2300"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "There are 2 lecturers in this class and Dr. Sewell is one of them. Every online lecture there is always some complication, which isn't completely her fault. But the way she gets her information across never clicks with me or makes the most sense. I have talked to others and many have said the same thing. Is a nice prof but not the best at teaching.",
        "course": "Anatomy2300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Anatomy",
    "firstName": "Habiba",
    "id": "VGVhY2hlci0zMDgxOTIw",
    "lastName": "Chirchir",
    "legacyId": 3081920,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Genuinely the worst professor I've had in my 4 years of college. She does not care if her students understand the material and only reads of the lecture slides. She expects you to know and understand anatomy in the same way she does, but she's just reading words off the slides. The tests consist of way too much material. Do not take her class! ",
        "course": "3504"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 5,
    "department": "Anatomy",
    "firstName": "Derek",
    "id": "VGVhY2hlci0xODg1OTI0",
    "lastName": "Harmon",
    "legacyId": 1885924,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Harmon truly loves what he does and is always willing to meet outside of class or explain himself better. The content is all over the lectures and labs and unfortunately everything counts. And might I say he's easy on the eyes.",
        "course": "ANATOMY3300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Derek is such an awesome professor. His lectures are clear, his tests are fair, and he is always willing to help when you have questions. One of the best professors I have encountered at OSU. Would recommend him to anyone. Not hard on the eyes as well ;) ",
        "course": "ANAT3300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class moves quickly, find what works for you and stick with it. Written and practical exams are straight forward, no trick questions. Know the material on the slides, read the lab manual, go to recitation, stay the entire time for lab and you'll most likely get an A. ",
        "course": "ANATOMY3300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Harmon is amazing. He's funny and very intelligent. He knows anatomy like the back of his hand and presents it to students in a way that is very understandable. He will go over ANYTHING a thousand times if it means it'll help students. Be prepared- Study a little each week and exams and practicals are straight forward and easy. ",
        "course": "ANATOMY3330"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easily the best professor I have ever had, and that is saying a lot considering this is supposed to be the more difficult of the anatomy classes at OSU. He is a great lecturer, and the tests are very straightforward. He dedicates extra hours of his own time to reviewing information in the lab, and it is clear he wants the best for all his students.",
        "course": "3300"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Incredibly helpful and interested in helping his students! Comes into lab and opens the lab additional hours so you can go over material with him.  Exams are not super hard but you do have to study to do well.  Great teacher!",
        "course": "ANAT3300"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Derek and his lab stuff are amazing. I loved this course and would highly recommend. Attend his lectures,labs and recitation and spend extra time with the TAs' for labs you are sure to get an A in this course.",
        "course": "ANATOMY3300"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great lecturer. Clear. Answers questions well. Lecture is EXTREMELY helpful. He reviews class materials multiple times at the beginning of class which is super helpful. Also hot!",
        "course": "ANAT3300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class is not hard at all as long as you put forth the effort. Derek is super helpful and very straightforward about what to expect on exams",
        "course": "ANATOMY3300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.8,
    "department": "Anatomy",
    "firstName": "Kate",
    "id": "VGVhY2hlci0yNzEwNDA0",
    "lastName": "Corbin",
    "legacyId": 2710404,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "I think Kate Corbin cares about her students. She had to lecture a lot cause the class was structured that way. Her tone is hilarious and that makes me learn better. She could teach a little slower and give more time to ask questions. Maybe making this a daily lecture and splitting content would be a better idea. The class is hard!",
        "course": "ANAT2300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love this woman. She is extremely hilarious and makes lecture very interesting. There is A LOT in the lectures and you literally have to memorize everything but if you study every day you will be fine. The test questions are NOT meant to trip you up, and I feel they are very straightforward. ",
        "course": "ANAT2300"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have ever had. She does not care about her students at all. There is no time to breathe in this class. Every day was so miserable. The entire class is basically based on four 100 point impossible exams. Do not take this class. ",
        "course": "ANAT2300"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Doesnt care about students. Wont round up your grade even if youre less than a percent away from passing. Do not take her",
        "course": "ANAT2300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.1,
    "department": "Anatomy",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0xMjQzMzAx",
    "lastName": "Burgoon",
    "legacyId": 1243301,
    "numRatings": 131,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Be prepared to basically teach yourself the content. Lectures consist of videos from anywhere from 15 minutes long to 2 hours. The lab helped me understand the units a lot better but, watching lectures and taking notes is not enough to pass the class. Be ready to study for hours for each test as your grade is 85% comprised of 5 unit tests.",
        "course": "ANAT2300"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. Burgoon is very knowledgeable on human anatomy and knows her stuff. Lectures are very long and intense and you must watch all of them to understand what's going on. Lab attendance wasn't mandatory but they told us at the VERY END that it could raise your grade if you go every week. Be prepared to have this class consume all of your time.",
        "course": "ANAT2300"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "Trust me, lab attendance and the textbook are not mandatory. Lectures are long and taught like a review as if you already know the material. Grade entirely depends on 5 exams, 40 MC, with class averages of around 70 (no curves), and only the first exam is open note. Do not take this class unless you're willing to put in a LOT of time.",
        "course": "ANAT2300"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took the class online and it was pretty much asynchronous. Lectures are long but when broken up are very doable. Material was not difficult but you cover a lot throughout the semester. Exams were very doable. Definitely need to study but if you are willing to put in time and effort and you can memorize, you will be just fine.",
        "course": "ANAT2300"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Anatomy with Dr. Burgoon can be hard if you don't take note on her lectures. The way she has the class set up is very organized but it can still be easy to fall behind if you're no careful. I never bought the textbook and was perfectly fine without it. Beware there a 5 exams and a final.",
        "course": "ANAT2300"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "she lecture is really not much of a help. Be prepared to work and shes not a very reasonable professor.",
        "course": "ANAT2300"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Burgoon was a good professor and explained things well. She has been accessible during Friday morning recitations and cares to help her students. Unfortunately, all lectures were prerecorded rather than live (although, I would expect nothing more during Covid). It would be more helpful to many if this class was in person. Enjoyed it!",
        "course": "ANAT2300"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "Challenging course overall bc anatomy isnt easy. Rough prof, and minimal assignments towards grades. However , everything has been open note , but dont take advantage of that bc exam questions can be tricky if you dont actually know the material at least a little bit.",
        "course": "ANAT2300"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Burgoon changed the course halfway through the year, adding a proctored, graded, national anatomy exam as our final. Her fall semester class DID NOT HAVE TO TAKE A FINAL. Many students emailed her about this, and she has not acknowledged out concerns. This is going to give many students applying to the BSN program a SEVERE DISADVANTAGE!",
        "course": "ANAT2300"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "AWFUL at structuring this course and helping students and incredibly rude! Due to COVID it was asynchronous, so the lectures were pre-recorded, and the quizzes were open-note and you could retake them as many times as you wanted. Then they implemented a closed-note, proctored final exam when they never had before and gave no real explanation.",
        "course": "ANAT2300"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS WITH THIS PROFESSOR. She does not care about you at all, is not helpful in the slightest, and is the most ridiculous person I have ever been taught by at OSU. Screwed over my section regardless of the pandemic and disregarded all of our concerns. DO NOT TAKE THIS CLASS WITH THIS PROF.",
        "course": "ANAT2300"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "For the most part, every review about her written after January 2021 is true. She showed no care for students and when I personally emailed her about testing accommodations, she never responded (still waiting for one). This class requires a lot of studying so be prepared. TA was also rude to students. overall, get this course done ASAP.",
        "course": "ANAT2300"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT under any circumstance take Prof. Burgoon for ANAT2300. Extremely rude and did not address concerns of students during COVID-19. TA also did not stand up for students and completely dismissed anything that was brought up, no compromise whatsoever. I spent more time on this class than I did on organic chemistry and that's saying something.",
        "course": "ANAT2300"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "DO NOT take this class. Prof and GTA do not care about the students and have a very rude attitude. GTA treats college students like preschoolers. Class is graded based on 5 exams (open note) and 1 HAPS exam (standardized anatomy test) with a national average of 49%, and there is no curve or extra credit given.",
        "course": "ANAT2300"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "Just dont take the class if you have a choice. Professor and TA dont care about the students AT ALL. They gave us an unfair exam not given to any other of their classes, during this pandemic that is already hard enough to deal with, in the class that is hard enough as it is. extremely disappointed with the teaching of this course.",
        "course": "ANAT2300"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "Only exams and lectures. This class isnt great. Uploaded TWO HOUR lectures and her class is supposed to be 55 minutes if it were in person. If it has HAPS exam in the syllabus, dont even take the class.",
        "course": "ANAT2300"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 3,
        "comment": "This professor was awful especially during the time of Covid-19. No effort was made towards students in the spring semester to ensure fair treatment was made. Spring students were forced to take a national proctored exam while earlier students were not forced to even take a final. Very dismissive and passive aggressive to students concerns.",
        "course": "ANAT2300"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 3,
        "comment": "During covid-19 online courses, absolutely no effort was put in by the professor. The recorded lectures were recorded during a live class pre-pandemic &amp; the recitations are run by the TA. All Dr. Burgoon does is activate the exams on carmen. Class is easy aside from the Proctored final. Im just jealous that I dont get paid 6 figures to sit around",
        "course": "ANAT2300"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Getting a decent grade in this course is impossible if you don't spend 5+ hours a day (including weekends) on this class. Even if you all the muscles and innervations perfectly, the majority of the questions are ridiculously obscure and specific. Many of the questions are worded to trick. There is also now a cumulative closed-book final",
        "course": "ANAT2300"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took during AU2020 (COVID). The class was all online including the lab. The class had five exams for the 5 units and were fairly easy because it was open note. Each unit had a set of easy quizzes to complete for comprehension and review (did not count in the total grade). Lab was all online through tophat, and graded on completion. Take it online!!",
        "course": "ANATOMY2300"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 4,
        "comment": "Recorded lectures are extremely long and hard to watch all at once. The only grades for the class are the 5 exams and 13 lab assignments. If you only watch the lecture and attend review sessions, you will only barely pass the exams. Much of the information comes from the textbook or workbook.",
        "course": "ANAT2300"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 4,
        "comment": "Have to study everyday for this every single day in order to do well in this course. Everything is weighted the same.",
        "course": "ANAT2300"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Burgoon's class focuses almost entirely on lecture. Study the lectures to pass the class. She goes through the lectures rather quickly. The exams take content straight from the lecture. No homework, but after lecture quizzes. The amount of time you put in will determine the grade you get.",
        "course": "ANAT2300"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "Anatomy is a fun class and she is very straightforward. The online class isn't too bad, but watch all the lectures and do all the assignments. The exams are very simple if you study and if you don't cram. Don't procrastinate and you will be fine! Lectures can be long.",
        "course": "ANAT2300"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 4,
        "comment": "Requires a good amount of studying and don't cram unless you know you can memorize a lot of info. Exam questions are fair (imo) but harder than the quizzes and require connecting the dots. Didn't use the textbooks but READ THE LABS AND GO TO RECITATION. Everything is recorded. Content is interesting + prof/ta really try to give you tips and tricks.",
        "course": "ANAT2300"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "Ok. this class is ALOT OF WORK. if you want to do well you need to make quizlets of each section regularly and study them on days you dont have lecture. Aside from that there are sooo many resources available for you to use. personally i didnt use the guy burgoon book, but the PAL was a MUST review tool for the exams. Loved burgoon, so nice!",
        "course": "ANAT2300"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "Grade is almost solely based on the test but if you put in the effort you'll be fine. She rarely lectures and when she does she can talk fast so it is helpful to watch them again online afterwards to get all of the content.",
        "course": "ANAT2300"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "There are no extra credit assignments or curves for this class. Your grade is solely dependent on your exam grades. Study early, this class is all memorization. The best advice I got was to make sure to look at the learning objectives. What you need to know will most likely all be there.",
        "course": "ANAT2300"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 2,
        "comment": "Probably the easiest science class I've ever taken. The exams were very fair as long as you studied a few days in advanced for them. They say that the textbook is mandatory but I would not suggest purchasing it, it's not worth it, you only use it for labs and you could easily get away without it.",
        "course": "ANAT2300"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "Most of your grade depends on the unit exams, which aren't too bad if you put a lot of time into studying. Study in advance, so you're not slammed when it comes to a week before the exam. All the lectures are posted online, so attendance isn't mandatory, but I thought it was better to be there in person to see the annotated slides.",
        "course": "ANAT2300"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 3,
        "comment": "You are expected to remember A LOT of information for this class, and at first this will seem overwhelming. However, I found the exams to be extremely easy. On the downside, to get an A in the class, you can only miss a very minimal amount of points. Basically, just be familiar with/know all the information, and the class becomes an easy A.",
        "course": "ANAT2300"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "lectures are posted online, so class isn't mandatory. RECORD THE LECTURES she talk sooo quick, use quizlet or flashcards and you'll be fine, lots of memorization",
        "course": "ANAT2300"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class is SO hard. The 8 am lectures suck, but she posts them all online so I started skipping every single lecture and it honestly didn't matter. I ended up with a B which I was really proud of, but I literally studied my ass off 24/7. If I wasn't studying, I felt like I needed to be. Lowkey ruined my first semester of freshman year",
        "course": "ANAT2300"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 4,
        "comment": "It is an anatomy class so a lot on studying is required. But everything is posted online and when going to lecture its pretty much just read right off the slides. Fell behind in lectures a bit though, so have to study ahead to be prepared for exams. Exams are not hard as long as you put in effort! TAs are great & answer all questions",
        "course": "ANAT2300"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hardest class ever! Only Tests and no curves! you need to study everyday for hours! She talks soo fast! Lab teachers make you sit there until lab is over even if you have nothing to do ( everything is done as a coletcive class, therefore everyone is done at the same time) and you cant be on your phone.",
        "course": "ANAT2300"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 2,
        "comment": "Fast lecturer, but GTA did most of the lectures and was much better than her. Lots of information, though it is not very hard to understand. Labs help with visuals by looking at cadavers. Does not differentiate in lecture what information is going to be tested vs. just interesting facts for us to learn, so use textbook to know what's testable",
        "course": "ANAT2300"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 3,
        "comment": "Talks INSANELY FAST. Nice and easy to talk to. Lectures are kinda boring honestly. Does not differentiate between important and trivial information. Fascinating info and class, but she teaches is very dry and nonchalant in her lectures. Powerpoints have way too much info on them.",
        "course": "ANAT2300"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Burgoon is a very fast lecturer, but she emphasizes the important points. Lecture can be overwhelming, but the exams are NOWHERE NEAR as difficult as lecture would suggest, very straightforward. Lecture slides AND recordings are posted, so you basically never have to go. You'll have to put in time for this class, but she won't try to trick you.",
        "course": "ANAT2300"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Burgoon lectures way too fast and overwhelms you with information. Most of the information that she says does not even appear on the exams. To do good in the class, all you need to do is study the lecture objectives in the front of each section. Doing this will get you an A on each exam.",
        "course": "ANAT2300"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lecture is hard to follow as Dr. Burgeon talks/flips through slides very quickly. She acts as though you already understand the material, and is not helpful whatsoever. She also does not add to the slides, but simply reads off them. It's helpful to print off the slides and bring them to class. Lab is more helpful than lecture, but not by much.",
        "course": "ANAT2300"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 4,
        "comment": "I thought Dr. Burgoon was a very good professor. She was pretty fast at times, but her exams were very fair. As long as you know everything on the power points, it is not hard to get an A in this class. Office hours were pretty helpful, and checking out bones at Prior was a good way to practice.",
        "course": "ANAT2300"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Burgoon lectures way too fast, and acts as if you should already know all the info. My recommendation would be to audio record so you can go back to review. Labs were just another lecture with some cadaver viewing and review thrown in. Be prepared to attend lecture and listen carefully.",
        "course": "ANAT2300"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 4,
        "comment": "She obviously knows her stuff but she just throws information. Highly recommend recording her lectures because she talks so fast you'll miss half of what she says. Tests aren't too hard but there's a ton of information with each one and she doesn't give you any help on areas to study. Not great Not horrible",
        "course": "ANAT2300"
      },
      {
        "index": 44,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is not accessible outside of class AT ALL. I understand she has a lot of students, but she doesn't even make time to reply to emails or probably even open them. Get to know your TAs in this class and find time to study with people in your lab group, because she does not care about her students at all, and doesn't seem to mind that people know.",
        "course": "ANATOMY2300"
      },
      {
        "index": 45,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst class ever. This is the first semester Bragoon decided she wasn't going to put all of her slides online anymore and she talks SO fast that you miss so much of what she says. She throws so much material at you every day. If you miss a lecture you're out like 1/8 of the material for the exam. Theres no extra assignments to help your grade.",
        "course": "ANAT2300"
      },
      {
        "index": 46,
        "rating": 1,
        "difficulty": 3,
        "comment": "she makes you get a custom edition of the textbook so she can get royalties on it. Can only be bought through the bookstore for a ridiculous price. no respect for her.",
        "course": "ANATOMY2300"
      },
      {
        "index": 47,
        "rating": 3,
        "difficulty": 4,
        "comment": "Final grades are dependent on exams. Lectures aren't mandatory since all of the lectures are online. Exams were difficult. Lab was mandatory.",
        "course": "ANAT2300"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 4,
        "comment": "Burgoon is a pretty good professor. Very minimal amount of things graded by. Lectures are heavy but attendance is not mandatory, as you can view all lectures online. Exams aren't as difficult as the lectures would appear.",
        "course": "ANAT2300"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 5,
        "comment": "This class is very difficult. So many things you need to memorize. Graded almost by only exams. This course is a no slacker, must look at material and review every single day. This course is very fast paced in lecture (you will not be able to write down everything before they flip the screen). All lectures available online.",
        "course": "ANAT2300"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class is extremely content heavy. Dr. Burgoon knows her stuff but is not very accessible. Take advantage of the lab time where you see really cool cadaver demonstrations. I learned a few weeks in that actually listening in the lab and using the TA as a resource greatly improved my grasp on the material. Helped that my TA was gorgeous",
        "course": "ANAT2300"
      },
      {
        "index": 51,
        "rating": 4,
        "difficulty": 4,
        "comment": "She had all of her lectures online and those were better than actually waking up to go the 8am lecture.  Her tests are straight from the lectures so as long as you pay attention and study a significant, the class will be a breeze.",
        "course": "ANAT2300"
      },
      {
        "index": 52,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lecture heavy. Too much content for each unit, and doesn't has clear grading criteria. Labs aren't very enriching either and worth a miss, but you can't miss more than 3 otherwise it affects your overall grade. Her student TAs and Nick (the Lab TA) teaches too unclearly & quickly. One of the worse Anat classes I've taken.",
        "course": "ANAT2300"
      },
      {
        "index": 53,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class is extremely time consuming, and you definitely have to work hard to succeed.  There aren't a ton of points, so not doing well on one test can really impact your grade, don't fall behind!",
        "course": "ANAT2300"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Burgoon was great when she taught the class but she often handed it over to grad students who weren't as good. However, all her lectures are online (audio and video) so you don't have to go to lecture and they're also great for review. This class has a lot of information but it's definitely doable.",
        "course": "ANATOMY2300"
      },
      {
        "index": 55,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lots of information but overall doable. Never took anatomy, but her lectures are clear and easy to understand. Lectures are online and identical to her in-person ones. If you pay attention, then it makes studying easier. Tests are basic, no trick questions. You can miss three labs, which are boring and didn't help me learn.",
        "course": "ANAT2300"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 2,
        "comment": "All you really have to do is watch the lectures online and take NOTES alot of it . She also gives alot of information in the lecture , but only need to know the key concepts. If this class is offered online take it because the lab is a waste of a good solid 2 hours of your day(but the TA is mad cute so that was a bonus) .",
        "course": "ANAT2300"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 2,
        "comment": "burgoon offers all of her lectures online which i highly recommend as you can pause to take extra notes or speed up to cut  lectures in half. she is very clear in her lectures however gives a lot of extra information that you don't need for tests, if you take good notes and take the time to study it will be an easy A",
        "course": "ANAT2300"
      },
      {
        "index": 58,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class Ive ever taken. Dr. Burgoon goes extremely fast in lecures to the point where you can't even copy all of the notes down. I get that the lectures are online but who wants to go back and watch hours worth of lectures? Exams are extremely hard and you have to know so much material. Not enough point opportunities. Def wouldnt recommend it",
        "course": "ANAT2300"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 3,
        "comment": "It's an early class so she put all the lectures online. If Leah is teaching that day you might as well do the lecture online. Burgoon knows her stuff and will make sure you do too during lecture while Leah speeds through material and gets frustrated when you ask her to repeat. Put in the work for this class and your grade will reflect it!",
        "course": "ANAT2300"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class definitely makes you work hard for your grade. There are four master quizzes, each 10 points, and four exams, each 100 points, which make your grade. You have to study a couple weeks ahead in order to pass the exams, but if you do not procrastinate you will do fine! The exams are not super hard, they just have a lot of information.",
        "course": "ANAT2300"
      },
      {
        "index": 61,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class does not make sense to me. each unit is a MASSIVE amount of information and theres only 50 questions on the test. Spring break you learn half the information then take a week off and not have enough time to fit the lectures in before the test. I know majority people who take this class have to take it but overall it is a very difficult",
        "course": "ANAT2300"
      },
      {
        "index": 62,
        "rating": 2,
        "difficulty": 4,
        "comment": "Talks way too much and just shows a picture and repeats herself so lectures take longer than they should, lab is pointless but mandatory. Each exam has enough information for 2 different tests. She is very bad at replying to emails. She's a nice lady and all but this class needs to be restructured badly.",
        "course": "ANAT2300"
      },
      {
        "index": 63,
        "rating": 3,
        "difficulty": 4,
        "comment": "Nice teacher but the way the class is structured is beyond awful. 4 tests with 50 questions and each section there is hundreds of notes. i study about 2 hours a day and put an unbelievable amount of time in to get a B or B+ on each test. class needs to be restructured asap",
        "course": "ANAT2300"
      },
      {
        "index": 64,
        "rating": 4,
        "difficulty": 4,
        "comment": "Not necessarily difficult material, but you have to be willing to put in the time and energy as well as a lot of memorization. She's also very clear about grade criteria, so no bumping up grades or getting extra credit. Lectures and slides are online though, and that's really helpful",
        "course": "ANATOMY2300"
      },
      {
        "index": 65,
        "rating": 4,
        "difficulty": 3,
        "comment": "I personally thought she was a wonderful teacher. I would recommend going to lectures and paying attention during them because everything she says has a chance of being on the test. I would not recommend studying the night before. There is no way to cram for this class. The exams are relatively easy if you study the slides and book thoroughly.",
        "course": "ANAT2300"
      },
      {
        "index": 66,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures are optional, which is nice since it's at 8am, but going helps. The cadaver lab is amazing, and there are no lab practicals, but attendance is taken. There are weekly recitations that are optional for extra help as well. Exams are tough because you have to know so much info for 50 questions, so you never know what to study. So much work.",
        "course": "ANAT2300"
      },
      {
        "index": 67,
        "rating": 4,
        "difficulty": 2,
        "comment": "I didn't go to lecture & only listened to the lectures online. they took a crazy amount of time to do but it wasnt just me listening to the lectures, it was a lot of time writing things down and and teaching myself until i understood. In order to do well in the class you need to study everything in the slides. i loved anatomy, but its a lot of time",
        "course": "ANAT2300"
      },
      {
        "index": 68,
        "rating": 3,
        "difficulty": 4,
        "comment": "Take as a full semester course, not 7 weeks. Lectures dry. Gives out extra info at lectures not in slides so attend. Written tests can be conceptual. Cadaver lab is amazing. Although not mandatory, utilize all open lab time to get the best scores. Only 4 tests4 quizzes so study hard. Purchase extra modelsbooks if needed to facilitate studying. ",
        "course": "ANAT3300"
      },
      {
        "index": 69,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Burgoon makes you work for your A. Anyone with a strong work ethic can get an A or A- in this course. This course was condensed (7 weeks over the summer) which made it even more imperative to put in the work. I studied about 24 hours for each test.  The powerpoints, not the textbook, are what count. The labs were hands-on and intriguing.  ",
        "course": "ANAT3300"
      },
      {
        "index": 70,
        "rating": 4,
        "difficulty": 4,
        "comment": "Anatomy 2300 was one of the most poorly structured classes I've taken at OSU. 4 tests and 4 (easy to get full points for) quizzes? There's no extra credit involved so STUDY HARD. Burgoon knows her stuff but her lectures online are incredibly redundant and boring. Labs were useless to most of us because you HAD to go but didn't get credit for it. ",
        "course": "ANATOMY2300"
      },
      {
        "index": 71,
        "rating": 3,
        "difficulty": 4,
        "comment": "Melissa Quinn teaches all the lectures.. I only saw Professor Burgoon like twice. The class is hard, but if you study every night you'll do fine. They offer optional recitations. Those can help. All the lectures are online so its not a big deal if you miss, but its definitely easier to understand if you go. Only 4 exams and other 40 points so study",
        "course": "ANATOMY230004"
      },
      {
        "index": 72,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class is not bad overall. You only have 4 exams and 4 quizzes that make up your grade but if you study (I did the night before) and attend lecture, the exams are passable (usually 80% class average). There are also online lectures available if you cannot make it to class, and Quinn offers open labs twice a week. Go to lab, it's very helpful! ",
        "course": "ANATOMY2300"
      },
      {
        "index": 73,
        "rating": 4,
        "difficulty": 3,
        "comment": "All-in-all not bad.  They information she gives you is the information you need to know.  Lectures are very straightforward and clear.  ",
        "course": "6511"
      },
      {
        "index": 74,
        "rating": 5,
        "difficulty": 1,
        "comment": "This course was very straight forward and I came out of it having learned a lot. There is a lot of information and you need to make sure that you keep up with it, but do that and you're golden. The online lectures have all of the information you need to do well in the class. Only downside is that she does not answer emails promptly.",
        "course": "ANAT2300"
      },
      {
        "index": 75,
        "rating": 3,
        "difficulty": 3,
        "comment": "While Burgoon/Quinn are listed as the instructors for the class, only Quinn lectures. They have audio/video files on carmen of Burgoon lecturing from last year though, so it's not required to go to the lectures if you just want to listen to the online ones.",
        "course": "ANAT2300"
      },
      {
        "index": 76,
        "rating": 1,
        "difficulty": 5,
        "comment": "People are reporting that this is so simple. This is not the case. This class is challenging. Going to class and reading the book isn't enough. The information given in class is easy to understand with studying, but it is presented in a very different manner on the exams. Four 100 pt. Exams is the only way to earn points. Not Recommended!",
        "course": "ANATOMY2300"
      },
      {
        "index": 77,
        "rating": 3,
        "difficulty": 5,
        "comment": "I wouldn't recommend Dr. Burgoon to anyone. Many people claim that she is helpful and gives you the exact information she needs you to know. This was not my experience. She gave you the option to listen to the lectures online but they were also no help for me. This is a challenging class. I would take this at CSCC instead.",
        "course": "ANAT2300"
      },
      {
        "index": 78,
        "rating": 4,
        "difficulty": 3,
        "comment": "Awesome professor and class!!! She made the class fun and interesting. She is super helpful after lecture and during lab when she is present. She really cares about helping the student. Attend Lecture and Lab!!!! Both are more important than the text book. She does lecture fast but she is super nice about repeating something when you need it.",
        "course": "ANAT199"
      },
      {
        "index": 79,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor! She does repeat everything you need to know many times. Exams tested on broader topics and there was no trickery. They could have been much harder considering all the information we learned. I didn't have to study every day like many, but I usually studied over at least 2 or 3 days. Lecture recordings online were a life-saver!",
        "course": "ANAT199"
      },
      {
        "index": 80,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a great professor.  The audio for lectures were posted online if you couldn't attend class.  Everything you need to know is in the lecture notes and she repeats the info you need to know 100 times in lecture.  Go to class, take notes, and study, study, study.  If you study a lot, your grade will reflect it.",
        "course": "ANAT199"
      },
      {
        "index": 81,
        "rating": 5,
        "difficulty": 1,
        "comment": "I just retook anatomy for the second and her tests and quizzes are much easier than my last professor.  All of the lecture recordings are online so you don't have to go to class.  Just study the lecture notes like crazy and memorize as much as you can and you'll be fine.  No trickery from her like in physiology.",
        "course": "ANAT199"
      },
      {
        "index": 82,
        "rating": 4,
        "difficulty": 3,
        "comment": "I thought she was a great teacher and the class was very interesting. She gives you what you need for the test, and the tests are not tricky, but I've also never studied more in my life. Put in about 25 hours of studying, at least, for each test.",
        "course": "ANATO1959"
      },
      {
        "index": 83,
        "rating": 5,
        "difficulty": 3,
        "comment": "Burgoon is VERY clear on what she wants you to know, just pay attention in class and go to review sessions. She has a quiz a couple of days before the tests, which helps motivate you to start studying earlier and gives you a chance to see how well you know the material. She is very nice- I suggest going to her office hours whenever you can.",
        "course": "ANAT199"
      },
      {
        "index": 84,
        "rating": 5,
        "difficulty": 2,
        "comment": "Burgoon is a great teacher. Just know that this class covers a LOT of material, so studying is necessary. I did not do a single reading in the book, just focus on the material covered in class. Burgoon repeats important information multiple times so focus on that. Listening to recorded lectures help and make sure you memorize worksheet answers.",
        "course": "ANAT199"
      },
      {
        "index": 85,
        "rating": 4,
        "difficulty": 4,
        "comment": "You need the OSU version of the book for the worksheets in the back, but that's pretty much it. The powerpoints are pretty much all the test material. LOTS of content material, not severely complex, just a ton of material to cover in a short amount of time.",
        "course": "ANAT199"
      },
      {
        "index": 86,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class requires a bit of studying but the labs and lecture tell you EXACTLY what you need to know for exams, which are easy if you study enough.  Dr. Burgoon makes a long and early class at least tolerable.",
        "course": "ANAT199"
      },
      {
        "index": 87,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Burgoon is awesome! This is a challenging course, and require work and dedication. Many people blame Dr. Burgoon for this, but I think she makes this course as manageable as possible. She won't test over things she didn't say in lecture.",
        "course": "ANAT199"
      },
      {
        "index": 88,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was so much work. Very nice lady, but if she can find something to trip you up on a quiz or exam chances are she will do it. If you go to class and study literally everyday you should do well, but cramming the night before will guarantee you fail because there is so so much information to know.",
        "course": "ANAT199"
      },
      {
        "index": 89,
        "rating": 4,
        "difficulty": 2,
        "comment": "good.",
        "course": "ANAT199"
      },
      {
        "index": 90,
        "rating": 2,
        "difficulty": 5,
        "comment": "Talks way too fast. Her powerpoints weren't very organized. Labs are useless, they usually last about one hour. Exams weren't that bad. I did crap in this class 'cause I didn't study EVERYDAY like other students usually do. She's nice though, she's more than happy to help you out if you have trouble understanding her.",
        "course": "ANAT199"
      },
      {
        "index": 91,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is awful, avoid at all costs unless required for your major. Not an easy A at all, it WILL take over your life.",
        "course": "ANAT199"
      },
      {
        "index": 92,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Burgoon was an excellent professor. She was always very helpful. The class was A LOT of work but you will do just fine if you STUDY. Just study a little bit each day. You can't wait until the night before to study for this class..there is WAY too much information for that. If you don't succeed it's your own fault, not Dr. Burgoon's.",
        "course": "ANAT199"
      },
      {
        "index": 93,
        "rating": 3,
        "difficulty": 5,
        "comment": "Literally mountains of information! & she talks very fast. You definitely have to work in this class, not an &quot;easy A&quot;. I would only take if you HAVE to or are VERY interested. If take: attend lecture and study every day. This class is ALOT of work.",
        "course": "ANAT199"
      },
      {
        "index": 94,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Burgoon is very smart.  It really is your own fault if you do bad in this class because she gives you all of the information.  Do it everyday and keep up and you will do fine!!  She is really nice when you ask her questions after class.  I liked her as a teacher.  The only thing is you might want to record her lectures because she talks fast.",
        "course": "ANAT199"
      },
      {
        "index": 95,
        "rating": 2,
        "difficulty": 5,
        "comment": "Burgoon is truly awful and by far the worst professor I've had. She is completely uninterested in helping you succeed. I had to get a tutor and will still get a B-/C+ at the end of this class. All I do is study but it really is not enough. The class is way too indepth for introductory anatomy. Overall, her lack of care for students is unbelievable.",
        "course": "ANAT199"
      },
      {
        "index": 96,
        "rating": 2,
        "difficulty": 5,
        "comment": "ATTENTION: I dont know what all these people are talking about saying this class is an &quot;easy A&quot; because honestly its a &quot;hard C&quot;! I've taken 2 other anatomy courses in my life and this is by the far the most in-depth and challenging course I have taken at OSU. She's not interested in helping you succeed, good luck.",
        "course": "ANAT199"
      },
      {
        "index": 97,
        "rating": 5,
        "difficulty": 5,
        "comment": "She is a great professor.  This course takes me a lot of time to study. But, I really enjoy the class with pouring knowledge on human body. If you attend the class every day and make your notes.  You should be OK on this course.  I have to tell you that this professor is rock!!",
        "course": "ANAT199"
      },
      {
        "index": 98,
        "rating": 5,
        "difficulty": 5,
        "comment": "She is a great professor.  This course takes me a lot of time to study. But, I really enjoy the class with pouring knowledge on human body. If you attend the class every day and make your notes.  You should be OK on this course.  I have to tell you that this professor is rock!!",
        "course": "ANAT199"
      },
      {
        "index": 99,
        "rating": 4,
        "difficulty": 1,
        "comment": "This is a tough course, but Dr. Burgoon makes it easy. As long as you attend class and keep up with studying, this class is a breeze. It takes work, but an A is definitely plausible. I recommend this professor!",
        "course": "ANAT199"
      },
      {
        "index": 100,
        "rating": 5,
        "difficulty": 2,
        "comment": "great teacher!!!!!!!",
        "course": "ANAT199"
      },
      {
        "index": 101,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is easy if you GO TO CLASS. There is no reason to fail or even get a C. Take notes. Study the powerpoints. She's not a hard teacher at all. Don't listen to the people who complain. They are going way too hard on her. The only bad thing is she talks kinda fast, BUT she is willing to restate what she said after lecture. just ask her to.",
        "course": "ANAT199"
      },
      {
        "index": 102,
        "rating": 4,
        "difficulty": 1,
        "comment": "Excellent professor. Stresses what is important. Class is easy as long as you attend lecture and print the slides. Exams are multiple choice and she has review sessions for tests. Lab is simple and we usually got out early. Just dont wait until the last minute to study because it is a lot of information, but if you study as you go you'll be fine.",
        "course": "ANAT199"
      },
      {
        "index": 103,
        "rating": 4,
        "difficulty": 2,
        "comment": "A lot of information but if you go to lecture you will do fine. She stresses what is important and lab is pretty helpful too. I just studied the power points and used book and easily got an A. If you don't get behind it is really not that bad.",
        "course": "ANAT199"
      },
      {
        "index": 104,
        "rating": 1,
        "difficulty": 5,
        "comment": "Wow. She needs to slow down and not throw so much info",
        "course": "ANT199"
      },
      {
        "index": 105,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you don't do well in this class it's your own fault.  Dr.B gives you all the info you need to know and stresses whats important. Yes, there is a lot of information, but its COLLEGE level human anatomy. By taking this class you're probably entering a health field, therefore it should be no surprise that this class won't be a walk in the park.",
        "course": "ANAT199"
      },
      {
        "index": 106,
        "rating": 2,
        "difficulty": 4,
        "comment": "Nice lady, but christ, what an awful teacher. disorganized and overloaded notes, unclear about necessary info, more physiology than should've been for the lowest level anatomy class offered. avoid her if possible.",
        "course": "ANAT199"
      },
      {
        "index": 107,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Burgoon is not an impossible professor, yes her exams are not the easiest but there is just a lot of material to be covered since it is a general anatomy class.  If you attend lectures and review your notes before tests you should be fine.  Class consists of 4 quizzes (lowest is dropped) and 4 tests, final is not cumulative!",
        "course": "ANAT199"
      },
      {
        "index": 108,
        "rating": 4,
        "difficulty": 5,
        "comment": "I don't think she is the problem it's really just the class. Yes her exams are tough, but if you keep up with the material you will be able to do alright. I studied more for this class than I ever did in my life so be prepared to study all the time!",
        "course": "ANAT199"
      },
      {
        "index": 109,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is extremely difficult, but it would be extremely difficult no matter what professor you have. Dr. Burgoon is very nice, very approachable and willing to help. To take this class you have to be willing to study, all the time. If you study, ask questions and go to class, you should be fine.",
        "course": "ANAT199"
      },
      {
        "index": 110,
        "rating": 5,
        "difficulty": 3,
        "comment": "Easy A if you study!!",
        "course": "ANAT199"
      },
      {
        "index": 111,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class covers a lot of information. That being said, Burgoon tells you what you need to know (in lecture) for tests, so if you don't attend you will be overwhelmed. Test follow the powerpoint slides pretty well. Wouldn't study direct from textbook. For Muscles know: origin, insertion, innervation, motion!! Know all bones and ALL markings on thm",
        "course": "ANAT199"
      },
      {
        "index": 112,
        "rating": 2,
        "difficulty": 4,
        "comment": "This professor speaks super fast! She also gives student 10x more info in lecture than they'll need for the exam. Looking over notes every night is a MUST if you want to succeed. Getting an A is definitely possible!! Be able to draw out the blood charts she gives in lectures..they are ALWAYS on the exam! The quizzes & exams are fair if you study!",
        "course": "ANAT199"
      },
      {
        "index": 113,
        "rating": 2,
        "difficulty": 5,
        "comment": "She makes everything so complicated. Gives a ton of info and her tests are so hard!! Quizzes are ok and the labs are just a waste of time!! Half of her students are failing and it is pretty impossible to get an A! Take this class only if it is absolutely required, if not just take something else!!",
        "course": "ANAT199"
      },
      {
        "index": 114,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class drove me crazy all quarter. All she does is cram information down your throat. The class should be A/P not just anatomy. The tests can be tricky. If she can find something to trip you up, she'll put it on the exam. Study all the time. Always go to class. If you show interest, she may help you. Lab is a waste. She is condescending/boring.",
        "course": "ANAT199"
      },
      {
        "index": 115,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Burgoon was a great professor. Her tests were fairly easy if you studied from the lecture notes. Going to lecture every day is a must, she says a lot of things that arent in the notes. Overall, a good class with a good teacher",
        "course": "ANAT199"
      },
      {
        "index": 116,
        "rating": 1,
        "difficulty": 4,
        "comment": "First of all she speaks really fast! If u r a fast typer/writer, GOOD for u! take as much notes as possible. go thru the powerpoint notes n textbook everyday. plz do not wait till the night b4 the quiz/exam! Getting an A is possible if u study everyday..Goodluck ppl :-)",
        "course": "ANAT199"
      },
      {
        "index": 117,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible!This teacher really is &quot;that bad&quot;!The material is NOT as hard as she makes it.She does not care what-so-ever about her students success.Honestly, she is by far the worst teacher I have ever had and I am a junior. Avoid this monster if you are trying to maintain a good GPA.She has NO business teaching,she's stuck in the past- her old job!",
        "course": "ANATO199"
      },
      {
        "index": 118,
        "rating": 1,
        "difficulty": 5,
        "comment": "Let me start by emphasizing that I am an A/B+ student, a senior and graduating with honors.Burgoon is monotone and speaks very fast! I went to her office various times to get assistance-she did not offer to help just told me I was not studying the &quot;right&quot; way&#63;!I studied everyday,my life revolved around this class!She's terrible, avoid her at all co",
        "course": "ANATO199"
      },
      {
        "index": 119,
        "rating": 4,
        "difficulty": 3,
        "comment": "okay burgoon really wasnt THAT bad. i will admit her tests were difficult. but if you studied everyday and kept up with the material they werent too bad. dont be discouraged by reading what others have written. her class is just as hard as any other anatomy teacher.",
        "course": "ANAT199"
      },
      {
        "index": 120,
        "rating": 1,
        "difficulty": 5,
        "comment": "She's a horrible teacher. She makes her exams almost impossible to pass. They're very tricky. Even you study hours and hours each day, really hard to earn A.",
        "course": "ANAT199"
      },
      {
        "index": 121,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Burgoon is a great lecturer. Her exams and quizzes aren't as hard if you study and go to lecture. It does require a lot of studying since the class is anatomy! Getting an A is very manageable as long as you put time into this class. She is always willing to help!",
        "course": "ANAT199"
      },
      {
        "index": 122,
        "rating": 4,
        "difficulty": 3,
        "comment": "Wow agreed.  These people are whiners.  This class did have a lot of material, but if you went to class and studied a little the exams were really, really easy.  And nothing was cumulative, so you're good as long as you can handle 2-3 weeks of material for a test.  Nothing was on a test that she didn't say in class.",
        "course": "ANAT199"
      },
      {
        "index": 123,
        "rating": 4,
        "difficulty": 3,
        "comment": "oh what a bunch of whiners!  yes there is a bunch of information, but if you go to class, and study, its more than managable.",
        "course": "ANAT199"
      },
      {
        "index": 124,
        "rating": 5,
        "difficulty": 2,
        "comment": "People are way too hard on Dr. Burgoon. Yes, there's a lot of information, so studying DAILY is a must for any anatomy class. She does move through material very quickly. Nothing is on her tests that she has not gone over. She is quite busy, so her interest level in helping you is pretty low. Also, tests are not cumulative, which is a huge plus.",
        "course": "ANAT199"
      },
      {
        "index": 125,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take her class.  She is extremely difficult and her class was more information than the Anatomy 200 class.  She is willing to fail you.  Avoid her.  She gives way too much information on top of the powerpoints and the lecture notes she gives.",
        "course": "ANAT199"
      },
      {
        "index": 126,
        "rating": 2,
        "difficulty": 4,
        "comment": "Even coming to class everyday won't help you with this course.  There is a huge amount of information she expects you to memorize.  I realize it's a college course, but it was just ridiculous.  She could care less about helping/making the class easier to learn.  Avoid her if you can!",
        "course": "ANAT199"
      },
      {
        "index": 127,
        "rating": 2,
        "difficulty": 5,
        "comment": "She just gives student way too much information to learn and memorize. on top of all the information, her exams are only 50 questions (worth 2 points each) and they are all mostly application questions! so she expects students to not only memorize an incredible amount of info but also be able to apply the knowledge in a span of 2 weeks!",
        "course": "ANAT199"
      },
      {
        "index": 128,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have had at OSU thus far.  She is impossible to comprehend when she speaks.  She mis-pronounces more words than I can count.  Exams are not fair and are way too specific for the large amount of info covered.  She absolutely refuses to help students.  I asked her for help after class one day and she told me to pay my TA to help me.",
        "course": "ANAT199"
      },
      {
        "index": 129,
        "rating": 2,
        "difficulty": 5,
        "comment": "The class went way to in depth for a basic anatomy class.  She expected way too much on her tests than was presented in class.  She talked quick and crammed too much information into the little time that was available.",
        "course": "ANAT199"
      },
      {
        "index": 130,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was very difficult...study A LOT, keep up with the work and don't fall behind!  I recommend studying daily, do NOT try to cram before the exams (there's way too much material to do that and pass). The exams were more application focused than strictly diagram memorization. Good luck!!",
        "course": "ANAT199"
      },
      {
        "index": 131,
        "rating": 2,
        "difficulty": 4,
        "comment": "The class went more in depth then it should.  This class is just supposed to be Anatomy, but the test included alot of Physiology as well.",
        "course": "ANAT199"
      }
    ],
    "SEI": []
  }
]