[
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Arabic",
    "firstName": "Bradley",
    "id": "VGVhY2hlci0yNTczNjE0",
    "lastName": "Brincka",
    "legacyId": 2573614,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Had him for Arabic. Very polite and eager to help students in or out of class. Encourages you to step out of your comfort zone and participate. The class is pretty interactive, so be prepared to speak or write on the board. Likes to joke around a little and isn't overly-serious, but he's passionate about the helping people learn the language.",
        "course": "ARABIC1101"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "His class is a joke. He made the course so easy that I'm spending my time in upper level Arabic courses playing catch up. He does not use slides, doesn't update the due dates of Canvas, and was absent for basically a quarter of the semester. Take any other professor if you actually intend on learning something.",
        "course": "ARABIC1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.9,
    "department": "Arabic",
    "firstName": "Marite",
    "id": "VGVhY2hlci0yMDcyNDEz",
    "lastName": "Labaki",
    "legacyId": 2072413,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Marite is amazing. I have had difficulties with a particular professor in the department, but she was a breath of fresh air. She is so understanding, thoughtful, and accommodating. I had a tough time this semester outside of classes, and she was there to make it easier and helped me. If she is an option for your Arabic classes, always pick her!",
        "course": "ARABIC2111"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Labaki is one of the finest in OSU. I am glad I took her class coz I heard she's the best if you wanna learn Arabic. She proved that 100% I loved being in her class, as she is very knowledgeable and knows how to capture everyone's attention. The class material is demanding and she grades fair, which means that I worked really hard for this A!",
        "course": "ARABIC1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you take Arabic, there's no better professor than Marit&eacute;. She is genuinely one of the nicest people I have ever met, not an exaggeration. A rate-A human, nationally recognized scholar, and a great prof, she breaks down a difficult language well. The class is fairly tough and has a lot of homework but she's VERY lenient with late HW/assignments.",
        "course": "AR1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's the best Arabic teacher you could hope for. It's a lot of work, but you have no choice but to learn a lot in her class. She knows a ton about teaching languages, and about interacting with all kinds of students. She's sweet, direct, and very smart. Never leaves you confused or feeling helpless.",
        "course": "ARABIC1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marite deeply cares for her students and is an absolute pleasure to be around. There is homework quite often, but it is usually completion and effort based. Very accessible through email and Skype especially on the nights before tests. Grades very clearly and fairly  and gives EC.  One of my favorite teachers overall.",
        "course": "ARABIC1102"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Marite is very helpful and willing to take extra time helping you if you need it. She can be confusing at times but if you show her you are trying she will help you out. Lots of homework but most is just for completion. Her quizzes aren't bad either, she always gives guidelines of exactly what is expected. Easy A if you just show up and do the work",
        "course": "ARB1102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best Arabic teacher I've ever had! Extremely patient and very helpful.",
        "course": "ARABIC1102"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Marite is hands down the best Arabic professor I have ever had at OSU. She is so helpful that she will skype with students to prepare for projects and tests. She is very passionate and talented, and makes learning this difficult language a little easier.  She has high expectations but makes her students want to succeed.",
        "course": "ARABIC3105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.9,
    "department": "Arabic",
    "firstName": "Chris",
    "id": "VGVhY2hlci0xNDc4Nzky",
    "lastName": "Stewart",
    "legacyId": 1478792,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Extremely friendly professor, his course is really enjoyable and stressless.",
        "course": "cse3244"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Stewart is an excellent professor at Ohio State.  He really cares about his students and wants to make sure that everyone is successful in the course.  The course material can be difficult at times, but reaching out for help is never an issue.",
        "course": "cse3244"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof Stewart was great, but the course is a little hard to grasp.",
        "course": "CSE4471"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great teacher. Had him before and this class and the others were very challenging. He expects a lot, so don't take him if you want to just pass a language class- you will work! He is very into grammar and has studied it in depth (not just a GTA) so he is qualified to teach this advanced of a course. Nice guy too.",
        "course": "ARAB205"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent professor. Always willing to offer students his time to help them understand the material. Very friendly and understanding. Perhaps the best professor I've had at Ohio State. Hope to have him in the future. Do your work, ask him questions, study and you are guaranteed to do well.",
        "course": "ARAB104"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Extremely energetic and helpful teacher. I have had very few instructors with his level of passion, especially at the college level. He cares deeply for his students, and will challenge you day in and day out. However, he rewards those that put in the hard work greatly. So, go to class, work hard, and you'll do great.",
        "course": "ARABI103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is hard and he makes sure you are always accountable for your work.  He accepts nothing but your best and doesn't take excuses.  He didn't respond to some e-mails which was a little concerning but he was always willing to help and I never felt overwhelmed, only challenged.If you put in the work, you will get a lot out of this class.",
        "course": "ARA103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Cares so much about his classes and students-- will stop at nothing to help students succeed.  His enthusiasm for Arabic is contagious... definitely recommend!",
        "course": "ARAB102"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "My favorite professor. His classes are intense because he &quot;over-teaches&quot; his students but he explains concepts so well I'm grateful he taught me the picky and complicated Arabic grammar that I now understand. A great teacher. He loves sharing stories which makes his class enjoyable - sometimes you just have to grin and bare his jokes.",
        "course": "ARABI103"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lots of information presented, but has extensive office hours to help you with material. Does not suffer fools gladly. Great teacher, loves grammar, loves the Arabic language.",
        "course": "ARABI103"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very energetic, willing to help, class moves very quickly, must attend class or you will miss a lot of information.",
        "course": "ARABI101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Energetic and fun teacher - recommend his class to anyone.",
        "course": "ARABI103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 4.3,
    "department": "Arabic",
    "firstName": "Shahreena",
    "id": "VGVhY2hlci0xMTA0ODg2",
    "lastName": "Shahrani",
    "legacyId": 1104886,
    "numRatings": 29,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is not as difficult as 1102, because for the most part its a review and cumulation of all of the information taught in 1102. It's a really nice experience taking this class, especially if you've taken the two before it; the professor works really hard to create a community feeling in the class, and it actually does feel like one.",
        "course": "ARABIC1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is definitely more difficult that 1101, and you will have to work to stay on top of everything, but it doesn't ever seem impossible. One of the best things about this professor is that she is constantly working just as hard, or harder, than you are, and the classes never feel like impersonal lectures.",
        "course": "ARABIC1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Shahrani is very intimidating at first, but she is a very dedicated teacher and it soon becomes clear that she just expects you to try your best. She is very willing to put in the time to help you out on a personal level and make sure you're on track. I would describe this class as hard but achievable; sort of a tough-love approach.",
        "course": "ARABIC1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Took 1101-1103. if you are trying to truly learn Arabic she is the one you wanna take it with. Classes reliant on group work, textbooks mandatory, lots of hw, but also most rewarding classes I have taken. Very friendly and success driven person. If she sees you put the time in she will go above and beyond for your success, my fav professor at OSU!",
        "course": "ARAB1103"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Shahreena is passionate about Arabic and does make herself available for extra help outside of class, but she is by far the most condescending professor I've ever had. I felt like I was in high school. Lots of unnecessary group/partner assignments and a ridiculous amount of (daily) hw. Way too much work for what the class was. Would not recommend.",
        "course": "ARABIC1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Shahrani is a very nice professor and person. She cares for each of her students and cultivates a welcoming community. Be prepared to participate, show up, and do your many assignments, but she does not make things unnecessarily difficult. Those who need help can access loads of it. I'll miss Ustaadha and would take one of her classes again.",
        "course": "ARABIC1101"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "She really cares for the performance, learning and well being of her students. The course is just too difficult and too much work for a GE.",
        "course": "ARAB1101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "really great teacher to start arabic with grading is set up so if you do homework and try you'll get a decent grade like really do the homework though and go to class",
        "course": "ARABIC1101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Shahreena is one of the best professors that I have had. Expect to do a lot of work outside of class and expect the quizzes to be challenging. While getting an A is not easy, Shahreena really cares that her students do well. She is very accessible outside of class and gives extra credit opportunities. I really feel like I learned the language.",
        "course": "ARAB101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Shahreena is an extremely hard professor, but you will learn a ton from her. She expects nothing but the best out of her students, but is also very compassionate. She takes genuine interest in her students' lives and makes sure to keep class interesting by relating topics to youth culture. Homework usually takes about 3-4 hours, but it will pay off",
        "course": "ARAB1101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Shahrani will make you work harder on your papers than any English professor. She is fair and gives a lot of feedback but, she's really strict on her grading. I really thought I was going to fail but she worked with me during her office hours so I pulled out an OK grade. She does give some extra credit. This is a tough clas s for a GE.",
        "course": "2241"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "I really enjoyed this class, be prepared to work hard. Shahreena grades pretty tough, especially on essays. Spelling in this class is CRUCIAL, definitely make sure you know relevant names and specific dates. I would recommend this class if you want to pursue anything with Middle Eastern affairs, the course provides a great foundation to build off. ",
        "course": "2241"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Shahreena is a tough but fair grader. She will do her part to prepare you for the quizzes and exams but you have to work for the grade. There are a few extra credit opportunities that you will want to do to boost your grade a little. Keep up with the readings and participate in class discussions. She goes through things fast, be prepared for class.",
        "course": "2241"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 5,
        "comment": "Each week you are required to take 1-2 pages of notes, in all honesty this was helpful to me. Although she grades very tough on papers , and did not point out where you went wrong in the paper. She has an abrasive style of teaching, her style is similar to an aggressive boss at work. Some thrive under that type of management, but I'm not one.",
        "course": "ARABIC2241"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 5,
        "comment": "Shahreena is very condescending. She treats you like you're in high school. She gives quizzes on learning students' names and docks points for everything. She loves to hear herself talk and doesn't care about the input of other students. She has a superiority complex and belittles you in class. Absurd grader and absurd amount of work for a GE.",
        "course": "ARABIC2241"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "I LOVED this class and I LOVED Shareena.  She is an awesome professor who loves what she teaches. She is very Enthusiastic about the subject and is VERY knowledgeable.  She is also very helpful and encourages everyone to come to office hours.  She is a hard grader especially when it comes to writing papers. Highly suggest her! You learn a lot!",
        "course": "ARAB2241"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 5,
        "comment": "I am checking on professors for next semester.  I decided to rate this one.  She is tough and she makes you work hard.  She is not easy.  I learned a lot.  She is a good professor.",
        "course": "ARABC241"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 5,
        "comment": "It's just like everything I hear about her class. Even though I got a B I had to work hard for it and I thought I was going to fail half the time.",
        "course": "ARB241"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "tough grader on papers",
        "course": "ARABI2241"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "The teacher is is a great instructor and I recommend this class from this instructor.  She assigns a little too much work for a GEC class but everything covered was good material.  She read all of my work and left a lot of good feedback. She answers questions and is enthusiastic in class and in office hours.  I would take her classes again.",
        "course": "NELC241"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class wasn't too hard but it did involve a lot of reading.  The instructor was really enthusiastic and covered a lot of different views and used a lot of different media.  Class time was spent covering topics and in discussion and is not boring.  She doesn't waste class time and has really good office hours.  I highly recommend this class.",
        "course": "NELC241"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 5,
        "comment": "Great teacher, very hard grader. If you take this, expect to learn a lot of Arabic, but expect your GPA to take a hit. Will help students willingly though.",
        "course": "ARAB101"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Shahrani is a pretty cool professor. I liked the class but I probably wouldn't have signed up if I'd known how much writing there was going to be. The class covers a lot.  I learned a lot. I know how to write a good paper.  _Not all GE classes are the same but you get out what you put in._ Take the class, get the joke. Thesis Statement.",
        "course": "NELC241"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is not a usual lecture class. She gets to know students and uses a lot of books, movies, internet in class and there is a lot of reading and she grades TOUGH on writing.  All tests and quizzes come straight from material and notes and she teaches on stuff you don't hear about in other classes. I suggest this class to friends. She is fair.",
        "course": "ARAB241"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is the worst teacher I have ever had in OSU. She gives us a lot of HM and a short time to do it (less than 12 hours) do not take this course with her",
        "course": "ARBC241"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 5,
        "comment": "She is a tough teacher and a nice teacher.  She explains everything and she answers questions very well.",
        "course": "ARABI102"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 5,
        "comment": "I have learned so much Arabic this quarter!  My old professor didn't push any of us nearly as hard as Professor Shahrani did but I really got my money's worth out of this class.  I will take any of her classes in the future.  In her class I really felt like I was learning Arabic.",
        "course": "ARABI102"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 4,
        "comment": "Her class is not easy but it isn't too hard if you keep up on your work.  However, when you get through her class and you start taking other Arabic classes you will find that you have learned a lot.  I would take her classes in the future without a doubt.  She's tough but she's fair and puts in extra work that other prof's don't.  DO YOUR HOMEWORK!",
        "course": "ARABI102"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's a great teacher and knows what she's doing. Pushes you a little to much for a 101 class but it's worth it in the long run. Nice, and always willing to help.",
        "course": "ARABC101"
      }
    ],
    "SEI": [
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "22385",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.6,
    "department": "Arabic",
    "firstName": "Hekmat",
    "id": "VGVhY2hlci0yNTQ3MzY4",
    "lastName": "Dirbas",
    "legacyId": 2547368,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor! really wants students to be able to understand the language. ",
        "course": "ARABIC1101"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Overall, it was a pretty straightforward and easy class. Just make sure to participate in class.",
        "course": "ARABIC1101"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "It was an easy class, but he was so mean. He would pick on me when I got the answer wrong. Easy grader, but was kinda full of himself. You have a lot of homework, but it's expected. ",
        "course": "ARAB1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hekmat is a good professor that cares about his students learning and succeeding. If you show up on time and put in good effort during his lectures and on the homeworks you will do well. Attendance is important in his class and if you don't show up or even show up late it'll hurt your grade significantly. ",
        "course": "ARAB1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dirbas does a great job of teaching Arabic and making sure everyone is progressing and learning as we go along. If you attend class and do the homework(around 1 hour a week), you should be able to get an easy A.",
        "course": "ARABIC1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Dirbas  is dedicated, organized and encouraging and wants to see his students succeed in Arabic.  Punctual attendance and class participation are mandatory.  Dr Dirbas specifies what will be covered on quizzes and exams  and provides study materials geared to these topics. The curriculum proceeds quickly and it is important not to fall behind.",
        "course": "ARABIC1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "clear and very helpful explanations on mistakes on exams and quizzes. More than grammar and vocabulary were insights into culture, music, calligraphic art, architectural structures and poetry. Also, while the textbook is good, his explanations of the grammar were better for understanding. He loves language and is clearly dedicated to help students.",
        "course": "ARABIC1102"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT take this class with the professor. He does not care about his students. The worst professor I ever had at Ohio State.",
        "course": "ARABIC1101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never met such a hardworking and sympathetic professor before. He always strives to help his students succeed in the class. His lectures are efficient and organized, and the assignments do not take much time to do. As long as you show genuine effort and attentiveness, it'll be an easy A. Professor Dirbas is truly the best professor at OSU. ",
        "course": "ARAB1103"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "He is terrible. He is full of himself and will go on tangents about what angers him for no reason. He assigns SO MUCH homework. If you're a bit slow, chances are he will humiliate you in front of the whole class. If you have anxiety, you will hate his class. Most of it is us learning on our own and reviewing it with him. Survived it somehow.",
        "course": "ARABIC1102"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "He's a good teacher and is kind, but the class is heavily based on drills and participation. He also gets mad if no one participates which makes the class scary. It got so bad last semester, the head of the department was contacted from my class. He loves the textbook and the class basically consists of doing drills as a group and then as a class.",
        "course": "ARAB1103"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Really great professor who simplifies the language well. He really cares about his students success and will make sure everyone understands before moving forward. Takes participation very seriously but not hard to get the participation points. Auditory based teaching style.",
        "course": "ARABIC1101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "He has very specific expectations, but if you listen in class and you pay attention to the lectures, it's easy to understand what kind of work he wants from you. He really values participation and punctuality, and he's good about responding to emails or staying after class to answer questions. Overall, a passionate and understanding professor!",
        "course": "ARAB1102"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "He never overloads students with homeworks and assignments, and he's very understanding and cares for the success of each of his students. He makes Arabic easy to understand, and you will get an A as long as you participate in class and show an honest effort!",
        "course": "ARABIC1102"
      }
    ],
    "SEI": [
      {
        "Subject": "ARABIC",
        "Catalog": "1103.02",
        "Class Name": "Intermediate Modern Standard Arabic I: Intensive",
        "Class Number": "23335",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "12581",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.31"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "12582",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.75"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "12583",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "2.78"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "28132",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.71"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "16314",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.33"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "16316",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "4120",
        "Class Name": "Arabic Media",
        "Class Number": "16319",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "3.25"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "23364",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "10605",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.7"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "10607",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.43"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "23711",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.31"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "10455",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.17"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "10456",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.7"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "10458",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "4120",
        "Class Name": "Arabic Media",
        "Class Number": "10460",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.02",
        "Class Name": "Elementary Modern Standard Arabic I: Intensive",
        "Class Number": "19617",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "3"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.02",
        "Class Name": "Intermediate Modern Standard Arabic I: Intensive",
        "Class Number": "19619",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.11"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "14755",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "14757",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "26780",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.43"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "17021",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "17023",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.33"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "30587",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "28969",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "17483",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2101",
        "Class Name": "Arabic Grammar I",
        "Class Number": "36879",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2241",
        "Class Name": "Contemporary Arab Cultures: Arts, Mass Media, Society",
        "Class Number": "29689",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.73"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Arabic",
    "firstName": "Manal",
    "id": "VGVhY2hlci0xMjU3NzUy",
    "lastName": "Habbal",
    "legacyId": 1257752,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "SUPER STRICT GRADER",
        "course": "EDTL1902"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Beautiful teacher inside and out and very helpful",
        "course": "ENG101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "good teacher!",
        "course": "ENG101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had Manal for Individual Study. Although most work was done out of class, Manal always helped with questions and did an excellent job of clarifying an often complicated language. I Strongly Suggest taking Arabic with her!!",
        "course": "ARAB101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Manal is great. If you really wanna learn take her class plus she makes good baklava",
        "course": "ARAB104"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Manal is an awesome teacher!! She does everything she can to help you and make sure you understand the grammar. She's a really nice person, too. I'll really miss having her as a teacher. Take her if you get the chance!!",
        "course": "ARAB104"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "She was a really nice teacher, always willing to help whenever you had questions. Even though Al-Kitaab isn't the best textbook (I hate Maha and Khalid), it's the best out there. Manal tried to make Arabic fun in 103, so I decided to take her for 104, which I'm now in. I recommend her! =)",
        "course": "ARAB103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome! Awesome! Awesome! Makes learning such a difficult language fun and interesting. She tries her best to answer every question that comes her way and does a great job in doing so.Her goal is to help you learn the language and she actually cares about how her students are doing. Great professor I would recommend no one else to take Arabic with",
        "course": "ARABC103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Manal Is by far one of the best in the arabic department. Cares about her students and a clear explainer. Tests are kinda hard but if you study you'll be fine",
        "course": "ARABI103"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 4,
        "comment": "I liked her when I had 101. In 103 she was pretty lousy. The arabic tract is kinda lousy because of the book being used, but Mannal was pretty bad at explaining the grammatical concepts to us. She was enthusiastic, just poor in teaching. After the midterm around a third of the original class was gone... dropped or was failing.",
        "course": "ARABI103"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very knowledgeable and organized teacher.Makes learning the language fun. She is very helpful if you have questions Def. would recommend.",
        "course": "ARAB102"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "I have had her for 101 and 102 and I love her! She is so nice and adorable. I talked to a girl from my 101 class with a different teacher for 102 and she said she wished she could switch back. She's very helpful and straightforward. Cares a lot about her students. Tests are always straightforward but you really need to go to class to understand it!",
        "course": "ARABI101"
      }
    ],
    "SEI": [
      {
        "Subject": "ARABIC",
        "Catalog": "1101.02",
        "Class Name": "Elementary Modern Standard Arabic I: Intensive",
        "Class Number": "23333",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "17696",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "37242",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "27729",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "3.13"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "37651",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "4.17"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "1901",
        "Class Name": "Advanced English as a Second Language",
        "Class Number": "7611",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.93"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "36964",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.77"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "36968",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.75"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "1902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "30695",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.91"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "1902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "30699",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.64"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "1902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "36010",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.6"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "1901",
        "Class Name": "Advanced English as a Second Language",
        "Class Number": "32172",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.85"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "34361",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.67"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "34363",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.82"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "34364",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.36"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "13028",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.33"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "13033",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.73"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "15055",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.91"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Academic Writing in English as a Second Language",
        "Class Number": "15415",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Advanced Academic Writing for Multilingual Graduate Students",
        "Class Number": "15313",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "5"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Advanced Academic Writing for Multilingual Graduate Students",
        "Class Number": "15316",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.73"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Advanced Academic Writing for Multilingual Graduate Students",
        "Class Number": "13509",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.55"
      },
      {
        "Subject": "EDUTL",
        "Catalog": "5902",
        "Class Name": "Advanced Academic Writing for Multilingual Graduate Students",
        "Class Number": "13645",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "School of Teaching & Learning",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.78"
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Arabic",
    "firstName": "Gergana",
    "id": "VGVhY2hlci0yMDE3OTE2",
    "lastName": "Atanassova-Boft",
    "legacyId": 2017916,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is super sweet and cares about the success of her students. HW assignments are not graded till the end of the semester though so you don't know what you did right or wrong. While she was super nice I think I would've learned more with another professor. Attendance is not mandatory and class often gets canceled. ",
        "course": "ARAB1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Geri is a great teacher. You can tell she is passionate about what she teaches, and she explains concepts clearly. She is always available outside of class. The homework is manageable and she gives grace periods. The tests take a while to be graded though. She managed to fit a lot into 1 semester and did it in a way where it wasn't too hard. ",
        "course": "ARABIC1101"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "Class so far is ok but her grading criteria is never clear. She even sometimes gets annoyed if we ask her questions during lecture. Canvas page and her \"whiteboard\" doc is all over the place too. She seems like a nice person but it feels like she is never prepared to teach us during class. ",
        "course": "ARAB1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "BEST GE course! Lots of content but she made it enjoyable. Highly recommend. ",
        "course": "ARABIC2241"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing class, amazing lecturer. This was only a second session course that I took last moment but it turned out to be one of the best courses I've taken at OSU. Dr. Geri made the material relevant to everyone and so interesting! Totally accessible outside of class, great feedback on assignments and very flexible. I'm taking more classes w/her. ",
        "course": "ISLAM3205"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "She's a sweet teacher and person but class was often canceled last minute, which threw off the schedule for the class. She also doesn't know Arabic? My dad is a native speaker and told me she was just straight up wrong about a lot. She's not a native speaker and you can tell. Also the class had a confusing structure and I didn't learn very much",
        "course": "ARABIC1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "The best Arabic Professor out there! She is really caring and patient and is really helpful when you ask her questions in class. I really learned a lot from her and even though there was a lot of homework, she was accommodating and allowed for late submission.",
        "course": "ARABIC1102"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "I've had Geri for 4 semesters and she has always been a very clear and generous grader. Very patient. She really wants you to succeed. Class is what you make it. She puts effort into it, lots of culture, music, videos, food. We read books and not just stupid Maha. But it's still a college class, not entertainment.",
        "course": "ARABIC2104"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "Takes years for her to grade just ONE assignment, assigns TOO much homework, and takes points off for no reason. Tells you to buy the textbook but uploads a picture of each drill on Canvas. Class is very boring as well.",
        "course": "ARABIC1102"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "She really just wants to see you succeed. There is homework every night, but it isn't excessive, just a worksheet normally. If you have a question, she'll take class time to answer. Sometimes she's a bit discombobulated and classes weren't very productive. If you participate, you'll get a lot more out of class. She includes culture lessons too",
        "course": "ARABIC1101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fantastic professor! A heads up: she take a while to grade assignments and exams.",
        "course": "ARAB1102"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was a great professor 10/10 would take it again!",
        "course": "ARAB2101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Geri is extremely knowledgeable and very clear about what she expects from her students. She's always willing to answer questions and she presents the material in a way that makes it accessible to everyone. Shes one of the most understanding and caring professors Ive had at OSU.",
        "course": "ARAB1102"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 5,
        "comment": "Not an easy class. Homework every day sometimes multiple homeworks in one day. Way too much work for a GE class. left no time for other coursewprk. Textbook an online drills pretty bad and expensive. Shes nice though.",
        "course": "ARAB1102"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's amazing! She assigns very little homework, yet still teaches you the language well. She clearly loves Arabic and teaching. She really cares about her students and spends a lot of time ensuring that they do well. But you need to be there in order for that to happen! Tons of extra credit opportunities and super flexible!!",
        "course": "ARABIC1101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved her! She gives an enthusiastic and inspirational intro to the arabic language. It's clear she's very passionate about it. She gives daily homework but it usually isn't too hard, and neither are the tests if you actually show up tp class and do your homework. She's so helpful and sweet, uses the language a ton in class. 100% would take again",
        "course": "ARABIC1101"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's been my favorite professor here at OSU. She cares very much about her students and it's obvious her opinion has a lot of weight in the department. Like most OSU language classes, the content is not particularly difficult but there's a lot of work. She is more than willing to work with you if you are struggling. Overall amazing teacher.",
        "course": "ARABIC1103"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "My favorite class this semester.",
        "course": "ARABIC1101"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Geri gave me a great introduction to the Arabic language. She was caring and helpful, but her consistent tardiness and lack of follow-through left me frustrated at many times. At the end of the day, I learned a lot, but to get the most out of this course, she is not the most advisable choice of the professors at OSU at this level.",
        "course": "ARABIC1101"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Geri cares about what she is teaching and is always wiling to answer questions. You are taking a foreign language class so it will be difficult, just stay up to date on vocab. I have had Geri for 3 semesters and so have many other people in class.",
        "course": "ARAB1103"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is the second class that I have taken with Professor Geri and she is INCREDIBLE. She is a great and accommodating lecturer and really helps in office hours. It is clear that she wants you to pass but it IS NOT an easy class even for some heritage speakers. KNOW THE VOCAB and study! If you don't care about this class you will not pass.  ",
        "course": "1102"
      }
    ],
    "SEI": [
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "12579",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.67"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "25690",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "20102",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "22386",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "16315",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.85"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "29177",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2104.01",
        "Class Name": "Intermediate Modern Standard Arabic II",
        "Class Number": "16318",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "10457",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "23303",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2104.01",
        "Class Name": "Intermediate Modern Standard Arabic II",
        "Class Number": "14297",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2241",
        "Class Name": "Contemporary Arab Cultures: Arts, Mass Media, Society",
        "Class Number": "23379",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.6"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "14758",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "14759",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "17022",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.71"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "28719",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2104.01",
        "Class Name": "Intermediate Modern Standard Arabic II",
        "Class Number": "20518",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "2241",
        "Class Name": "Contemporary Arab Cultures: Arts, Mass Media, Society",
        "Class Number": "19810",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.75"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "17694",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1101.01",
        "Class Name": "Elementary Modern Standard Arabic I",
        "Class Number": "17695",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.33"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1102.01",
        "Class Name": "Elementary Modern Standard Arabic II",
        "Class Number": "17482",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.73"
      },
      {
        "Subject": "ARABIC",
        "Catalog": "1103.01",
        "Class Name": "Intermediate Modern Standard Arabic I",
        "Class Number": "28344",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Near East S Asian Lang/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.64"
      }
    ]
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 5,
    "department": "Arabic",
    "firstName": "Clint",
    "id": "VGVhY2hlci0xNTgyODQ0",
    "lastName": "Hackenburg",
    "legacyId": 1582844,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hackenburg is the best professor I ever had. 10/10 teacher. Would highly recommend. ",
        "course": "ARAB101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint was great. All around good instructor, helpful, funny, serious when necessary, and very knowledgeable. Likes class discussion almost every class. ",
        "course": "INTROTOISLAM"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Take Arabic with Clint. He's very passionate about the Arabic language and his enthusiasm is infectious. Overall, he's very helpful (ex. he would usually hold study sessions before tests) and interactive (he invites the class out for events). The language is a bit hard, but nothing anybody can't handle, especially with Clint as your instructor. ",
        "course": "1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Clint is simply the best teacher you can ever get! This was his first time teaching intro to Islam and I quite enjoyed the class. The material is dry but he makes it very enjoyable (he's hilarious). One quiz a week and they're extremely easy if you do the readings. Midterm was fairly easy and open notes. There's a final paper 6-10 pages. Easy A!",
        "course": "NELC3501"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Arabic is a tough language but Clint makes it enjoyable. He keeps class interesting with his wacky sense of humor and stories about living in the Middle East. Before tests, he has study sessions and if you go to class and do homework you will do well. He goes above and beyond and wants everyone to succeed and love Arabic as much as he does.",
        "course": "1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is an awesome guy and teacher. By far the best foreign language instructor I have ever had; he makes an extremely difficult language fun and easy (relatively) to learn. He will meet with you any time you want and will help with study abroad applications. Study the material and you will do well.  ",
        "course": "ARABIC1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "The most wondeful person you'll ever meet. Literally gave us his Skype contact information, in case we had questions and didn't want to walk to his office. Class isn't easy, but he would do anything in order to help you succeed. Generally just the most delightful person you'll ever meet.",
        "course": "ARABIC1102"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint was without a doubt one of the best teachers I've had at OSU. He loves Arabic and is willing to help anyone out, even after I no longer had him as a teacher. His stories/nerdiness make class even better. Not an easy A, but you'll get a lot out of it if you put the work in. Definitely take Arabic w/Clint if you can.",
        "course": "ARABI102"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of THE best teachers I have had at OSU. Very passionate about Arabic not only as a language but also the culture. He has entertaining stories and the culture he shares helps a lot with learning. Willing to help anyone, definitely recommend. His accent is also very good for a non-native speaker",
        "course": "ARABI101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher, but the class is hard. Just study hard and go to his office hours and you'll get a good grade. He's a very lenient grader too.",
        "course": "ARABI102"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 5,
        "comment": "Clint was a really great teacher. Arabic is an extremely difficl language but he was always willing to meet with you during office hours. As long as you do the homework and come to class you should get an upper level grade in the class. I would recomend anyone taking arabic to take Clint.",
        "course": "ARAB101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 5,
        "comment": "Clint is a wonderful professor, and will do just about anything to help you out. He legitimately loves everything about Arabic and is entirely American, so he speaks plain english. Unfortunately, Arabic is very very difficult. If you're going to take Arabic, take it with Clint. But remember, this class is highly intensive",
        "course": "ARABI101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.3,
    "department": "Arabic",
    "firstName": "Zuhair",
    "id": "VGVhY2hlci0xMTc1MTA3",
    "lastName": "Alidib",
    "legacyId": 1175107,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Terrible professor. Will embarrass and call you out on the spot. Has no rubrics or syllabus to reference on so you don't know why you got the grade you did. Don't take this course unless you have to!!!",
        "course": "ARBIC367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Super great processor. He's really funny!",
        "course": "FRENCH1801"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a really good prof!",
        "course": "110202"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible teacher. doesn't care if you do well, only cares about filling he next semester class with students. he will ask you to tell your friends to take he class. he only spends 2 days on each chapter of the French book so you learn the alphabet in French in 2 days. and then he gives you a 300 point test the next class over everything.",
        "course": "FRENCH110201"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "don't take this teacher.he never gives test when they are scheduled, you just show up to class and hes like \" oh. we will take it next class\" after you have studied for day's. he also don't explain thing properly and the examples he give don't help you in class. everyone I talked to told me not to take him. and I didn't believe them, but now I do",
        "course": "110202"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I totally recommend his class, very knowledgeable and super helpful and clear lecture. In order to receive good great need to work a bit harder to earn it. He is funny and like to listen to others when they have questions and also far with grading. My favorite professor ever.. I would take his class again !",
        "course": "ARABI104"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "try to avoid him if possible!even tho he loves discussions, hes really closed minded, basically forces u to believe in what he believes in. lenient towards ppl he knows (esp girls) and harsh on the rest. u actually have to work super hard to get an A.",
        "course": "ARBIC367"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "really funny and very easy to get good grades with  an open attitude and a little hard work",
        "course": "ARABC241"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "easy professor if you have a interest or background in Arabic. very helpful!",
        "course": "ARABIC104"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great Prof who will help you a lot",
        "course": "FRENC104"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is best Professor i ever had",
        "course": "ARABI102"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "ARABI367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.1,
    "department": "Arabic",
    "firstName": "Hisam",
    "id": "VGVhY2hlci0xMTExMzYy",
    "lastName": "Elaqad",
    "legacyId": 1111362,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easily the best professor I have had in my four years here. He grades on effort, so really do try your best. Hisam is a lovely man, and hilarious. I loved all of his classes. Also, make sure you do your homework because he notices when you do it and he does factor that into your grade.",
        "course": "ARABI202"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "Professor Elaqad is not the best teacher, and I had to learn a lot by myself or with the help of TAs. However, he is extremely dedicated to his students and will help in any way that he can. He will even FaceTime with his students on weekends. He is also a lenient grader- if he sees you putting in the effort, he will help out.",
        "course": "ARAB1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hisam cares about his students' success and is always willing to make extra time at his office to help. He grades mostly on effort, so as long as you show up, do your homework (he check's a lot), participate in class, and study, you'll do well.",
        "course": "ARABIC4120"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had Hisam 4 times since my minor was Arabic. Very tough but work hard and you will get a good grade guaranteed. He mainly grades on effort. Don't show up late or skip class all the time cause he will ask you why in front of everyone! The grammar classes are very hard but you will not find a better Arabic teacher on campus when it comes to Hisam!",
        "course": "ARAB205"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I learned more in this Arabic class than in any other Arabic class I've taken. Hisam is a good teacher and really pushes you to learn. It is a lot of hard work but if you do the work it is rewarding. Hisam can sometimes come of as rude but he is generous with extra credit, is hilarious, and keeps the classroom atmosphere very casual. ",
        "course": "ARAB1102"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Hisam will rarely give you any grades or telling you how you are doing. He grades people on their effort. So as long as you come to class and do the homework everyday (which is a lot) you will be fine. If you don't, regardless of how good you are at Arabic, don't expect a good grade.",
        "course": "ARABIC4106"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Elaqad is excellent. He cares about his students. I learned a lot from him. He is fair and will reward hard workers.",
        "course": "ARA4111"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "Hisam is extremely rude and he appears to think that studying abroad is a requirement to take his classes. His exams are ridiculous and don't always cover material given in class. He is also extremely rude to certain students and doesn't care to provide help or resources outside of class. He is the worst professor I have ever had to deal with.",
        "course": "ARA4111"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 5,
        "comment": "He is very moody*. He assigns a ridiculous amount of homework that is impossible to complete then he doesn't go over it in class but expects you to know it. I did not feel encouraged by him and meeting with him was uncomfortable and degrading. He called other students out in class about non-related issues and was very rude. I didn't enjoy him.",
        "course": "ARABI603"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher, one of the best at OSU",
        "course": "ARABI401"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's a tough teacher and if you're not willing to show up, there is no way you're going to pass. However, if you put in the effort, you'll be fine. He really cares about his students and explains the material very well. He's intimidating some days and cheerful others so just be careful with him!",
        "course": "ARAB205"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hisham genuinely cares for his students and is passionate about what he teaches. He is one of the best professors I ever had and I highly recommend him. If you are lazy do not take Arabic, it requires a lot of time no matter what class you are in.",
        "course": "ARABI205"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "he's extremely distracted. there's no rhyme or reason to his grading, and grades based on his mood. One exam we took, he marked off more than the exam was worth. He also likes to pick on some people. One good thing about him is his jokes, although he can be quite bipolar.",
        "course": "ARABI202"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Hisam is very friendly and understanding, and constantly stresses that the class is about learning more. He's usually very friendly and that makes a long class better, but occasionally he seems irritated, and if you go to his office hours he is often very distracted. But by far the best Arabic teacher OSU has. Come to class & do your work = A.",
        "course": "ARAB200"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is a grammar class and I thought it was going to be so boring but he made it interesting. He is an excellent Prof. makes the information understandable and even enjoyable. He is very helpful inside and outside class, just show up to class and read and you'll be fine. If you skip class or if the dog eats your homework, you will be embarrassed.",
        "course": "ARAB200"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hesham is a good teacher. He is always cheerful and he made class fun. He is very helpful, inside and outside class. He covered the material thoroughly and made sure we learned the topic. I would give him 11/10 and I would recommend his class to anyone interested in learning Arabic.",
        "course": "ARB205"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "I learned more Arabic in this class than in any of the past ones I've taken. I personally think that Prof. Elaqad is an excellent teacher. He is very good in explaining the hard material.",
        "course": "ARAB200"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is an awesome teacher.  His energy makes the class fun. He's very helpful in office hours too. I highly recommend him.",
        "course": "ARAB205"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hisam is an amazing teacher. He has definitely been my best and favorite Arabic teacher so far.",
        "course": "ARABI205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Arabic",
    "firstName": "Brent",
    "id": "VGVhY2hlci0xNzgwODQ4",
    "lastName": "Biglin",
    "legacyId": 1780848,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Brent is the best TA I've ever had. He is an amazing teacher and is truly passionate about what he does. He is more than willing to help and really tries hard to make sure you understand everything and are having fun while learning. He is hilarious and makes class awesome. Definitely try to take Arabic with him.",
        "course": "110201"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Brent's a great teacher, always willing to help outside of class if needed. Very knowledgeable of the culture, and has fun incorporating random lessons like music and videos. Great teacher, highly recommended",
        "course": "ARB2103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy was an amazing teacher.  He always makes time, even outside of office hours, to help, throws in culture lessons, has an excellent knowledge of Arabic, and is hilarious.  Highly recommend any class he teaches.",
        "course": "ARAB101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4,
    "department": "Arabic",
    "firstName": "Hanan",
    "id": "VGVhY2hlci0xMTM5ODE2",
    "lastName": "Kashou",
    "legacyId": 1139816,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very nice and helpful",
        "course": "ARABIC141"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class, also very helpful outside of class. Learned alot",
        "course": "ARB102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hanan is a great instructor. Has a great command of classical Arabic language. Serious, conservative. Very helpful. Promptly responded to emails. I would totally take another course with her.",
        "course": "ARAB101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Enjoyed having her as an instructor, very helpful and willing to help students.",
        "course": "ARABI103"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "hanan is nice, but that's not enough to be an excellent instructor... she does not seem interested in helping you as much as the other instructors are.. she is very unorganized and is always losing papers, tests, etc. which is not fair to the student for feedback purposes.. i always felt like she did not want to be bothered or something..",
        "course": "ARAB103"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is a great teacher, but remember: at the 200-level and beyond, the students are expected to work more independently than before, and to come to class with questions on the material and prepared to demonstrate their knowledge.  Hanan is always very helpful, knowledgeable, and understanding, but you must do a lot more work on your own!",
        "course": "ARAB205"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "extremely helpful and extremely flexible. I enjoyed having her as a professor. she is funny and makes class fun. her grading is pretty east too",
        "course": "ARAB101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "She always responded to emails and was willing to help students, she actually knows the language. Gave us enough opportunities to complete the HW and tried to make is easy for us to learn it. I don't know what a better plan for the course means  the syllabus was pretty clear and had all the work we were supposed to finish. I enjoyed her class.",
        "course": "ARABI101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "ARABI101"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not prepared for classes, took literally weeks/months to get quizzes back, never gave feedback on hw, would ask us questions then answer them herself before giving us time to think of the answers (this is 103, it takes a minute to make a good answer!), never e-mails you back, we didnt speak much in class she was nice, but i wouldnt take her again",
        "course": "ARAB103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Arabic",
    "firstName": "Nick",
    "id": "VGVhY2hlci0xNzczMzEw",
    "lastName": "Mangialardi",
    "legacyId": 1773310,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I agree with the other rater that Nick is far and away the best language teacher I've ever studied under. Very talented, funny, and creative. Also ridiculously cute and charming.",
        "course": "ARA1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Literally the best language teacher I've ever had. He's really creative with class activities, will answer all your questions, and make you laugh. A seriously knowledgeable man.",
        "course": "ARAB1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Arabic",
    "firstName": "Gevorg",
    "id": "VGVhY2hlci0xMjY1NTQy",
    "lastName": "Hunanyan",
    "legacyId": 1265542,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best teacher i ever had. By the way he is very handsome too...",
        "course": "ARABI101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ustazh Mumtaz! I would pay double to have him teach 103 and 4. Best teacher I've ever had. He broke Arabic down so easy since he doesnt speak it natively. I learned a ton and he also taught us useful vocab that we could use that wasn?t in the text book. Arabic is hard enough. Do yourself a favor and rearrange you schedule if you have to to take him",
        "course": "ARABI102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a great teacher! He is VERY lenient. However not doing the homework will lead to falling behind in class.",
        "course": "ARABI101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4.5,
    "department": "Arabic",
    "firstName": "Tara",
    "id": "VGVhY2hlci0xMzU2OTk5",
    "lastName": "Hess",
    "legacyId": 1356999,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very difficult language. I personally felt like she tried to take the class too fast.  I had other classes and maybe just didnt have enough time to dedicate even though I would do homework for hours a week in this class.  Class felt unorganized",
        "course": "ARAB102"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is super helpful and truly wants her students to succeed and share her passion for what she's teaching. I enjoyed this class.",
        "course": "ARAB101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Tara is an excellent teacher.  She is enthusiastic, fun, and very reasonable with assignments.  She has an obvious passion for Arabic and wants to pass it on to others.  If you go to class and do the work, you will get both a good grade and a good start to the language.",
        "course": "ARAB101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.5,
    "department": "Arabic",
    "firstName": "Amira",
    "id": "VGVhY2hlci0xMzk2NTUw",
    "lastName": "Alhaj",
    "legacyId": 1396550,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "she's very helpful, interactive, and engages the whole class.",
        "course": "ARAB102"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "I think she is a nice person, but not ready to teach at the university level. She grades; she doesn't teach. In class, we go over assignments from the book and that is it. She is basically a human teachers edition. Misspells easy English words on exams and emails. Exams are brutal, and often contained new words we havent learned. Doesnt use carmen.",
        "course": "ARAB102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Helpful and explains well. She doesn't check homework everyday, but we always went over our homework for the day and she asked us the answers and would correct them for us, which is nice when studying for the quizzes. Her grading is good, but the quizzes and exams are slightly harder than some of the other Arabic professors I've had. A+!",
        "course": "ARAB102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.7,
    "department": "Arabic",
    "firstName": "James",
    "id": "VGVhY2hlci0xMDk2MjU2",
    "lastName": "Steppenbacker",
    "legacyId": 1096256,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher, good class. You barely read the textbook, but discuss much in class and he goes over everything that will be on the tests. You get to watch some interesting movies and lots of controversial discussions. Take 241 if you can. He looks like Grant from the myth busters. He was really helpful 1v1 and took the time to get to know me.",
        "course": "ARABI241"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very straight forward class, the book was rarely if ever used. Good discussions in class, exams/tests are explained before exactly what is on them.",
        "course": "ARAB241"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Highly recommended. James makes the class very interesting. Grades fairly and although there is one project it is very easy and pretty fun to do. If you want an easy, interesting, and informative class take this one!",
        "course": "ARAB241"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "James is the nicest teacher i think i've ever had. he has a tendency to ramble but i think it's just cuz he knows so much about the subject. I recomend this class to anyone who wants a straight-forward GEC b/c u don;t have to guess whats going 2 b on the exams",
        "course": "ARAB241"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Awesome teacher! Very, very nice. Sometimes his teaching is a little confusing, but he doesn't move on until he knows everyone understands. He grades pretty easily, but be sure to know your stuff. He can tell if you know what you're doing or are just trying to slip by. He's very friendly and makes class easy to go to, not a drag. Highly recommended",
        "course": "ARAB102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was so knowledgeable about everything-history, culture, political current stuff.  ppl in my class had the most random questions and he would take the time to answer them. he studied in palestine too. very nice/ polite with students, allowed discussion but kept ppl from being offensive. very objective. lots of textbks, not used much though",
        "course": "ARAB241"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really nice,quiet guy. A fine teaching style for a young teacher. While he is personally objective and gracious, the class was extremely biased. Because of his kindness, Steppenbacker did a very poor job controlling students, some of which were quite disruptive. The learning environment would have been improved if dissent had been better tolerated.",
        "course": "ARABI241"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good teacher, interested in helping. He will clarify anything when asked. Assignments were easy, especially when you pay attention in class.I definitely recommend him.",
        "course": "ARAB241"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "Arabic",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0xMDQ2OTgz",
    "lastName": "Nichols",
    "legacyId": 1046983,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is really sweet, an easy grader, and willing to help. She is very understanding. I wish I could have her for all my Arabic classes. I am sad she left OSU!",
        "course": "ARAB103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "the most awesome arabic teacher at osu ever!! she is soooooo understanding and helps you in whatever way she can.. she also makes it very comfortable for you to learn..",
        "course": "ARAB102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 5,
        "comment": "One of my favorite teachers, Jennifer is willing to go above and beyond for students who show an interest and proficiency.  Always willing and able to answer questions, and provides supplementary information for those who are interested.  Smart and sassy, with a vast knowledge of the Arabic language and Middle Eastern cultures.",
        "course": "ARABI104"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "I took II with her because it was the only way for me to get 5 credits. My Arabic is better than hers. She never had the right answer for my grammar questions either.",
        "course": "INDIV000"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "Jennifer was very organized, which helped us make sense out of difficult material.  She always used Arabic in class and made us all speak.  She's the best TA I've had at OSU.  I took Intn Stds with her which was also fantastic.  Take a class with her if you can",
        "course": "ARABI102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jennifer is the best!  Always willing to help, great explanations, and you can tell she really enjoys teaching arabic.  By far the best teacher in arabic I have had yet.",
        "course": "ARAB000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "really great person, always willing to help you anytime!! keep up the great work and i hope to have for other classes",
        "course": "ARAB104"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 5,
        "comment": "she is awsome",
        "course": "ARABI101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "she is wonderful. explained everything so we understood and always made time for us!",
        "course": "ARABI103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.4,
    "department": "Arabic",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0xNTEzMTI3",
    "lastName": "Hemmig",
    "legacyId": 1513127,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Grades tests very easily.  If you show up and put in effort you'll pass.  Really nice guy.",
        "course": "ARABIC1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Explains topics well and has a lot of office hours in case students are confused.  Tests could be have tough questions but he graded them really loosely and getting good grades was never too difficult.",
        "course": "ARABIC1103"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "Moves quickly, and at times goes off topic. The switch between different dialects for a first year was tough.",
        "course": "ARB1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really nice guy who is willing to work with you outside of class.  Grades really fairly.",
        "course": "ARABI102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.9,
    "department": "Arabic",
    "firstName": "Youssef",
    "id": "VGVhY2hlci0xNTQ4Nzg5",
    "lastName": "Yacoubi",
    "legacyId": 1548789,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor of Arabic literature, encourages students to think beyond the text. Not only an interesting course, but one that affected the way in which I see the world.",
        "course": "5701ARBPROSE"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Take it!! Participate once a week and you'll get a B. If you get a C, B, and A on 3 papers, he'll give you an A- overall for improvement. Buy ALL the books, you need them. Beginning of course is boring, gets way more interesting. Class schedule is VERY tentative. Go to class he gives lots of info you use for midterm papers, lots of EC opportunities",
        "course": "2367"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "This teacher thinks he is extremely important  :( but the truth is he is not! guy needs to see a doctor!  DROP THIS NOW!",
        "course": "ARABIC2367"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": " Class is a disaster, not a fun atmosphere, not motivating, not professional. The teacher is always unprepared, very arrogant, and unclear in terms of what he expects from you! He doesn't follow the syllabus at all!  He really should lighten up. In short, dont waste your time! Avoid at all cost",
        "course": "ARABIC2367"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Prof. Yacoubi is really enthusiastic about the topic and it can be fun to watch him get really into his lectures. However, the class is strangely organized and doesn't follow the schedule on the syllabus. It isn't too hard to get a good grade as long as you're okay at writing papers and go to class.  It also helps if you know a little Arabic.",
        "course": "ARABIC2367"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Really bad professor who knows lots about the topic. I don't recommend working close with this professor",
        "course": "ARB371"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "very enthusiastic about material, sometimes hard to take notes off of as he only goes off slides that are shown in class. Overall very good",
        "course": "NELC3702"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher, definitely helped us out if you went to office hours. Taught an interesting class, and held my interest.",
        "course": "ARABICLIT"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have incredible respect for Dr. Yacoubi. He is one of the most involved and enthusiastic professors I have had at Ohio State. Very knowledgeable in all the liberal arts and he is willing to discuss about anything. If you take him though, expect to read and work hard on papers. He is difficult, but it is worth it to study under his intellect. ",
        "course": "ARABI371"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "THE WORST INSTRUCTOR SO FAR! The class expectations, lectures, and instructions are vague or incomprehensible.  His syllabus is not helpful.  40-50 pages of Arabic reading are assigned per week with little time for questions or discussion.  Also,a homework was transformed into a midterm retroactively (after its return).",
        "course": "ARABC722"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 4.1,
    "department": "Arabic",
    "firstName": "Awatif",
    "id": "VGVhY2hlci0xOTQ5MDM3",
    "lastName": "Elnour",
    "legacyId": 1949037,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor is so helpful. Take her class. You won't reared it! ",
        "course": "ARABIC110101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Enjoyed her class very much. Wonderful character. Full of Light.",
        "course": "110101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "This teacher is very kind, helpful, and goes over and beyond to help her students. She does ask you to online assignments, but they are for your own good in the end. She goes not only into the language, but also the culture and the different norms in arab countries. Just be willing to put in the work, and she helps you to talk arabic in class, ",
        "course": "1103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "The professor is nice and very willing to help you with anything. As this is a language get ready to use your text book a lot and also do the homework. Participation is very important in this class. If you do your assignments and show up to class you'll be fine. ",
        "course": "110101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": " The professor is really nice and willing to work with you to help you understand the material. It is important that you study a little every day. The teacher assigns homework  most days and attending lecture is crucial.  ",
        "course": "110101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "The teacher is a great instructor and I recommend this class from this instructor. As long as you ask questions and do your work you'll be fine. She is the best for learning Arabic. She is very knowledgeable on all subject matter.",
        "course": "ARABIC110101"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "My personal experience with Dr. Elnour is that she is a nice person. For non natives, her teaching style can be very confusing, but as long as you ask questions and do your work you'll be fine. She is a generous grader, but expects you to do work. The grading criterea does not seem to be clearly defined, and sometimes the class seems unorganized.",
        "course": "1103"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "I struggled to keep up with her teaching style.  It seems like she bases her class of off the performance of native speakers - who are taking the class for a GPA boost.  Poorly paced class.  Nice person, frustrating teacher.  Teach yourself through the book if you want to succeed.  310 do not recommend.",
        "course": "ARABIC110101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Arabic",
    "firstName": "David",
    "id": "VGVhY2hlci0yMTEyMDA1",
    "lastName": "Bond",
    "legacyId": 2112005,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor; enthusiastic, passionate about what he is teaching. Makes you think outside the box. Just do the work and you'll get an A",
        "course": "NELC3702"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Graded attendance but passing means do the online work. Lots of quizzes and discussions about course material but will comment interesting feedback. Going to class is good because he is knowledgeable and shows off some really cool stuff. He has a bit of a speech impediment sometimes and cuts people off but for the sake of time management. Easy A",
        "course": "NELC3702"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "All around nice guy with a clear passion for the material and the willingness to work with you to maximize your educational experience",
        "course": "ARABIC2241"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Arabic",
    "firstName": "Amany",
    "id": "VGVhY2hlci0xNTg3ODI2",
    "lastName": "Seleem",
    "legacyId": 1587826,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "BEST IN THE WORLD",
        "course": "5512"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome instructor! My favorite class yet-- she was very helpful, patient and very willing to give any extra help. Just be sure to do assigned homework-- Arabic can be tough if you don't study. Classes were very interactive and enjoyable. Sweetest woman in the world, I definitely recommend taking her!",
        "course": "ARABI101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was the best teacher i took. She is so helpful, and She is hard worker. Her work Ethic is out of this world. She taught us things that were a bit too advance because she had faith on us. She knew we could do it. She tells her students they are BRILLIANT. which is good to hear.",
        "course": "ARABC101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.8,
    "department": "Arabic",
    "firstName": "Abderrahim",
    "id": "VGVhY2hlci0xNDE3OTYz",
    "lastName": "Slaouihakim",
    "legacyId": 1417963,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "He is really quiet and kind of awkward but he is a really nice guy and will help you out a lot if you ask for it. I felt that the structure of the class was weak because he is so timid. I was doing extremely well until the final. Its difficulty was NOT on par with previous exams. If you can, get into Chris's class.",
        "course": "ARBC102"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "I had him for arabic 102 and 103 and was excited to have him again. However, in 205 he was rude and would pick on the students in the class who weren't native speakers when they made mistakes. By the end of the class only 15 people were left, almost all native speakers. I dropped it and took it the next quarter with a different teacher--I got an A.",
        "course": "ARAB205"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very kind and helpful. He expects a LOT from his students as well as respect and dedication*. He goes straight by the book but includes a lot of culture in his lectures too. I learned about the language and* world while being in his class.",
        "course": "ARABI401"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Despite the scary beard, he's a really, really nice teacher. Always willing to help you if you have questions. I'd take him again.",
        "course": "ARAB205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.3,
    "department": "Arabic",
    "firstName": "Ali",
    "id": "VGVhY2hlci0xNjU5Njk5",
    "lastName": "Hassan",
    "legacyId": 1659699,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Hassan is one of the kindest and most generous human beings you will ever meet. No surprises in the class (he tells you exactly what will be on tests). Easy A if you study a little and attend class.",
        "course": "ARAB501"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "One of the nicest people you will ever meet. He may not be the most clear in class, but he will go out of his way to help you understand the material. The class is not difficult and he tries to make sure there are no surprises on tests.",
        "course": "ARABI501"
      }
    ],
    "SEI": []
  }
]