[
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.8,
    "department": "Architecture",
    "firstName": "Justin",
    "lastName": "Diles",
    "legacyId": 2133052,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Justin is a kind and funny professor and always has great feedback in studio. He's always willing to help out with learning software and it seems like he genuinely cares about his students. My studio mates and I would definitely recommend! Live laugh love Justin. Diles 5EVER"
      },
      {
        "index": 1,
        "rating": null,
        "comment": "He was an incredibly difficult studio professor for me personally. He would pick on me for really little things and would find ways to make me feel embarrassed in front of the entire class. I've heard really good reviews about his ability to teach structures though! I will never take his studio course again unfortunately. :("
      },
      {
        "index": 2,
        "rating": null,
        "comment": "He shows only one or two problem examples in lecture and then expects you to solve 6-10 ridiculously harder examples for homework. Even the TA's were confused and it made it difficult to get through homework. Ended up spending hours teaching myself. Don't get me wrong, he is super nice, I just don't think he structured the class very well."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Justin is very genuine and very easy going. The only issue is that he tends to make small mistakes when going over problems, and students often have to correct him. He also occasionally has errors on homework and other class worksheets, which can become confusing. Make sure to review your physics before this class. He dives right in with the math."
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "Justin is a true gem at Knowlton. Go to class and structures will be a breeze, have him for studio and you'll learn a lot and make formally interesting and provocative architecture."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Justin is amazing, and honestly a genius. His demonstrations for people who dont understand structures as well as I do, are really great, so remembering when i began structures, years ago, these would have been very helpful. Caution, GO TO LAB, he crams a lot into the lectures, but they're very helpful, and the historical parts are fascinating !"
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Justin is life"
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Justin is incredible. He really really cares about students. He makes lectures as interesting as a structures lecture can be, and if you are struggling with homework or projects, he is willing to meet outside of class anytime, not just during office hours."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "I don't think he is the right person for teaching this class. He always make mistakes in the class when he tried to solve some physics problem. Sometimes he cannot realize the mistakes he made and leave the wrong answers to students."
      }
    ]
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Architecture",
    "firstName": "Beth",
    "lastName": "Blostein",
    "legacyId": 2683002,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Beth is really kind and cares about her students! She's great at giving feedback on what you bring her, rather than trying to take over your project (which some studio professors tend to do). She has innovative ideas and tries to push your project further. I would definitely recommend her!"
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Mixed feelings about her. Ive heard negative things about her as a studio instructor, but she seems like a nice construction person. Often changed due dates to make it easier on students. Lots of extra credit opportunities. Always willing to help on labs. However, labs (charettes) were way too stressful and honestly detrimental to my mental state."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Beth is not the greatest lecturer. She doesn't make any of the material exciting or comprehendible, and its very dry, not to mention her PowerPoints have barely any notes and she breezes through them without repeating herself. The labs are extremely difficult and graded harshly, and since the class is graded by few things, no one I know has an A."
      }
    ]
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.8,
    "department": "Architecture",
    "firstName": "Justin",
    "id": "VGVhY2hlci0yMTMzMDUy",
    "lastName": "Diles",
    "legacyId": 2133052,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Justin is a kind and funny professor and always has great feedback in studio. He's always willing to help out with learning software and it seems like he genuinely cares about his students. My studio mates and I would definitely recommend! Live laugh love Justin. Diles 5EVER",
        "course": "ARCH2410"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "He was an incredibly difficult studio professor for me personally. He would pick on me for really little things and would find ways to make me feel embarrassed in front of the entire class. I've heard really good reviews about his ability to teach structures though! I will never take his studio course again unfortunately. :( ",
        "course": "ARCH2410"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "He shows only one or two problem examples in lecture and then expects you to solve 6-10 ridiculously harder examples for homework. Even the TA's were confused and it made it difficult to get through homework. Ended up spending hours teaching myself. Don't get me wrong, he is super nice, I just don't think he structured the class very well.",
        "course": "ARCH5710"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "Justin is very genuine and very easy going. The only issue is that he tends to make small mistakes when going over problems, and students often have to correct him. He also occasionally has errors on homework and other class worksheets, which can become confusing. Make sure to review your physics before this class. He dives right in with the math.",
        "course": "ARCH5710"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Justin is a true gem at Knowlton. Go to class and structures will be a breeze, have him for studio and you'll learn a lot and make formally interesting and provocative architecture.",
        "course": "ARCH5710"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Justin is amazing, and honestly a genius. His demonstrations for people who dont understand structures as well as I do, are really great, so remembering when i began structures, years ago, these would have been very helpful. Caution, GO TO LAB, he crams a lot into the lectures, but they're very helpful, and the historical parts are fascinating !",
        "course": "ARCH5710"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Justin is life",
        "course": "ARCH2410"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Justin is incredible. He really really cares about students. He makes lectures as interesting as a structures lecture can be, and if you are struggling with homework or projects, he is willing to meet outside of class anytime, not just during office hours.",
        "course": "ARCH5710"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "I don't think he is the right person for teaching this class. He always make mistakes in the class when he tried to solve some physics problem. Sometimes he cannot realize the mistakes he made and leave the wrong answers to students.",
        "course": "ARCH5710"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Architecture",
    "firstName": "Beth",
    "id": "VGVhY2hlci0yNjgzMDAy",
    "lastName": "Blostein",
    "legacyId": 2683002,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Beth is really kind and cares about her students! She's great at giving feedback on what you bring her, rather than trying to take over your project (which some studio professors tend to do). She has innovative ideas and tries to push your project further. I would definitely recommend her!",
        "course": "ARCH3410"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mixed feelings about her. Ive heard negative things about her as a studio instructor, but she seems like a nice construction person. Often changed due dates to make it easier on students. Lots of extra credit opportunities. Always willing to help on labs. However, labs (charettes) were way too stressful and honestly detrimental to my mental state.",
        "course": "ARCH5520"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Beth is not the greatest lecturer. She doesn't make any of the material exciting or comprehendible, and its very dry, not to mention her PowerPoints have barely any notes and she breezes through them without repeating herself. The labs are extremely difficult and graded harshly, and since the class is graded by few things, no one I know has an A.",
        "course": "ARCH5520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.3,
    "department": "Architecture",
    "firstName": "Toby",
    "id": "VGVhY2hlci0xOTI0Mjg3",
    "lastName": "Rittner",
    "legacyId": 1924287,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "P. Rittner gets a bad rap on here, he is respectful of students and is an A+ lecturer, extremely engaging. He does stuff 3 huge projects into the last month of class which is frustrating, but he is a pretty relaxed grader so as long as you put in an honest effort and attend class you should have no trouble getting a B or better. ",
        "course": "CRPLN3400"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "I highly recommend not taking this class. The class is extremely long and boring. You will receive minimal guidance for your assignments. Attendance matters. This teacher unfortunately does not respect his students feelings and will take any opportunity to embarrass them in front of the class. Seemed like he really did not want to be there. ",
        "course": "CRPLN3400"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "He claims that his class is helping students prepare for the real world, but he really just talks about himself, presents long lectures with little substance, and degrades students whenever he can. The papers and projects require almost exclusively outside research for which you are given little direction. Id recommend taking a different class",
        "course": "CRP3400"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is very funny, but when it comes to coursework he is demanding. On one site visit to his office, he would come straight and ask you to prepare for a complete presentation (pop presentation?) to a panel of managers in 30-50 minutes and make students compete with each other to see who end up looking bad.",
        "course": "CRP3400"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very dry lectures accompanied by several projects throughout the semester, all of which he nitpick grades for the most insignificant details and grammatical errors. Lecture gets off topic frequently and makes it difficult to find out what's important and what isn't in the class. No tests but projects that take up unnecessary amount of time.",
        "course": "CRP3400"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "There's no test. One of the best prof. at OSU",
        "course": "CRPLN3400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.6,
    "department": "Architecture",
    "firstName": "Benjamin",
    "id": "VGVhY2hlci0yNTY1MjU3",
    "lastName": "FLowers",
    "legacyId": 2565257,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Flowers is easily one of the best professors I know. He is insanely smart, funny, and wants to see all his students succeed. I was always engaged in his lectures and the projects we had were clearly outlined in what we needed to do. During our final project, he approached me and gave advice/ complimented my work very helpful great guy",
        "course": "KNOW2310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "The goat's a genius. Some of the greatest lectures I've ever sat in, if you want your mind to be blown then his class is an easy choice. He's incredibly caring, super entertaining during lectures, and surprisingly inspirational? I'm tearing up. Anyway, take his class he's amazing. ",
        "course": "KNOW2310"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Love him, he is so nice and I believe everyone respects him. He knows A LOT and makes things interesting.",
        "course": "KNOW2310"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I found Professor Flowers' lectures to be interesting but he seemed less approachable than Professor Boswell. Homework is reasonable and graded pretty fairly. I do greatly respect him for interrupting lecture to call out some students who were having a conversation the whole time.",
        "course": "KNOW2310"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely great, had several one on one conversations that I got my answer and then we derailed talking about other things",
        "course": "LARCH2300"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "grading is a little iffy ",
        "course": "LARCH2300"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved his lectures. The class itself was really easy if you did all the assignments and j showed up to learn.",
        "course": "LARCH2300"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class could be boring and I can honestly say I almost fell asleep a couple times. However, this was only because the class was from 5:30-7:00, so everyone was hungry and exhausted. Benji was a good lecturer and made the content funny and interesting. His tests weren't hard if you reviewed your notes and memorized the study guides.",
        "course": "ARCH5120"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Benji was a very fun guy and his lectures were very interesting. I would say I learned more in his honors recitation than in lecture. He really challanged us to think and his opinions on architecture are very stimulating to listen to. He's was very respected in my class and if you join the recitation, you'll fully understand.",
        "course": "ARCH5120"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Benji was a very likable guy, super funny and interesting to listen to. His class is lecture heavy, so you need to go and take notes. His tests are typically structured around the study guide he gives and smaller details he gives in the lectures. Its an interesting class, and the material is easy to follow. There are also pop quizzes occasionally.",
        "course": "ARCH5120"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "Based 20% of grade (150 pts) on a hard 10 question quiz he told us not to study for. Didn't handle COVID well, didn't cancel an assignment that required us to take pictures of buildings (never once specified we had the option to stay home). Everyone loved him but i didn't get the hype. He tried to make stuff interesting but it just came off weird.",
        "course": "ARCH5120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.5,
    "department": "Architecture",
    "firstName": "Amber",
    "id": "VGVhY2hlci0yMjUwMzY4",
    "lastName": "Woodburn",
    "legacyId": 2250368,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "* Vague assignments and a poorly defined final project.\n* No feedback or correct answers were provided for the assignments.\n* Clumsy and unclear teaching methods.\n* An unclear grading system (although a grading system was presented on paper, it was not consistently followed).\nOverall, one of the worst experiences!",
        "course": "AVN5300"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Way too much assignment and discussion post for a 3-credit hour class, without mentioning there is a semester project at the end",
        "course": "AVN5300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Woodburn McNair holds her students to very high standards, but not beyond the capabilities of any driven undergrad. She expects critical thinking and analysis that you can demonstrate a firm understanding of topics and express original ideas. Challenging? Yes, but I've learned more from her than any other instructor at OSU.",
        "course": "CRP4110"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "I'll give Amber some credit because she is doing what she thinks will make students do their best, but she gives little/no feedback, treats the students as if they are in elementary, gives us 10-15 hours of homework weekly-biweekly, and when it came to the midterm and final, don't think you are going to get a review that is worth anything.",
        "course": "AVN5300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.8,
    "department": "Architecture",
    "firstName": "Kristina",
    "id": "VGVhY2hlci0yNjMxNTk1",
    "lastName": "Bertocchi",
    "legacyId": 2631595,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Super nice, genuinely cares about her students and grading was clear but the curriculum forces you to learn an entire software yourself which is very stressful at the beginning. Heavy workload but if you're passionate about architecture it doesn't feel like work. My favorite class this semester and I wish I could have her again",
        "course": "ARCH2410"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kristina was caring and always considered our wellbeing and pushed for/altered the deadlines and deliverables based on my specific section's needs and wants. She was encouraging and would tell us if we were doing good or if she was worried about our progress. I'm not a fan of how the curriculum forced you to teach yourself nearly everything though.",
        "course": "ARCH2410"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Kristina was my head TA for studio. She did a really good job of clearing up discrepancies between lecture and studio, of which there were several. Often this meant less work for us to do. My only issue was some days she just didn't show up for some reason and the other TA's would have to sub in for her, which they obviously weren't prepared for.",
        "course": "ARCH2310"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kristina was great! The lectures/studio situation was a bit disorganized but wasnt her fault (above her pay grade I think) she obviously cared about us and tried to guide us through a course that was still being putt together midsemester. Would take another class with her involved for sure",
        "course": "ARCH2310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 1.3,
    "department": "Architecture",
    "firstName": "Todd",
    "id": "VGVhY2hlci0yNzAyMDcz",
    "lastName": "Gannon",
    "legacyId": 2702073,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "An architecture history class is a good idea but Todd takes the value out of it. Lectures are 50% architecture and 50% yapping about nothing. TA's do all of the work and he doesn't give them a lot of instruction. Slide quizzes (memorizing 80+ buildings) are not a good way to learn and add unnecessary stress to an already challenging program",
        "course": "ARCH5110"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Todd is my least favorite teacher at Knowlton.  I'm taking him right now and I can already see why many of my classmates don't like him.  He is so interested in hearing himself think and his attitude is pretty bad. I really don't know why the administration hired him - he really is an ego maniac like other students have said on here.",
        "course": "ARCH5210"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "I didn't learn anything from his class.  He sort of just rambles on without any point.  I basically played on my switch the entire lecture and got an A.  The papers are so mind-numbing that I just wrote gibberish and still passed.  ",
        "course": "ARCH5210"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Todd is an ego maniac.  He is probably THE worst professor ever to come to KSA.  He doesn't care about students and only cares about furthering his career.  His lectures are absolutely insane and have nothing to do with architecture.  I got an A and learned absolutely nothing.  Waste of time and money.  This class only strokes his ego.",
        "course": "ARCH5210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Architecture",
    "firstName": "Justin",
    "id": "VGVhY2hlci0yNjkyMDgw",
    "lastName": "Meyer",
    "legacyId": 2692080,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Meyer is super clear, friendly, and helpful. The software he teaches can be difficult, but he will always help you and make things clear. He should be teaching 3150 for Cartwright.",
        "course": "CRP2600"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very different than any class I've taken at OSU so far. The class consists of projects throughout the semester. Most of what to do in these is covered in class. You won't know your grade until the last week. The class also runs on WordPress, not Canvas. The professor himself is charismatic, skilled in the software he teaches, and very helpful. ",
        "course": "CRP2600"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Took this course in SP21. Only grades in the class are the 5 final projects that you work on throughout the semester. Don't wait until the end. Good professor, good class. A bit boring at times, but you learn how to use some very valuable softwares. Adobe PS, Illustrator, and Indesign are a staple for this class.",
        "course": "CRP2600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.8,
    "department": "Architecture",
    "firstName": "Ben",
    "id": "VGVhY2hlci0xMTkzMzcz",
    "lastName": "Wilke",
    "legacyId": 1193373,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "A great teacher who helped me tremendously in building my dream and love towards architecture. I'm grateful to take his introduction of architecture studio in the autumn semester of 2019. That is the best choice I've ever made in my life. ",
        "course": "ARCH2310"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "Easy A.  Didn't learn much from him.  He has favorites in his class that he gravitates to and ignores others.  He loves to talk about his son, for some weird reason.  Pretty strange.  Abrasive and not welcoming.  Would never recommend this guy.",
        "course": "ARCH2610"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "It was generally known that his studio produced the best work - he gives very specific instructions and is particular about ideas and craftsmanship, but it's so worth it in the end. He definitely has favorites (this will be your favorite class if you're one of the lucky few) but overall, is hilarious once you are done being intimidated.",
        "course": "ARCH151"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ben is intimidating at first, but once you get to know him, he is awesome. This is the second time I have taken his class, and I hope to get him next year. He is super patient and critiques your work to make it better. I highly recommend taking at least one class with him. You will not regret it!",
        "course": "ARCH2610"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ben will roast you into oblivion, but only if you deserve it. This class was less design oriented and more about techniques. Follow the steps and do what he asks and you will get a good grade. Do not wait until the last minute to start projects. He may be intimidating, but he is always willing to help if you ask. Really great prof!",
        "course": "ARCH2610"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Ben definitely knows what he is talking about. He is intimidating to talk to until you realize that he gives good feedback and will help your project improve.",
        "course": "ARCH2610"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Blunt and straightforward. Critical, but always helpful and never mean. Spectacular studio professor.",
        "course": "ARCH2310"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ben is a really chill studio instructor. He'll give anyone who asks for it feedback on their studio projects, and good feedback at that. He always has funny stories to tell and his studio is better than other studios of the same class. I strongly recommend Ben.",
        "course": "ARCH2310"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ok so Ben is this hipster dude who loves to write all over your stuff with a red pen so beware, he talks about his angsty son a lot, wears adidas superstars and outfits from H&amp;M on a daily basis, hates informal emails, and hates materials in any other color but white. If you want a good laugh ask him about the childhood game he played (bloody feet)",
        "course": "ARCH2310"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ben is the best teacher at Knowlton. I can tell you that for sure. He makes sure students in his class are doing the right thing, even if that means longer studio hours and more detailed works. But trust me, you will love the result. Compared to other classes, ours are always the finest because of his specific guide and lessons. A great teacher!",
        "course": "ARCH2310"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Glad I chose him, he's  funny, if slightly intimidating. Cuts out unnecessary work. If you've ever done a class that has critique, he's pretty standard as far as harshness goes, never personal or overly critical, but he will point out flaws. Also, even though he does seem to have favorites, if you ask him for help he will always give you input.",
        "course": "ARCH2310"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Picked Ben's studio section because it worked best with my schedule, and I'm so glad I did. His projects were to the point, and though his criticism sometimes seemed harsh, it was never personal. He wanted us all to be the best we could be. He does tend to focus on only a few people but he is very accessible if you make yourself known.",
        "course": "ARCH2310"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "He gives really good feedback, he's one of those professors that will give you his honest opinion. It's usually not sugar coated but it helps you to only better yourself. If you ask him what he thinks about your work, seriously take what he says into consideration because his opinion will apply to your review.",
        "course": "ARCH2310"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "I think overall he is a good teacher. What bothers me is that he does have his favorite students and spends too much time helping them instead of helping the students that are struggling. Besides that he is cool.",
        "course": "ARCH2310"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "so happy I got Ben for my first studio. He may be critical but it's never personal, you can tell he is truly there to help you get better. A studio professor isn't there to baby students, so if you can't take it, this field probably isn't for you. He's a funny guy and very quotable. Lets us have more wiggle room than the other freshmen for sure.",
        "course": "ARCH2310"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "If you get on his good side and make sure you do as your told, he will love you. Just don't try to be a smart alec like I did. He still liked me but that's because I was lucky.",
        "course": "ARCH202"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 3,
        "comment": "While you will still spend many long hours working for this class Ben cuts out a lot of dumb busy work. He will tell the truth and can be really funny, but too scary to laugh at his jokes. Don't expect any praise (it is an arch studio). Do what he says with the drawings, even if you don't like it, he knows more than the students, deal with it.",
        "course": "ARCH202"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "When you listen to ben talk, he may sound really mean and sound like he is just shooting all your ideas down, but he actually knows a lot more than any kid he is teaching so you should learn to listen to him.  it took me a couple of weeks to get past the strait forwardness but after that i was always really helped by his criticism.",
        "course": "ARCH241"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "He may seem uninterested, but he can provide to-the-point criticism to help you with your projects. He knows a lot, but he won't voluntarily share,unless you ask for it. Definitely an interesting person.",
        "course": "ARCH202"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 5,
        "comment": "boring and unspiring",
        "course": "ARCH243"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "Understands genious. Subtley hilarious.",
        "course": "ARCHH200"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "works you hard, but it is good prep for your next three years. Very Critical!! but has alot of good constructive comments if you can get past the critical comments.",
        "course": "ARCH151"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 1,
        "comment": "Average",
        "course": "ARCH202"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "completely useless teacher. doesn't care about the class or the students",
        "course": "ARCHH200"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 5,
        "comment": "Lets students think for themselves.",
        "course": "ARCHARCH"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "ARCH200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Architecture",
    "firstName": "Samuel",
    "id": "VGVhY2hlci0yOTk5MDg0",
    "lastName": "Tibbs",
    "legacyId": 2999084,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Gives solid feedback but sometimes came off rude. The initial impression you make on him can influence how he treats you thereafter, whether positively or negatively. Likes to make jokes from time. Often assigns more work than other instructors. Also tends to compare himself as a student to students. Grades harsher than he lets on.",
        "course": "ARCH-2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Architecture",
    "firstName": "Ochuko",
    "id": "VGVhY2hlci0zMDE4ODY3",
    "lastName": "Evware",
    "legacyId": 3018867,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really pushed our studio to be creative and liked what we did. Awesome professor! ",
        "course": "3420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.9,
    "department": "Architecture",
    "firstName": "Jackie",
    "id": "VGVhY2hlci0yNjY3MTE=",
    "lastName": "Gargus",
    "legacyId": 266711,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Awful professor. She made history not fun to learn at all. Only good thing are the pop quizzes that she occasionally gives out. ",
        "course": "ARCH5110"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jackie makes it very easy to pass the class. There is so much extra credit involved. She gives extra credit for sometimes just showing up to class, even though lecture is mandatory. Attending Baumer lectures and giving your notes/writing a short essay gives you more, and she included a paper that basically replaced 3 of the 9 quizzes.",
        "course": "ARCH5110"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible! Has to be the worst class ever taken. Her lectures are hard to follow and covers a ton materials every lecture. I never felt I learnt something from her. Her intention is to cover the syllabus rather than making sure her students are learning through the process. Quiz every Friday. Gives no time to go over notes. Exams are super hard too.",
        "course": "ARCH5110"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Honestly, she is a great studio instructor and has a different demeanor with studio compared to history. I have learned so much from her about architecture. Beware, there will be times where you get absolutely roasted by her and maybe want to cry, but besides that, she is freakin hilarious and a fountain of knowledge.",
        "course": "ARCH3410"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Jackie is a very respected and knowledgeable professor at Knowlton, yet she is one of the rudest I have ever had, and doesn't seem to care about her students whatsoever. She barely remembers any students names and doesn' make an effort to be welcoming at all. She makes fun of questions and interrupts during reviews. She thinks she is being witty.",
        "course": "ARCH5110"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "Jackie is very blunt and basically has no filter. If things aren't done in her way, she doesn't like it, so don't take it personally for your projects. She is a bit traditional and her style can lean more towards function over form, so if you want an A, make sure your project isn't too crazy. She doesn't care much about graphics during reviews.",
        "course": "ARCH3410"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "The class itself is difficult but manageable if you study, show up, and participate. However, a lot of insensitive comments about content and towards students. Think about your questions before asking because she will ridicule some of them, but my guess is as good as yours on which ones. Quizzes are sometimes very hard. Sometimes shes funny though",
        "course": "ARCH5110"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "She doesnt look at the quizzes before she gives them out to the class. One time she looked at the quiz while everyone was taking and was like &quot;Oh we havent gone over this yet.&quot; then went &quot;Oh well.&quot; She also is super rude during lectures when someone wants to ask a question. She just says that the person should be paying attention and continues.",
        "course": "ARCH5110"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not enough time for this weekly quizzes. You NEED the textbook if you are going to do well.",
        "course": "ARCH5110"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "I don't care how much &quot;power&quot; she has at Knowlton - she is rude, unprofessional and downright doesn't care about students' success. If you don't like to teach, then why become a professor? I have reached out several times for help and she never responds. Her quizzes are impossible because she gives you no time to go over your notes. HORRIBLE!!",
        "course": "ARCH5110"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "Jackie is eccentric and funny but also is a fountain of knowledge The lectures are LONG and even though some of the content can be interesting, it's hard to focus. She can be slightly rude/disrespectful towards students so be wary but she gives extra credit just for attending so don't skip. Don't buy textbooks. Quizzes/exams are lecture-based.",
        "course": "ARCH5110"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "Jackie is very eccentric but clearly knows her stuff. Do not skip class ever, because you wont pass, even if you get the notes. She gives a ton of extra credit during classes too, so show up. Her tests aren't bad if you review a lot, but really study the ID's and know the dates because if you don't, that is where you will lose the most points.",
        "course": "ARCH5110"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Fabulous! My girl Jackie has been Bae1 since day 1.  She will bring you places if you work for it and deserve it.  Take every opportunity to have her! You must travel on her famous European Trip. Had her for Honors History 1 & 2, Studio, and study abroad.  Jackie is amazing, one of a kind, and a complete SAVAGE!",
        "course": "ARCH5110"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Jackie is genuinely interested in her field and in teaching the material. She is crazy- in  good way. Very high energy and hilariously sarcastic (which some people might perceive as insensitive, but she's really just funny. And a lot nicer than some other professors). Her exams are tough but not impossible, as they rely heavily on memorization.",
        "course": "ARCH5110"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "Jackie is one of my favorite professors to date. Her class is incredible and never fails to entertain. She is eccentric but hilarious and is incredibly intelligent. She has an incredible design mind but demands respect from students. (Stay on her good side or watch out)",
        "course": "ARCH5110"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 5,
        "comment": "Easily one of the best profs I've had here yet.  She is really enthusiastic and knowledgable and makes a mundane subject pretty interesting.  She is a bit eccentric so watch out; she will make you laugh though.  She's also my studio instructor and she gives excellent feedback and support..but if you're not her student look out for her on reviews!",
        "course": "ARCH600"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is very unpredictable just today we learned dance moves for buildings. Crazy huh&#63;",
        "course": "HIST601"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 5,
        "comment": "She is a tough prof. She def knows what she is talking about and knows more about arch than I ever may.  I have learned an amazing amount from her, but when it comes to exams they are impossible.",
        "course": "ARCH600"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Funny, she enjoys teaching, very smart.",
        "course": "ARCH601"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is alittle quarky, not that any other architecture prof. isn't, but she knows what she is talking about.  She's more than happy to extend deadlines on any sort of paper or exam, and although the comments may seem harsh, she usually hands out good grades on the papers.",
        "course": "ARCH601602"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 4,
        "comment": "She is hilarious.  The class is tough though.  You have to memorize many details about the architecture.  However, it is worth it.  I learned a lot.",
        "course": "ARCH601"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 4,
        "comment": "i learned so much in this class! she's hillarious and knows just about everything there is to know about art and architectural history. the class is hard, but its worth taking. you'll either love her or hate her, though. ps- she's horrible on reviews, though, she makes sure no one thinks they did well",
        "course": "600SERIES"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "ARCH600SERIES"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Good luck! You will need it!",
        "course": "HISTORYSERIES"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "I think she's too pretentious, but she knows the stuff.",
        "course": "601603"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 4,
        "comment": "I've had the runs felt better than having her class. sux to sit there and be overloaded with just tons of crap. most of which is totally useless in appreciating or understanding arch better.",
        "course": "HISTORYSEQUENC"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "The course is incredibly interesting; Gargus' eccentric and at times haphazard persona make the material even more 'interesting'. That said, there is a lot of material to cover, and she tends to have favorites. Quite a woman, you either love her or hate her!",
        "course": "ARCH601"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ARCH602"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "My suggestion is to record her lectures.  She talks fast and it is hard to write down everything.  She is a good professor though. She does care about you, as long as you care about the class.",
        "course": "ARCH602"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Write fast and dont sit in first 2 rows she will get you.",
        "course": "ARCH600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 3.4,
    "department": "Architecture",
    "firstName": "Karen",
    "id": "VGVhY2hlci0yNDc4OTQ0",
    "lastName": "Lewis",
    "legacyId": 2478944,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great Professor. She treats you like her kids which can be corny and cringe sometimes but overall, she made the class super easy. You can resubmit your assignments as many times as you'd like but does take awhile to receive feedback, sometimes up to 2 weeks.",
        "course": "ARCH5620"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "This woman is so cringe.  She tries so hard to be seen as an \"advocate\" of people of color but falls flat spectacularly.  Heaven forbid you bring up something that she said that made you feel uncomfortable, she turns into an entirely different person -- living up to the meaning of her name if you know what I mean.  Avoid her at all costs.",
        "course": "ARCH5610"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Karen is very nice, but her class wasn't as challenging as I wanted it to be. You learn how to use Rhino and Illustrator in her class, which is very helpful, but the assignments are super easy and it just makes you not want to put in any effort. She also decided halfway through the class to change the assignments to pass/fail which didn't help.",
        "course": "ARCH5610"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Karen is the most caring and positive person I have met. She will do whatever it takes to make sure you grow and learn as a designer. She is extremely supportive and I can't express how much she made me feel like I could thrive in architecture. Yes its an easy A, but it's only because you are encouraged to experiment creatively so put in the work.",
        "course": "ARCH5610"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Karen is the sweetest lady and very accessible outside of class. She is very knowledgeable and clearly very intelligent. Her grading is very easy and you should get an A in this class, no problem, as long as you do your work and get feedback from her or the TA's.",
        "course": "ARCH5610"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.1,
    "department": "Architecture",
    "firstName": "Kyle",
    "id": "VGVhY2hlci0xNTQyOTM5",
    "lastName": "Ezell",
    "legacyId": 1542939,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. E is one of my mentors. He is so incredibly passionate about planning and it is contagious. I loved having him for studio because he let the students lead and be creative. On the other hand, his lectures are very unorganized. He is very all over the place and has a hard time with Carmen, which can be frustrating. You just got to get used to him",
        "course": "CRPLAN4910S"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "The most chaotic and confusing teacher I have ever had. He means well and cares a lot about planning, but as a real estate minor class, it's something I wouldn't take. Lots of work, mandatory attendance, and confusing and chaotic class periods, but not a hard class. Lots of busy work.",
        "course": "3600"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Ezell has easily been my least favorite professor during my time at Ohio State. His course is near impossible to follow due to his convoluted way of assigning items on Carmen, the course site is the most disorganized and unnecessarily confusing I have ever experienced. ",
        "course": "CRP110"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Chaotic and indecisive. Yes, the studio was supposed to be open ended, but he showed no ability to direct things. Often seemed unprepared and unengaged w/ students' writing. Time wasted on tangents; key concepts never defined at the outset of the class. Claimed to not &quot;have the time&quot; to complete a crucial IRB form - students scrambled to do it.",
        "course": "CRPLAN4910S"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "You can tell he's passionate about what he does, but can be a little but arrogant at times. Loved the class. It was very interesting and interactive. Consists of doing group work the entire time, so get ready to know your \"teammates.\" Attendance is also graded. No textbook. ",
        "course": "CRP2110"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Kyle is arrogant and he makes Chih-hao, his TA, do everything. He does not care to get to know you and he never has in class lecture you always have to ride the cota bus to do field work. I do not enjoy this class or the way he taught.",
        "course": "CRP1210"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great class. Has a guest speaker each week that gives a local CRP problem that you have to solve. Very insightful and useful class.",
        "course": "CRP623"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had him for CRP 110 and was unsure about CRP but after the class I knew it was what I wanted to do. Very good prof, very inspiring. Highly recommend. Easy too.",
        "course": "CRP110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.7,
    "department": "Architecture",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0yNjg2MTcy",
    "lastName": "Cruse",
    "legacyId": 2686172,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He taught the lecture of 2310 and was super kind. Our class had difficulty connecting the lecture to studio but he put in efforts to fix that. He brought in KSA faculty who taught us about the different programs and resources which I thought was super helpful while deciding between majors. He gave helpful and gentle feedback to me during reviews.",
        "course": "KNOW2310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was a great professor in a very fun class. He gave great feedback and helped me make my projects more complex. 10/10 would recommend.",
        "course": "KNOW2310"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "KNOW 2310 was a difficult class but Professor Cruse did a good job teaching the basics of architecture. The class was structured in a logical way, but there were only four graded assignments. I had issues obtaining a studio kit and he went above and beyond to ensure I had one. When that kit was stolen later on, he provided another one for free.",
        "course": "KNOW2310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Architecture",
    "firstName": "Melissa",
    "id": "VGVhY2hlci0yNjAyNjAw",
    "lastName": "Solinger",
    "legacyId": 2602600,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's really kind and helpful, but this course was not very enjoyable. The few classes we had on KSA resources and the student panel were helpful but after that the classes were presentations from random OSU resources. The quizzes were on topics totally unrelated to class content making it easy to get 1/3 points on quizzes that're half your grade.",
        "course": "KNOW1100"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "She is very caring and it's really easy to get an A, but this class just about put me to sleep after the first few weeks. The information about the architecture curriculum was useful. All the classes after that, though, were just unnecessary presentations of university services. This class could definitely be condensed into like 3 weeks.",
        "course": "KNOW1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 4.1,
    "department": "Architecture",
    "firstName": "Sandhya",
    "id": "VGVhY2hlci0xNTU1NzUy",
    "lastName": "Kochar",
    "legacyId": 1555752,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "LOVE this professor!  Sandhya is a genius at her job.  The people who have ties to the school and are overprivileged usually don't like her because she challenges the status quo and bias in architecture.  The students who like her and do well are those who want to challenge themselves and work hard instead of coasting by.  Learned so much!",
        "course": "ARCH4999"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I have taken two classes with Sandhya, seminar and studio. Loved both. She really pushes you to challenge your own preconceptions, to analyze and critique processes of architectural production and thought. There is no wrong answer, she just wants you to use your brain a little bit more than most teachers.",
        "course": "ARCH4999"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 5,
        "comment": "If you're smart take this class. If you're not smart take this class. Either way you'll come out a better thinker. Many hours of work but skill levels JUMP.",
        "course": "ARCH2"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "Tough but really a helpful professor! If you really love architecture and want to improve, choose her!",
        "course": "ARCH2410"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. She helped a lot with my project and learned a lot in this course.",
        "course": "ARCH202"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "She talks in circles, changing what she wants to see with every sentence. She tells you what to do, ignoring your ideas, so you're just creating her ideas. She cuts you off when attempting to speak. Her nature is to speak down towards her students. She is not very clear.",
        "course": "ARCH1450"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "She gives feedback and helps. Some of the feedback she gives doesn't help. And sometimes she will make you start over if your concept is not clear. Attendance is not mandatory but do attend all of the classes.",
        "course": "ARCH202"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "When you are in the class, she puts you in a constant panic. But if you learn not to take it personally and complete the course, you'll find that you probably learned the most out of any section. Not my cup of tea, but I am glad in hindsight I had her as a professor.",
        "course": "ARCH201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.5,
    "department": "Architecture",
    "firstName": "Amber",
    "id": "VGVhY2hlci0yNjkyMDg0",
    "lastName": "McNair",
    "legacyId": 2692084,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Very uninspiring and boring class taught by an even worse professor.",
        "course": "CRP4110"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took this in SP21. Great class if you're interested in city planning, and the prof always knows what she's talking about. Great at carrying conversation within lectures and encourages participation. Weekly quizzes, a handful of discussion posts, and 2 final essays. Solid class and professor.",
        "course": "CRP4110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Architecture",
    "firstName": "Paula",
    "id": "VGVhY2hlci0yNTYzMzk5",
    "lastName": "Meijerink",
    "legacyId": 2563399,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "DO NOT TAKE THIS FOR A G.E. CREDIT. Paula is pretty okay but the class is confusing because every instructor gives you different instructions so make sure to asked twice and even three times. your TA is your best tool, make sure to get along with them and listen to their advice.",
        "course": "2310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Architecture",
    "firstName": "John ",
    "id": "VGVhY2hlci0yODg1OTYx",
    "lastName": "Davis",
    "legacyId": 2885961,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "John Davis is such a good lecturer, even topics I usually don't care for I still pay attention when he's giving his take. He's really down to earth and fun, I wish I could take his class every semester. ",
        "course": "LARCH5620"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.9,
    "department": "Architecture",
    "firstName": "Jason",
    "id": "VGVhY2hlci04NjAzOTk=",
    "lastName": "Kentner",
    "legacyId": 860399,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "You can probably attribute a lot of the negative reviews to Pro Practice, which, given the subject material, is generally hard to make interesting. As for Jason, he really shines in extracting ideas from students and fostering them without a heavy hand (a lot of profs tend to take over your project). Stays invested even after you graduate, too!",
        "course": "LASTUD"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Overall, Jason isn't a bad teacher. The class itself is boring, but he doesn't help the cause because lectures are often long and repetitive. In the beginning Jason was excited about the content, but later on it slipped and he seemed to get bored with the material as well. All the quizzes are online.",
        "course": "LARCH2600"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "I thought this class would be fun , but it's really boring and repetitive. All of the lectures are composed of pictures, and the tests are hard. Don't take this class if you think it's an easy A.",
        "course": "LARCH2600"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Avoid taking Larch 2600 by any means necessary. Kentner is a miserable professor with long, rambling, mandatory lectures that don't really help at all for the numerous online quizzes, readings and discussions. There's a lot of work involved and you come out of the class with almost no additional knowledge about the material.",
        "course": "LARCH2600"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Probably the worst teacher I've had by far. Really unclear in giving directions. Doesn't know what he's talking about most of the time and definitely does not know how to teach.",
        "course": "LARCH2600"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Jason is a great professor. His lectures are well organized. He is easy but the students still learn a lot at the same time. I highly recommend his Landscape Outlines class. He is also a great designer if you ever get to see his work.",
        "course": "2600"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Overall Jason is an easy professor who is pretty helpful. The class I took was an introductory Landscape Architecture class so it was EXTREMELY easy and I enjoyed it quite a bit.",
        "course": "LARCH2600"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 5,
        "comment": "Jason is a great professor, if you dont understand something he is more than willing to help and h is very flexible when it comes to work and deadlines. Love him !",
        "course": "LARCH2600"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "the guy is out of this world terrible. he is not helpful and he doesn't really seem to know how to do things. his ideas can be progressive, but overall he needs to develop as a professor, because right now it leaves much to be desired.",
        "course": "LARCH600"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dude, \r Have YOU ever listened to his ANSWERS&#63; Talk about a circle of bull...There are teachers and then there are people who get jobs teachers. He's not the first kind and never will be. Sorry to burst the bubble.",
        "course": "LARCH457"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 5,
        "comment": "Its college, duh! - you're supposed to think for yourself. Jason's the best teacher - have you SEEN the water in the landscape class&#63; Those models totally rocked!! He really makes you think and find out how to work - if you don't have any ideas, dude, sorry, but go find another major.",
        "course": "ARCH415"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "Just like most others in knowlton-he does not teach. He expects you to learn on  your own, and ask questions. But here is the thing- what if you don't know what questions to ask&#63; Then you don't get the info but other students who do ask questions get that info in desk crits. Proffs in this school need keep all students at a level learning field!",
        "course": "LARCH457"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 5,
        "comment": "Jason's challenging and thoughtful - and he can design!!!!",
        "course": "LASTUD"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "LARCH321322"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "LA622"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Architecture",
    "firstName": "Keoni",
    "id": "VGVhY2hlci04MTQxNzQ=",
    "lastName": "Fleming",
    "legacyId": 814174,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I've learned so much from Keoni.  He is an AMAZING professor at Knowlton.  He is so supportive and truly loves what he teaches - it is almost impossible to not see his passion for architecture and building construction/systems.  He is extremely intelligent and you can learn so much for him.  He's even helped me with studio stuff!  AMAZING!!!",
        "course": "ARCH5810"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Keoni has very interesting and well-organized lectures. His exams are based on everything from these lectures, so take good notes! The labs are pretty difficult and require time and effort to get good grades on them.",
        "course": "ARCH5510"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the friendliest professors I've had yet. Lectures are fun and he is easy going. Very knowledgeable. He's more than happy to help you with anything you don't understand and never acts like you're wasting his time asking like some other professors I've had. If I could take another class taught by him, I'd do it in a heartbeat.",
        "course": "ARCH5810"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Seriousl one of the best professors I've had.  Very helpful, very approachable, great guy.  Knows his stuff and takes the time to make sure you know it too.  Lecture is simple and he doesn't care if you sleep or eat, and the book is required but his lectures are much more fun than reading the book.",
        "course": "ARCH5810"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "ARCH341"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "this man can do no wrong in my book!",
        "course": "341617618"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 1.9,
    "department": "Architecture",
    "firstName": "Kay Bea",
    "id": "VGVhY2hlci01Mjc3MDY=",
    "lastName": "Jones",
    "legacyId": 527706,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible",
        "course": "ARCH242"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "terrible person ",
        "course": "ARCH202"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "She hates all things in life that are fun. Im pretty sure Satan himself is even tired of this wretched old dirtbag.",
        "course": "ARCH202"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst teacher Ive ever had. Conceited and self-centered. Unwilling to put in any help outside of class if you are struggling",
        "course": "ARCH242"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "She is completely useless and there are very few students and professors who find her valuable to this institute. She talks a lot but leaves you with nothing in the end. She never showed up for class. She's uninterested in teaching which shows when at the end of the studio she still knows nothing about your project. &quot;She is a snake&quot; -Jose Oubrerie",
        "course": "ARCH442"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "excellent studio, she gives you a hands on feel to the project that few professors do. yes she expects alot but the amount you learn is worth it.",
        "course": "ARCH844"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Kay Bea is a great studio instructor. She really listens to what you have to say, and gives excellent feedback. Look out though, once she makes eye contact you will be locked in talking forever, seriously. Also take notes as she talks because you'll want to remember it",
        "course": "ARCH242"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Quite possibly the most incomprehensible professor in the department. I don't know if she rates herself or what, because I don't know ANYONE who thinks she's worth the time. Besides being the kind of professor that judges you as soon as you enter the room, her ideas are sophmoric and banal. Do yourself a favor, take someone else.",
        "course": "ARCH301"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "In her younger days, the only thing worth going to class was to see if she'd give a &quot;show&quot;.  Otherwise, her and the other fem's from Yale were too busy kissin butt of some of their senior colleagues to teach anything worthwhile about construction or design.  Difficult prof only cuz you didn't know what she was trying to teach.",
        "course": "ARCH301"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "For fun - count the number of &quot;ums&quot; in her lectures.  I once counted 56 in an hour.",
        "course": "ARCH202"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 5,
        "comment": "One of the most difficult, challenging classes and one of the absolute best professors that I have ever had!  The class was a combination of graduate and honors undergrads, we went to Italy after the quarter for first hand research.  She stretched my thinking AND made me think for myself which seemed to be a problem for a couple of the undergrads.",
        "course": "ARCH"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ARCH"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "This prof. doesn't live in the real world.  By far the most arrogant, selfish teacher at OSU. Consitently interupts students and is flat out rude. Loves to hear herself talk and can't stand it when other people are talking. Loves herself and the things she has done.  If you want an A, don't bother",
        "course": "ARCH"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "SAVE YOUR $. GO TO GREECE. This was the worst class that I have ever taken, even though it goes to Rome. This woman doesn't even know what she is talking about when she speaks. She thinks she knows everything and sucks at explaining, b/c she doesn't know what she's talking about anyway. STAY AWAY!",
        "course": "H69803"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 1.6,
    "department": "Architecture",
    "firstName": "Ashley",
    "id": "VGVhY2hlci0yNDc3NDEy",
    "lastName": "Bigham",
    "legacyId": 2477412,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Ashley is so worried about how her students work will look for her tenure package that she belittles anyone that doesnt share her weird aesthetic. Her lecture and studio is so cringe that it makes me wonder she has lasted this long at KSA. Ive learned absolutely nothing from her studio. Complete waste of time.",
        "course": "ARCH5610"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "Ashley is one of the worst professors Ive had at OSU. She is extremely biased towards her favorite students and students who work in KSA. She will only feature her favorite students. She is very rude and her curriculum taught me absolutely nothing. A complete waste of time and money. I hope you like chairs because thats all you learn about.",
        "course": "ARCH5620"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "She is incredibly rude and unsupportive. Ashley has clear favorites in her class and does not promote diversity. Her lecture for Rep was ridiculously boring and uninspiring. Nothing about her attitude is encouraging or supportive. Unless you are one of her brown-nosing favorite students, you won't be featured on the KSA Instagram page. Horrible",
        "course": "ARCH5620"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Genuinely the most condescending and uncaring professor. Doesn't care about students and expects them all to have an extremely unhealthy work ethic during a pandemic. She coordinates most of sophomore year and always manages to rudely schedule all due dates for the classes on the same weekend. You can't avoid having her though so rip.",
        "course": "ARCH5620"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Ashley is super nice and caring. Always is honest with you and gives great criticism. Only downside is the frequent deadlines that made it stressful to work around studio with, but other than that her class was interesting and she loves to talk to and bond with her students.",
        "course": "ARCH5620"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 5,
    "department": "Architecture",
    "firstName": "Iman",
    "id": "VGVhY2hlci0yNzQ1NTE5",
    "lastName": "Ansari",
    "legacyId": 2745519,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Incredibly challenging class with lots of work, but 100% worth it. Hell give you a lot of freedom to be creative with your projects and pushes you to think outside the box. Definitely intimidating at first, but super helpful and gives lots of good feedback.",
        "course": "ARCH3410"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "Like others in my class, I was wary at the beginning of the semester, but Iman quickly became my favorite studio professor to date. You will work yourself to the bone in his class, but the outcome will be 100% worth it. My best work has been done under his guidance, and Im thankful to have had him as my professor.",
        "course": "ARCH3410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 2.2,
    "department": "Architecture",
    "firstName": "Charles",
    "id": "VGVhY2hlci0xMDY1NjAx",
    "lastName": "Cartwright",
    "legacyId": 1065601,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Charles is by far one of the worst professors I have ever had at OSU so it's a shame that this is a required class. Every person I know who has taken this class has hated it. He is impossible to reach outside of class (literally), has no clear grading criteria, and only teaches arcmap which is so much clunkier than other esri software. -100/10",
        "course": "CRPLAN3150"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "He did not teach the full scope of what GIS really is. There were two issues pertaining to that. The class was only a 2 hr credit course and he only used ARCGIS for our gis exploration, when there are so many other ARC applications and capability through esri. Class kinda sucked for the reasons abov and he did not really teach just did how tos",
        "course": "CRPLAN2600"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "People complain about him going too fast in class, but he will help anyone outside of class at any moment. People who do poorly were expecting to get good grades just for turning in projects. ",
        "course": "2600"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "You must focus every second to what he is saying. If you miss any detail good luck with the lab assignments, which are extremely tough and vague as well. He refused to help me outside of class and was never at his own office hours. I HIGHLY RECOMMEND taking the GIS class through the Geography School instead of with Cartwright.",
        "course": "5001"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He's awful. I read these reviews prior to taking his class and thought everyone was just exaggerating.Everything here is true though. He's unclear, requires inordinate amounts of work for a 1 hour class and makes absolutely no sense when lecturing. Avoid!",
        "course": "CRP5700"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Cartwright is a great teacher for the City and Regional Planning department. He is very easy to understand and really knows what he's talking about. He is also very willing to help with any problems you have. His class requires a lot of time and effort, but the amount you learn makes it worth it.",
        "course": "CRPLAN2600"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "Made an already new topic difficult. I honestly believe he makes things confusing and difficult for job security. Honestly, anyone who read the textbook throughly could teach the course just as well, if not better. Also and exam of 35 questions where 1 is worth 40% of the grade... come on.",
        "course": "LARCH662"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "This is one of the worst teachers at knowlton.  He uses PowerPoint to teach math problems and does not work them out. The examples given in class do not reflect what are on the HWs, so everyone gets bad grades on the HWs and he doesn??t care. You are given hundreds of pages to read and the exam questions are unimportant points in the reads that yo",
        "course": "LARCH625"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Does not give good explanations on powerpoint math equations (which also have a ton of errors). Complained to entire class that grades were not good..doesn't that say something about the professor&#63; Class was to be linked to design studio but is not. Class is to build a trash can, aka waste of time! 3 cred class with a work load of a 4.5 cred class.",
        "course": "LARCH625"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.6,
    "department": "Architecture",
    "firstName": "Aimee",
    "id": "VGVhY2hlci0yMTcyODg=",
    "lastName": "Moore",
    "legacyId": 217288,
    "numRatings": 79,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Aimee is really sweet and caring. She takes real investment in this class and her material. This class is really fun; we went downtown Columbus once a week and learned by experiencing. The maps she has you do can be very time-consuming, but you will learn a lot form them.",
        "course": "ARCH4880"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Participate, read the grading criteria, and TRY. Aimee truly treats students like adults and holds slackers accountable. If you don't want a professor that expects participation, go to college asynchronously online.",
        "course": "ARCH2300"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "I took an Arch History college course in high school so 2300 was sort of a review for me. Aimee is actually the worst. People would ask simple questions about some projects and she would just make up responses that weren't even accurate. How does someone who has studied arch their whole life not know about the columns at the Parthenon... smh",
        "course": "ARCH2300"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "*WARNING* Aimee Moore is a very petty professor that will hold any small thing against you. If you forget to turn your camera on let alone not speak one class she will hold that aghast you for the rest of the class. Not sure if this was just for me or not but she is a very tough grader. I thought I was in collage not in elementary school again.",
        "course": "ARCH2220"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "She acts pretty pretentious, and she probably means well but I could not get over a deep seated dislike of her all semester. Was hard to stay awake and attentive during her lectures. Thanks, Aimee",
        "course": "ARCH2300"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor can be rude at times and a bit disrespectful. Very informative class that goes over a lot of material. Tough graders.",
        "course": "ARCH2300"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely the worst professor that I have ever had in my entire career as a college student. She has been extremely unhelpful and unforgiving during COVID. Avoid her at all costs. If she does not like you, she will make it known. She does not respond to emails and will not meet with you. She canceled her office hours every single week.",
        "course": "ARCH2300"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "If you want to major in architecture and are looking for a class to really inspire you and provoke a sense of fascination and amazement, DO NOT TAKE THIS CLASS! This one is particularly brutal for students not used to the college workload, and, in conjunction with other heavy classes is enough to deliver a final blow to your soul early. Expect work",
        "course": "ARCH2300"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Aimee gets a lot of flack on here from students who expect to not do work, not show up, and not participate. The class really isn't difficult if you put in the bare minimum amount of expected effort. She relies on her TAs which is honestly a positive because they end up being really helpful. She definitely can be petty to students in class though.",
        "course": "ARCH2300"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 2,
        "comment": "Took a study abroad class with her,shouldve realized was a mistake because I took her lecture before. Many comments talk about how she comes off as petty/disrespectful which true. although shes well traveled,on the trip there were a few times she came off culturally insensitive to the locals and our tour guide-Gave me a B for a participation course",
        "course": "ARCH5798"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "I strongly dislike Aimee as a person. Lectures aren't very accessible on Carmen. Sure, you may be able to watch the video of the lecture, but good luck skipping around until you find that one slide that you need. While she is very passionate about what she teaches, she is condescending and she rubs me the absolutely wrong way. Very petty person.",
        "course": "ARCH2300"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 2,
        "comment": "Aimee tries to be nice but really isnt. She is very well traveled and is an excellent resource so get on her good side, participate, and get her to know your name. Papers are graded hard but the tests are easy. Make sure you go to class if you want participation points. Dont go on your phone and pay attention or you will be called out in class.",
        "course": "ARCH2310"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Literally the worst professor ever. Posts lectures online, but attendance is required. TA's can't grade. A very rude disrespectful woman. I failed the class.",
        "course": "ARCH2300"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Aimee is a very fair professor. She provides adequate exam prep but always go to lecture. Sometimes she can come off as petty, but she is passionate about what she teaches and wants to help you learn. Do not buy textbooks, as she only references them in lecture. There are 2 papers, which are graded by TAs so the paper grade depends on them.",
        "course": "ARCH2300"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "lectures are interesting. Participation is somewhat important. Shes not accessible out of class, she hardly replies back to your emails. I also took her arch 4880 class and she lost my map which of course didn't get graded.",
        "course": "ARCH2300"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "Aimee is a very eccentric woman who kind of rubs you wrong but you don't know why. Don't get discouraged by how annoying she is and skip class because she takes attendance in the 200 person lecture and WILL deduct points, and it's the same for recitation. If you go to class, you will get an A; her lectures are the exactly what is on the exams.",
        "course": "ARCH2300"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Seems really nice from a distance but is actually quite inconsiderate at office hours especially when it comes to personal issues. Grades depended more on my TA rather than on the professor herself. If you TA is a tough grader-especially if it comes to diagramming, good luck because you are going to need it. She gives extra credit which helps.",
        "course": "ARCH2300"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "Don't buy the textbooks!!!! She comes across as a little weird but she's nice and teaches well. TA's will be a better resource to you than she will be though! Only two papers that are fairly short but you need to have a solid grasp on diagramming. Essay questions for exams are given ahead of time. The material isn't hard, just a lot to memorize.",
        "course": "ARCH2300"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good professor clearly enjoys the position. Participation in class will benefit you greatly; don't just show up and sit through the whole lecture. Show her that you're engaged. Exams are very lecture based so take good notes. Try to never miss class. Missing one or even two isn't the end of the world but seriously, for this class lectures are key.",
        "course": "ARCH2300"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 2,
        "comment": "pretends that she is latina, I am waiting for someone to tell her that she is not",
        "course": "ARCH2300"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 4,
        "comment": "Class was good, prof was super obnoxious. She gets very impatient if you don't understand or interpret things the same way she does. Showing up for lecture is a must, as is taking good notes, because the exams are very specific. Also didn't appreciate the way she spoke to/interacted with her TAs.",
        "course": "ARCH2300"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 4,
        "comment": "Arch 4880 (Explore Columbus) was much harder than advertised. Every class you had to turn in a map where you walked in class last week which took a large chunk of time to make. Other than those pointless assignments I loved the class!. You get to know Aimee on a more personal level and you get to explore the city.",
        "course": "ARCH4880"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 4,
        "comment": "I went to all the lectures and still struggled. She post all of he lectures online so you can  rewatch anything. Honestly I think your grade depends on your TA since they do most of the grading. Papers are tough but Aimee is willing to help if you go to her office hours. Study the study guide and test should be easy. Tons of Extra Credit tho.",
        "course": "ARCH2300"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 1,
        "comment": "Everyday the class starts with her trying to figure out how to use the computer for 30 mins. Final grade didn't go until the night it was due. I got above 100% on all three exams, and got a B in the class. She seems like she will help you out with any question you have but she never emails back and blows you off like you're nothing. Awful.",
        "course": "ARCH2300"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 4,
        "comment": "If  English is not your first language, her course could be a DISASTER.",
        "course": "ARCH2300"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely loved this class! Each week you visit a different location around Columbus and get to walk around the city and/or tour different locations. While it's best geared for someone unfamiliar with Columbus, I'd still take it even if I was a senior. I learned a lot, had tons of fun, and got to know Aimee at a more personal one-on-one level.",
        "course": "ARCH4880"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved her class and don't agree with the negative reviews so many people have left. She knows a ton and I learned a lot from her. While it's a lot of work, I enjoyed it all and came away with a lot of new and interesting knowledge. Take the time and effort to get to know her--it'll really pay off and you'll realize she's really a great person.",
        "course": "ARCH2300"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 3,
        "comment": "Overall a pretty good teacher. Don't dare to get up and leave during a lecture or skip the lectures in general, you'll be crucified. Take great notes, every word she says is fair game for exams. I was always afraid to ask questions or go to office hours, she can be pretty hostile if she thinks she already covered something enough. Good luck!",
        "course": "ARCH2300"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 2,
        "comment": "4880 isn't as fun as it seems, expect a heavy load of work but as long as it's completed she usually gives an A. I do recommend for first year ARCH students, taking this class will allow you to get on a more personal level with her as a professor which is always a good thing",
        "course": "ARCH4880"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not the best but not the worst. Don't skip class it'll come back to haunt you & take really good notes. Make flash cards for the exams & get good at drawing diagrams for the papers. Wouldn't take this class if it wasn't required. Expect to work hard because good grades are earned in this class & not handed out.",
        "course": "ARCH2300"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 4,
        "comment": "Aimee is really a great teacher. She helps me a lot. If you have questions, just ask her, she is so nice to solve every problems!",
        "course": "ARCH2300"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 3,
        "comment": "Look I cant tolerate how pretentious she is.",
        "course": "ARCH2300"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "Aimee is a great professor, it was the most interesting class I had last semester. You need to go to lecture and study the material, but if you do this you will for sure get an A! She covers a lot of material in a short amount of time, so just pay attention and keep up!",
        "course": "ARCH2300"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 2,
        "comment": "I know Aimee can be somewhat polarizing, but honestly, if you show up to class and if you respect her, she's fine. Personally, this class was a huge influence in my decision to switch to architecture because not only is the content SO interesting, but Aimee is such a great lecturer, you can really tell she has a passion for what we discuss.",
        "course": "ARCH2300"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 3,
        "comment": "I'm doing well in this class, but the lectures are long, and you need to pay attention. If you miss a class, you're basically missing points on the test. She knows what she's looking for on tests, so listen and pay attention when she repeats herself and makes things seem important because it will most likely be on the exams. ",
        "course": "ARCH2300"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 4,
        "comment": "It's an average class. Notes taken in class are a MUST. If you miss one thing you have a potential for missing it on the test. If you ask for help she, or her TA's will most likely help you. Definitely more work then a 3 credit class. ",
        "course": "ARCH 2300"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was an easy A for me because I paid attention. She only tests you on stuff that she says in class, no surprises. So take good notes and you'll be fine. Oh, and she gives out a study guide before each test. Study it and you'll get an A, easy as that. She doesn't deviate from it at all, (the one time she did was the only question I missed)",
        "course": "ARCH2300"
      },
      {
        "index": 38,
        "rating": 1,
        "difficulty": 5,
        "comment": "Take notes!!!",
        "course": "ARCH2300"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 3,
        "comment": "Come to class, take good notes, and study what she tells you and you'll be fine. Pretty fair, but if you're not perfectly correct with your answers don't be surprised to lose points",
        "course": "ARCH2300"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 3,
        "comment": "She jams all this information in like 2 hours and once she says something, you won't hear it again so get ready to share notes with a friend or something. Just make sure you take notes because the tests (about 4 including the final) are based on the things she says in lecture. She usually tells you if what she's talking about will be on the test",
        "course": "ARCH2300"
      },
      {
        "index": 41,
        "rating": 2,
        "difficulty": 4,
        "comment": "Missed recitation once and she hated me. Lectures are long and she talks fast, get ready to take notes because she tests you on details she mentioned once in lecture. Book is not necessary, but helpful so you have less notes to take in lecture. Class counts as a GE but I would never take this if I wasn't an architecture major.",
        "course": "ARCH2300"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 5,
        "comment": "avoid at all costs. worst professor I have EVER had. this class should definitely not be available as a GE, either.",
        "course": "ARCH2300"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 2,
        "comment": "She will skirt around the actual topic instead of actually answering questions. She lets students lead class discussions because she has no idea what she's talking about",
        "course": "ARCH2220"
      },
      {
        "index": 44,
        "rating": 1,
        "difficulty": 5,
        "comment": "She spoke quickly and was honestly kind of mean to some of the students. She crucifies students that miss class too. It is not hard to do well on some of the assignments since the TA's grade them and are reasonable, all the assignments she grades are graded very harshly, far too harshly for an intro class.",
        "course": "ARCH200"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 4,
        "comment": "she's a decent teacher towards the beginning but as the semester was ending she just was talking about whatever she felt like, including her children and family vacations. She speaks way to fast and if you miss a lecture you're pretty much screwed for the information, a great class to sleep in though.",
        "course": "ARCH1210"
      },
      {
        "index": 46,
        "rating": 1,
        "difficulty": 5,
        "comment": "She thinks that shes God's gift to the students, when in reality, shes a very bad professor. She has tests and quizzes that either have nothing to do with what she went over, or are just over material that is irrelevant. If you aren't an Architecture major in this class, she'll grade you subjectively.",
        "course": "ARCH200"
      },
      {
        "index": 47,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lectures are extremely boring, the quizzes are set up in the strangest fashion and test the most useless knowledge. Wouldn't normally complain about a quiz but this is just straight stupid, there is no reason one would need to know the specific name the locals called the land a certain building is on if it isn't well known.",
        "course": "ARCH200"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's very nice and eager to help students - except she's pretty busy and speaks way too fast. The class is always in the morning so... bleh",
        "course": "ARCH200"
      },
      {
        "index": 49,
        "rating": 2,
        "difficulty": 4,
        "comment": "class has a lot of work. (way more than a three credit hour class) the professor is not very clear on assignments or in class. She frequently changes quiz study guides the night before the test. good luck.",
        "course": "ARCH200"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really enjoyed having Aimee as a teacher. 200 is a big lecture but she makes an attempt to know every student's name. The class isn't a cinch, but it's worth the effort because you learn so much. Very clear about the subject material. What she says in class is what turns up on the quizzes. You get out of the class what you put in.",
        "course": "ARCH200"
      },
      {
        "index": 51,
        "rating": 3,
        "difficulty": 2,
        "comment": "Honestly cares about her students. Think of the quizzes as test. The papers are easy as long as you are clear and to the point. You have to come to class, you can get away w/ never doing the reading. If you interact in class she'll give you more points. She also give points for improving over the quarter. Get to know her, it'll help later in arch.",
        "course": "ARCH200"
      },
      {
        "index": 52,
        "rating": 3,
        "difficulty": 4,
        "comment": "WAY too much material to be considered 3 credit hour. 3 &quot;quizzes&quot; (more like tests), 2 5-6 pg papers, random recitation assignments. Gives alot of busy work. GO TO LECTURE!!! Counts towards grade",
        "course": "ARCH200"
      },
      {
        "index": 53,
        "rating": 2,
        "difficulty": 3,
        "comment": "The subject matter could be interesting, but she seemed not to want to change the status quo. Names and dates is all there is. Seems like there should be more to history than that... she's fine, as far as it goes, but not particularly interesting. You'll yawn your way to an A or B with her stacatto keeping time.",
        "course": "ARCH200"
      },
      {
        "index": 54,
        "rating": 3,
        "difficulty": 3,
        "comment": "I did not care for her as a teacher, but the class itself was interesting if you like architecture.  Also, use flash cards to study, makes it so much easier.  Go off the study guides too, and you should do fine.",
        "course": "ARCH200"
      },
      {
        "index": 55,
        "rating": 4,
        "difficulty": 4,
        "comment": "She may come off as a little mean, but she truely wants her students to do well.  Has understanding of the course, but I felt like it should be 5 credit hours, instead of 3.",
        "course": "ARCH200"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 5,
        "comment": "she talks fast. really fast. this is a 3 credit hour class, she teaches it like its 5.",
        "course": "ARCH200"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 58,
        "rating": 2,
        "difficulty": 5,
        "comment": "Hard",
        "course": "ARCH200"
      },
      {
        "index": 59,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 60,
        "rating": 1,
        "difficulty": 3,
        "comment": "First off...your name is Amy...not whatever you keep saying it is...secondly she goes like 561564 miles per second so i am taking notes (for me and all the other scholars)",
        "course": "200"
      },
      {
        "index": 61,
        "rating": 2,
        "difficulty": 2,
        "comment": "So she thinks she knows everything, but she will never be Jackie. but I guess she can try if she wants.",
        "course": "202"
      },
      {
        "index": 62,
        "rating": 4,
        "difficulty": 1,
        "comment": "Her scarf (you know the one) made me giggle... so pretentious....",
        "course": "ARCH200"
      },
      {
        "index": 63,
        "rating": 1,
        "difficulty": 5,
        "comment": "Aimee was a total B*%&# !!!  She made me hate architecture with this useless and boring class.  It took up so much time, even though it was only 3 credits.  She's an evil woman!  Don't take her class unless you absolutely must!",
        "course": "ARCHH200"
      },
      {
        "index": 64,
        "rating": 1,
        "difficulty": 3,
        "comment": "She def drove me crazy. the class should def be worth more than 3 credit hours especially if you have to listen to her talk about her vacations all the time. It's a make or break class. Good Luck!",
        "course": "ARCH200"
      },
      {
        "index": 65,
        "rating": 3,
        "difficulty": 5,
        "comment": "for those undecided- this will definately make or break the decision, as an introductory class, felt overwhelmed by the diagrams, talked very quickly, barely enough time to finish the midterm/final, worth more than 3 credit hours",
        "course": "200"
      },
      {
        "index": 66,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 67,
        "rating": 3,
        "difficulty": 2,
        "comment": "Aimee loves what she does, but is rather vague.  Some people in the class did not like her, but I had no problems.  The class work was not difficult, but could be time consuming.",
        "course": "ARCH200"
      },
      {
        "index": 68,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 69,
        "rating": 4,
        "difficulty": 1,
        "comment": "A great teacher who made class and the trip to London a lot of fun.",
        "course": "HONORS296"
      },
      {
        "index": 70,
        "rating": 1,
        "difficulty": 4,
        "comment": "Contradicts herself alot, very rude, and very unorganized. But I did enjoy looking at her vacation photos...because that is all she teaches with!",
        "course": "ARCH200"
      },
      {
        "index": 71,
        "rating": 3,
        "difficulty": 4,
        "comment": "Aimee is an interesting lecturer but she does talk fast.  You have to take notes all class long and rather rapidly.  Her tests aren't too difficult but require alot of preparation.",
        "course": "ARCH200"
      },
      {
        "index": 72,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her class was looking at her travel photos!",
        "course": "ARCH200"
      },
      {
        "index": 73,
        "rating": 5,
        "difficulty": 4,
        "comment": "Challenging class with annoying emphasis on diagrams..but I was interested and enjoyed the lectures for the most part. Aimee' is a good lecturer for her age; seemed interested in the subject! I liked her.",
        "course": "ARCH200"
      },
      {
        "index": 74,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 75,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 76,
        "rating": 3,
        "difficulty": 4,
        "comment": "I cannot stand this lady. A lot of memorization, and she was not very helpful",
        "course": "INTRO"
      },
      {
        "index": 77,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "ARCH200"
      },
      {
        "index": 78,
        "rating": 4,
        "difficulty": 4,
        "comment": "Aimee is awesome.  Her class is hard but she is trying to get students ready for l/architecture.  There is too much memorization but a good amount of creativity.  Aimee and her TAs were always very helpful and nice.",
        "course": "ARCH200"
      },
      {
        "index": 79,
        "rating": 4,
        "difficulty": 2,
        "comment": "Too much memorization, but otherwise interesting class.  She can be quite the itch-bay at times.",
        "course": "ARCH200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Architecture",
    "firstName": "Zelig",
    "id": "VGVhY2hlci0yNzE4MDEw",
    "lastName": "Fok",
    "legacyId": 2718010,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Zelig Fok at Kent State University for a Third-Year Architecture Studio. He was an excellent professor that wanted his students to succeed and become critical architectural thinkers. Zelig was always there to assist students and challenged us to expand our conceptual horizons. I recommend this professor to all.",
        "course": "ARCH30101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "If given the opportunity, take Zelig. Creates an amazing studio environment that translates into projects that are very rewarding if you put effort into them. Critiques are thorough and very intellectual; can provide adequate feedback for just about anything. Highly recommend any class taught by Zelig",
        "course": "ARCH301"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "translates into projects that are very rewarding if you put effort into them. Critiques are thorough and very intellectual; can provide adequate feedback for just about anything. Highly recommend any class taught by Zelig",
        "course": "ARCH301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.9,
    "department": "Architecture",
    "firstName": "Dow",
    "id": "VGVhY2hlci0yMDEzNTE5",
    "lastName": "Kimbrell",
    "legacyId": 2013519,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Funny guy. Easy A. He absolutely hates technology and doesn't know anything about Rhino or Illustrator - so good luck getting help. Tends to get flustered pretty easily with Zoom.",
        "course": "ARCH2420"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dow is very funny, though he often goes off on random tangents so be prepared to just sit and wait for him to finish because he loves the sound of his own voice. Dow gives great feedback and really helps elevate your designs to the next level. He occasionally will make your section do more work than the others, but it is worth it in the end.",
        "course": "ARCH2410"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I highly recommend taking studio with Dow. He gave me the confidence I needed to succeed in studio. Put much effort in your drawings and models, and Dow will be happy. He is slightly eccentric, but it makes class interesting and makes him a fun person to talk about your project with. Overall, he is a great person to have for a studio instructor.",
        "course": "ARCH2310"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great studio instructor, I had an amazing time in studio largely because of Dow. Gave great feedback and was pretty funny, too. The only way to displease Dow was so a completely and obvious lack of effort or blatantly ignore his instructions, otherwise he clearly enjoyed what he was doing and was a great instructor.",
        "course": "ARCH2310"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dow is a little eccentric, which can make class fun but also makes it difficult to understand what he really wants out of you. He gives a lot of feedback on projects (be sure to ask him specific questions if you want specific answers!) No clear grading criteria, it's all about the portfolio at the end of the semester.",
        "course": "ARCH2310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Architecture",
    "firstName": "Erik",
    "id": "VGVhY2hlci0yNTk2NDE4",
    "lastName": "Herrmann",
    "legacyId": 2596418,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Erik gives great feedback and he really likes for his students to take risks. He is very talented and it's fun to pick his brain about rendering skills and other techniques for representation. He is very supportive and a kind guy. Ask questions! And don't be afraid to take risks.",
        "course": "ARCH5610"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Erik is very well spoken and intelligent, giving great feedback and personally caring about you as a student. He is very talented and helpful when it comes to designing projects or picking things out graphically. He taught this representation class very well, and I learned a lot. His projects were fun and honestly didn't feel like homework.",
        "course": "ARCH5620"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Architecture",
    "firstName": "Ryan",
    "id": "VGVhY2hlci0yNjA0MjMx",
    "lastName": "Scavnicky",
    "legacyId": 2604231,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ryan is literally the best professor in all of KSA. He actually cares about his students and does not have the ego that 99% of KSA professors have. He is down to earth, caring and really pushes his students to think creatively. My studio projects were amazing because he allowed me to push the envelope instead of playing it safe. He is the GOAT!!",
        "course": "ARCH2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 3.7,
    "department": "Architecture",
    "firstName": "Kimberly",
    "id": "VGVhY2hlci0yMjQ0MTE2",
    "lastName": "Burton",
    "legacyId": 2244116,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Took this class in SP21. Easy A if you participate and do your work on group projects. Lectures were interesting, and Professor Burton is more than qualified to teach on the subject.",
        "course": "CRP2630"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Class felt too easy. Attendance is important.",
        "course": "CRP2630"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I enjoyed her Planning for Future Cities course. Expect a lot of conversation and group work. Overall it was an interesting elective.",
        "course": "CRPLAN2798"
      }
    ],
    "SEI": []
  }
]