[
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.4,
    "department": "Art History",
    "firstName": "Karl",
    "lastName": "Whittington",
    "legacyId": 2116547,
    "numRatings": 34,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Had Prof. Whittington for Gender and Sexuality in European Art. You could tell he was very passionate about the specific topics within the assigned readings and lecture (I'm pretty sure he designed the class). There was very little homework and the quizzes were easy. I would have liked more to better engage with the readings, but this is a GE class"
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "He is nice and talking clear, make concept easy to understand!"
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "I have taken multiple classed with karl and I really love his classes. If you need a history of art credit definitely take one of his."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "The lectures were cool, the lowest two quizzes were dropped, and all of the information came from the lectures and was not hard. The Ta's graded everything fair and nice. I wouldn't be scared about the writing since I usually wrote the response papers a couple of hours before the due date (I'm also not the best writer). Highly recommend Karl!"
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "This class was very nice for LVA gen ed requirement, there are 4 response papers and 2 course reflections but they are small (500 - 750). The quizzes are only over the prerecorded lectures and were easy to do well on (lowest 2 are dropped). Spend your time on the writing and this class is very doable and easy. Enjoyable course, you'll like it!"
      },
      {
        "index": 5,
        "rating": "4.0",
        "comment": "Very engaging lectures and the professor is very passionate about what he teaches. That being said, this course was ridiculously difficult. The final paper was long and tedious with little prompting. There are 2 assigned scholarly sources to write about that were beyond difficult to read for an entry level course."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "This professor changed my outlook on art history and academics in general. He's the reason why I have a History of Art minor"
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Karl is SUCH an engaging lecturer. I took his class for a GE, but found myself fascinated by how he presented the content in his lectures. The coursework is minimal, but the material is really interesting. I do not really like art, but it really changed my outlook a lot."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Prof Whittington was super nice and you can tell he is very passionate about the topics he presented. I would recommend going to as many lectures as you can to be prepared for the midterm and final. My TA was incredibly nice as well."
      },
      {
        "index": 9,
        "rating": "4.0",
        "comment": "I took this class as an elective and without high expectations, but Dr. Whittington's enthusiasm and knowledge of art history is contagious. He does a good job making lectures interesting. Almost the entire grade is based off three response papers, a midterm consisting of two essays, and a final with three essays, so be prepared to write."
      },
      {
        "index": 10,
        "rating": null,
        "comment": "Idk why he's getting so many good reviews. Severely demanding for an entry level course. Professor did no actual teaching. The midterm and final are timed lengthy and detail oriented essays, no outside notes and they watch to make sure. I've never been more stressed or irritated from a class before... same rating I gave my physics 2 prof... absurd"
      },
      {
        "index": 11,
        "rating": "4.0",
        "comment": "I would recommend professor Whittington. Although I do not like art he was a great professor and teaches it really well. I would not suggest skipping lectures, his presentations in lecture is where all of the information is at. As well as recitation with his TAs, don't skip those either. If you go to class, pay attention and review you will pass."
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "I love this man. He is amazing. I couldn't choose the course I took but it was a 4000 level study-abroad in Italy. He is truly one of the best professors I've ever had. He is so passionate about the material and will make you love it too. He is also very kind and just a great person. If you get a chance to take a class with him, TAKE IT."
      },
      {
        "index": 13,
        "rating": "4.0",
        "comment": "Class was graded by 4 quizzes, 3 short papers, and 2 tests. Prof. Whittington is very knowledgeable and gives very detailed lectures on each art piece. I personally found this class very difficult because I'm terrible at writing essays which is all the midterm and final is, but if you are good with essays and attend this class should be an easy A."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Prof. Whittington made the content of the lectures much more interesting, and his passion for the subject is extremely obvious. We were graded by written responses almost every week and a midterm and final based heavily on the lecture material, so take good notes. I liked him very much and was satisfied with the class."
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "The content of the lectures were boring, but the professor spoke about them in a way that made them interesting. He graded the weekly response papers very easily. It was easy to get a 100% on those. When it came to the essays on the exams, I studied hard and put my all into the responses and always missed points for something frivolous."
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "You only do 7 assignments throughout the semester and it's all laid out at the very beginning, with no extra assignments except 4 papers and 3 exams."
      },
      {
        "index": 17,
        "rating": "5.0",
        "comment": "Professor Whittington is one of the best, most passionate professors I've ever had. He makes every lecture so easy to listen to. If you take notes and show up, you're almost guaranteed to get an A."
      },
      {
        "index": 18,
        "rating": "5.0",
        "comment": "Prof. Whittington is very passionate about what he teaches and that is shown through his lectures. He makes even boring history seem interesting and is very nice and lenient with grading. There are 3 tests and a few response papers but they are all easy if you watch lecture and take a few notes."
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "Prof Whittington is amazing! He is very passionate about the course material which made lectures enjoyable. I enjoyed this class a lot. There are not too many readings outside of class which is nice. The amount of exams and assignments throughout the semester are fair. Overall he is a great professor, definitely schedule him if you can."
      }
    ]
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.7,
    "department": "Art History",
    "firstName": "Lisa",
    "lastName": "Florman",
    "legacyId": 131550,
    "numRatings": 25,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Had Prof. Florman for 4001 in my first semster. The class is a writing seminar stressing analysis and description of a variety of artworks. Prof. Florman served as a great intro to the field; there was a fair bit of reading (expected in this major) and also a lot of papers, but she gave good feedback and was willing to listen to new ideas."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Ltook her for Art History Renaissance-Modern. It was an easy class. Show up, take notes, and you will do great. Don't buy the textbook."
      },
      {
        "index": 2,
        "rating": "4.0",
        "comment": "Prof. Florman is a wealth of knowledge in the art sphere. She has expert analysis on a huge array of art styles and artists, with amazing specificity in individual pieces. Her class was enjoyable, albeit it being very important to study and prepare to write very rapidly during exams. I would take more classes with her; she makes art intellectual."
      },
      {
        "index": 3,
        "rating": "4.5",
        "comment": "Good teacher. Interesting lecture. You won't want to miss a class."
      },
      {
        "index": 4,
        "rating": "4.5",
        "comment": "Really knows her stuff and speaks eloquently; I loved listening to her lecture. The information was difficult, but very interesting. She's a hard grader but gives you good feedback on your midterms and papers. Definitely go to class."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "She gives amazing lectures. Super smart, friendly, and understanding."
      },
      {
        "index": 6,
        "rating": "4.5",
        "comment": "Great Professor. If you go to class you don't need to buy the book. Everything you need to know for exams are covered in class. Makes the subject interesting."
      },
      {
        "index": 7,
        "rating": "4.5",
        "comment": "Wonderful professor. Don't buy the book if you plan on going to the lectures -- haven't opened once and aced her midterm. She makes a boring subject incredibly interesting and easy to learn. Wish other profs were as excited about their subject as her."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "You can either REALLY read the book and do research, or not buy the book and attend class and pay 100% attention. She is really descriptive and the tests aren't hard if you go to class. She made it interesting. As interesting as this subject can be to someone who doesn't care."
      },
      {
        "index": 9,
        "rating": "4.5",
        "comment": "History of Art - She's a very clear lecturer. Don't buy the textbook, you never use it."
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "Great professor. Truly knows the topics she teaches inside and out. Answers questions very thoroughly. Opinionated, but very open to student opinions as well. She gives out all possible essay questions before the tests, which require some critical thinking but are perfectly fair. Class was kind of reading-heavy, but you can get by skimming."
      },
      {
        "index": 11,
        "rating": "4.5",
        "comment": "Lisa is great. Makes things very clear, even if her own interests come out stronger than the students. (I think that's more the student's fault for not talking enough...)"
      },
      {
        "index": 12,
        "rating": "4.0",
        "comment": "Professor Florman is extremely intelligent and knows her stuff backward and forward. Her class was really interesting and I learned a lot!"
      },
      {
        "index": 13,
        "rating": "4.5",
        "comment": "this professor is very excited about teaching and helping students understand difficult concepts."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Lisa Florman gave the most verbally economical and concise art history lectures. That said, the material is densely presented, so be prepared to keep up. If you're listening, the material is fascinating and compelling. If you drift off, you may as well leave for all the good it will do you. Great class, learned tons, actually retained it."
      },
      {
        "index": 15,
        "rating": "4.5",
        "comment": "Very good teacher...very clear on what she wants from you. Attendance is crucial to make sure you know everything she talks about. Would recommend this class"
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "Good class"
      },
      {
        "index": 17,
        "rating": "4.0",
        "comment": "the original description of the class got me really excited but when i got there i was dissappointed, not because the class was bad, just because it ended up being something completely different than what i thought. we talk about critics, specifically greenburgh, rather than works. florman really knows her stuff though, and teaches it very well."
      },
      {
        "index": 18,
        "rating": "5.0",
        "comment": "Very good lectures. Make sure you go to class everyday. She'll give hints for the exams on a days when there aren't that many people at the lectures. Overall great class, but tests are somewhat hard. Know your stuff!"
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "No Comments"
      }
    ]
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.8,
    "department": "Art History",
    "firstName": "Mark",
    "lastName": "Svede",
    "legacyId": 817722,
    "numRatings": 39,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Incredibly boring lecturer. He's very knowledgeable but doesn't show any emotion or passion in class. He doesn't ask questions to the class or engage with students, he just lectures in the most boring way possible."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Svede is a great professor. The class involves a lot of homework, which includes reading essays and watching films. He cares a lot about his students and is very understanding. He has great understanding of film, and his lectures are relatively engaging. There are times where he can ramble, but they're not too terrible. He tells it as it is."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Was perfectly fine I guess until final exam when he did not post his slideshows and I could not do the exam. He further sent a rude email saying I did not take notes. I understood that I turned an incomplete exam late but I sprained my ankle. He does not teach and rants in class. He also only taught our theories through others essays."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Took this class a while ago but forgot to review. Mark is exceptionally knowledgeable of the material he teaches. This class is really enjoyable if you're even half-interested in the material. Exam questions are given ahead of time, and he's good about responding to questions over email."
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "Hes a great guy and easy grader. He shows you all the potential questions before the exam and pick half for the actual exam. The topics were easy and he encourages people to work together on the questions for the exam so it was an easy A. No outside the classroom written work just watch the movies before class. Quizzes on movies is one question."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "While the course content can be a bit dull at times, Mark is a master in his field. His lectures are a bit all over the place, but the amount of information and facts that you get on the topic is insane. He is friendly to everyone who wishes to talk to him and he gives you the midterm/final questions in advance."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "this class is horrible!!!!"
      },
      {
        "index": 7,
        "rating": null,
        "comment": "His lectures, while informative, are not always directly helpful towards passing the tests. There are no slides available to help guide you. While he encourages participation, he is often rude to those who give answers which he either disagrees with, and/or deems incorrect. The T.A. grades the tests pretty hard, which makes it important to attend."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "Very boring lectures. Mark is barely available to speak outside of class as he will redirect you to his TA if you have any questions. These TA's are also very hard graders so don't expect an A. There is also no real grading rubric for the exam so expect a random grade with no reason and to be redirected to a TA if you question the grade you get."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "He is a genius and it shows. This class is well worth your time if you have any interest in art or film whatsoever. Take notes and participate during the in-class discussions and you will do very well. If you don't go to class and don't write notes from the discussions, you will not do well. It's as simple as that."
      },
      {
        "index": 10,
        "rating": "4.0",
        "comment": "Mark is incredibly smart and can talk about a movie for hours. He's a really cool guy. That being said, this class was very boring for me, although that may be because I took this as a GE and am not very interested in film. He grades very hard on the exams because he gives you the questions ahead of time. If you don't come to class you won't pass."
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "Take this class!! Professor Svede is amazing. You have to go to class to do well on the midterms and you have to watch all of the movies because he has quizzes."
      },
      {
        "index": 12,
        "rating": "4.5",
        "comment": "I really enjoyed his class, he is very knowledgeable in his field and I found it to be intellectually stimulating! Definitely utilized \"different\" films, but they weren't awful.  3 essay exams, he gives you a possibility of 5 Questions prior to exam, and he picks 3; that being said, the grading (I'm assuming a TA) is very picky.  Don't expect an A."
      },
      {
        "index": 13,
        "rating": "4.5",
        "comment": "Definitely an intellectual who delved deep into the material. The class was very stimulating, and I learned a lot. Unless your cinema knowledge is very developed, you'll want to attend class. There are several quizzes and three exams He gives you 5 possible exam questions, three of which are on the exam, so you always know what to study."
      },
      {
        "index": 14,
        "rating": "4.5",
        "comment": "Svede has to be my favorite professor so far at OSU. He is extremely intelligent and the class was mentally stimulating. Extremely helpful and quick to answer any questions you have outside the classroom. For the most part, good movie choices - wish there had been a little more selection. Tests aren't too bad, just review and study."
      },
      {
        "index": 15,
        "rating": null,
        "comment": "Attendance is basically mandatory because you have quizzes after every screening.  Not an easy A. Grading on exams is kind of tough in my opinion."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "Really nice teacher, if you stay aftr class and ask questions he's very thorough. The movies are not very exciting and get pretty boring and were hard to follow. I only used my book for terminology and help in writing essays but I am sure yu can google it. Tests were all essays. He gives you 6 propts the week before then chooses a couple in the end"
      },
      {
        "index": 17,
        "rating": "4.0",
        "comment": "Mark is a great teacher and extremely knowledgeable. You can tell he loves what he does. However, this class is very different than what it appears to be. The TA graded everything. Films were interesting to watch, and I was really surprised that this class only counts for visual arts."
      },
      {
        "index": 18,
        "rating": null,
        "comment": "Mark is a nice guy, I liked him. I DID NOT like the class. I took is as a GE for visual arts, not what I was expecting. The grading is extremely ambiguous. If you have any questions, ask the TA she grades everything. The films were alright. If you aren't into the arts like me, avoid this class."
      },
      {
        "index": 19,
        "rating": "4.5",
        "comment": "I enjoyed everything about Mark Svede. He is extremely knowledgeable, but in an interesting and inspiring way rather than condescending. He is funny, witty, helpful, entertaining, and is well versed in all aspects of the art world. I just wish he taught more classes here. Awesome class - go, take notes, be attentive - you'll do well."
      }
    ]
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4,
    "department": "Art History",
    "firstName": "Illya",
    "lastName": "Mousavijad",
    "legacyId": 2920851,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "This was a pretty awesome class. I learned a lot although I had little knowledge coming into this class. Illya is amazing. Very caring and generous. Definitely recommend taking Comp Animation with him."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Amazing class. Illya is very knowledgeable and caring."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "I took Comp Animation with Illya. I learned a lot. This class changed my perspective on animation! Illya is very knowledgeable, caring, and thoughtful. But he is very serious and strict with attendance and student performance. This can make the course difficult, but also really push students to work hard and make progress on their projects."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Class: Computer Animation\nUnrealistic expectations.\nDidn't know the material he was teaching. \nSpend half of the class learning the material than teaching us.\nExtremely critical. \nRude/condescending.  \nunorganized, Indecisive\nyell at u in front of the class. \nonly gives 5 absences no sick/other exception after. \nAvoid at all costs!"
      }
    ]
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.8,
    "department": "Art History",
    "firstName": "Christina",
    "lastName": "Mathison",
    "legacyId": 1864002,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Be careful to choose this class"
      },
      {
        "index": 1,
        "rating": "4.0",
        "comment": "If you don't go to class, you won't pass!! She goes over artwork once and doesn't really repeat the notes she talks about."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "I took the class for a GE credit and I loved having Ms. Mathison in class ^^, her lectures are pretty easy to follow. I would say you may be bored if you're not too interested in art history but the assignments aren't too bad- just pay attention in lecture and take general notes and you'll do well. She's helpful outside of class"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Personally, I think Prof. Mathison taught this class really well! However, I don't think her class is an easy A but it isn't impossible. She doesn't have many assignments, only the bi-weekly notes and a few short essay response. Her midterm and final are a little more difficult because of the time but as long as you make good notes, you'll be fine."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Her lecture has tons of information, it's very hard to follow her speed to take notes. Even though I'm from East Asia, there are many contents I don't familiar with. The grade almost based on the weely notes, if you cannot take good notes, you are screwed. If you take this course just for GE credit, the best way to keep a good GPA is RUN!"
      },
      {
        "index": 5,
        "rating": null,
        "comment": "Although I really hate her, I have to agree she teaches good. But if you don't interest in hisart and only come for credit then just RUN! Her lecture has tons of information every second and she doesn't even have a recording. She grades notes even! These notes helps exams, but exams are kind of hell. You could learn much, but get poor grade."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "This was a relatively easy class if you pay attention and take good notes! You have to turn in your notes every two weeks, but those notes come in handy when it's time to make cheat sheets for the exams (she allows 3 pages of notes, front and back). The exams were timed which made it somewhat difficult. All her lecture materials were interesting!"
      },
      {
        "index": 7,
        "rating": null,
        "comment": "This class was a very stressful displeasure for the semester I was enrolled in it. Please be aware that it is impossible to receive a perfect grade in the class because the way assignments and tests are scored. The tests are too lengthy to complete in the alotted time given for them. Do not take this class unless it is necesarry."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Dr. Mathison is an amazing professor. Her lectures were interesting and she used appropriate language for a GE course, so the information felt accessible and engaging. You have to turn in your notes every week, but it helps for studying for the difficult timed exams (midterm and exams). Was my hardest class, though, so don't take for an easy A."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "This was a relatively easy class and if you take good notes (and submit them on time!!) you should be fine. The exams are somewhat difficult due to the short time you have for each essay, but if you fill out the cheat sheet she lets you have, you should be okay."
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "Dr Mathison is easily one of my favorite prof. She is so engaged in the materials and she really cares about the students."
      },
      {
        "index": 11,
        "rating": null,
        "comment": "If you can't get E in this class, it will not meet her purpose."
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "I loved her class. She is a great person and a great professor. Her TA's grade very tough, but she offers help when needed. Only issue is the exam is timed and it's nearly impossible to answer the essays in the six minute time limit. There isn't a lot of homework which makes it hard to get a good grade if you do bad on the paper or exams."
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "she is a great pro but she is a really tough grader, probably the toughest grader i ve ever seen in my life. 3 points extra credit i only got 0.06 and the highest grade is 0.1. Her TA was a tough grader as well. But overall, she is a good pro, she knows what is she teaching about and has a clear schedule, but the class is so hard."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Great professor, and very clear about what she wants on Tests, papers, assignments. Class isn't too difficult, but the exams are just memorization of pictures of artworks with main points of style, symbolism, religious affiliation, and etc. Attendance is mandatory which isn't too bad, and there are lots of extra credit opportunities. TBH my fav GE!"
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "Best GE I ever took. It was pretty work-intensive (two article readings and responses per week) but Dr. Mathison made it interesting and her passion was contagious. She obviously knows what she's talking about and offered many extra credit opportunities. Start memorizing the monuments ahead of time or the tests will kill you."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "She seems to think that this is a 4000 level class, not a 2000 level. There are only 3 grades + participation. The midterm and final and strictly essay questions and you must memorize."
      },
      {
        "index": 17,
        "rating": "4.0",
        "comment": "I learned a ton from her. Just show up to lecture, it's an amazing class. Her exams are extremely detailed in what they ask for but you can definitely cram if you're into that. The recitations are actually really useful. I think it's a good alternative for a GE class that you actually want to learn from."
      },
      {
        "index": 18,
        "rating": "5.0",
        "comment": "You can tell she really cares about what she teaches, and so you too have to care in order to not find this class dreadfully boring. She really goes into depth about the color, the texture, the brush strokes, & for someone who was taking this class due to an interest in history and how it influenced art (not JUST art), I was a little disappointed."
      },
      {
        "index": 19,
        "rating": null,
        "comment": "The key to this class is to really keep up with studying and take good notes. It is all memorization and the tests are tightly timed, so you need to be able to write down information quickly.  As long as you study and prepare, you will do well. Professor Mathison is very nice and will help if you ask for it."
      }
    ]
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.3,
    "department": "Art History",
    "firstName": "Karl",
    "id": "VGVhY2hlci0yMTE2NTQ3",
    "lastName": "Whittington",
    "legacyId": 2116547,
    "numRatings": 36,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Karl Whittington is really nice and cares about his students. He always provides plenty of trigger warnings for those that need them during harder to discuss topics. He always engages with the discussion posts and provides good feedback. His lectures are also super interesting even for someone who couldn't care less about art history.",
        "course": "HISTART3010E"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "I've learned practically nothing about the art's history and historical meaning and have just been preached to about the feminist meaning of the art. He knows little about the mythology behind the art and called Athena and Poseidon siblings. The way he taught Christianity was misrepresentative and honestly offensive to me as a Christian.",
        "course": "ARTHIST2001"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Had Prof. Whittington for Gender and Sexuality in European Art. You could tell he was very passionate about the specific topics within the assigned readings and lecture (I'm pretty sure he designed the class). There was very little homework and the quizzes were easy. I would have liked more to better engage with the readings, but this is a GE class",
        "course": "HISTART3010E"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is nice and talking clear, make concept easy to understand! ",
        "course": "HISTART2001"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I have taken multiple classed with karl and I really love his classes. If you need a history of art credit definitely take one of his. ",
        "course": "ARTHIST2001"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "The lectures were cool, the lowest two quizzes were dropped, and all of the information came from the lectures and was not hard. The Ta's graded everything fair and nice. I wouldn't be scared about the writing since I usually wrote the response papers a couple of hours before the due date (I'm also not the best writer). Highly recommend Karl!",
        "course": "HISTART2001"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was very nice for LVA gen ed requirement, there are 4 response papers and 2 course reflections but they are small (500 - 750). The quizzes are only over the prerecorded lectures and were easy to do well on (lowest 2 are dropped). Spend your time on the writing and this class is very doable and easy. Enjoyable course, you'll like it!",
        "course": "HISTART2001"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "Very engaging lectures and the professor is very passionate about what he teaches. That being said, this course was ridiculously difficult. The final paper was long and tedious with little prompting. There are 2 assigned scholarly sources to write about that were beyond difficult to read for an entry level course.",
        "course": "HISTART2001"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "This professor changed my outlook on art history and academics in general. He's the reason why I have a History of Art minor ",
        "course": "HISTART2001"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Karl is SUCH an engaging lecturer. I took his class for a GE, but found myself fascinated by how he presented the content in his lectures. The coursework is minimal, but the material is really interesting. I do not really like art, but it really changed my outlook a lot. ",
        "course": "ARTHIST2001"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Whittington was super nice and you can tell he is very passionate about the topics he presented. I would recommend going to as many lectures as you can to be prepared for the midterm and final. My TA was incredibly nice as well. ",
        "course": "HISTART2001"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took this class as an elective and without high expectations, but Dr. Whittington's enthusiasm and knowledge of art history is contagious. He does a good job making lectures interesting. Almost the entire grade is based off three response papers, a midterm consisting of two essays, and a final with three essays, so be prepared to write.",
        "course": "ARTHIS2100"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Idk why he's getting so many good reviews. Severely demanding for an entry level course. Professor did no actual teaching. The midterm and final are timed lengthy and detail oriented essays, no outside notes and they watch to make sure. I've never been more stressed or irritated from a class before... same rating I gave my physics 2 prof... absurd",
        "course": "HISTART2001"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "I would recommend professor Whittington. Although I do not like art he was a great professor and teaches it really well. I would not suggest skipping lectures, his presentations in lecture is where all of the information is at. As well as recitation with his TAs, don't skip those either. If you go to class, pay attention and review you will pass.",
        "course": "HISTART2001"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love this man. He is amazing. I couldn't choose the course I took but it was a 4000 level study-abroad in Italy. He is truly one of the best professors I've ever had. He is so passionate about the material and will make you love it too. He is also very kind and just a great person. If you get a chance to take a class with him, TAKE IT.",
        "course": "HISTART2001"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 4,
        "comment": "Class was graded by 4 quizzes, 3 short papers, and 2 tests. Prof. Whittington is very knowledgeable and gives very detailed lectures on each art piece. I personally found this class very difficult because I'm terrible at writing essays which is all the midterm and final is, but if you are good with essays and attend this class should be an easy A.",
        "course": "ARTHIST2001"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Whittington made the content of the lectures much more interesting, and his passion for the subject is extremely obvious. We were graded by written responses almost every week and a midterm and final based heavily on the lecture material, so take good notes. I liked him very much and was satisfied with the class.",
        "course": "HISTART2001"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "The content of the lectures were boring, but the professor spoke about them in a way that made them interesting. He graded the weekly response papers very easily. It was easy to get a 100% on those. When it came to the essays on the exams, I studied hard and put my all into the responses and always missed points for something frivolous.",
        "course": "HISTART2001"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "You only do 7 assignments throughout the semester and it's all laid out at the very beginning, with no extra assignments except 4 papers and 3 exams.",
        "course": "HISTART2001"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Whittington is one of the best, most passionate professors I've ever had. He makes every lecture so easy to listen to. If you take notes and show up, you're almost guaranteed to get an A.",
        "course": "HISTART2001"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Whittington is very passionate about what he teaches and that is shown through his lectures. He makes even boring history seem interesting and is very nice and lenient with grading. There are 3 tests and a few response papers but they are all easy if you watch lecture and take a few notes.",
        "course": "HISTART2001"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Whittington is amazing! He is very passionate about the course material which made lectures enjoyable. I enjoyed this class a lot. There are not too many readings outside of class which is nice. The amount of exams and assignments throughout the semester are fair. Overall he is a great professor, definitely schedule him if you can.",
        "course": "HISTART2001"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Whittington has been fantastic. He teaches very clearly and explains work in depth. It can be intimidating to ask questions in a lecture hall course, go up to him after class and ask, he has always been very happy to help. You can clearly see he has a passion for teaching and that helps keep you awake during lecture.",
        "course": "HISTART2001"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "The difficulty for the class is so high. The professor speaks too fast so that I cannot understand the lecture and take some notes about that. The exam is based only on what what the professor said and we should memorize too much thing. Don't recommand for people who is not interested in art.",
        "course": "HISTART2001"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "The lecture is detailed and interesting. If you want to learn something about culture, history and Europe, it is a great GE class for you to take. Recitation is easy and it will review materials in lecture. Students can write notes for masterpieces for tests now. So if you take great notes for lecture, you can get great grades.",
        "course": "HISTART2001"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "have to attend lecture because thats what's on the quizzes, which are very straightforward if you actually go to class. Recitation takes attendance.",
        "course": "ARTHIS2100"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Love this man!! His lectures are so interesting, and diverge from the textbook. I used the book twice, once for a lecture I missed, and once to cite a source for a project. There should be one on reserve in the library if you need. Western History can be very exclusive, but he made sure to include diverse pieces and talk about representation!",
        "course": "HISTART2001"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Whittington is a great lecturer. He explains concepts in a way that anyone could understand. He is extremely passionate about what he does and that shows when he teaches. Overall the class is really interesting and as long as you pay attention and take good notes youll get an A.",
        "course": "HISTART2001"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 3,
        "comment": "I found him to be very nice, educated, and informative- especially to someone not interested in art history. All the info you need for exams is in lecture so don't skip and I didn't buy the book and found that to be completely fine (it just goes into more detail on lecture material). He was passionate about the material - a good professor overall.",
        "course": "HISTART2001"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 5,
        "comment": "The class overall was okay. Attendance is VERY important. Exams are all memorization (40 art pieces name, location, date) and essay responses. If you are not someone who is actually interested in art history, it is hard to get into. Also, if you are a Christian, I felt that the way he discussed Christianity was misrepresentative and offensive.",
        "course": "HISTART2001"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Whittington is super passionate and every single one of his lectures was really interesting. The tests required a lot of memorization but if you get into it and spend enough time with the material, you will get an A easily. He's totally straightforward about what you'll need to know. 10/10 recommend.",
        "course": "HISTART2001"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "Great professor and TA's. However, there are only two exams that are all writing. Meaning you have to memorize 20+ pieces of artwork (name, time period, meaning behind it) to only be tested on about 6 of them for the exams. 4 short essays and recitation to help with your grade, but to be honest these exams require more studying than a GE should.",
        "course": "HISTART2001"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 3,
        "comment": "Karl is the best professor I've had at OSU. He genuinely cares about his work and he understands that most of his students don't care about art history so he focuses on giving his students an appreciation of art and not memorizing facts.",
        "course": "HISTART2001"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 4,
        "comment": "Overall a great professor. If you consistently attend lecture and recitation, take good notes, and put at least some effort into the response papers, you will get an A in this class. Just put in the work and you will see results. The class is very interesting and I would definitely take another class with this professor again.",
        "course": "HISTART2001"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 1,
        "comment": "You do not need the textbook!! Great teacher! He makes lectures that could be terrible interesting.",
        "course": "HISTART2001"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Whittington went above and beyond. I had a very unfortunate week during our final and Professor Whittington could not have been more accommodating. He emailed me on the weekend and responded within the hour (sometimes within 10 minutes!). It's evident he truly cares about his students and their success. Outstanding professor.",
        "course": "ARTHIST2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.8,
    "department": "Art History",
    "firstName": "Mark",
    "id": "VGVhY2hlci04MTc3MjI=",
    "lastName": "Svede",
    "legacyId": 817722,
    "numRatings": 39,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Incredibly boring lecturer. He's very knowledgeable but doesn't show any emotion or passion in class. He doesn't ask questions to the class or engage with students, he just lectures in the most boring way possible.",
        "course": "FILM2271"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Svede is a great professor. The class involves a lot of homework, which includes reading essays and watching films. He cares a lot about his students and is very understanding. He has great understanding of film, and his lectures are relatively engaging. There are times where he can ramble, but they're not too terrible. He tells it as it is.",
        "course": "FILMSTD2220"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Was perfectly fine I guess until final exam when he did not post his slideshows and I could not do the exam. He further sent a rude email saying I did not take notes. I understood that I turned an incomplete exam late but I sprained my ankle. He does not teach and rants in class. He also only taught our theories through others essays. ",
        "course": "FILM2271"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class a while ago but forgot to review. Mark is exceptionally knowledgeable of the material he teaches. This class is really enjoyable if you're even half-interested in the material. Exam questions are given ahead of time, and he's good about responding to questions over email.",
        "course": "HISTART3901"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hes a great guy and easy grader. He shows you all the potential questions before the exam and pick half for the actual exam. The topics were easy and he encourages people to work together on the questions for the exam so it was an easy A. No outside the classroom written work just watch the movies before class. Quizzes on movies is one question.",
        "course": "HISTART2901"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "While the course content can be a bit dull at times, Mark is a master in his field. His lectures are a bit all over the place, but the amount of information and facts that you get on the topic is insane. He is friendly to everyone who wishes to talk to him and he gives you the midterm/final questions in advance.",
        "course": "HISTART2901"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "this class is horrible!!!!",
        "course": "HISTART3901"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "His lectures, while informative, are not always directly helpful towards passing the tests. There are no slides available to help guide you. While he encourages participation, he is often rude to those who give answers which he either disagrees with, and/or deems incorrect. The T.A. grades the tests pretty hard, which makes it important to attend.",
        "course": "HISTART3901"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very boring lectures. Mark is barely available to speak outside of class as he will redirect you to his TA if you have any questions. These TA's are also very hard graders so don't expect an A. There is also no real grading rubric for the exam so expect a random grade with no reason and to be redirected to a TA if you question the grade you get.",
        "course": "HISTART2901"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a genius and it shows. This class is well worth your time if you have any interest in art or film whatsoever. Take notes and participate during the in-class discussions and you will do very well. If you don't go to class and don't write notes from the discussions, you will not do well. It's as simple as that.",
        "course": "HA3901"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "Mark is incredibly smart and can talk about a movie for hours. He's a really cool guy. That being said, this class was very boring for me, although that may be because I took this as a GE and am not very interested in film. He grades very hard on the exams because he gives you the questions ahead of time. If you don't come to class you won't pass.",
        "course": "HISTART3901"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Take this class!! Professor Svede is amazing. You have to go to class to do well on the midterms and you have to watch all of the movies because he has quizzes.",
        "course": "HISTART3901"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed his class, he is very knowledgeable in his field and I found it to be intellectually stimulating! Definitely utilized \"different\" films, but they weren't awful.  3 essay exams, he gives you a possibility of 5 Questions prior to exam, and he picks 3; that being said, the grading (I'm assuming a TA) is very picky.  Don't expect an A.",
        "course": "HA3901"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Definitely an intellectual who delved deep into the material. The class was very stimulating, and I learned a lot. Unless your cinema knowledge is very developed, you'll want to attend class. There are several quizzes and three exams He gives you 5 possible exam questions, three of which are on the exam, so you always know what to study.  ",
        "course": "HISTART3901"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Svede has to be my favorite professor so far at OSU. He is extremely intelligent and the class was mentally stimulating. Extremely helpful and quick to answer any questions you have outside the classroom. For the most part, good movie choices - wish there had been a little more selection. Tests aren't too bad, just review and study.",
        "course": "HA3901"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Attendance is basically mandatory because you have quizzes after every screening.  Not an easy A. Grading on exams is kind of tough in my opinion.",
        "course": "HISTART3901"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "Really nice teacher, if you stay aftr class and ask questions he's very thorough. The movies are not very exciting and get pretty boring and were hard to follow. I only used my book for terminology and help in writing essays but I am sure yu can google it. Tests were all essays. He gives you 6 propts the week before then chooses a couple in the end",
        "course": "HISTART2901"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mark is a great teacher and extremely knowledgeable. You can tell he loves what he does. However, this class is very different than what it appears to be. The TA graded everything. Films were interesting to watch, and I was really surprised that this class only counts for visual arts.",
        "course": "HA3901"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mark is a nice guy, I liked him. I DID NOT like the class. I took is as a GE for visual arts, not what I was expecting. The grading is extremely ambiguous. If you have any questions, ask the TA she grades everything. The films were alright. If you aren't into the arts like me, avoid this class.",
        "course": "HA3901"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "I enjoyed everything about Mark Svede. He is extremely knowledgeable, but in an interesting and inspiring way rather than condescending. He is funny, witty, helpful, entertaining, and is well versed in all aspects of the art world. I just wish he taught more classes here. Awesome class - go, take notes, be attentive - you'll do well.",
        "course": "HA350"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "Enjoyable class that makes you look at film from a new perspective. Harder grader but if you go to class and pay attention you shouldn't have any problems.",
        "course": "HA350"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "This is not a blow-off easy GEC as I thought it would be going into it, but it turned out to be an intellectually challenging and interesting class. Mark will make you look at films in a whole new way and will entertain you with his dry sense of humor. If you go every day, take detailed notes, and use the test preparation materials you will be fine",
        "course": "HA350"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "Mark Svede made class interesting and fun. The movies we watched were very diverse and thought provoking. I would recommend this class to everyone if you can fit it in your schedule.",
        "course": "HA350"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "Go to class, keep an open mind (really open) and try to think outside your &quot;bubble&quot;, have fun, & you'll be fine. I like Mark a lot; he has a pleasantly sweet attitude, dead pan sense of humor (I love it!)-  I like the challenge he poses to expand your vocabulary- we're in college after all. You don't have to like the films, just be co-operative.",
        "course": "HIST350"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Enjoyed the class, never watched foreign films before. Mark was great, listened to the students thoughts. Would recommend others to take his course.",
        "course": "HA350"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is a good teacher and i enjoyed the class but very hard grader and if you don't go to clss don't expect an amazing grade.",
        "course": "HIST260"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "Grades so much harder.",
        "course": "ARTHI350"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "all you need to do is go to class and take notes.  only graded on three exams.  gives 6 questions before the exams and chooses 3 the day off.  that's IT.  beyond words easy if you just show up.  insightful, intelligent, and made me look at film differently.  thanks, prof. svede!",
        "course": "HA350"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 5,
        "comment": "Movies are unbearably boring. His lectures are mandatory for your exams if you expect to do well. Uses more complicated words than he needs to considering this class is a GEC class. Avoid if possible, find an easier professor. Not worth the work for a Visual arts class.",
        "course": "HA260"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Mark was a wonderful teacher!  Film is not my area of study, but he made class exceedingly pleasant with his well spoken comments and diplomatic comportment.  If you are responsible enough to pre-submit your papers, he will provide constructive criticism to further your understanding (and grade.) Learn from him whenever possible!",
        "course": "AHIST350"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "Take any class he teaches. He is is insightful and well-versed, I loved his easy-going natures and the material chosen. Recommended highly.",
        "course": "ART220"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "Really nice guy and interesting class.  Go to class, pay attention, and read the book if you want a B or A, but the class is very manageable.  Only grades are 3 tests.  Seats in theater are comfortable so drink coffee if you're not a morning person!",
        "course": "HA260"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 3,
        "comment": "great teacher. really knows his stuff",
        "course": "FILM220"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have taken two of Svede's classes this year and I love him and his easy-going manner and the obvious knowledge and interest he has for film. I found the tests challenging but not difficult if you simply show up and pay attention.",
        "course": "ART260"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 3,
        "comment": "Hist. of Art 260 is just NOT HARD. How can you complain when you get all the questions in advance for both midterms and the final&#63; Consistency in grading is a reflection on his TAs and not him.  While I will offer that he is a bit pompous, he is knowledgeable and interesting.  Hist. of Art 260 is absolutely no sweat.",
        "course": "HISTART260"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 4,
        "comment": "Hard tests, but they are never graded with consistency. two people with the same test could easily get two very different grades. He gives you the test questions, but you never know if you are giving him what he wants to here. final grades aren't in yet but i got anything from an E-A...",
        "course": "ARTHIST260"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is very rude when talking to students. Very unclear, not helpful.  Makes class way harder then it has to be. Gives you the questions for the test but never gives the answers in class. Definitely do not take him, he is a jerk.",
        "course": "HISTORYOFART"
      },
      {
        "index": 38,
        "rating": 2,
        "difficulty": 4,
        "comment": "Class was fairly interesting, but I don't think he gave enough information to do well on the exams. You do get the essay questions beforehand, but without the info you need to answer the questions, it's pointless. Go to class and try to write as fast as he speaks. Good luck because it's a tough class!",
        "course": "AH260"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 4,
        "comment": "He makes this class way harder than it should be. All the tests are essays and if you don't have the exact answer he wants you are screwed. He gives you all the questions before the test and even then it is hard to pull a C.",
        "course": "HISTORYOFART"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.9,
    "department": "Art History",
    "firstName": "Guisela",
    "id": "VGVhY2hlci0xNzQ4NDYy",
    "lastName": "Latorre",
    "legacyId": 1748462,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is very passionate about what she is teaching and clearly states what to expect to be on quizzes and midterms",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Terrible. She was barely involved in class all she did was upload pre recorded lectures. &amp; I literally had a B- than she took off points for being late to online recitation. Like be forreal.",
        "course": "WGSST1110"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Latorre is genuinely passionate about her job! I had her online, but the class was still engaging. Participation in recitation matters and is encouraged. You have a couple papers to write, but they are super easy. There is a weekly quiz, but you should do fine as long as you watch the lecture fully and complete the readings that are given",
        "course": "WGSST1110"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "The professor literally tells nothing except the historical development of all kinds of power from special identity, require a high level of writing skills and grade really hard on midterm and paper, it supposes to be a GE that not ruin GPA, but it did. it requires four papers in one semester and averages 80%, you can't get an A if you are normal.",
        "course": "WGSST1110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such a great professor who truly cares about what she's teaching. Also very understanding about situations. A few papers to write over the semester graded by GTA's and easy quizzes and exams if you watch the lectures/ do the readings. Readings can be long though.",
        "course": "WGSST1110"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Latorre is one of the best professors I've had at OSU. She is so passionate about the topics covered in class and does her best to be empathetic and understanding in hard times, specifically amid COVID. Participation and attendance are mandatory, but I've found her class is very engaging and interesting.",
        "course": "WGSST2230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor G is amazing. She truly cares about her students and is incredibly inspiring. She creates an extremely inclusive atmosphere and creates opportunity for wonderful conversations. I have learned so much about feminism from this class and I recommend it to anyone. Weekly quizzes on lectures and readings and essay based exams aren't hard.",
        "course": "WGSST1110H"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "AU 19. This class made me critically think, and I actually liked the recitation participation activities. Doesn't post the lectures, so you will need to attend them. Keeps track of attendance as well so show up (or your grade might hurt). You will do good on the exams (which are essay based!) if you actually understand and think about the material.",
        "course": "WGSST1110"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "This class was very easy BUT she is very unorganized (changes up dates things are due, does not put changes on Carmen, etc.) You get two unexcused absences but any after that is 10% off your FINAL GRADE. Exams aren't too difficult but there is a lot of material to study with the format being 5 fill in the blank (no word bank) and 1 essay.",
        "course": "WGSS1110"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "She assigned so much reading. We had a discussion every Friday, which was kind of boring. I liked her as a person, but not so much as a professor. She's very nice, but expects a lot out of her students.",
        "course": "WGSS4560"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "I love her. She is one of the most caring professors I've had at OSU. She listens and empathize. This class inspired me in so many ways I truly appreciate it",
        "course": "WGSS1110"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is easily one of the best professors I have taken class from at OSU. She is inspiring, gives a ton of extra credit opportunities, and is super real. We barely had homework due aside from the readings for recitation every week that were usually interesting, so not a struggle to get done. I recommend this class/ professor to all.",
        "course": "WGSS1110"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super clear about what would be on midterm & what she expected on the papers. Gave extra credit. two midterms (second is the final but same format as midterm) and two quizzes. easy class.",
        "course": "HISTART3603"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mrs. Latorre is an excellent Professor. She is very helpful, very interested in her work, and she is always welcoming students to participate. One thing, however, is that if you're like me, and had to take this class without any interest in learning about the arts, it was very hard to keep any interest throughout this class. Take it if you like art",
        "course": "HA3603"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Latorre is incredible. She is extremely knowledgeable and approachable. She is really nice, super smart, and very interested in student comments during discussions. She makes you think about art and women's studies in ways that you probably haven't before. Take a class with her!",
        "course": "WSS700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.3,
    "department": "Art History",
    "firstName": "Kristen",
    "id": "VGVhY2hlci0yMzI2NTY2",
    "lastName": "Adams",
    "legacyId": 2326566,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Shes an amazing lectuer, she goes into depth for artworks/events and connects them, makes it interesting.However,I hate the wordload is managed. She always crams papers, exams and expects you to read a 30page article and write about it over a few days. Exams are tedious like taking an AP History exam. I would avoid it just because of the workload. ",
        "course": "HISTART3521"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Does not care about students' wellbeing or time. Refuses exam makeups, or even taking them early--even if student has circumstances in which they physically cannot be in class during the time of the test. Very heavily Christian-leaning course content and views. Not clear grading criteria. Vague exam questions. At least there's no group projects.",
        "course": "HISTART2001"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor. You can tell she is passionate about what she teaches, and is caring and willing to answer any questions you may have about the subject or any assignments. The class has only a few graded assignments: two tests, a final paper, and four short response papers.Would definitely recommend if you have an interest.",
        "course": "HISTART3521"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Solid professor. Very clear criteria and very clear on what would be on exams. Not a ton of homework which was nice. Fair grader. Overall a very solid choice for Art History.",
        "course": "HISTART2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.8,
    "department": "Art History",
    "firstName": "Erica",
    "id": "VGVhY2hlci0yMTM4OTgx",
    "lastName": "Levin",
    "legacyId": 2138981,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "I honestly hated this class. All of the movies were in a different language which is fine, but I have a hard time understanding movies and don't really like movies. The class is easy though, just make sure you do good on your reflection essays with comparing two movies of your choice! But each week you watch a movie, do a discussion post",
        "course": "HISTART3901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class was heavy with readings and writing, but no tests for a 4 credit class. Watching movies is also a lot of time because you often have to rewatch it. Great professor and super willing to bounce ideas and collaborate with during lectures. Super friendly to students who have no background in film or HISTART.",
        "course": "HISTART3905"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I actually took 5910, Documentary Cinema, as well as online global cinema with her. She was wonderful in both classes. Interesting topics, not too much work, communicated in a clear manner.",
        "course": "HISTART5905"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was a pretty easy class. I didn't watch the full movies and still got an A. It is nice that you can do the work when you want but be prepared to write pretty lengthy discussion posts each week. You also have to respond to someone each week to get full credit. There are two bigger papers but are based on your opinion using sources from class.",
        "course": "HISTART3901"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was a completely online course, and it was very straightforward. You have to watch a movie every week and respond to discussion posts, but even though it takes time it's very easy. The only real assignments are discussion posts and two reflection papers, but this class is super manageable. ",
        "course": "HISTART3901"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Levin is a kind and caring professor. Lectures were always super fun & engaging. She made sure that none of her students got left behind and would send a \"checking-in\" email if you missed a few classes to make sure you're okay. Levin was probably one of my favorite professors. She was passionate about the lectures & assignments were easy.",
        "course": "HISTART5905"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A and somewhat enjoyable work. Watch a movie every week and have to critically answer a few questions. Helpful to be in a class GroupMe if you have questions. Only 2 papers and Prof Levin is an easy grader/and responds fast to emails. If you can manage to watch movies with CC for 4 months take this class for an easy grade! ",
        "course": "HISTART3901"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Movies are really depressing or non-mainstream. Never did any of the 30+ page readings but I would suggest you know how to use F9 and hopefully youre in a class groupme. Always watched the movie and did the discussion post the day of or day before. Tedious work, but manageable.",
        "course": "HISTART3901"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "She was my worst professor. Every week had at least 50+ pages to read for a possible quiz! Do not take her! You will regret it! Quizzes are not clear and hard, impossible",
        "course": "HISTART3901"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Erica's great and she teaches a fun class. It was always engaging, interesting, full of good discussions, and also had a very manageable/reasonable workload. I'd definitely take another class with her. Plus, she's super kind and has a sense of humor! What more could you want?",
        "course": "HISTART5905"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Levin is passionate about the topics discussed in class. Films are viewed weekly, outside of class, along with a weekly reading. The work load is very manageable. I recommend doing the study guides every week as well as taking a few lecture notes. I loved this class and learned so much. There is one paper, 5 quizzes, and one final.",
        "course": "HISTART3901"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lots of lectures, but her passion for the subject material shines through. So much knowledge. She appreciates contribution but it's not required.",
        "course": "HA5905"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Yikes",
        "course": "HISTART3901"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Unless you have to take this course, don't. And if you hope to see an uplifting movie, you won't. Quite the opposite actually.",
        "course": "HISTART3901"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Some of the movies are pretty boring, but overall it is a great class. She tells you exactly what you need to know for the quizzes and exams and gives pretty interesting lectures. Quizzes are pretty easy, but make sure to read the passage in the textbook and watch the movie.",
        "course": "HISTART3901"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Levin is such an awesome lecturer. He lectures may be long and boring, but they're full of a ton of information. The class itself is easy and she makes it even easier. You watch movies every week and take a few open note quizzes. The midterm was take home and the final ended up being a take home exam as well. I recommend this class",
        "course": "HISTART3901"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Art History",
    "firstName": "Kristen",
    "id": "VGVhY2hlci0xMzI5NDk5",
    "lastName": "Paulsen",
    "legacyId": 1329499,
    "numRatings": 31,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Paulsen's lectures were interesting along with the different films that were discussed. But you have to make sure to keep up with the class weekly since the majority of your grade is from two exams which are essays along with discussion posts and quizzes as well.",
        "course": "HISTART2901"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "All I have to say is your grade is based completely off your two exams and that's it all the other assignments not only do they take hours and hours to complete their worth practically nothing. The workload is more than my core classes some weeks. ",
        "course": "HISTART2901"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "The content was pretty easy as long as you kept up, but keeping up was the hard part. I really didn't have an issue with prof. Paulsen, but the workload was way over the top. If film studies is a topic that you enjoy than this class may suit you, but if not, I suggest taking a different course if you're looking for a GE. ",
        "course": "HISTART2901"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Email communication was reasonable- about 24 hours or less. Not too many assignments, but the ones we had were pretty lengthy. They weren't too bad if you did the readings. My only issue with Professor Paulsen is that I was .75% away from a B & I wasn't able to redo an assignment to fix it. Other than that, she was pretty okay. The TA was horrible.",
        "course": "HISTART2901"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Not too hard, generally enjoyable if you keep up with the class weekly. I enjoyed the course and thought it was interesting.",
        "course": "HISTART2901"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "her lectures are interesting but the structure of the class is stressful, only 2 quizzes, 2 exams (essays), and 30% of the grade is participation which is really long and hard discussion posts",
        "course": "HISTART2901"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Ive seen lots of bad reviews on this class, however I did not think it was that difficult. It was asynchronous, however I never really watched the lectures (only the ones that were needed for exam essays). Theres not much to be graded on, so do not miss a discussion or it will tank your grade. For discussions, looking up summarys worked for me.",
        "course": "HISTART2901"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was overall easy, the final papers were ridiculous though. Prepare to spend lots of time writing finals that are the majority of your grade. Grading is way more difficult than it needs to be on the finals. Papers end up being at least 10 pages because the essay questions have at least four parts. Overall, wouldn't recommend it.",
        "course": "HISTART2901"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "um. if youre taking this as one of several options for a GE.. DONT. tons of easier options. try ArtEd1600. if required for your specific major good luck. grading criteria on exams is extremely ambiguous, unless you genuinely love film studies DO NOT take this.",
        "course": "HISTART2901"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "She seems pretty nice, lectures are easy to understand. You have all the answers for quizzes ahead of time. You can get away without doing a good chunk of the reading/watching movies and still get a fine grade. Asynchronous so for the most part you can really go at your own pace which is nice. Interesting class.",
        "course": "HISTART2901"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Tons of reading and writing. Not clear in terms of paper expectations. I did well, but I still feel the class needs to be far clearer in grading criteria. Exam is extremely long and lots of work. The class is less difficult and more time consuming. Often a movie each week, 3 hours of lectures, reading 20 pages, and writing a discussion post.",
        "course": "HISTART2901"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class was completely asynchronous this last semester. Dr. Paulsen is clearly very intelligent and knowledgeable about her field, but her lectures can be extraneously long. The first week we had over 5 hours of lecture to view. It felt ridiculous but eventually evened out. The papers were rough, but the TA graded nicely. Put in the time, get an A!",
        "course": "HISTART2901"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Paulsen gave extremely good lectures and it is clear she puts a lot of effort into teaching her class.",
        "course": "HISTART2901"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "There is no reason on earth why a GE should be this much work. Maybe this course has never had to be online before? I have no idea. DO NOT take this course unless you're a film whiz. Zero communication from prof, TA grad students only. Low point assignments that will have you working for hours. Exams pretty much  grade. Horribly set up for online",
        "course": "HISTART2901"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took this class as a GE online. The amount of coursework is insane. Most of the weeks you can expect to sit at your computer for 4+ hours reading, watching lectures, and watching films.",
        "course": "HISTART2901"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this class for a GE and do not take it over the summer online. The amount of work is absurd. I did hours of work each day and was still always struggling to catch up. Movies are extremely boring and so are the lectures. Grading is extremely harsh. Very difficult A.",
        "course": "HISTART2901"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "I think Prof Paulsen is one of the best professors I've had yet. She's an amazing lecturer, which is definitely good because you probably couldn't get an A in this class without listening. Difficult class, but I really enjoyed it, mostly because of Prof Paulsen.",
        "course": "HISTART2901"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Took thinking it would be an easy A and interesting. I was completely wrong. Take another GE don't take this one. Assigns extremely long papers with material that is hard to write about.",
        "course": "HISTART2901"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "Kris Paulsen is extremely passionate about what she teaches. However, I thought this would be an easy class, and it wasn't. One test and two ten page papers are what make up your grade. I would suggest taking a different GE if you don't have a heavy interest in films. She makes it as interesting as she can, but I dreaded going to class. Hard A.",
        "course": "HISTART2901"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "I've never taken  a class like this before. Our entire class was designing and executing an exhibition in Hopkins Hall gallery. She is incredibly well- connected, and her organization is unmatched. This class gave me real- life experience, which is more than I can say about any other class at Ohio State.",
        "course": "HA5001"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Not really into modern art, but she is so enthusiastic and fun that it grew on me- her energy is contagious",
        "course": "HA4640"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class was one of the best classes I had this semester.  Professor Paulsen makes this class super interesting and is very insightful in terms of film studies. Attendance isn't mandatory, but you won't get the information otherwise.  This class and her teaching inspired me to pursue a film studies minor.  I'd take another one of her classes!",
        "course": "HISTART2901"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kris is energetic, and passionate about the art she studies. Don't miss the readings, and always, ALWAYS do the response papers. That's the only reason I got a B. She is a fair, yet understanding grader. Tests all essay questions, but she doesn't dock unnecessary points. I hate modern art, but she made it fun to learn! Take her class if you can.",
        "course": "AH4640"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is an awesome professor! I absolutely love her analysis of films. I researched on the films we watched and couldn't find an insight comparable to hers. You do have to go to class.. it's not mandatory but you'll get most of the answers in her lecture material. Do take notes, they'll help when writing the essays. This class made me love old films",
        "course": "HISTART2901"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "Worst professor I've had at Ohio State. All the exams are essays, and you receive a grade with no comments as to why you missed points. Rude in emails, and makes you watch terrible films. Good luck getting an A in what should be an easy class, but isn't. Only class I won't get an A in this semester.",
        "course": "HISTART2901"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very passionate and enthusiastic teacher with some pretty funny comments. Very thorough in her material but she talks very quickly so sometimes its hard to get everything down. If you don't like reading critical essays don't take the class because there are a lot of readings you have to do and essay responses. Great class though!",
        "course": "HA4640"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was interested in the topic, but really didn't seem interested in talking to the students. Her TA's did all the grading. If you take good notes, then you can easily get an A in her class. Just make sure that you are writing down everything she says about the movies, these comments actually help a lot when writing the exams..exams are all essay.",
        "course": "HSTAR260"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kris was very excited about what she was teaching and that rubbed off on me. You can get an A, but you have to do the work for it. Very fair. I suggest typing out the notes in class! overall, love her!",
        "course": "HART541"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "I found Dr. Paulsen to be a really cool and engaging professor.  She made a topic about which I had negative feelings (contemporary art) very interesting and enjoyable.  If you need help in her class, go to office hours; she's willing to stay for as long as can reasonably be expected to help you understand a topic.",
        "course": "HA541"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 1,
        "comment": "This is a really easy class. The movies were pretty interesting and everything was graded very easily. The only bad thing is it sounds like the teacher is reading directly out of a book during lectures, which gets boring after a while.",
        "course": "HISAR260"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 5,
        "comment": "Teacher pics a horrific selection of movies that cannot be related to at all.  Lost interest in class immediately and attending class other than movie days not important. She butchers all movies we watch.",
        "course": "HISAR260"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4,
    "department": "Art History",
    "firstName": "Illya",
    "id": "VGVhY2hlci0yOTIwODUx",
    "lastName": "Mousavijad",
    "legacyId": 2920851,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This was a pretty awesome class. I learned a lot although I had little knowledge coming into this class. Illya is amazing. Very caring and generous. Definitely recommend taking Comp Animation with him.  ",
        "course": "ART-4401"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Amazing class. Illya is very knowledgeable and caring.",
        "course": "ART-4401"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took Comp Animation with Illya. I learned a lot. This class changed my perspective on animation! Illya is very knowledgeable, caring, and thoughtful. But he is very serious and strict with attendance and student performance. This can make the course difficult, but also really push students to work hard and make progress on their projects. ",
        "course": "ART-4401"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Class: Computer Animation\nUnrealistic expectations.\nDidn't know the material he was teaching. \nSpend half of the class learning the material than teaching us.\nExtremely critical. \nRude/condescending.  \nunorganized, Indecisive\nyell at u in front of the class. \nonly gives 5 absences no sick/other exception after. \nAvoid at all costs!",
        "course": "ART-4401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.8,
    "department": "Art History",
    "firstName": "Christina",
    "id": "VGVhY2hlci0xODY0MDAy",
    "lastName": "Mathison",
    "legacyId": 1864002,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Be careful to choose this class",
        "course": "HISTART2003"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "If you don't go to class, you won't pass!! She goes over artwork once and doesn't really repeat the notes she talks about. ",
        "course": "HISTART2003"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took the class for a GE credit and I loved having Ms. Mathison in class ^^, her lectures are pretty easy to follow. I would say you may be bored if you're not too interested in art history but the assignments aren't too bad- just pay attention in lecture and take general notes and you'll do well. She's helpful outside of class ",
        "course": "HISTART2003"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Personally, I think Prof. Mathison taught this class really well! However, I don't think her class is an easy A but it isn't impossible. She doesn't have many assignments, only the bi-weekly notes and a few short essay response. Her midterm and final are a little more difficult because of the time but as long as you make good notes, you'll be fine.",
        "course": "HISTART2003"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Her lecture has tons of information, it's very hard to follow her speed to take notes. Even though I'm from East Asia, there are many contents I don't familiar with. The grade almost based on the weely notes, if you cannot take good notes, you are screwed. If you take this course just for GE credit, the best way to keep a good GPA is RUN!",
        "course": "HISTART2003"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "Although I really hate her, I have to agree she teaches good. But if you don't interest in hisart and only come for credit then just RUN! Her lecture has tons of information every second and she doesn't even have a recording. She grades notes even! These notes helps exams, but exams are kind of hell. You could learn much, but get poor grade. ",
        "course": "HISTART2003"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was a relatively easy class if you pay attention and take good notes! You have to turn in your notes every two weeks, but those notes come in handy when it's time to make cheat sheets for the exams (she allows 3 pages of notes, front and back). The exams were timed which made it somewhat difficult. All her lecture materials were interesting! ",
        "course": "HISTART2003"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was a very stressful displeasure for the semester I was enrolled in it. Please be aware that it is impossible to receive a perfect grade in the class because the way assignments and tests are scored. The tests are too lengthy to complete in the alotted time given for them. Do not take this class unless it is necesarry. ",
        "course": "HISTART2003"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mathison is an amazing professor. Her lectures were interesting and she used appropriate language for a GE course, so the information felt accessible and engaging. You have to turn in your notes every week, but it helps for studying for the difficult timed exams (midterm and exams). Was my hardest class, though, so don't take for an easy A.",
        "course": "HISTART2003"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was a relatively easy class and if you take good notes (and submit them on time!!) you should be fine. The exams are somewhat difficult due to the short time you have for each essay, but if you fill out the cheat sheet she lets you have, you should be okay.",
        "course": "HISTART2003"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Mathison is easily one of my favorite prof. She is so engaged in the materials and she really cares about the students.",
        "course": "HISTART2003"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you can't get E in this class, it will not meet her purpose.",
        "course": "HISTART2003"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved her class. She is a great person and a great professor. Her TA's grade very tough, but she offers help when needed. Only issue is the exam is timed and it's nearly impossible to answer the essays in the six minute time limit. There isn't a lot of homework which makes it hard to get a good grade if you do bad on the paper or exams.",
        "course": "HIST2003"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 5,
        "comment": "she is a great pro but she is a really tough grader, probably the toughest grader i ve ever seen in my life. 3 points extra credit i only got 0.06 and the highest grade is 0.1. Her TA was a tough grader as well. But overall, she is a good pro, she knows what is she teaching about and has a clear schedule, but the class is so hard.",
        "course": "HISTART2003"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor, and very clear about what she wants on Tests, papers, assignments. Class isn't too difficult, but the exams are just memorization of pictures of artworks with main points of style, symbolism, religious affiliation, and etc. Attendance is mandatory which isn't too bad, and there are lots of extra credit opportunities. TBH my fav GE!",
        "course": "HISTART2003"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best GE I ever took. It was pretty work-intensive (two article readings and responses per week) but Dr. Mathison made it interesting and her passion was contagious. She obviously knows what she's talking about and offered many extra credit opportunities. Start memorizing the monuments ahead of time or the tests will kill you.",
        "course": "HISTART4810"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "She seems to think that this is a 4000 level class, not a 2000 level. There are only 3 grades + participation. The midterm and final and strictly essay questions and you must memorize.",
        "course": "HISTART2003"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "I learned a ton from her. Just show up to lecture, it's an amazing class. Her exams are extremely detailed in what they ask for but you can definitely cram if you're into that. The recitations are actually really useful. I think it's a good alternative for a GE class that you actually want to learn from.",
        "course": "HISTART2003"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "You can tell she really cares about what she teaches, and so you too have to care in order to not find this class dreadfully boring. She really goes into depth about the color, the texture, the brush strokes, & for someone who was taking this class due to an interest in history and how it influenced art (not JUST art), I was a little disappointed.",
        "course": "HISTART2003"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "The key to this class is to really keep up with studying and take good notes. It is all memorization and the tests are tightly timed, so you need to be able to write down information quickly.  As long as you study and prepare, you will do well. Professor Mathison is very nice and will help if you ask for it.",
        "course": "HISTART2003"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Mathison's class is interesting. Students could not only know the art history, but also get to familiar with Asian culture and background. This class could inspire your interest and passion to art. And professor Mathison is quite willing help students with every sector taught in class. I got a great grade in the end of this class.",
        "course": "HISTART2003"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 4,
        "comment": "I needed a fine arts GE class and I am not very artistic. I thought an Art History class would be the most manageable. Unfortunately, she teaches like she thinks everyone in the room is an Art History major. For people studying anything else there isn't much to grasp onto. ",
        "course": "HISTART2003"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "The course requires a lot of rogue memorization and the dates and periods are confusing. There was little to no extra credit. I would not recommend this class to anyone. The memorization and attendance make it too much work for a 2000 level GE",
        "course": "HISTART2003"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "Prof. Mathison is nice and knowledgable, but this class is overly difficult for an intro course. The tests are basically impossible due to time restraints, and even as an HA major I was somewhat overwhelmed. Plus tests are the majority of your grade, so if they don't go well, you're screwed. Only recommend if you're passionate about the subject.",
        "course": "HISTART2003"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Mathison is the sweetest. She is very thorough in her material and has it presented in an organized and coherant manner. Tests were a little difficult just based on the time structure but other than that a very enjoyable class. I learned a lot from her and the Asian culture and religion.",
        "course": "HA2003"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Mathison last semester for 2003. She is a great professor, very knowledgeable and extremely nice. Highly recommend taking the class, whether it be for a minor or GE.",
        "course": "2003"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mathison is nice and she loves teaching. She is very helpful in finding sources for your paper. Very clear about the requirements for the midterm and final. Go to the lectures and take notes and you'll be fine. She's a fair grader, so as along as you put efforts in this class you'll def get a nice score. I learned a lot in her class.",
        "course": "HISTART4810"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 3,
        "comment": "material wasn't difficult, but grading was unnecessarily hard for a low level class. attend lecture and take good notes. know dates and titles. she didn't make it through all of the syllabus for each unit, so make sure you pay attention to revised study guides",
        "course": "HIST2003"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.7,
    "department": "Art History",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0xMzE1NTA=",
    "lastName": "Florman",
    "legacyId": 131550,
    "numRatings": 25,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Had Prof. Florman for 4001 in my first semster. The class is a writing seminar stressing analysis and description of a variety of artworks. Prof. Florman served as a great intro to the field; there was a fair bit of reading (expected in this major) and also a lot of papers, but she gave good feedback and was willing to listen to new ideas.",
        "course": "HISTART4001"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ltook her for Art History Renaissance-Modern. It was an easy class. Show up, take notes, and you will do great. Don't buy the textbook.",
        "course": "ARTHIS210"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Florman is a wealth of knowledge in the art sphere. She has expert analysis on a huge array of art styles and artists, with amazing specificity in individual pieces. Her class was enjoyable, albeit it being very important to study and prepare to write very rapidly during exams. I would take more classes with her; she makes art intellectual.",
        "course": "HA2002"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good teacher. Interesting lecture. You won't want to miss a class.",
        "course": "HA2002"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really knows her stuff and speaks eloquently; I loved listening to her lecture. The information was difficult, but very interesting. She's a hard grader but gives you good feedback on your midterms and papers. Definitely go to class.",
        "course": "5622"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "She gives amazing lectures. Super smart, friendly, and understanding.",
        "course": "DADA"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Professor. If you go to class you don't need to buy the book. Everything you need to know for exams are covered in class. Makes the subject interesting.",
        "course": "HISTART2002"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Wonderful professor. Don't buy the book if you plan on going to the lectures -- haven't opened once and aced her midterm. She makes a boring subject incredibly interesting and easy to learn. Wish other profs were as excited about their subject as her.",
        "course": "HA2002"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "You can either REALLY read the book and do research, or not buy the book and attend class and pay 100% attention. She is really descriptive and the tests aren't hard if you go to class. She made it interesting. As interesting as this subject can be to someone who doesn't care.",
        "course": "HISTART2002"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "History of Art - She's a very clear lecturer. Don't buy the textbook, you never use it.",
        "course": "HISTA2002"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. Truly knows the topics she teaches inside and out. Answers questions very thoroughly. Opinionated, but very open to student opinions as well. She gives out all possible essay questions before the tests, which require some critical thinking but are perfectly fair. Class was kind of reading-heavy, but you can get by skimming.",
        "course": "HA636"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lisa is great. Makes things very clear, even if her own interests come out stronger than the students. (I think that's more the student's fault for not talking enough...)",
        "course": "HART715"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Florman is extremely intelligent and knows her stuff backward and forward. Her class was really interesting and I learned a lot!",
        "course": "HOA715"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 5,
        "comment": "this professor is very excited about teaching and helping students understand difficult concepts.",
        "course": "HA202"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 5,
        "comment": "Lisa Florman gave the most verbally economical and concise art history lectures. That said, the material is densely presented, so be prepared to keep up. If you're listening, the material is fascinating and compelling. If you drift off, you may as well leave for all the good it will do you. Great class, learned tons, actually retained it.",
        "course": "HSART636"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good teacher...very clear on what she wants from you. Attendance is crucial to make sure you know everything she talks about. Would recommend this class",
        "course": "ARTHI201"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good class",
        "course": "HA340"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 4,
        "comment": "the original description of the class got me really excited but when i got there i was dissappointed, not because the class was bad, just because it ended up being something completely different than what i thought. we talk about critics, specifically greenburgh, rather than works. florman really knows her stuff though, and teaches it very well.",
        "course": "HISTART340"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good lectures. Make sure you go to class everyday. She'll give hints for the exams on a days when there aren't that many people at the lectures. Overall great class, but tests are somewhat hard. Know your stuff!",
        "course": "ARTHIS210"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "MODERN"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors I've had at OSU.  Intelligent, professional and thoroughly knowledgeable about her subject. Other profs should follow her standard.",
        "course": "636"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great",
        "course": "HA636"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "The absolute best professor I have ever had. Plus she looks like Jodie Foster",
        "course": "ARTHIST415"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "Don't expect to pass if you miss more than one class.  She is very clear in what she wants from students.  Doesnt limit the viewing of art to just the classroom, she wants students to actually experience it themselves.",
        "course": "ARTHST636"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a very nice woman who tries to make her Art History classes enjoyable to those who don't know anything about art!",
        "course": "ARTHST"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Art History",
    "firstName": "Ravinder",
    "id": "VGVhY2hlci0yODk2OTM5",
    "lastName": "Binning",
    "legacyId": 2896939,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "It was a really light class with a few writing assignments, but he was a very easy grader. The lectures were interesting, and the exams were open note. ",
        "course": "2001H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had no interest in art history before taking this class but Binning made the material interesting. It was information heavy but he'll tell you what information is the most important. There are 3 written assignments and he gives you clear guidlines on what is expected. The exams are easy if you show up and take notes. ",
        "course": "2001H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "This man was an absolute goat. His class is actually so light. You will get an A if you write down some of the big words he uses to describe some of the art and use it in the 3 small writing assignments you have all year. I've never been remotely interested in art but the class is easy to pay attention to and is interesting. Binning=Him ",
        "course": "2001H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 3.5,
    "department": "Art History",
    "firstName": "Namiko",
    "id": "VGVhY2hlci0yMTMwMjEw",
    "lastName": "Kunimoto",
    "legacyId": 2130210,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "Heavy reading and memorization!!!!!!!!!!!!!!!!",
        "course": "HISTART3605"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "I find the reading-heavy approach that Kunimoto takes to be pretty ineffective; a lot of students were put off by it and she did away with her pop quizzes halfway through the semester because everyone was failing them. The material needed for exams was pretty easy in comparison to the level of difficulty in the readings, at least.",
        "course": "HISTART3605"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "As someone who has never learned about Art History before, Professor Kunimoto opened me up to a lot of great knowledge. I feel after her course that I really learned valuable insight into the History of Photography. That being said, this course was much more work than I was hoping for. Two long readings and a 1 page (single space) paper per week",
        "course": "HISTART3605H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kunimoto does a good job of walking the line between making the class meaningful for History of Art majors (who often come in with much more background,) and students who are learning to look critically at art for the first time.  The readings are challenging and there is a lot of memorization, but it's worth it.",
        "course": "HISTART4820"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Art History",
    "firstName": "DeAvin",
    "id": "VGVhY2hlci0yOTcxMDE5",
    "lastName": "Mitchell",
    "legacyId": 2971019,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very basic class that the expectations are laid out super clear and the workload isn't heavy at all. The professor is very quick to respond, and does what he can to make sure you do well.",
        "course": "ARTEDUC1600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Art History",
    "firstName": "Asia",
    "id": "VGVhY2hlci0yOTI5MTY3",
    "lastName": "Adomanis",
    "legacyId": 2929167,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Asia was a phenomenal professor, and went out of her way to assist us in any way she could. If you take good notes, this class is a breeze. Lectures were engaging, clear, and it helped that she posted them before class so I could organize my notes better. Very responsive outside class, friendly, and wants to connect with students. Amazing educator.",
        "course": "Art2002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.3,
    "department": "Art History",
    "firstName": "Andrew",
    "id": "VGVhY2hlci02NzA3Mjk=",
    "lastName": "Shelton",
    "legacyId": 670729,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Shelton is such a great lecture! He does not take attendance but you will not do well if you do not attend. As long as you take notes and participate a little you are golden! He is so nice and easy to talk to. He is very clear and good at communication. I would highly recommend but you need to be willing to work semi-hard to do well!",
        "course": "HISTART3611"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Your grade is composed of attendance in recitation, 1 midterm, 1 paper, 1 final, and the option of extra credit. Lectures are interesting and material-heavy. Don't skip class! Paper is very easy and tests are also written and very easy. Attend review sessions and study with the review sheets. If you go to lectures, you won't have to study.",
        "course": "HA2002"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "The grade was comprised of a paper, midterm, attendance and participation in recitation, and the final with one extra credit opportunity. Overall, a pretty easy class after you jump in and start analyzing each piece. A great course for non majors who could use this on travels. Highly recommend for a GE, he's a great lecturer.",
        "course": "HA2002"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Shelton is an amazing professor. Took History of Art 2002 from him, he is very knowledge among the subject he teaches. For me personally, I added a minor in History of Art after taking his class. If you want an A you have to work hard for it, since there are a lot of details to remember and you have to go to Lecture and take good notes.",
        "course": "HIST202"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy grader",
        "course": "HA202"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very well spoken &amp; easy to understand. Lecture was not mandatory but recitation was. Recitation was just a review of lecture. As long as you take notes &amp; pay attention in recitation, you'll know the information. The only homework was to write one paper, &amp;there were 2 exams. The exams are a lot of writing but you will know what you're talking about.",
        "course": "HA202"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "He does a great job of explaining the art so that anyone can understand. There is a lot to memorize, but he gives a narrowed down study guide. Grades are 2 exams, 1 paper and attendance/participation, which is only mandatory for recitation, but I learned much more in lecture. Never had to do anything outside of class except my paper and studying.",
        "course": "HA2002"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Consists of two midterms &amp; a final. Memorization based with hint of analysis. Really makes you work for an A, simply memorizing the work won't suffice. Shelton is very passionate &amp; knowledgeable in the subject, makes lecture more tolerable. Reading is 'mandatory' and helpful but not necessary to pass. Post lecture online but only includes pictures",
        "course": "HISTART3611"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Shelton is a really great guy. His lectures aren't bad and if you pay attention and take good notes you'll have no issues with this class. Recitation participation is a big part of your grade but its mostly review. A midterm, a term paper, and a final are the only other portions of the grade and they aren't bad. Overall a great experience",
        "course": "HA2002"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Shelton is a great professor! He knows the material so well and he makes things so clear and easy to listen to him lecture because he's so passionate about it. Two exams and a really easy paper. Recitation is mandatory but its just review. Exams are easy and straightforward just ID's two comparisons and a short essay. Gives you material before",
        "course": "HA202"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a really good lecturer and I not only learned a lot but I also enjoyed them. There aren't a lot of grades in this class so you do have to do well on the few things you do in the class. Overall a good class and teacher.",
        "course": "HISTART2002"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures the entire class, but it's easy to tell he really loves the art work and he knows so much about them its incredible. So interesting to listen to. Lectures aren't mandatory, but it will make the class so much easier if you go and pay attention. Recitation is mandatory. Pretty sure he makes words up to describe some works.",
        "course": "HIST202"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Shelton offered enjoyable lectures and the class is graded fairly. The class consists of a midterm, 3-5 page paper, a final exam, and a participation grade. If one prepares well for the midterm and final the class is an easy A.",
        "course": "HIST202"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of your grade is dependent on your TA, since they grade the paper and your midterm/final.  So if you have a cool one, this would be a pretty easy class. Make sure to know historical context for the exams.  Attendance to recitation is mandatory.  Lectures can get kind of repetitive, but at least that tells you what you need to know.",
        "course": "HA202"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved this class so much that I'm not considering an art history minor. I've never seen a lecturer be so knowledgeable. He memorizes all of the information he wants to convey. To pass, go to lecture and write down everything he says. I recommend then making flash cards and rewriting your notes. It's a lot of memorization but it's very interesting",
        "course": "HIST202"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Shelton cares about what he teaches and gives you all the information you need. Unless your into art history, the lectures can drag on because of the material. Recitation attendance is mandatory. Final exam is worth a lot but as long as you study then it shouldn't be too bad.",
        "course": "HA2002"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "Methods and theories was the most painful class I've ever taken at OSU. The reading list was clearly designed by a pretentious asshat with a large library, but who has clearly never felt an emotional connection to art. It's a convoluted philosophy wanna- be class, and Shelton's ramblings didn't help much .",
        "course": "HA4010"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Shelton is great. Extensive knowledge of his subject and obviously very passionate. Slips a joke in every once in a while so he's pretty funny if you pay attention. Lots of ums and uhs but if you can get past that, he's really fun to listen to. Participation in recitation is graded, so it helps to actually read/listen in lecture.",
        "course": "HIST202"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures are interesting and the basis for the exams.  His study guides tell you exactly what you need to study.",
        "course": "HA202"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "As long as you take good notes you're good!",
        "course": "HISTART202"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is an awesome professor. Just go to class and write down everything he says; it's a guaranteed A. The only attendance that is mandatory is your recitation, but all the TAs are cool.",
        "course": "HA2002"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Shelton is a great professor- very knowledgeable, enjoyable lectures that he delivers with exuberance, exam preparation (review lectures mainly + defined exam structure), and very helpful. I loved that he focuses on the historical significance of artworks; he creates a wholesome picture of the time period and then ties everything together.",
        "course": "HART5616"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "The only reason this class was so easy was because I attended every lecture and wrote down everything he said about every painting.  There is no need to purchase a textbook for his class since everything on the exams come from his lectures.  Just go to and pay attention in lecture and you're good to go!",
        "course": "HART202"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof Shelton goes through a lot of info (Renaissance to present is a LOT of material) and expects you to know historical significance of all the art but doesn't explicitly say it in lecture.. ended up with an A but definitely worked hard for it. finals are all written essays, not difficult if you study/go to class/pay attention",
        "course": "HART202"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "I definitely agree with the last comment!! Prof Shelton seemed to know what he was talking about and everything but did not prepare me well for the exam. I honestly thought it was kind of a hard course and I have a 3.8 as a junior...guess history just isn't my calling :/",
        "course": "HIST202"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 5,
        "comment": "So I'm going to differ from everyone that has posted a comment about Prof Shelton. Although he is organized and knowledgeable, I don't believe that the class is easy or that he does a good job at helping you prepare for the exams. He expects students to put a lot of history into the essays but he rarely mentions how history ties in with lectures.",
        "course": "HIST202"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "this professor is well organized and extremely knowledgeable.",
        "course": "HA202"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took History of Art 202 with Prof Shelton & he is without a doubt the most eloquent & well-spoken man I've ever had the pleasure of being taught by.  He knows art history like the back of his hand, & listening to him talk about it will make you more worldly, if not turn you into an Art History major.  He's great.  This is a RARE worthwhile GEC!",
        "course": "HA202"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "This is an excellent class.  As long as you go to lecture and take notes, you should do well.  This class made me become an Art History major, and Prof. Shelton is one of the best profs at OSU.  Also, you don't need the book.  For the exams, memorize the artists and their works: know distinguishing features and what style they utilized.",
        "course": "HA212"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is an excellent teacher, his tests are difficult if you don't know your stuff but his lectures are very interesting",
        "course": "ARTH"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 1.7,
    "department": "Art History",
    "firstName": "Marcia",
    "id": "VGVhY2hlci0xMTk4Mjk2",
    "lastName": "Kupfer",
    "legacyId": 1198296,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "PLEASE DO NOT TAKE THIS CLASS. I AM A 4.0 GPA STUDENT WHO DOES WELL ON EVERYTHING AND I GOT AN F ON MY FINAL EXAM. SHE IS THE TOUGHEST TEACHER I'VE EVER MET. DO NOT TAKE HER CLASS UNLESS YOU ARE HAPPY WITH GETTING A B- AND BELOW IN THE CLASS. PLEASE DON'T DO IT!!!!!!!!!!!!!!!!!!!!!!!!!",
        "course": "ACC-UF"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very opinionated and will not accept open discussion. Her slides and the content she explained will not match, so you really need extra time to figure it out. When it comes to religion, the content might be really offensive. Her exam is extremely hard, and the comments are harsh, also the grade. Please be aware of her.",
        "course": "ACC-UF"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "For my folks at NYUDC beware! Her classes are lecture heavy with no substance. She knows her stuff, however  her teaching is intended for art history majors, not Liberal arts students. If you do take her class, please pay attention her exams are not easy!",
        "course": "ACC-UF"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "NYUDC ARTS AND CULTURES\nShe is nice if you ask questions after class and attend the excursions. Grading criteria VERY vague; she told us that the final essay is about \"ideas\"... nothing more. Write down EVERY description she says about artworks and texts cuz she says art is not open to interpretation and expects you to read her mind during papers.",
        "course": "ACC-UF"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "She rants all class and doesn't even check to make sure her students are interested/paying attention. I do not recommend taking her class unless you are ok with a B+ and below. She once told our class that she doesn't give out A's often. ",
        "course": "ACC-UF"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "This Prof has been accused of being hard on her students &quot;Does confront students when they don't show up or do reading/participation.&quot; I'd rather that than a teacher who doesn't care whether or not you turn up. I saw her the other night in a TV series about &quot;The Beauty of Maps&quot; and she was terrific really passionate about the topic and looked great",
        "course": "HISTMED1"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "TERRIBLE, TERRIBLE teacher. DO NOT take her class. Her lectures are boring and brutal to sit through.She is rude, and irrational. I had a mandatory court date and she told me to reschedule it because it was inconvenient to her. Courts don't just reschedule especially if you are the prosecutor. Her exams are ridiculously hard.",
        "course": "ART201"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "do not take her class! it is horrible. the tests are unreasonably hard and her lectures are the most boring i have EVER listened to!",
        "course": "ART200"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "REALLY knows her stuff and is a total sweetheart. If you're patient you'll learn a lot, so give her class a chance.",
        "course": "HA415"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Tough Professor. Expects you to show up to every class and do all of the reading. Even if she assigns 70 pages in one night. If you don't keep up - you're screwed. She definitely knows her stuff, but tends to ramble on - a lot. Bit spacey and odd, but nice enough. You can learn something if you're up for a challenge.",
        "course": "HA415"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Quite ridiculous, I found myself dreading going to this class all the time. Not clear in subject matter and not necessarily a great professor.",
        "course": "HART201"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor was by far one of the worst I have EVER come across. Her exams could not be any harder. You must memorize the name, DATE, artist, time period, culture, details, and significance of somewhere around SIXTY works of art, when only about 5 are actually used on the test. DO NOT TAKE THIS CLASS!!!!",
        "course": "HIST201"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "Has unrealistic expectations. Constently gave us a ridiculous amount of reading. One week we had 200 pages to read! I had a 4.0 in my major... after this class, not so much.",
        "course": "HA451"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Terrible terrible terrible!!! Does not at all teach hardly any art history, she just babbles about useless stuff you'll never need to know for the exams, and will hardly talk about the piece and what makes it unique! avoid her!",
        "course": "HA201"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is awful. Dr. Kupher babbles on and on and uses vocabulary that only an art major would know. She guilts you into attending class and then puts material on her exams that you would only know if you attended the lecture and took the specific notes she wants. Her tests are half fair, half not and you dont really know what to expect on them.",
        "course": "HA201"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 5,
        "comment": "Horrible professor.  She lectures like she's reading from a drama script and it only hurts comprehensibility.  Presenting a large vocabulary doesn't get the material to the students better. So much to remember for the exams.  DO NOT CHOOSE THIS PROFESSOR!",
        "course": "ARTHS202"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Loves to babble on about information you wont need for the exams (like 45 minutes on maps). Does confront students when they don't show up or do reading/participation. Her exams are easy, but you just have to get yourself to show up to class first to get a decent grade.",
        "course": "HA525"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very difficult class with far too many details to keep up with. Attendance is not mandatory but she guilts the class for not attending and then punishes the class with essay questions on the midterms that if you were in lecture, you can supposedly &quot;answer with no problem&quot;. DO NOT CHOOSE THIS &quot;PROFESSOR&quot;",
        "course": "ART201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Art History",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yODc4MzAy",
    "lastName": "Schellinger",
    "legacyId": 2878302,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Schellinger teaches an incredibly interesting class, and participation within it is quite engaging. However, there are about 1-2 quizzes every week over the readings. Ensure to do her reading guides or else that part of your grade will bomb. Other than that, a pretty well rounded class.",
        "course": "NELC3700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.5,
    "department": "Art History",
    "firstName": "Julia",
    "id": "VGVhY2hlci02MTI2MjE=",
    "lastName": "Andrews",
    "legacyId": 612621,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was so sweet. She left the nicest feedback on all my papers and even had an extra credit opportunity field trip (was loads of fun, try talking to others in the class)! There were abstracts due weekly, but they were not too bad. She is passionate about art history and is very kind to students. She liked the RM meme in my final presentation too!",
        "course": "ART2003H"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "I took Professor Andrews East Asian Art History 2003H class to fulfill some gen ed requirements (social diversity and visual education). Lectures were long and sometimes boring, and there was usually a chapter of reading outside class, but the assignments were manageable and the content was interesting at times. Start your term paper early!",
        "course": "ART2003H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "She's unorthodox, that's for sure. BUT she is kind, brilliant, and genuinely loves writing about art. Not to mention that her impeccable career has been built on curating at the Guggenheim and writing textbooks about art. Don't mistake her quiet demeanor and subtle stutter for disorganization-she vocalizes better on paper, but she is still amazing.",
        "course": "HISTART4001"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Andrews is not only extremely knowledgable, but extremely experienced. She has written many (wonderful) books papers, and is THE expert in Chinese art. Her writing skills are un-matched; soak up her knowledge while you can. She always wants the best for her students, she may be shy and quiet, but don't take her for granted. What a gem of a teacher",
        "course": "AH40014815"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "I took this class for my major, and found it disappointing. She's disorganized, classes run long, and her lectures are hard to follow. Many sources we needed to write research papers were in Chinese, but speaking Chinese was not a prerequisite for the class but I felt at a disadvantage. Would not recommend.",
        "course": "4815"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Here's the thing about Professor Andrews. You can tell that she is VERY knowledgeable about the topic, but she is kind of distant bc of that. Lots of overlap between lectures so it can get confusing, and one slide quiz means you need to know so much material. Make sure you can stay awake during her lectures because they can tend to drag on. ",
        "course": "4815"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Great Knowledge, but the writing class is not her forte. You will never get grades/ assignments returned, and the criteria for assignments isn't given. You are on your own slightly.",
        "course": "HISTART4001"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Her class was so much fun. There were days when she repeated information, but she really knows her stuff. Her book on Contemporary Chinese Art is incredible. Not to mention she's so nice.",
        "course": "HIST4815"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Andreas's knowledge of Chinese art is amazing. I learned a lot from this class. I'll certainly recommend you to take her class.She is also the nicest professor I have had at OSU.",
        "course": "HART4815"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is so knowledgable, knows everything about modern Chinese art, really amazing. She is also very nice to students. A great teacher!",
        "course": "HART4815"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Andrews is a great professor. She is extremely nice to students, and so knowledgable. I will certainly take her class again.",
        "course": "HART213"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Andrews is the most knowledgable professor I have had. She is also extremely nice and available to help students",
        "course": "HART213"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "She has a serious problem with time management indeed. If you schedule this class expect to be late to your next one.",
        "course": "HA576"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "she has a lot to offer, but seems unconfident infront of the class.",
        "course": "HA213"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "I disagree with the other comments, she was a little disorganized, however she was able to make everything very clear to me, although im a science major. She is great with descriptions, and her tests were long, but easy.",
        "course": "HART576"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "Agree with everyone else, totally disorganized. Boring class and she did nothing to spark interest. Worse were the days she was away and the Asian TA lectured, I would just leave, impossible to understand.",
        "course": "HA576"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "I agree with everyone else.  Totally disorganized, and she did not follow the slide list handouts at ALL. An interesting class despite it all, but rely on your TA and your textbook for the bulk of the information.",
        "course": "HISTART213"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "Yeah, I guess I learned a lot but... Y-A-W-N.  What the other person here said about disorganized lecturing is SO true.  Leave lines between your notes so that you can jump around as much as she does.",
        "course": "ART213"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is so disorganized and her manner of teaching is very unclear! She spoke too fast and had absolutely no idea what the term &quot;time management&quot; meant since she regularly kept us after class 5-10 minutes past the bell.",
        "course": "ARTHISTROY576"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Art History",
    "firstName": "Stephanie",
    "id": "VGVhY2hlci0yNzk5MTEw",
    "lastName": "Kang",
    "legacyId": 2799110,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Papers were harshly graded, but I think that depends on the grader and not the professor. Class was a lot of boring movies at the start, but some later on like Rashomon and Citizen Kane were really fun to watch. Class was built well for an online class. Prerecorded lectures were boring however, I didn't have to watch all of them to get an A though.",
        "course": "2901"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "For a 3-credit GE, Professor Kang makes it more difficult than it needs to be. The class had 2 (yes, two) 6-pagers as a midterm and another 2 6-pager for the final. An additional multiple choice exam for each midterm and final. She also does weekly quizzes and discussion posts. To make matters worse she's the hardest grader ever. Take a dif prof...",
        "course": "2901"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.4,
    "department": "Art History",
    "firstName": "Mark",
    "id": "VGVhY2hlci04MDMyNzY=",
    "lastName": "Fullerton",
    "legacyId": 803276,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Has outstanding knowledge of the subject matter. Moved quickly during lectures and lecture videos but was easy to follow. Grades papers relatively leniently which is good since there are only four grades in the course. Paying attention to lecture videos and taking notes on them is a good strategy for success.",
        "course": "HISTART2001H"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "I took his 6-week Classical Archaeology class. Had 3-4 hours of video lectures each week, which you need to take notes on or you will struggle on the exam. Had a discussion board each week for participation. Also had a 250-300 word research paper each week. Both exams were 4-5 page essays. Prompts and grading criteria were not always clear.",
        "course": "HISTART2301"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "The content of this course is interesting, but unorganized and hard to follow, even as someone with experience in this field. The professor unfortunately lectures like you're reading a research paper, and references things in the book that were never in the book (I read the whole book). You'll be teaching yourself a LOT.",
        "course": "HISTART4301"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "The subject matter of this course is not that interesting, but if you want to take a course to knock out two GE's, take this online in the summer. Only graded by weekly, very short papers and midterm and final, but the exams were not hard. Overall easy A if you keep up with it. His lectures are kind of all over the place, but the book really helps.",
        "course": "HIST2001"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mark definitely cared a lot about the material and what he does, which is always nice to see. His lectures could be a bit rambly to sit through, and the class is entirely on 4 grades: attendance/participation, a presentation/paper, the midterm, and the final. That said, he was an easy grader and it can be an easy A if you take notes and study.",
        "course": "HISTART2001H"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "I just didnt enjoy the subject of art at all and there were only three grades the whole semester so if you mess up, youre screwed. Make sure to study a lot for the exams as theres a lot of art to memorize.",
        "course": "HISTART2001H"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Mark Fullerton is extremely knowledgeable on the subject of art history but his lectures are all over the place. Works of art were on the midterm that we barely touched on in class and the book is also highly unorganized so studying is difficult. Would benefit from review sheet earlier than 1 week before class. Nice guy.. but goes off on tangents.",
        "course": "HISTART5312"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent class! Exams were straightforward and he grades fairly. He gives you a list of about 50 to study and gives the essay questions before so you know what you're going to write. Overall typical art history class but with an excellent and highly knowledgeable professor. I wish I could take another class with him but I am graduating.",
        "course": "HISTART5322"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Fullerton was okay. He goes on rants about certain topics and it can get really boring because he just drags out very simple concepts. This makes his lectures difficult to pay attention to unless you are passionate about ancient art. Generally easy class, lots of memorization for the 2 exams and one presentation/paper combo",
        "course": "HISTART2001H"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "This professor is awful for a GE, the amount of work is absurd.",
        "course": "ARTHIS2001"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Only grades are 2 midterms, 1 paper/presentation combo. He goes over basically everything in the readings. Content is generally interesting, but remembering the specific names/dates come testing time can be hard since there are dozens. The test only selects a handful for you to name and analyze. If your memory is good, you'll be fine.",
        "course": "HISTART2001H"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "He was a fantastic professor! Very knowledgeable and interested in his topic! He gets going on his lectures and if you like that sort of thing, it is amazing (I did)! His exams are really easy so long as you study! It's absolutely a great class! I look forward to taking classes with him again!",
        "course": "HISTART2001H"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very different from any art history teacher I've taken before (my major).. he's not very clear on what he is looking for, because he throws so much info at you. Great teacher IF you understand his teaching style.",
        "course": "HISTART5312"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class was relatively boring. A lot of information was repeated in the lecture, so it went very slow. Very knowledgeable, and the tests are fairly straightforward. A lot of studying.",
        "course": "HIST2001"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very knowledgable professor.  His lectures were detailed and interesting. Tests were on the difficult side because he covered a lot of material, but he graded very leniently. I would definitely reccomend him.",
        "course": "HA619"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you're not interested in art then this is going to be a long quarter, but he is very informative and his midterms and finals are straightforward. Hate to say it but it was an easy A for me.",
        "course": "HART201H"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Throws a lot of info at you, but if you listen, he's great.",
        "course": "HA523"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.4,
    "department": "Art History",
    "firstName": "Jody",
    "id": "VGVhY2hlci0yNjI1ODY4",
    "lastName": "Patterson",
    "legacyId": 2625868,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love art history and interested in enrolling in this course. The professor is very good and gives specific feedback in the short answer questions in the exam. Also homework missed emailed and teacher said she would reopen Carmen for me. but the percentage of grades are too big , I've only lost 6 points on all the homework and exams and get 92%.",
        "course": "HISTART2002"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Knowledgable, caring, passionate but no free passes.",
        "course": "HISTART2002"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Didn't feel like she interacted with us much. All lectures were online and made by other profs in the department. Expect a few quizzes and papers. Also, do the extra credit because it will be added to your final! I had an 89 before the final and finished with a 98!",
        "course": "HISTART2002"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "TERRIBLE. DO NOT take this class. There were around 4/5 grades all semester. This professor does NOT care about your learning.",
        "course": "HISTART2002"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad Lecture.",
        "course": "HISTART2002"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible class. Do not take this class. I barley passed. There were around 5 grades all semester. She does not care about you learning. Papers get a grade and no feedback. Test questions are so specific and took over a month to grade. My organic chemistry classes were easier. Good luck.",
        "course": "HISTART2002"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Patterson didn't interact with her students much. The course itself was frustrating. It was based on a total of 8 grades the whole semester. If you miss one point your grade goes down a whole percentage. Quiz questions were very specific. Papers had no rubric and you wouldn't receive comments just a grade. This class had an awful set up",
        "course": "HISTART2002"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst. Class. Ever. Avoid this class at ALL costs. I have been a 4.0 student my entire life and I am BARELY going to PASS this class. Your entire grade is based off of a few quizzes and then a midterm and final. I am usually a good test taker but the questions that they ask are SO specific no one could possibly remember the answer!! Awful.",
        "course": "HISTART2002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4.6,
    "department": "Art History",
    "firstName": "Christian",
    "id": "VGVhY2hlci05NjAwMjA=",
    "lastName": "Kleinbub",
    "legacyId": 960020,
    "numRatings": 42,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Kleinbub is among my favorite professors that I had at Ohio State! When I took my first class from him as a Sophomore, I was blown away by how articulate and intelligent he is. He's so passionate about the content he teaches, too. A true gem in the OSU History of Art Department!",
        "course": "HISTART5521"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "This professor is amazing and is one of the most interesting lectures I have had. Exams are straightforward and if you take good notes and pay attention they are fairly easy.",
        "course": "HISTART2200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "HE IS AMAZING! It is very weird because his lectures were nothing close to funny or interesting, but I still enjoyed so much. He was very serious about teaching. He wore suits to lecture every day. He explained everything really clearly, which helped a lot on preparing for exams.",
        "course": "HISTART2002"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Kleinbub is passionate about Art History and tries to connect it to other areas of study. The exams are easy if you go to recitation and listen /read over the powerpoints. I really enjoyed the setup of the class and found it easy to learn from. The lectures were the best part of the class because of his excellent speaking abilities.",
        "course": "HISTART2002"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Go to lecture and take good notes. Make flashcards before the tests and pay attention during recitation. Learned a ton and got A's on both tests with little effort.",
        "course": "HISTART2002"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "He gave excellent lectures and made the material easy to remember. He told us everything you need to know for the exams. Not that hard to study for the exams, since you can approximate the dates for a piece of artwork within 20 years, and if you attend recitation and lecture you'll already be able to talk about all the artworks pretty well.",
        "course": "HISTART2002"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely loved the class and really learned a lot, but the grades consisted of just the midterm and final. If you don't take it seriously you won't do well.",
        "course": "HISTART3521"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures, despite not being mandatory, were very enjoyable and I looked forward to them. Lectures are also important to go to, as he looks at the art works in depth. Graded by recitation attendance, two exams and a paper, but they grade fairly. He is very clear when it comes to what is needed to know for the exams as well.",
        "course": "HISTART2002"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Kleinbub is an amazing lecturer who really shows interest in what he's teaching. His Lectures and the course material is actually intriguing (I'm a business student who hates art and this was my favorite class). Attendance is not mandatory (besides recitation) but if you don't go to lecture you'll be lost. 1 midterm, paper and a final.",
        "course": "ARTHIS2002"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "This is seriously the best class I've ever taken! Professor Kleinbub makes the lectures SO interesting. I never got bored once during the class. He is clearly extremely knowledgable about the topic. Attend lectures because you probably won't do that well without them. Minimal work (1 essay, midterm, and final). Easy A, in my opinion.",
        "course": "ARTHIS2002"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Kleinbub is VERY passionate and knowledgeable. He's just the best at explaining the information, lecture never gets boring. Recitation attendance is mandatory, but lecture is not. He's a really nice guy and really cares about the info taught. Easy class if you go to all the lectures! Only two exams and like one paper, other than that, no work.",
        "course": "HISTART2002"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Christian Kleinbub, best professor Ive had at OSU. Lecture is engaging, and hes very approachable. Attend lecture &amp; youll be fine.",
        "course": "HA202"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. Kleinbub's lectures are engaging and you are never bored. I needed a Gen Ed. course and ended up take Hist. of Art 2002. There were only 4 grades (paper, midterm, final, participation). If you go to class and pay attention, it's an easy A. Not only an easy A, but the material is also interesting (Renaissance through Contemporary art).",
        "course": "HISTART2002"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very passionate, enjoyed sitting through his lectures. Grade is based on midterm and final. No quizzes or attendance, but missing the lectures will make the exams much harder. He wants you to learn rather than just give you a grade.",
        "course": "HISTART3521"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "You have the option to show up for lectures but attendance in section is mandatory. You will do best if you attend the lectures and try your best to pay attention. Professor Kleinbub isn't the most dynamic character, but he's a lot better than some of the other lecturers out there. He seems genuinely interested in the subject and is approachable.",
        "course": "ARTHIS2002"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is really knowledgable and really helpful. The lecture is amazing and interesting.",
        "course": "ARTHIS2002"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Kleinbub was an all around awesome professor. Coming from a background of knowing nothing about art, he made the class very easy to understand and enjoyable. He is very passionate and knowledgeable about art. The exams are not bad if you memorize the works he provides and go to class and recitation. I would definitely take him again. ",
        "course": "ARTHIS2002"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "Unless you have interest in art or have to take this class DONT. The only grades are a midterm final and paper. The paper was easy but the midterm and final were next to impossible all essay and you have to memorize about 120 works of art name year and artist and only about 6 on on the test. I have never studied so hard in my life. REC attendance",
        "course": "2002"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "You don't need a textbook. Don't waste your time or money. There is only a midterm and final so watch out. There are definitely easier classes to take for a GE but it was kind of fun. It is a lot of memorization and my TA was rather hard at grading (her name was Elizabeth). If you like history and paintings you will do fine.",
        "course": "3521"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite class at OSU, never knew anything about art and now I have a passion for it. His lectures are inspiring and I hope to take him again. Do not waste money on the textbook, you won't need it.",
        "course": "HISTART2200"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 5,
        "comment": "If you are not interested in Italian Renaissance Art I highly recommend a different GEC. Although a good professor, the material is difficult to comprehend and gets boring if you're uninterested! Only grade is a midterm and final which is EXTREMELY risky so if you don't need this class don't take it!",
        "course": "HIST3521"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you are a grad student, you would benefit greatly from taking Kleinbub's class. He's a great teacher and a great guy, he knows his stuff inside and out and always welcomes student contributions to class discussion. Fantastic professor, OSU is lucky to have him.",
        "course": "ARH600"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Incredible professor.  Kleinbub is very knowledgeable on the subject matter, especially Italian Renaissance era art.  Easy to listen to, easy on the eyes, and has a sense of humor.  PPTs are posted online if you miss class, and the only work is midterm, final, and a paper where you go to CMA to compare 2 works.  Loved this class!!!",
        "course": "HISTA202"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dare I call him Christian&#63; He is absolutely my saviour...in all things art historical, of course. A genius worth every moment spent in the glory that emanates from an intellect burnished with passion and resolute perfectionism.",
        "course": "HISTA202"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Kleinbub is obviously very passionate about the subject matter. However, I never attended lecture because the content is very boring and Kleinbub tends to shout into the microphone. It's a pretty easy class, all in all.",
        "course": "HA202"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Presents the information is a very logical manner that makes a somewhat complicated topic seem easy.  Lecture attendance is very important.",
        "course": "HA315"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "Go to lectures and record him while taking notes. It's the easiest way to study for the class. He goes into a lot of details with the art. Class is only midterm and final. If you want to do well, go to lectures!",
        "course": "HA315"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really great prof! He's a total expert on the subject and I really enjoyed his lectures. He gives great insight and description, and though the lecture was 1hr48min it hardly seemed that long. The class itself is easy as long as you attend lecture. Also, he wears great suits. Definitely recommend this class for your GEC requirements",
        "course": "HA202"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Kleinbub is the most passionate prof. I've ever seen.  Listen to his analysis' and comparisons in class and go to recitation and you pass the class.  Focus on what he says about the compisition, meaning, and what influenced the art and you are golden!",
        "course": "HISTA202"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Kleinbub is one of the best lecturers I've had at OSU.  I would highly recommend taking one of his classes.",
        "course": "HA315"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "Outstanding professor! Very passionate about the material so it is easy to learn. He also has a good sense of humor.",
        "course": "HA202"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 3,
        "comment": "one word NARWAL...Prof Kleinbub is great super passionate and knowledgeable",
        "course": "HA530"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 5,
        "comment": "The best Art History professor @ OSU. Sign up and takes his class NOW!!!! You won't regret it......",
        "course": "HIST531"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing!  Brilliant!",
        "course": "HIST537"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loved Loved Loved this class. Kleinbub is brilliant and he explains the subject matter in a very clear and interesting way. You will also need a good T.A. to do well in this class but Kleinbub was definitely helpful.",
        "course": "HIART202"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 3,
        "comment": "very passionate about Italian Renaissance Art. Knows his stuff and lectures are kept interesting. One midterm and a final, all slides; good professor.",
        "course": "ARTHI315"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "Intelligent and well spoken",
        "course": "HIST315"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 3,
        "comment": "I like history of art, took his class with Sean Delouche as a TA, I loved it, but there is a ton of memorization,  Kleinbub has a wonderfull approach, very good at what he does, listen to what he says and you will do fine, above all just have fun learning what he has to teach.",
        "course": "ARTHI202"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 5,
        "comment": "Clearly very intelligent and driven. Tons of reading, fail if miss more than one class, very tough grader. Can be fun but not if you're not a favorite. Bottom line: smart guy, hard class, lots of work, overall not worth the stress.",
        "course": "HA415"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 3,
        "comment": "i loved going to this class.  he is such an expert on what he is teaching.  not an easy A though..only 2 grades all quarter, midterm and final.",
        "course": "AH211"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 2,
        "comment": "It was a good course. He is very knowledgeable which makes for an interesting course. There are a lots of slides to memorize for the exams, but there are only two exams and no quizzes or papers. If you are somewhat interested in Renaissance art you will like this course and professor.",
        "course": "ART211"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very exited about his material (he is a pretty young professor), but also speaks with a lot of authority. If you want a not too hard class thats also interesting, kleinbub's renaissance course is very good. And if you really like art history, take his advanced class.",
        "course": "HA315"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3,
    "department": "Art History",
    "firstName": "Yifan",
    "id": "VGVhY2hlci0yMzI2MDAx",
    "lastName": "Li",
    "legacyId": 2326001,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "By far the least stressful online class I've taken and I enjoyed the material! Assignments were very short (!!!) and everything was in the lectures (no outside research needed). Lectures are a little long (30 mins, 2-3 each unit) but they were easy to understand. Study guides/reviews provided, just the right amt of work for an intro class!",
        "course": "HISTART2003"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Yifan Li is good as a person, but not so good as a teacher. I got a hard time to understand his leature, which is what the exams are based on. My english is not good, but I can understand all of my other classes. I couldn't take notes because I was not sure what he was talking about for most of time, and these notes can't be found anywhere else.",
        "course": "HISTART2003"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Yifan was adjusting to being a TA, but he was great. He was so funny, tried to learn everyone's names, and stayed after class to talk to students. He didn't know many answers asked by students, but he always tried to figure it out. He was not a hard grader, but really made you work for anything above a B+. Overall he really cares and is considerate",
        "course": "HA2002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4,
    "department": "Art History",
    "firstName": "Eunice",
    "id": "VGVhY2hlci0yMDc3NjIy",
    "lastName": "Uhm",
    "legacyId": 2077622,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loved professor Uhm! Her weekly readings were pretty long but as long as you showed up to class with the general idea of the weekly reading and participate its and easy A. She also gives amazing feedback.",
        "course": "COMPST2321"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Uhm is a very caring and understanding professor. Some of her readings can be a tad long but nothing too crazy or difficult. If you show up to lecture, participate, and do the weekly reflections the class is very easy.",
        "course": "COMPST2321"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Eunice is such a great teacher! She makes class fun and incorporates a lot of different media to liven up academic articles we read. She is extremely kind and was really adaptable when having to transition our class to online since COVID19. There were weekly reading reviews but these aren't too difficult. Overall, great person and highly recommend",
        "course": "COMPSTD2321"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Most rude TA Ive ever had. Travelled all summer and used it as an excuse to treat her students poorly and not help whatsoever. Asked for an explanation for my grade and she answered 1/3 questions in a rude in a rude manner. If you are in the 99% of students and dont care about art history at all but just want an easy GE... do not take with her.",
        "course": "HISTART2001"
      }
    ],
    "SEI": []
  }
]