[
  {
    "avgDifficulty": 2.1,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Emma",
    "lastName": "Kindall",
    "legacyId": 2091328,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Emma is an amazing teacher! It's clear she really cares about her work and her students. My class was a 3 credit hour class in only 7 weeks. It may seem scary signing up for it but it isn't bad at all. The workload is not too hard, as long as you enjoy what you are doing. This class feels like a break compared to the rest. Amazing class!!"
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Emma is the best! For an asynchronous class, she did an excellent job encouraging everyone to draw and learn. It's obvious she cares about her students and even in an online environment, she does her best to get to know everyone. I truly feel like I improved on my art skills thanks to her!"
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "Best teacher I've ever experienced! Emma was so kind and encouraging. She really knew how to push your creativity and gave us all the opportunity to find ourselves artistically. Emma is incredibly accommodating for those needing a sick day or extra help on an assignment. Cannot say enough good things about Emma and will miss her!"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "\"Ah you studied with Chantal and Emma, so you were in good hands\", said my painting prof later on. I took this class 2 years ago and remembered Emma as a good instructor and a lovely person. Knowledgable, understanding, willing to listen, encourages thoughtful concepts (I tried installation and performance). We had plenty 1-on-1 check-in time"
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "Loved this class! You do not have to have art/painting expeirence to learn from Emma. You do have to spend a decent amount of time outside of class painting, but you'll make friends in this class -- which can turn it into a social thing! Highly recommend, Emma is so caring and personable!"
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "I ended up falling behind due to mental health reasons but Emma was extremely considerate and understanding. She is intelligent, never wastes time, gives good feedback, utilizes technology and structures her courses well, and is overall an excellent teacher and person. I would take her class again in a heartbeat."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "I cannot speak more highly of a professor! I learned so much in this class, and so much of that is due to Professor Kindall's kind and clear approach. She is very excited about new perspectives in the classroom, while also doing very helpful demonstrations of technical skills. A great communicator and so caring for everyone in the class."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Honestly, she's amazing. She gives great feedback and listens to her students, even asking how their day is going. Take her if you can."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "I would take every class she taught even if I didn't care for the material. She is a good person. Very beneficial artist and respected instructor. If you read these Emma, you deserve the best!"
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "One of the best art professors, she's very kind and understanding. Always is willing to make accommodations for what you need and is very supportive."
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "One of the best art professors I've had. She makes the class enjoyable for everyone and the critiques never drag out or feel slow. Gives amazing individualized feedback for each student."
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "I LOVE HER! She's very good at clearly explaining how to do things, and allows you to really explore your interests for projects. She also has a nice vibe that always brightens my day!"
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "Emma is actually the best. She lets her students explore their creativity and isn't too harsh about each projects rubric. She gives great feedback without being too harsh. She was def very understanding with covid and as long as you were putting effort into your paintings she gave you a good grade."
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "Emma IS THE BEES KNEES. I can not stress how amazing she is. Fantastic teacher: she is so knowledgeable about art and very passionate in teaching. Her classes are engaging and fun. I was nervous to take Figure Drawing. However, her figure drawing course was inclusive and stress free. I learned so much and would gladly take another course with her!"
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Emma was a great instructor. She had a great balance of giving technical instruction and allowing her students to pursue art that peaked their interests and meant something to them. She was very laid back, funny, and caring. She had a lot of great things planned for this semester but due to the virus she had to switch it up, but she adjusted great!"
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "This class was my favorite! I was worried when I signed up to take a drawing class with little to no experience, but I had nothing to worry about. Emma was amazing at explaining concepts and showing her students how to draw. I enjoyed going to this class every week and was a good choice for the art ge requirement."
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "Kindall seems to really care about her students and their artistic growth. She does a good job making the class interesting and challenging for people of all skill levels- from never picked up a piece of charcoal to Ive been in art classed for 13 years. She does take attendance infallibly- so show up."
      },
      {
        "index": 17,
        "rating": "5.0",
        "comment": "One of the best professors Ive ever had. I was very hesitant on taking a drawing class but emma made this class very enjoyable. She is very positive and encouraging!"
      },
      {
        "index": 18,
        "rating": "4.5",
        "comment": "I absolutely hate drawing but she made the class pretty bearable. I would definitely suggest taking her over any professor because she's very lenient on grading. Didn't do one of my homework assignments and still passed with an A. Good GPA booster and my drawing skills greatly improved. But you only have 5 allowed absences so save them!!!"
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 4,
    "department": "Art",
    "firstName": "Deborah",
    "lastName": "Scott",
    "legacyId": 2236978,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "So much unnecessary lecture content. Picked favorites and only helped them."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Deb was fine, she's really nice but some of her lectures seemed to confuse me more on what the assignment was. There are very few assignment to be graded off of, but you have a lot of time to put into them which is nice."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "She's good but clearly picks favorites. Doesn't give much time to students she doesn't like. She also does additive grading and her feedback never really makes sense. I never felt like I got a grade I agreed with in her class. She was nice tho and gave a lot of time on her assignments"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Genuinely the best professor I've ever had, and definitely the most helpful Foundations instructor. If you're willing to reach out and get feedback, in and outside of class, she will be extremely helpful and push you to keep developing your ideas - which helps your grade as well."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "The worst professor I have ever had the displeasure of being in the presence of. Was disrespectful and obviously favored her other class much more than ours. Called two of us a cancerous negative energy when in reality we worked hard and got along with the majority of our peers. She cried a shocking amount of times during studio."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Deb is an absolutely amazing professor! You have to put in a lot of work outside of class and talk to her often, but this effort is definitely worth it. She gives really helpful feedback and meets everyone where they are to help them improve. Unfortunately there's only three things that you're graded on but you have a long time for each assignment."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Deb was always really passionate throughout every class. She brought a lot of energy to the subjects, and was really helpful in giving feedback. I really appreciated her openness to review work and she was often in the studio. The class can be a lot of work, but if you start things early I found it very manageable."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Deb is an amazing instructor. She truly cares about students understanding the class material and is extremely knowledgeable. The course is manageable and consists of 3 \"modules\"- design projects. The only issue is that it can be difficult to get a hold of her during class for feedback as she speaks to each student one-on-one for several minutes."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "OMG DEB. How can I describe Deb in 350 characters?? Deb is wonderful. Very motivational, caring, and an overall nice lady. The class covers a lot of material so it can be a little jumbled but all in all its a nice course. Be ready to work and deliver on time. If OSU drives you nuts, Deb will restore your faith in this universities art programs."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Deb is THE BEST. She really truly cares about her students and is a genuinely good person. She came into the studio outside of class all the time to help us out"
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "Really understanding and caring.  Did not give out perfect scores.  Gave constructive criticism and showed great passion for art.  Very personable and easy to talk to."
      }
    ]
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 2.9,
    "department": "Art",
    "firstName": "Jared",
    "lastName": "Thorne",
    "legacyId": 2191960,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Jared was incredibly nice and thoughtful, but he did have a big time tendency to ramble in class. He was helpful to bounce ideas off of and to help fine tune in the dark room but he has a small tendency to nitpick non-technical aspects in projects. He also takes forever to get grades (and contact sheets) back to you."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "I have taken multiple classes with Jared Thorne while attending OSU and the biggest takeaway I have is: he can be very cruel. He grades hard, but only with certain students, and often times, he just slaps a letter onto your final gradebook and doesn't give you any explanation as to why you got that grade. Be very wary with him & watch your back."
      },
      {
        "index": 2,
        "rating": "4.0",
        "comment": "My experience with Professor Thorne was overall positive and he loves to talk art and photography. The biggest advice for this class is to work hard, be patient, and always have questions. Critique is one of the foundations of art classes and unlike other class settings you are the one in control of the dialogue. Utilize the darkroom to the fullest"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Jared is definitely my favorite professor that I have ever had, he gave great feedback on my work, and taking his class last semester really helped me and my development as an artist. Also while being in his class, I truly fell in love with film and darkroom processes."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "I wanted to like Photo II with Jared, but it was difficult. He is not unpleasant or mean, but as a professor he's distant and hard to learn from. I got an A, but only because I spent hours struggling in the darkroom to learn things that he should have taught me during class. We got endless lectures instead of practical instruction."
      },
      {
        "index": 5,
        "rating": null,
        "comment": "Jared is very honest during critique. Somewhat distant and hard to get a hold of. Does not make learning about photo history very fun. Long hours sitting down. BUT does make useful suggestions about your work. Assigns readings and then doesn't really read responses. Exams heavy on memorization of camera settings. Photo 1 requires money for prints!"
      },
      {
        "index": 6,
        "rating": null,
        "comment": "Jared is a wonderful person in a very difficult situation. He is extreamly busy which can make it hard to reach out to him outside of class. Jared was difficult to connect with which is sad as I know he has a lot of knowledge to impart. He often felt standoffish trying to keep us as arms length. This was to the detriment of personal instruction."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "I guess you can say he is a cool guy to talk with in terms of photography, in terms of teaching skills, nah..... I mean you wouldn't expect that you can actually learn something by taking this class, besides just show up on time and do the normal work and discussions, you will get an A."
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Marcus",
    "lastName": "Morris",
    "legacyId": 3036273,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "marcus's class was super fun! he made the material easy to understand, and was really good at responding to questions or giving feedback outside of a project. he also provided examples for the projects to help guide us toward the general direction we should take with our photos."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Marcus makes this class very enjoyable for beginners. He grades leniently with the understanding that many of us are new at this kind of photography. This made it a lot easier to explore our creativity with photography instead of stressing over grades. Some lectures were boring and long but for others he let us leave early to take photos."
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.8,
    "department": "Art",
    "firstName": "Deborah",
    "id": "VGVhY2hlci0yMjM2OTc4",
    "lastName": "Scott",
    "legacyId": 2236978,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "terrible feedback and lectures, Doesn't give clear instruction. Her TA is more helpful. Projects have nothing to do with design ",
        "course": "DSN2310"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "So much unnecessary lecture content. Picked favorites and only helped them. ",
        "course": "2110"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Deb was fine, she's really nice but some of her lectures seemed to confuse me more on what the assignment was. There are very few assignment to be graded off of, but you have a lot of time to put into them which is nice. ",
        "course": "2110"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "She's good but clearly picks favorites. Doesn't give much time to students she doesn't like. She also does additive grading and her feedback never really makes sense. I never felt like I got a grade I agreed with in her class. She was nice tho and gave a lot of time on her assignments ",
        "course": "DSN2310"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Genuinely the best professor I've ever had, and definitely the most helpful Foundations instructor. If you're willing to reach out and get feedback, in and outside of class, she will be extremely helpful and push you to keep developing your ideas - which helps your grade as well.",
        "course": "DSN2310"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst professor I have ever had the displeasure of being in the presence of. Was disrespectful and obviously favored her other class much more than ours. Called two of us a cancerous negative energy when in reality we worked hard and got along with the majority of our peers. She cried a shocking amount of times during studio.",
        "course": "DSN2310"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Deb is an absolutely amazing professor! You have to put in a lot of work outside of class and talk to her often, but this effort is definitely worth it. She gives really helpful feedback and meets everyone where they are to help them improve. Unfortunately there's only three things that you're graded on but you have a long time for each assignment.",
        "course": "DSN2310"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Deb was always really passionate throughout every class. She brought a lot of energy to the subjects, and was really helpful in giving feedback. I really appreciated her openness to review work and she was often in the studio. The class can be a lot of work, but if you start things early I found it very manageable. ",
        "course": "DSN2310"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Deb is an amazing instructor. She truly cares about students understanding the class material and is extremely knowledgeable. The course is manageable and consists of 3 \"modules\"- design projects. The only issue is that it can be difficult to get a hold of her during class for feedback as she speaks to each student one-on-one for several minutes.",
        "course": "DSN2310"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "OMG DEB. How can I describe Deb in 350 characters?? Deb is wonderful. Very motivational, caring, and an overall nice lady. The class covers a lot of material so it can be a little jumbled but all in all its a nice course. Be ready to work and deliver on time. If OSU drives you nuts, Deb will restore your faith in this universities art programs.",
        "course": "ART2400"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Deb is THE BEST. She really truly cares about her students and is a genuinely good person. She came into the studio outside of class all the time to help us out",
        "course": "DSN2310"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really understanding and caring.  Did not give out perfect scores.  Gave constructive criticism and showed great passion for art.  Very personable and easy to talk to.",
        "course": "ART2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Emma",
    "id": "VGVhY2hlci0yMDkxMzI4",
    "lastName": "Kindall",
    "legacyId": 2091328,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Emma is an amazing teacher! It's clear she really cares about her work and her students. My class was a 3 credit hour class in only 7 weeks. It may seem scary signing up for it but it isn't bad at all. The workload is not too hard, as long as you enjoy what you are doing. This class feels like a break compared to the rest. Amazing class!!",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Emma is the best! For an asynchronous class, she did an excellent job encouraging everyone to draw and learn. It's obvious she cares about her students and even in an online environment, she does her best to get to know everyone. I truly feel like I improved on my art skills thanks to her!",
        "course": "ART2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best teacher I've ever experienced! Emma was so kind and encouraging. She really knew how to push your creativity and gave us all the opportunity to find ourselves artistically. Emma is incredibly accommodating for those needing a sick day or extra help on an assignment. Cannot say enough good things about Emma and will miss her! ",
        "course": "ART-2221"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "\"Ah you studied with Chantal and Emma, so you were in good hands\", said my painting prof later on. I took this class 2 years ago and remembered Emma as a good instructor and a lovely person. Knowledgable, understanding, willing to listen, encourages thoughtful concepts (I tried installation and performance). We had plenty 1-on-1 check-in time",
        "course": "ART-2221"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loved this class! You do not have to have art/painting expeirence to learn from Emma. You do have to spend a decent amount of time outside of class painting, but you'll make friends in this class -- which can turn it into a social thing! Highly recommend, Emma is so caring and personable!",
        "course": "ART3024"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I ended up falling behind due to mental health reasons but Emma was extremely considerate and understanding. She is intelligent, never wastes time, gives good feedback, utilizes technology and structures her courses well, and is overall an excellent teacher and person. I would take her class again in a heartbeat.",
        "course": "ART2100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": " I cannot speak more highly of a professor! I learned so much in this class, and so much of that is due to Professor Kindall's kind and clear approach. She is very excited about new perspectives in the classroom, while also doing very helpful demonstrations of technical skills. A great communicator and so caring for everyone in the class. \n",
        "course": "ART-2221"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Honestly, she's amazing. She gives great feedback and listens to her students, even asking how their day is going. Take her if you can.",
        "course": "ART2100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I would take every class she taught even if I didn't care for the material. She is a good person. Very beneficial artist and respected instructor. If you read these Emma, you deserve the best!",
        "course": "ART3024"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best art professors, she's very kind and understanding. Always is willing to make accommodations for what you need and is very supportive.",
        "course": "ART2504"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best art professors I've had. She makes the class enjoyable for everyone and the critiques never drag out or feel slow. Gives amazing individualized feedback for each student.",
        "course": "ART3024"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "I LOVE HER! She's very good at clearly explaining how to do things, and allows you to really explore your interests for projects. She also has a nice vibe that always brightens my day!",
        "course": "ART2100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Emma is actually the best. She lets her students explore their creativity and isn't too harsh about each projects rubric. She gives great feedback without being too harsh. She was def very understanding with covid and as long as you were putting effort into your paintings she gave you a good grade.",
        "course": "ART3024"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Emma IS THE BEES KNEES. I can not stress how amazing she is. Fantastic teacher: she is so knowledgeable about art and very passionate in teaching. Her classes are engaging and fun. I was nervous to take Figure Drawing. However, her figure drawing course was inclusive and stress free. I learned so much and would gladly take another course with her!",
        "course": "ART2504"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Emma was a great instructor. She had a great balance of giving technical instruction and allowing her students to pursue art that peaked their interests and meant something to them. She was very laid back, funny, and caring. She had a lot of great things planned for this semester but due to the virus she had to switch it up, but she adjusted great!",
        "course": "ART2504"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was my favorite! I was worried when I signed up to take a drawing class with little to no experience, but I had nothing to worry about. Emma was amazing at explaining concepts and showing her students how to draw. I enjoyed going to this class every week and was a good choice for the art ge requirement.",
        "course": "ART2100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kindall seems to really care about her students and their artistic growth. She does a good job making the class interesting and challenging for people of all skill levels- from never picked up a piece of charcoal to Ive been in art classed for 13 years. She does take attendance infallibly- so show up.",
        "course": "ART2100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors Ive ever had. I was very hesitant on taking a drawing class but emma made this class very enjoyable. She is very positive and encouraging!",
        "course": "ART2100"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "I absolutely hate drawing but she made the class pretty bearable. I would definitely suggest taking her over any professor because she's very lenient on grading. Didn't do one of my homework assignments and still passed with an A. Good GPA booster and my drawing skills greatly improved. But you only have 5 allowed absences so save them!!!",
        "course": "ART2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.5,
    "department": "Art",
    "firstName": "Jessica",
    "id": "VGVhY2hlci0yNDQ0Nzg2",
    "lastName": "Boushie",
    "legacyId": 2444786,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "  this professor takes points off of projects for invalid reasons\nsuper strict with rules",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "She canceled class a bunch, so that was nice, you just have to spend time on your art projects and you will get a good grade, which reflects upon your effort.",
        "course": "ART2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.3,
    "department": "Art",
    "firstName": "Geren",
    "id": "VGVhY2hlci0yNzI5Mzcz",
    "lastName": "Heurtin",
    "legacyId": 2729373,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took ART 2555 with professor Heurtin and absolutely loved it! She made intro to photography fun and I feel like she was fair with grades and such. She was responsive to emails and had videos posted for lecture which helps describe what was necessary in detail. Would recommend this class and professor. ",
        "course": "14335"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Tough Grader",
        "course": "14335"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class is fun and great for those new to photography. Geren teaches this class with mostly lectures and a few workshop days. There are a few readings and we rarely used the textbook (which she provided). She cares very deeply about participation. Many of our classes were cancelled or moved to zoom. There are no tests except for the midterm.",
        "course": "14335"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 2.9,
    "department": "Art",
    "firstName": "Jared",
    "id": "VGVhY2hlci0yMTkxOTYw",
    "lastName": "Thorne",
    "legacyId": 2191960,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Jared was incredibly nice and thoughtful, but he did have a big time tendency to ramble in class. He was helpful to bounce ideas off of and to help fine tune in the dark room but he has a small tendency to nitpick non-technical aspects in projects. He also takes forever to get grades (and contact sheets) back to you.",
        "course": "ART3005"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "I have taken multiple classes with Jared Thorne while attending OSU and the biggest takeaway I have is: he can be very cruel. He grades hard, but only with certain students, and often times, he just slaps a letter onto your final gradebook and doesn't give you any explanation as to why you got that grade. Be very wary with him & watch your back.",
        "course": "ART3005"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "My experience with Professor Thorne was overall positive and he loves to talk art and photography. The biggest advice for this class is to work hard, be patient, and always have questions. Critique is one of the foundations of art classes and unlike other class settings you are the one in control of the dialogue. Utilize the darkroom to the fullest",
        "course": "ART3005"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jared is definitely my favorite professor that I have ever had, he gave great feedback on my work, and taking his class last semester really helped me and my development as an artist. Also while being in his class, I truly fell in love with film and darkroom processes.",
        "course": "ART3005"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "I wanted to like Photo II with Jared, but it was difficult. He is not unpleasant or mean, but as a professor he's distant and hard to learn from. I got an A, but only because I spent hours struggling in the darkroom to learn things that he should have taught me during class. We got endless lectures instead of practical instruction.",
        "course": "ART3005"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Jared is very honest during critique. Somewhat distant and hard to get a hold of. Does not make learning about photo history very fun. Long hours sitting down. BUT does make useful suggestions about your work. Assigns readings and then doesn't really read responses. Exams heavy on memorization of camera settings. Photo 1 requires money for prints!",
        "course": "ART2555"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Jared is a wonderful person in a very difficult situation. He is extreamly busy which can make it hard to reach out to him outside of class. Jared was difficult to connect with which is sad as I know he has a lot of knowledge to impart. He often felt standoffish trying to keep us as arms length. This was to the detriment of personal instruction.",
        "course": "ART3005"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 1,
        "comment": "I guess you can say he is a cool guy to talk with in terms of photography, in terms of teaching skills, nah..... I mean you wouldn't expect that you can actually learn something by taking this class, besides just show up on time and do the normal work and discussions, you will get an A.",
        "course": "ART2555"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Marcus",
    "id": "VGVhY2hlci0zMDM2Mjcz",
    "lastName": "Morris",
    "legacyId": 3036273,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "marcus's class was super fun! he made the material easy to understand, and was really good at responding to questions or giving feedback outside of a project. he also provided examples for the projects to help guide us toward the general direction we should take with our photos. ",
        "course": "2555-0020"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Marcus makes this class very enjoyable for beginners. He grades leniently with the understanding that many of us are new at this kind of photography. This made it a lot easier to explore our creativity with photography instead of stressing over grades. Some lectures were boring and long but for others he let us leave early to take photos. ",
        "course": "2555-0020"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 0,
    "avgRating": 0,
    "department": "Art",
    "firstName": "Akeylah",
    "id": "VGVhY2hlci0yNzM5NDc5",
    "lastName": "Wellington",
    "legacyId": 2739479,
    "numRatings": 0,
    "Ratings": [],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 3.5,
    "department": "Art",
    "firstName": "Dustin",
    "id": "VGVhY2hlci0yODA2NDAy",
    "lastName": "Brinkman",
    "legacyId": 2806402,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dustin is a certified gem. If you can take any class with him, do it. It is hard to find people who are good at art and teaching, but he is great at both. You will get a good grade if you listen to directions, show up & try. He is kind, genuine, smart, and goofy. Plus he makes awesome art so learning from him is a great privilege. 10/10 recommend",
        "course": "ART2200"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "Definitely loves to hear himself talk so be prepared to listen to a lot of speeches and when he says that's all he has for the day, don't believe it. Nice enough guy, just really entitled.",
        "course": "ART2200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Art",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0yMzQ1MTY0",
    "lastName": "Widomski",
    "legacyId": 2345164,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": " If you are thinking about taking this class... do not do it.. warning lies here. I took this class as an online GE course, i thought, this should be an easy A .  I never once argued with and a teacher, but she was my first. She is SOOOO disrespectful, extremely passive agressive , but tries to come off as nice to her students, it is all a facade.",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I think Rachel is super nice, the only comment I have is that sometimes her directions are not very clear. Overall, this art class I would recommend to other students.",
        "course": "ART2100"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "I took 2D art, and nearly all we did was tracings. she did no lectures or interaction with the class at all and expected us to read the textbook and spend literally so much time outside of class doing just busywork. I spent at least 150 hours and several all-nighters, and I got a D+. It's so ridiculously easy to fall behind in the project deadlines",
        "course": "ART2300"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Super nice. She acknowledges that this is a beginner class, so everyone is in different places (grades based one effort). Sometimes the work was a little time-consuming, but it was a nice break from my other classes. If you need help with anything in the class, then just ask her and she will help you. ",
        "course": "ART2100E"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is supposed to be an art GE course, but her grading is literally harsher than calculus/physics. You'll get 0's for little to no reason. I got a 0 on an assignment because my body physically casted a shadow on the drawing. It's like a joke.",
        "course": "ART2100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Immediate drop after day 1. Heed the warnings here, I read them and thought she couldn't be that bad. She was. I've never met another GE teacher that sits on such a high horse and expects that much. Just take art education instead, it's easier and more fun.",
        "course": "ART2100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Most unprofessional and disrespectful professor I have had. She leaves hurtful and non-constructive comments, so much so our entire class had to email the head chair to talk with her. Her rude attitude never waivers and makes you feel ignorant for asking questions. She gives zeros after not clarifying what she wants but requires specificities.",
        "course": "ART2000"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "Said-You shouldve done it right the first time I dont believe in extra credit. Her assignments seem simple but her grading is extremely complex. If youre not extremely persistent and constantly in contact w her you wont pass. This class functions heavily on writing capabilities even though its an art class. Use writing center!",
        "course": "ART2000"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Rachel is one of the worst professors I've had. Gives little direction yet expects you to know how to do things. Extremely passive aggressive in text and lectures. Doesn't give clear directions when asking how to do assignment, points to assignment guidelines on canvas, yet those are incomplete as well.",
        "course": "ART2000"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Personally, I wouldnt take this class if you didnt have too. It being online AU20 was very hard for me to pick up the different methods. I feel like when she was giving feedback she did not take that into account that maybe the reason why some of her students werent picking up the method all the way was because we werent in a classroom setting.",
        "course": "ART2100"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "Super hard to reach outside of class. Late responses for emails, tough grader, and take forever to grade an assignment. I was really expected contemporary art course, now I'm disappointed by this professor.",
        "course": "ART2000"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible professor. She takes forever to grade assignments and provides no feedback on how to improve. Not easily accessible outside of class as this was a direct quote from her, sorry, my schedule is more important than yours. For final grades, she said we cant email about them until NEXT TERM. I will never take any of her classes again.",
        "course": "ART2000"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "Rachel means well, I'm sure. But, she doesn't offer any feedback on the assignments you so and she offers little to no chance to get your grades up and doesn't &quot;believe in&quot; extra credit. So, bomb one assignment and you're done for. She takes herself way too seriously for a GE art lecture, and I'm an ART major.",
        "course": "ART2000"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "The course is insane. Rachel means well, but tends to take these courses to serious. Not asking for a handout, but its art. No disrespect to any students or professors who are in that department, Lets just be real. Its art. Will never take her courses again.",
        "course": "ART2100E"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "She kind of takes a while to grade. She does try to give good feedback that will help but only after youve done the drawing. She doesnt really teach you, but just gives a small explanation and makes you figure it out yourself. I mean its doable but kinda confusing the way the class is laid out",
        "course": "ART2100"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very helpful with developing art skills in photoshop, open to ideas from her students. Sometimes unclear, but literally everything is in the syllabus.",
        "course": "ART2500"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 5,
        "comment": "Rachel means well and she is fairly understanding and helpful. However, the coursework is overbearing: she verbally expresses that students spend 8-10 hours outside of class per week working on projects and assignments, in addition to the 6 hours in class, attendance is mandatory and tardiness is penalized. The class consists of 5 lengthy projects",
        "course": "ART2300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 1.2,
    "department": "Art",
    "firstName": "Florence",
    "id": "VGVhY2hlci0yMTMzMjAz",
    "lastName": "Gouvrit",
    "legacyId": 2133203,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "not worth the time spending ",
        "course": "ART3001"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "There's not a lot of things to be graded on. Critique of projects are rarely constructive - just a lot of \"slamming\" and honestly kind of disrespectful commentary on your work. Also, I didn't get a grade back until a week in the NEXT semester.",
        "course": "ART3101"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "She might be a good teacher, but she try her best to destroy me. I do not even argue anything about grade or what, because she is not worth for that, please let this semester end. She try to make me believe I am a bad student, LOL,  really stupid. Now I feel helpless about life and University, really appreciate her, she is the real teacher of life.",
        "course": "ART3001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.9,
    "department": "Art",
    "firstName": "Cory",
    "id": "VGVhY2hlci0yNDMyNTEz",
    "lastName": "Mahoney",
    "legacyId": 2432513,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Kind of micromanages all your projects and has very high expectations. Not great at teaching on the wheel. Plays good music in class though. You need to put in probably a minimum of 5 hours/wk during a project week to get your stuff done, so that's frustrating sometimes. Can also come across as passive aggressive",
        "course": "ART3502"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Does not accept excused absences (COVID, funerals, accidents, etc.) with proof and will deduct points for missing class. He will state that he \"understands things happen that are out of you control but you still need to attend class\".\n\nHe will take away points from your project because it is not up to his standards, even if you are a beginner.\n",
        "course": "ART2502"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Cory's teaching approach is problematic. Many in the course feel inadequate and belittled because he is passive-aggressive. He also has very peculiar restrictions on assignments, and grades are delayed until the semester's end. Assignments aren't that hard, but he will make them hard.",
        "course": "ART3502"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Labeled as intro but is more like a 3000 level course and NOT friendly for beginners. Time constraints were tight. No matter how hard you worked, feedback always made you feel like you did something wrong. Didn't seem sympathetic for special circumstances. Projects were very specific, with little room for creative freedom. Wish he would do better!",
        "course": "ART2502"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I think Cory does a great job. He sets clear expectations from day 1, & encourages everyone to improve regardless of skill. His projects are fun, engaging, leave room for creative expression. If you would like to learn and improve this great course, whether your an art major or not.Overall the expectation is in line with a 3000+ college art course.",
        "course": "ART3502"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Rlly like Cory just not the projects he chose ",
        "course": "ART2502"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Doesnt really teach, he works on his own projects during class and often misses classes the day before projects are due. Rather than helping students learn and improve their technique he more so says do this and walks away.",
        "course": "ART3502"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class has been terrible and unnecessarily stressful. He teaches it like an advanced level course and makes students feel like they are supposed to cater to his liking rather than be freely creative. Never gives enough time for projects and is never clear on anything, you feel like you know what he means but then he tells you its wrong.",
        "course": "ART2502"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "Passive aggressive and blames the student for not understanding content even though most students come from non-art majors. Projects are seemingly graduate level compared to the other intro ceramic classes. Very tough grader, your average is going to be a C. I now hate ceramics because of him.",
        "course": "ART2502"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is labeled Intro to High Fire. He teaches like it is a graduate level art class. He gives projects that are not specific and that are too hard for students who have no experience with clay. I would not recommend taking this class with him as your professor. Tough grader and expects too much out of students in everything that they do.",
        "course": "ART2502"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4,
    "department": "Art",
    "firstName": "Jinblossom",
    "id": "VGVhY2hlci0yODAxNTQx",
    "lastName": "Plati",
    "legacyId": 2801541,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is absolutely the best! I took Intro to Drawing with her and it was by far my favorite class that semester. She genuinely cares about her students and offers helpful, constructive criticism. The weekly assignments were a little time-consuming, but overall I had lots of fun with that class.",
        "course": "3002"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Compared with other intro-level studio art classes, this one is very basic and has little to do with art in a conceptual sense. She doesn't support projects outside the curriculum. A fine class if you just wanna craft/take home a bunch of cups, and don't mind BSing through papers or critiques. ",
        "course": "3002"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jinblossom is one of the few professors who genuinely cares about her students. She's incredibly talented, patient, and eager to share her knowledge. Her class left me feeling encouraged and inspired. One of the best I've taken at OSU. There was some confusion with homework expectations, but she's lenient if you show effort.",
        "course": "3002"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "She's like an Asian mom, willing to demo repetitively and fix things for each student. But expects obedience w/o question & respect to her authority. Assignments and plans were announced verbally, info on Carmen were often wrong. Brought forward dues/crits w v short notice. She doesn't know she's confusing.\n\n2page ppr abt 17-18 century ceramics.",
        "course": "3002"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jinblossom is a wonderful gifted teacher. So lucky to have taken her class!!!!",
        "course": "3002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.3,
    "department": "Art",
    "firstName": "Marsha",
    "id": "VGVhY2hlci0yODczNTQ2",
    "lastName": "Mack",
    "legacyId": 2873546,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Marsha is really cool but she's also pretty tough on you. She expects a lot out of you for an entry level class but she also made the class very enjoyable. She's definitely intimidating but cool. ",
        "course": "3002"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Marsha was very upfront about what to expect form this course however, she is very critical. It is an intro level course and there is a more expected from you than I had imagined. ",
        "course": "3002"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Marsha is intimidating at times but genuinely a fun and nice professor if you give her the chance. Loves to laugh at her own jokes. I wish she Gave a little more instruction and introduction for certain techniques but if you ask her specifically she will definitely help. You will probably spend a lot of time working on projects outside of class. ",
        "course": "3002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Julian",
    "id": "VGVhY2hlci0yODM5NDE2",
    "lastName": "Robbins",
    "legacyId": 2839416,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really great teacher. didn't get feedback/ grades until the last few weeks but given a lot of opportunity to turn in late work/ get extra time on projects. really fun and engaging class. ",
        "course": "3101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Chantal",
    "id": "VGVhY2hlci0yNzU2MTc2",
    "lastName": "Wnuk",
    "legacyId": 2756176,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "YES YES YES YES. Chantal is known among students and faculties to be one of the best instructors in P&D. Everything is so thoughtful, from assignments to feedbacks to the arrangement of works for the open house show at the end of the term. She cares and she knows how to. Oh and her music playlist is delightful and refreshing",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chantal cares about her students. I mean they all do, but she really does. She gives great lectures, assignments, constructive insights. She is a genuine listener and observer, compassionate and considerate. I dunno, there's so many great things about her. I would recommend her to anyone, art or non-art folks. ",
        "course": "ART2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chantal is so lovely and does such a great job of making sure everyone feels confident and secure in their art while simultaneously pushing you to be better and improve. I could see tangible growth in not only my drawing abilities, but also my confidence throughout the semester. This was one of my favorite classes and I highly recommend.  ",
        "course": "ART2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Please take a class with her if you can! Chantal is such an inspiration. My drawing class was unlike any Ive taken before, our assignments were so unique and actually made us get creative and experiment and change the ways we think about art. The class environment was so encouraging and I feel so accomplished after just one semester. Shes a gem!",
        "course": "ART2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 1.4,
    "department": "Art",
    "firstName": "Paul",
    "id": "VGVhY2hlci0xNjQ1NzYy",
    "lastName": "Simmons",
    "legacyId": 1645762,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "All these years later after graduating, I still remember him as the single worst teacher I have ever had in my 40 years of existence. No surname was necessary in the Art department; if you referenced the name Paul with enough stank, everyone knew who exactly it was. He was remarkably terrible at communication and contradicted himself constantly.",
        "course": "ART472"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Doesn't really listen to you AT ALL and would rather hear himself talk! Doesn't like it when students want to have a little bit more fun with his projects as they tend to be fairly bland. While he knows a lot about art and its medium, he'll usually only skim over his slides and hopes you understood everything.  Doesn't give constructive critique.",
        "course": "ART3054"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Paul's communication skills were seriously lacking. I believe he thought his assignments were deep and thought provoking, but they were the insane ramblings of an egoist. I think the only person that knew what Paul was talking about was Paul. Even that is debatable. Stay away. If you take his class, it will only be a void in your artistic career.",
        "course": "ART476"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "His communication skills are poor; he talks AT us and not TO us. His understanding of Art in general is superb and he seems very talented, but he doesn't know how to give constructive criticism. I would love to be friends with him outside of an academic environment,but he just doesn't know how to communicate with us as students. he's adorable too.",
        "course": "ART3054"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "He has poor communication skills; he talks at us. his level of artistic understanding is high, but his understanding of helping others is lacking. I would love to be friends with him outside an academic environment, but as an instructor he's so-so.",
        "course": "PAINT2"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very uninspiring. Though I'm doing well in the class, he frustrates me to no end. The way he treats some of my classmates is deplorable. I love Art and painting in particular, but I'm now considering other options because of him. Professors in other areas in the Arts inspire me more and are far more respectful.",
        "course": "ARTPAIN"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Trying to be objective as possible: he SHOULDN'T be a teacher. He has horrible communication skills in that he tells you one thing, and when you follow his advice, he is confused why you did. I have never been treated so poorly by even another person. He went out of his way not to give constructive critiques-but to cut us down and make us feel bad",
        "course": "ART472"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Brett",
    "id": "VGVhY2hlci0yOTY3NjIy",
    "lastName": "Davis",
    "legacyId": 2967622,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy class. Just take a few photos and pick two photo books a week to look through. three hour lectures 2 times a week but half way through the semester you only need to go to one of the lectures. One two page double spaced essay as the final about a photographer. Easy class. ",
        "course": "ART2555"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor. Never liked taking art classes in high school because of how structured they made it feel, but Brett allows you to shoot whatever you like and be creative. He is a very insightful and caring teacher. If I had to take another photo class, it would 100% be with him. 10/10",
        "course": "ART2555"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Ivan",
    "id": "VGVhY2hlci0yODMxMzI3",
    "lastName": "Ng",
    "legacyId": 2831327,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent instructor, professional and passionate in art. Learnt a lot from this class. Easy A. Drawing al lot and one paper. Recommend take this class with him. ",
        "course": "art"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.3,
    "department": "Art",
    "firstName": "Gloria",
    "id": "VGVhY2hlci0yNDA3ODM0",
    "lastName": "Shows",
    "legacyId": 2407834,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Shows is an awesome human being and really cares about her students wellbeing. I wish she would push us as students a bit more, as her class was super lax. I wish her well in her next chapter of her life. ",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "very nice and chill but lots of work",
        "course": "ART2100"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Took this class for my GE art credit and thought it would be fun. It was way too much word for a beginning drawing class. I would have taken a different art class for my GE if I could do it again. She is very nice and caring but does not explain directions well.",
        "course": "ART2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Gloria shows an amazing, caring and chill professor. She doesn't criticize harshly, and instead offers positive and supportive feedback. She builds an environment for growth, learning from mistakes and unique creativity. She's pretty flexible if you have trouble turning in your assignments. Make sure you're actively participating in class critiques",
        "course": "ART2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Benny",
    "id": "VGVhY2hlci0yOTg1Mjc4",
    "lastName": "Zelkowicz",
    "legacyId": 2985278,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love Benny, this class was awesome. We created 2D bouncing spheres, 2D walk cycles, stop motion, and a group final project. Critiques were helpful and assignments self graded. Wacky and lots of fun. Showed some amazing inspirational short films and pushed us to learn new software using ToonBoom Harmony. Very humble despite how great his work is.",
        "course": "ACCAD5001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3,
    "department": "Art",
    "firstName": "Kirsten",
    "id": "VGVhY2hlci0yOTY0NDkx",
    "lastName": "Willders",
    "legacyId": 2964491,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Extremely rude and unprofessional. Refused to answer questions, accused me of lying when I tried to offer feedback. Did not teach class at an intro level, gave very abbreviated demonstrations and short deadlines. Most of my class had some experience in ceramics, but an intro course should still be taught at an intro level for those who are new. ",
        "course": "ART3012"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Kirsten for the intro ceramics class and she was amazing. She's super knowledgeable at all things ceramics and allows her students lots of room to make whatever they want. With that said, learning to throw on the wheel was a steep learning curve, but if you don't give up it's very rewarding. Super fun, 100% recommend.",
        "course": "ART3002"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "For a ceramics class, the grading was kind of picky and harsh. The class high on assignments was often a 13/15, which seems unfair for an intro art course designed for non-majors. Requirements for attendance and projects are unclear. Good instruction for ceramics, but be prepared to work for an A.",
        "course": "ART3002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 2.7,
    "department": "Art",
    "firstName": "Aaron",
    "id": "VGVhY2hlci0yNTI2NDAy",
    "lastName": "Peters",
    "legacyId": 2526402,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Aaron is a great person and instructor and I would urge you to ignore some of the other responses here. I can understand that the class can seem fast paced, but it really just takes applying yourself to the projects and asking questions. Aaron is a knowledgable, funny, and caring person and a great artist!",
        "course": "ART2400"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "He can be pretty unorganized, but his enthusiasm makes up for it. We did three projects which were focused on teaching us new artmaking skills. There were a few open note quizzes. He grades based on effort and participation, not the \"quality\" of your project, which is nice. He's very nice and easy to work with if you need any accommodations. ",
        "course": "ART2400"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class could be better organized, but overall a nice individual ",
        "course": "ART2300"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "He's a good person, but he's unorganized and the class wasn't sure what was going on a lot of the time.",
        "course": "ART2300"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Mr. Peters is a nice guy, he's a little awkward though. The Zoom meetings could have been cut down, they were two hours long and if you weren't listening you wouldn't miss anything. Personally the &quot;project check-ups&quot; irritated me, but not turning in the &quot;checkpoint&quot; homework had very little effect on my grade; he is a lax grader!",
        "course": "ART2300"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Hard grader for an introductory course. Explanations are very vague and class is super unorganized. Dont know what Im supposed to be doing more than half of the time. Over explains simple things. You have to spend your own money on unnecessary things. Hours spent on homework and projects outside of class. Just dont take it. Dont.",
        "course": "ART2100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "I have never taken a art class so unorganized. Professor lacks communication about projects and neglects to give demonstrations or clear explanations. Takes forever to put in grades and very harsh grader despite the fact its an intro to drawing class.",
        "course": "BEGDWG278"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Art",
    "firstName": "Jessie",
    "id": "VGVhY2hlci0yMjczNDY5",
    "lastName": "Horning",
    "legacyId": 2273469,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jessie is a wonderful professor! Kind, funny, enthusiastic, and understanding! ",
        "course": "ART3056"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Syllabus is unclear and changed rapidly",
        "course": "ART2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super nice! Honestly like a irl Ms Frizzle. Lectures can run long and could be 1/4 of the length and still get the point across, but theyre usually recorded so you can watch outside of class. She gives realy helpful feedback and makes sure to check in with every student. Her main goal is that you show growth so as long as you do the work youre ok",
        "course": "ART2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jessie is so sweet! She's funny and makes class fun. Sometimes lectures/instructions were a little hard to follow or dragged on, but she's very knowledgeable and always willing to help. Definitely would take her class again.",
        "course": "ART3056"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "No tests, didn't have to show up during final. Gives you at least a C if you finish the drawing. Easy class, just long hours. A nice lady, can be air-headed at times. Brings food to class occasionally. She shows power points of drawing skills (ex. shading styles) but doesn't really explain/show how to do it personally unless you ask for help.",
        "course": "ART2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.7,
    "department": "Art",
    "firstName": "Matty",
    "id": "VGVhY2hlci0yODI4MDE4",
    "lastName": "Machado",
    "legacyId": 2828018,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved this class. I also love that I can be honest in this anonymous review!",
        "course": "ART2555"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I love this class! He was great and honestly really funny. He is a grad student doing student teaching and made the class fun!",
        "course": "ART2555"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Matty was honestly really really funny, made me enjoy going to class. Class is supposed to be 1 hr 50 mins, but often Matty cut short or canceled to give opportunity to work on projects which was nice. Very relatable and easy to interact with. Somewhat unpredictable in grading, but generally a very light grader, if you care about that for GE.",
        "course": "ART2555"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Katie",
    "id": "VGVhY2hlci05MzQ5MjU=",
    "lastName": "Shannon",
    "legacyId": 934925,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I absolutely ADORE Kate. She is one of the sweetest professors ever and she genuinely cares. There are a lot of online lectures you have to watch, but she makes them so fun. ",
        "course": "ART2555"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Kate is actually one of the best professors at the Ohio State University at Mansfield. She's to the point, breaks things down barney style which makes things very easy. You have to be a real piece of work to get anything below an A in her class, she makes it fun and extremely interesting when it comes to photography.",
        "course": "ART2555"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kate is a super TA in the photo dept. Always helpful, even after the quarter is over. She hands out easy to follow instructions (a simple side and a more detailed side), makes learning fun, and also stretches your abilities! Go ahead and take the course... you know you want to!",
        "course": "ART400"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Katie shannon is the best photography TA.  If you have the chance take her! She is extremely laid back and the perfect teacher.  She knows how to give you enough freedom to do what you want, but if you need guide lines she has those too.  She clearly states what she wants and makes photography fun. Take her! you will not be dissapointed",
        "course": "ART400"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "made class extremely interesting, always helpful and willing to answer questions, great input/feedback on projects",
        "course": "ART400"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ART300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.4,
    "department": "Art",
    "firstName": "Karen",
    "id": "VGVhY2hlci0yNjIzODkx",
    "lastName": "Tharp",
    "legacyId": 2623891,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Karen is highly knowledgeable and one of the best teachers for intro. She knows how to teach the subject and has very high expectations. Expect to be in the studio 10+ hours outside of class. She is strict, but cares a lot about her students. Gives great feedback and is patient as long as you are trying your best.",
        "course": "ART3002"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Overall a terrible experience ",
        "course": "3014"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "She is very knowledgeable about ceramics. Her demo videos are very helpful. But other than that, she is not a good teacher. She is poor at explaining her expectations and tries to control every part of your project. She has given the worst and most useless feedback in any art class, let alone any class I have had.",
        "course": "ART3002"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Egomaniac-- absolutely terrible teacher take any other teacher in ceramics department . Temper unprofessional.  If ",
        "course": "3014"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "Karen Tharp Leaves no room for personal creativity she micromanages everything you do in the class and expects you to be there 24 seven too much work to controlling terrible  teacher",
        "course": "ART3002"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Karen Tharp is absolutely fantastic you will  learn ceramics ",
        "course": "ART3002"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Superb instructions. A ceramic master. What a privilege!!!",
        "course": "ART3002"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Please do not take this class",
        "course": "ART2100"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class took so much energy out of me and would definitely not recommend taking it with her if it's a GE unless you have 10 hours to spare every week for a 3 credit hour class. She expects you spend a majority of the time in the studio. Is not accessible during class. Bad at giving instructions and feedback. Too much work for an intro class.",
        "course": "ART3002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3,
    "department": "Art",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yNzg0MDU4",
    "lastName": "Stackhouse",
    "legacyId": 2784058,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "He made us read 2 chapters/week for homework and said the text would be discussed in class, but it barely was. There were also pop quizzes that included like 3-4 500 word minimum responses, way too much for a pop quiz! Even though he was the professor, he made his TA teach probably more than he did, and they were actually much better than him.",
        "course": "ART2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "The only criticism I have of Chris is that it can take a bit to receive feedback from him. Other than that, he had super interesting lectures and is essentially a walking encyclopedia and can give you book recommendations or answer pretty much any question you have. ",
        "course": "HISTART4640"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Art",
    "firstName": "Zulal",
    "id": "VGVhY2hlci0yODY4NjQz",
    "lastName": "Fazlioglu Akin",
    "legacyId": 2868643,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Take her class if you have the option! She wants you to succeed and relates class content to the real world. Was always there to help if needed, and truly cares. ",
        "course": "arteduc3680"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.9,
    "department": "Art",
    "firstName": "Terron",
    "id": "VGVhY2hlci0yMDk0NDAx",
    "lastName": "Banner",
    "legacyId": 2094401,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "He seems to struggle teaching online classes. There is almost zero conversation between him and the class. No lectures. A discussion post once a week with little guidelines. The papers aren't hard, but the lack of clear instructions and he's hard to reach through email sometimes (he will not respond. he might do what you ask but won't respond)",
        "course": "ARTEDU2367"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "STAY AWAY FROM \"Dr.\" BANNER... Horrible class and even worse setup. If you ever try to get ahold of him, he will never get back to you in time. OSU should not let him teach anymore, this was one of the worst classes I have ever taken here, mainly due to the professor. I even did fairly well, despite him being almost completely unavailable. ",
        "course": "ARTEDUC2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very easy grader. Clear rubrics with steps to follow for every assignment. We had a discussion every week that was 300-500 words and we had to post 5 replies to other students' discussions that were about 100 words. We had three essays to write throughout the semester, varying from 3 to 5 pages (at least). We had a 97% average for the final paper.",
        "course": "ARTEDUC2367"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you dont like this topic, many homework will be just waste of your time.",
        "course": "ARTED2367"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He's literally one of the worst professor I've met in OSU, if you want to save your GPA, don't even think about take his online class. I got point deducted for no reason, but I have nowhere to argue because he is the one who has the power to assign a grade. I submitted my work before the due date and got point deducted.",
        "course": "ARTEWDU236703"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dont ever take his online class if you value your time. I have a friend who also take this course with a different professor, and we check our work together, we found out that my work is literally at least as twice as much of his work. There are so many things to read, watch, listen...... which most of them are meaningless. I dont know why other",
        "course": "ARTEDU236703"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Terron is the best. He's very laid back and his lectures are interesting. We would often watch TV in class, and we would often get out early. There were only three papers in the whole class, which is not a lot for a writing class. He also always let you resubmit your paper to be regraded after his initial feedback. Super easy, interesting class.",
        "course": "ARTEDUC2367"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 1,
        "comment": "This was by far the easiest class I have taken so far at OSU. I did not learn much of anything, but class let out early every day and the essays were graded very leniently.",
        "course": "ARTEDU2367"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was the best class I have taken at OSU and it's because of him. His lectures were fascinating and the shows we watched were commonly well-loved shows (like The Office).  He is super encouraging and lets you re-write papers for full credit as long as you tried on the first submission. He assigns a lot of readings but I didn't do them and was ok",
        "course": "ARTEDU2367"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Terron is an absolute bro. He is understanding if you need to turn in a paper late. He also is not to harsh of a grader and lets you redo your essays for full credit. He is the man.",
        "course": "ARTED2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 2.6,
    "department": "Art",
    "firstName": "Alison",
    "id": "VGVhY2hlci05OTMyODI=",
    "lastName": "Crocetta",
    "legacyId": 993282,
    "numRatings": 35,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Course work on the website needs to be rearranged and simplified. Questions regarding the course are not engaging at all. There is lots of information to study but not much time to actually develop the concepts and understanding more. Teamwork is not the best for online courses. ",
        "course": "ART2000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Alison Crocetta is one of the most unwelcoming professors I have ever had. Although I took this class just because I was passionate about the subject, I left the class completely deflated of my love for contemporary art due to her bland, pretentious teaching and bored, closed-off attitude. I got an A, but at what cost? Needs major improvement. ",
        "course": "ART2000"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Not a hard class if you pay attention. Two big projects: interview a contemporary artist and a 6-minute presentation. The way the class is set up could be better (ex., being assigned a ? to answer in a group and not even being able to share the answer because time was allotted for only one question). But Alison is not a bad professor by any means",
        "course": "ART2000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Alison was extremely serious about the work and wanted everything done in a very specific way even the art projects. She also did not enter a single grade until the semester was over. ",
        "course": "ART2100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a fun professor for 2100 and didn't expect anyone to be good at drawing. As long as you put effort into the work, you will do fine. Expect a lot of work during in person labs. The out of class work isn't bad at all. Very very much a stickler for attendance, more than I've ever seen. Other than that, very enjoyable class.",
        "course": "ART2100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "awful and boring but pretty easy to bs through",
        "course": "ART2000"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Never again it was a terrible experience. Every assignment is only a couple points. She didn't teach anything of value. If it wasn't a major course you dropped it. She offended a lot of her students and yelled for no reason. Difficulty is a 4 is because busy work made up your grade, but it was a constant stream. Tolerating her is a 5. No textbook.",
        "course": "ART2000"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 2,
        "comment": "This class is an easy A if you're trying to fill a requirement for your art minor/major but the zoom classes are pretty unbearable. She's rude to students and has called out multiple people for &quot;moving around&quot; or being &quot;too distracting&quot; during zoom calls. Not a fun class. Don't recommend taking it if you don't absolutely need to.",
        "course": "ART2000"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "She definitely puts in the work for the discussions, so she expects you to too. It's a lot of reading and videos, but the projects and discussions themselves are well explained and easy.",
        "course": "ART2000"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 2,
        "comment": "Had her for Contemporary Art, class was discussion based but structured in a way that prevented disagreement. Tried to reach out multiple times to go to virtual office hours (during COVID) but never showed up. When discussing politics (which come up in the class more than they should) certain views are explicitly endorsed and others are vilified.",
        "course": "ART2000"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "She gave mountains of work outside of class, at one point I stopped looking at it and it did not affect my grade. As long as you turn your work in and attend the weekly meeting you should pass this class. She seems like a nice person but I just don't care for contemporary art.",
        "course": "ART2000"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "Alison does not seem to consider the challenges students face outside of her class. She laid some of the projects on thick and doubled us up on assignments (one group project), most students are only in it for the GE but she acts like we're all aspiring artists. She hasn't responded to any of my emails and she calls out students during lecture.",
        "course": "ART2000"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Alison is quirky. She is very talkative and often struggles to get to the point when we aren't drawing, as a result she often jumps from random topic to random topic while the students are forced to listen to her. It gets annoying but when we are drawing, she gets more focused and actually provides valuable feedback and advice. A mixed bag IMO.",
        "course": "ART2100"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Alison is usually very happy as long as you make an effort with your drawings. Lots of drawing required for homework, some materials annoying to lug around. She definitely allows for a lot of exploration regarding subject matter. Participation in critique is important, she's happy even if your comment is truly useless/stupid. Willing to help. Busy.",
        "course": "ART2100"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "Absolutely one of the craziest and weirdest professors I've had.  No very helpful when it comes to projects. Also allot of homework. Although I got an A it was a very tough course.",
        "course": "ART2000"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "She demanded way more attention than the rest of my professors combined. She has no office hours and if you decide to email her with a question, don't be surprise if you don't get a reply back. Class average for exam is over an 80, but taking notes for her class and studying for her exam were difficult for me. One of the worst professors I had.",
        "course": "ART2000"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy and interesting class, Alison made me have a much higher respect for contemporary art. She was very helpful and I loved that she had guest artists come in and talk. Material was intriguing, and she fashioned the exams to be easy to pass. The only way you could fail is by not attending class, but Alison made me want to be in class everyday.",
        "course": "ART2000"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 1,
        "comment": "At first glance you might think Alison is going to be really cool.  If you have an ill-developed sense of personal art, then she may be just what you need--to push you to make bad, esoteric art, just like her.  She's fairly mean, unless you submit before her, and a bad listener.  Avoid taking her classes, unless you're into being told how to art.",
        "course": "ART200"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 1,
        "comment": "Alison has a serious issue with boundaries with students. She conducts these relationships in a completely unprofessional way. She demands respect yet does not know how to demonstrate respect for another human being. The Ohio State University would be a better place without her. Heed the warning, run far away from this woman.",
        "course": "ART200"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class was super easy. No homework, just had to do the readings which were posted online (no textbook). Only have 2 exams and attendence that make up your grade",
        "course": "ART200"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 2,
        "comment": "I've never had a professor so self-absorbed or self-important. Treats students like gum on the bottom of her shoe. Refuses to answer student questions, yet insists students answer hers to her exact specifications. If this class was not mandatory, I would have dropped it and waited to take it with someone else.",
        "course": "ART200"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was an excellent teacher! She had a real passion for what she was teaching.  I truly enjoyed her class.  As long as you show up and read the articles, the class is easy to pass.",
        "course": "ART200"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Alison is amazing. She makes you think outside of the box. The class is somewhat challenging but in a good way. As long as you show up to class and complete your work on time, you'll be fine. I would highly suggest Alison to anyone, she is one of the best teachers I have ever had. I'm so glad I was able to have her!",
        "course": "ART208"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "easy and interesting class. she was very straightforward.",
        "course": "ART200"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "I think that Alicen is very smart, explains her ideas clearly and is very straight forwards with what she expects from her students.  I've seen some of her work and she definitely is not a hack however, the impression I get from her outside of class is that she is incredibly insecure and I think this is evident in what usually comes off as conceit.",
        "course": "ART200"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy easy.  Come to class for attendance grade, pay attention, do or at least skim the readings (on carmen...no books req.), study her exam reviews and get an A.  Not a lot of out-of-class time spent.  Recommended.",
        "course": "ART200"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 2,
        "comment": "If you take Art200 with her it will be way easier than it used to be. On the first day of class she said she used to assign writing and lots of reading but has cut it down to almost doing no work now, just show up for class and take an easy midterm and easy final. She's pretty cool.",
        "course": "ART200"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 5,
        "comment": "it's unfortunate that most of the undergraduate student's don't appreciate what Alison has to offer. She really influences the work of the graduate students and she drives you to work harder. i am sorry that there are two different sides of her and very few people get to see how great she can really be.",
        "course": "ART895"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 1,
        "comment": "Not only does she take all of the interest out of what should be interesting, and she talks so fast that you can hardly understand what she says! So bring your computer to type. It was torture to listen to her condescending, narcissistic, self-centered presentations with her haughty idea of what qualifies as art.",
        "course": "ART200"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 3,
        "comment": "Clearly passionate about what she does, but this passion does not translate to her teaching methods very well.  As others have said, very condescending - if you are not an art star, you won't do well with her.  I once created a project she thought was offensive and anti-feminist and she yelled at me so long I finally cried.",
        "course": "FND101"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was ridiculous. She lectures in an annoyingly condescending manner. It makes a class with interesting material tedious, you get sick of listening very quickly!",
        "course": "ART200"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 2,
        "comment": "Alison Crocetta talks about contemporary art with such pompous self importance, it's enough to make anyone sick. She speaks to her class as though they were a group of 3rd graders. She is simultaneously condescending and banal. Sadly enough, some poor souls actually seem to buy into her version of what art must be. Stay far away from her, very far.",
        "course": "ART200"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 4,
        "comment": "Alison is quite eccentric. She is bold and passionate. I found her amusing but I think many students think she is offensive. Attend class on time with an open mind and do the readings and you'll be fine. Oh, and whatever you do... don't plagiarize!",
        "course": "ART100"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 5,
        "comment": "I completely agree with the last comments",
        "course": "ART200"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 3,
        "comment": "She completely turned me off from becoming an art major.  I cannot stand to hear the sound of her voice.  She talks down to her class full of students and is completely self involved in a pedantic condescending and self-important way.",
        "course": "ART200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.1,
    "department": "Art",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci04ODIxOTI=",
    "lastName": "Harvey",
    "legacyId": 882192,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hilarious, kind of crazy a times but means well",
        "course": "ART3502"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "She can be tough, but only if you're a ceramics major. And that's only because she wants you to succeed. She's scatter-brained, but absolutely brilliant and loves what she does.",
        "course": "ART3502"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Rebecca is great, wacky and fun. An excellent teacher. She would often disappear during class or say things to some people but not others. It can be difficult to keep up with her.",
        "course": "ART442"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "She doesn't really want to be teaching, she's in it for the paycheck. She may be funny and cute but she's got no heart in her teaching.",
        "course": "ART340"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Rebecca is very out there in thinking.  She will assign bogus homework assignments which i loved.  I loved rebecca is very cute and funny and always in a good mood.  I always felt like when she touched my art work though she made it look a lot worse.",
        "course": "ART340"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Rebecca is God's gift to the ceramic/art world. She's so cute and makes every thing gooder in the goodest way possible. She's good. and smart.",
        "course": "ART442"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "really really nice and really interested in helping students out. didn't grade to tough, as long as you got your work in",
        "course": "ART373"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.7,
    "department": "Art",
    "firstName": "George",
    "id": "VGVhY2hlci0yMjc2NTIy",
    "lastName": "Rush",
    "legacyId": 2276522,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Took him for Painting 1 and he is a good teacher, balances normal fundamentals with projects that challenge the  student from multiple angles. You won't like every painting you make in his class but you will learn how to paint, and to paint well. Accommodating/encourages growth of everyone's painting styles. Understanding.",
        "course": "3024"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "As an art student, I like George's critical feedback on my work. However, Painting I is very prescriptive as you are learning basics, so you won't get much creative freedom. You do TONS of still lifes. If you're looking for an easy GE glass this isn't it, as it's rigorous and meant to improve your basic skills rather than foster your creativity.",
        "course": "ART2524"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "George can be extremely critical, which can be good for an art prof, but the feedback he provides is confusing at best. He teaches figure drawing like a media exploration class and actively avoids teaching anatomy or, you know, figure drawing. That being said, if you show up every day, and follow his specific instructions, youll get an A.",
        "course": "ART2504"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 3.5,
    "department": "Art",
    "firstName": "Rob",
    "id": "VGVhY2hlci0xMTAyNzQ5",
    "lastName": "Thompson",
    "legacyId": 1102749,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the kindest and relaxed art professor's I've had. Gave very helpful assignments that I keep in a binder to reference months after the class ended.",
        "course": "ART3014"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "love this class",
        "course": "ART3024"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 1,
        "comment": "Nice guy, useless as a teacher. Gave no actual instruction in an INTRO DRAWING CLASS. He would give specific feedback, but no actual general instruction. Put in no grades the entire semester, just gave me 100 the day of the grade deadline.",
        "course": "2100E"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "pretty cool.",
        "course": "ART375"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "this guy is so useless. he's a nice enough guy, but he sucks at teaching art and getting people interested in it. the still lifes he sets up are so, so, SO boring. i dreaded coming to his class.",
        "course": "ART205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.3,
    "department": "Art",
    "firstName": "Britny",
    "id": "VGVhY2hlci0yMjI3MDM2",
    "lastName": "Wainwright",
    "legacyId": 2227036,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Britny's beginning drawing course was definitely a fun General Education course to take. But the idea of beginning in the course beginning drawing was lost half way through the semester. Britny tended to signal out students near the back half of the semester and tended to give strong advice to those looking to continue in art classes.",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "This beginning class was more of a hands on try and fail situation. She does expect good work and for you to become better as the class progresses. I really enjoyed her class and found it fun and relaxing. Just make sure that you attend all classes and talk a lot when you all critique each other's projects. Try to say at least 3 things per person.",
        "course": "ART2502"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took her ceramics class, she understood that it was a GE course and did not expect exceptional ceramic pieces. The class required a lot of outside time commitments to get the work done, i found her work load a little excessive. As long as you follow the criteria and show you tried hard your fine.",
        "course": "ART2502"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2,
    "department": "Art",
    "firstName": "Alice",
    "id": "VGVhY2hlci0yNzUxMDI4",
    "lastName": "Cheng",
    "legacyId": 2751028,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Fluff",
        "course": "ARTEDUC2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Art",
    "firstName": "William",
    "id": "VGVhY2hlci0yMjc2ODE1",
    "lastName": "Arnold",
    "legacyId": 2276815,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Arnold gives clear feedback and respects his students. He does everything he can to make the projects clear and easy, and he shares a wide range of work from many artists and photographers. Truly one of my favorite classes!",
        "course": "ART3555"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "First off, you will need a digital camera! William does a great job at using art to enrich the lives of his students. He often brings in visiting artists to talk about photography, which provided a lot of inspiration. He did a great job of encouraging students to be creative and allowing them to create freely, with few restricting requirements.",
        "course": "ART3555"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor.",
        "course": "ART2555"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good professor. He is kind. He gives the clearly feedbacks for each project. He talks to students friendly and shows his own works to us. He is sooooo goood as a photography teacher!",
        "course": "ART2555"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "William was super amazing. He really cares about his students, and loves talking to them. He tends to see more of the art side of the class which is amazing. He hates how we have to do an essay, etc. but he makes them easy for his students. Overall I really enjoyed his class. He got me into living photography.",
        "course": "ART2555"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Overall genuinely nice guy. Really focused on the art side of the class and not what OSU wants to pass off art, I've really enjoyed this class and actually really learned from his guidence.",
        "course": "ART2555"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 3,
    "department": "Art",
    "firstName": "Mitch",
    "id": "VGVhY2hlci0yNTIyNTE0",
    "lastName": "Vicieux",
    "legacyId": 2522514,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wish I would have had experience in photoshop before taking this class even though it wasnt required for the class. I felt that the grading of projects was unfair sometimes and they did not take into account that some people have not had previous experience in this class. I do not recommend taking this class with Mitch if you have no experience",
        "course": "ART2500"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Mitch is passionate about art and teaching. They are available via email, and always respond in a timely manner despite being very busy outside of class. Mitch makes you work for your grade- they arent a pushover and expect to see real growth in your art throughout the semester. Mitch is also kind. I respect Mitch and enjoy their class.",
        "course": "ART2500"
      }
    ],
    "SEI": []
  }
]