[
  {
    "avgDifficulty": 3.7,
    "avgRating": 1.7,
    "department": "Arts amp Sciences",
    "firstName": "Joe",
    "id": "VGVhY2hlci0yNDEyMDQ3",
    "lastName": "Dixon",
    "legacyId": 2412047,
    "numRatings": 25,
    "summary_comment": "Professor Dixon is generally regarded as a supportive and responsive instructor who offers multiple opportunities for extra credit. However, his lectures are often criticized for being lengthy and sometimes boring, which can detract from their effectiveness. Students also find his exams challenging but appreciate the additional chances to improve their grades.",
    "summary_comment_short": "Professor Dixon is generally seen as a supportive instructor who offers multiple extra credit opportunities, although his lectures are often described as lengthy and sometimes unengaging. Students appreciate his responsiveness to emails and his efforts to help students succeed, despite finding his exams challenging.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I feel like some of the other reviews are kind of harsh. Yes, the lectures were pretty drawn out when they could have been more concise, and some of the assignments were a bit difficult, however, several extra credit opportunities were offered. Joe was also very accommodating if you reached out to him with an issue and cares about students success.",
        "course": "SOC3302"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Joe was a nice guy and responded to emails pretty quickly. However, lectures were very drawn out and boring. Quizzes asked oddly specific questions but there was a decent amount of extra credit to boost your grade.",
        "course": "SOCIOL3302"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Joe Dixon is a really nice guy and was always very quick to respond to emails. That being said, his lectures (which were on topics that should have been interesting) were a drag. His exams were also pretty tough but he offers several extra credit opportunities to make up for it.  ",
        "course": "SOCIOL3302"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "the other reviews are harsh, Dr. Dixon is a great professor! Make sure you read the syllabus, there is an opportunity for extra credit. There are are only 2 assignments and 2 exams and also lots of opportunity for extra credit.",
        "course": "SOC4506"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hands down one of the worst professors I have ever had at this school. He looks for oddly specific answers for exams and papers and if your answers don't align exactly with what he has in mind you won't receive points. He doesn't seem to care about the fact that the majority of the class is doing poorly. Also has very few grades in the grade book.",
        "course": "SOC4506"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Lazy opinion based rants with little objective fact and no dialogue.\n\nRants include: \"Why we should allow child s** dolls for pedophiles,\" \"Why cars should be abolished,\" and \"Why Apple is not innovative.\"\n\nIf you want to learn anthropology, buy a textbook and form your own based opinion. I love anthropology, but this class was so disappointing.",
        "course": "SOC3302"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "Guy was a complete tool. Lectures felt like they went on for an eternity, full of cool little zingers that Im sure Joe thinks are mad clever, guaranteed to make your eyes roll so fast into your head that you'll fall out of your chair. Basically stopped showing up to class, still did fine but don't recommend if you can avoid him.",
        "course": "SOC3302"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "There were only 3 assignments in the course. Took the entire semester to grade 1out of the 3 assignments.  Second grade was automatically generated from one of the 2 exams. This  class was extremely  stressful.",
        "course": "SOC4506"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have had at this school yet and for a GENERAL EDUCATION CLASS. He is grossly ignorant and operates on his own schedule. Had covid at the beginning of the semester and had to email him 4 times before I received the content I missed. Words his questions unfairly that answers are opinion based but he does not agree with anyone.",
        "course": "SOC3302"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "AVOID AT ALL COSTS!!! This class had unneeded stress. He is pretentious yet ill-informed. I think they thought he was smart based on his accent but he scammed them. He made up rubrics after the fact and left little feedback that is unhelpful and seems to not make sense. He definitely skimmed them. Highest grades on the two main papers were low A's",
        "course": "SOC3302"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "Joe Dixon is an incompetent wanking mess. If his unbelievable pretentiousness doesn't turn you off then the outrageous grading system and constant yawning probably will. Will not reply to emails from students despite the lack of a TA, has only remedial knowledge of the subject being taught. Overall a huge waste of time.",
        "course": "SOC3302"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Grossly incompetent, what more is there to say? Takes the class way too seriously, grades off an imaginary rubric of what he likes or doesn't. Pretentious, and I had difficulty writing the way he liked even though I have been told I have been the best writer in classes before and took a writing class at the same time where I had a high A.",
        "course": "SOC3302"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "He seems to be nice but he is a terrible professor. The lectures are interesting, but unhelpful. He does not treat it like the throwaway, participation grade class he should treat it as. The rubrics are vague and has lengthy grading making feedback unhelpful. Grades are harsh and illogical. He doesn't know good writing. He should change or be fired",
        "course": "SOC3302"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "Vague grading rubric, boring and un-interactive lectures, lectures do not cover any material that is on assignments. In my case, feedback was not given until the second last week of school and did not allow the students, including I, to correct course and work off of the given feedback. This has left most students feeling helpless and withbadgrades",
        "course": "SOCIOL3302"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "My main problem with this professor was that he waited until the second to last week before exams before grading one of our reading summaries, of which we had every other week since week 5, and proceed to give feedback that would have be helpful if we had another one to do. The grades on these assignments were also very harsh",
        "course": "SOCIOL3302"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "The material was interesting but it would have been better if Professor Dixon were better versed in it. He often would present information to the class that was inaccurate, sometimes multiple times a class. He also added two discussion assignments a week when classes switched to at a distance at the start of covid, which was overwhelming.",
        "course": "SOC4506"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Dixon himself is a fine professor, has some charming jokes in class and is nice. My biggest complaint is that he is a fairly difficult grader and his rubrics are very vague. He will call you out in class if you're being rude and talking, but lectures do not really have much to do with your work outside of class and are interesting.",
        "course": "SOC3302"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "Took one of his classes thinking it would be about something I enjoy, turned out to be completely different. Would never take him again.",
        "course": "SOC4506"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "I'm in this class right now. Lots of complaints: The worst lecturer I've ever had. Doesn't seem like he knows the content he's trying to teach, just stands behind the computer screen and mumbles off his notes, looking down the entire time. Absolutely no class discussions. Exam was nothing he said it would be and much of it he never discussed.",
        "course": "SOC4506"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "I am still in this class, but this class is SO dry. He does not know what he is talking about half of the time.",
        "course": "SOC4506"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS IF YOU CAN. There is essentially no grading criteria, and even if you follow assignment guidelines perfectly, he will find ways to lower your grade. One of the best gpa droppers out there.",
        "course": "SOC3302"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "I liked him a lot. While attendance is mandatory (miss more than 4 classes and you get docked a letter grade), he kept the classes very interesting and insightful. He is a very nice guy to talk to and gives good feedback on your papers. Take into account his feedback on your Op-Ed, incorporate it into your discussion paper, and you will be good.",
        "course": "SOC3302"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 3,
        "comment": "Awful professor. Lectures the entire semester with few class engagements, attendance is mandatory. Does not explain the specifics about the class assignments and then grades them very difficulty. DO NOT TAKE IF YOU HAVE A CHOICE. 2 papers thats it - 1 discussion paper (2,000) and 1 Op-Ed (600). Marked me down to a C for only having one reference.",
        "course": "SOC3302"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Does not care about students whatsoever. If you care about your grade and future do not take this professor. WORST PROFESSOR EVER!",
        "course": "SOC3315"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 3,
        "comment": "As a person, Hes easy going very easy to talk to. However when it comes to grading he follows no guidelines what so ever. Your grade depends on his mood for the day. I finished with a B, and I wouldnt not recommend taking again.",
        "course": "SOC3315"
      }
    ],
    "SEI": [
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "19421",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "37",
        "Rating": "4.38"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "4506",
        "Class Name": "Drugs and Society",
        "Class Number": "33932",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.24"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "21322",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.32"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "4506",
        "Class Name": "Drugs and Society",
        "Class Number": "29789",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "48",
        "Rating": "3.71"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "17445",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "31",
        "Rating": "3.61"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "5525",
        "Class Name": "Global Criminology",
        "Class Number": "17587",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.14"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "15450",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.05"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "4506",
        "Class Name": "Drugs and Society",
        "Class Number": "23921",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "2.67"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "21249",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "3.92"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "4506",
        "Class Name": "Drugs and Society",
        "Class Number": "27472",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.37"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "21583",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "SOCIOL",
        "Catalog": "3302",
        "Class Name": "Technology and Global Society",
        "Class Number": "23821",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Sociology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "3.96"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3,
    "department": "Arts amp Sciences",
    "firstName": "Jane",
    "id": "VGVhY2hlci0yNDc1NjI2",
    "lastName": "Hammons",
    "legacyId": 2475626,
    "numRatings": 2,
    "summary_comment": "Professor Hammons is known for her rigorous approach to teaching, with frequent quizzes and assignments that are both time-consuming and strictly graded. While some students find her classes challenging and not particularly useful, others appreciate her supportive and responsive nature, noting that she makes it easy to perform well and would highly recommend her class.",
    "summary_comment_short": "Professor Hammons is known for her rigorous approach, with frequent quizzes and assignments that are both time-consuming and strictly graded. Conversely, another instance describes her as a supportive and easy-grading professor who responds promptly to emails and makes it easy for students to perform well in her class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "I do not think her class is useful and easy. There are plenty of quizs and assignments each week, and they are both time-consuming works. She would strictly grade your assignment. This course is not useful AT ALL!",
        "course": "ARTSSCI2121"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had Jane for half semester online information search, evaluation and use. She was so nice! She always emailed me back immediately and was very helpful. She grades things v easy bc she actually wants you to do well in the class. Very easy to do well in her class. Great professor. Would def recommend this class",
        "course": "ARTSSCI2120"
      }
    ],
    "SEI": [
      {
        "Subject": "ARTSSCI",
        "Catalog": "2121",
        "Class Name": "Academic Online Research",
        "Class Number": "26188",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.62"
      },
      {
        "Subject": "ARTSSCI",
        "Catalog": "2120",
        "Class Name": "Information Search, Evaluation and Use",
        "Class Number": "16784",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.7"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Arts amp Sciences",
    "firstName": "Hanna",
    "id": "VGVhY2hlci0yNTczNDMy",
    "lastName": "Primeau",
    "legacyId": 2573432,
    "numRatings": 2,
    "summary_comment": "Professor Primeau offers a challenging yet manageable course, providing a straightforward path to an easy A for students who complete all the work. She is responsive to student inquiries. However, the course demands significant effort, particularly in an online format, with extensive homework and quizzes that some find disproportionate to its credit value.",
    "summary_comment_short": "Professor Primeau offers a challenging yet manageable course with a lot of work, but students can achieve an easy A by completing all tasks. She is responsive to student inquiries and provides support. However, some students find the workload excessive for a two-credit online class, with frequent quizzes and assignments that do not involve writing or discussions.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class definitely had a lot of work for an elective class. With that being said, if you do all of the work it is a very easy A. I also liked the professor and she replied very quickly to questions.",
        "course": "ARTSSCI2120"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "I took this Online class, and I hate it! It has so much homework and quizzes, and they're not regular homework where you have to write something or do a discussion. It's only 2 credits and it's online, no need for all those complicated assignments. The final is also cumulative, but it's open book since it's online. The class should be way easier.",
        "course": "ARTSSCI2120"
      }
    ],
    "SEI": []
  }
]