[
  {
    "avgDifficulty": 5,
    "avgRating": 1.5,
    "department": "Arts & Sciences",
    "firstName": "Maria",
    "lastName": "Brunette",
    "legacyId": 2962365,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "I thought her lectures were fairly interesting and she definitely offered unique perspectives due to her background, but her class required a ridiculous amount of work. She also had unrealistic expectations, unclear guidelines, and graded very harshly."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "I honestly believe that she is the worst professor that I have ever had and will ever have at any level of education. Her class follows no guidelines what so ever so if you have chosen to take this class, you better buckle up. She does not give any feedback on any assignments. Her grading is subjective and makes no sense. Good luck if you have her."
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Arts & Sciences",
    "firstName": "Amie",
    "lastName": "Hufton",
    "legacyId": 2896373,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Dr. Hufton was always excited to teach us, so that made me excited to learn from her! You'll usually work with classmates during lecture and the in-class assignments are designed to make one think in a way that they usually haven't before. My brain is bigger because of her class."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Professor Hufton was great! 2410 was an easy online class, the work was very organized and there was a decent amount of writing it was over easy topics. There is a good amount of work, but is all easy and she gives 3 day extensions on all assignments."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "Dr. Hufton truly cares about her students and I really enjoyed the opportunity to meet with her for feedback during office hours. The class consisted of discussion posts and small projects throughout the semester. I would say expect spending 2.5 hours on the class per week. Highly recommend this professor!"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Dr. Hufton is the best professor I've had at OSU! The reflection essay assignments will seem intimidating at first, but you get used to writing them, they genuinely facilitate learning the material, and are not graded very tough. She really values student feedback and will dedicate time to what you really need and want to learn."
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "Great prof! No exams. Class is mandatory to receive points. One \"press release\" assignment and one research paper (5-6 pages), and discussion boards. Have to watch a weekly lecture before coming to class (ours was just on Mondays) and then we have an in-class assignment during class as well that is easy but expands knowledge on the topic. Def take!"
      }
    ]
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1.5,
    "department": "Arts & Sciences",
    "firstName": "Maria",
    "id": "VGVhY2hlci0yOTYyMzY1",
    "lastName": "Brunette",
    "legacyId": 2962365,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "I thought her lectures were fairly interesting and she definitely offered unique perspectives due to her background, but her class required a ridiculous amount of work. She also had unrealistic expectations, unclear guidelines, and graded very harshly. ",
        "course": "HTHRHSC4590"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "I honestly believe that she is the worst professor that I have ever had and will ever have at any level of education. Her class follows no guidelines what so ever so if you have chosen to take this class, you better buckle up. She does not give any feedback on any assignments. Her grading is subjective and makes no sense. Good luck if you have her.",
        "course": "HTHRHSC4590"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Arts & Sciences",
    "firstName": "Amie",
    "id": "VGVhY2hlci0yODk2Mzcz",
    "lastName": "Hufton",
    "legacyId": 2896373,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hufton was always excited to teach us, so that made me excited to learn from her! You'll usually work with classmates during lecture and the in-class assignments are designed to make one think in a way that they usually haven't before. My brain is bigger because of her class. ",
        "course": "PUBHEPI-3411"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Hufton was great! 2410 was an easy online class, the work was very organized and there was a decent amount of writing it was over easy topics. There is a good amount of work, but is all easy and she gives 3 day extensions on all assignments. ",
        "course": "PUBHEPI-3411"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Hufton truly cares about her students and I really enjoyed the opportunity to meet with her for feedback during office hours. The class consisted of discussion posts and small projects throughout the semester. I would say expect spending 2.5 hours on the class per week. Highly recommend this professor!",
        "course": "PUBHEPI-3411"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hufton is the best professor I've had at OSU! The reflection essay assignments will seem intimidating at first, but you get used to writing them, they genuinely facilitate learning the material, and are not graded very tough. She really values student feedback and will dedicate time to what you really need and want to learn. ",
        "course": "PUBHEPI5412"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great prof! No exams. Class is mandatory to receive points. One \"press release\" assignment and one research paper (5-6 pages), and discussion boards. Have to watch a weekly lecture before coming to class (ours was just on Mondays) and then we have an in-class assignment during class as well that is easy but expands knowledge on the topic. Def take!",
        "course": "PUBHEPI-3411"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 1,
    "department": "Arts & Sciences",
    "firstName": "Danny",
    "id": "VGVhY2hlci0yNjgwNjQw",
    "lastName": "Dotson",
    "legacyId": 2680640,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible class.  If you have the option, don't take it.  ",
        "course": "ARTSSCI3142"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "if you dont have to take this class for credit, DO NOT TAKE IT. unbearably tedious work he is no help and his instructions are terrible. his grading is very unfair especially with how he sets up the course. i could go on for days about him and this course overall but i will just end it with AVOID AT ALL COSTS OR ANY OTHER CLASS HE MIGHT TEACH.  ",
        "course": "ARTSSCI3142"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Simply way too much work for a 2-credit hour course. I can't even believe it's allowed to be listed as 2 credit hours when I'm taking 5-credit hours courses that are literally not even half the work that this class demands. While the content is rather useful to learn, I don't believe this class is worth the burden. There are much better options.",
        "course": "ARTSSCI3142"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Let me be straight forward here, Danny is a nice guy, probably great guy outside of the classroom. My bottom line is that this guy is giving a work load larger than my other four classes combined. When you sit down to work, be ready to spend more than 6 hours doing it... He had no rating so I had to do it, I do not recommend this class in any way.",
        "course": "ARTSSCI3142"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.4,
    "department": "Arts & Sciences",
    "firstName": "Marla",
    "id": "VGVhY2hlci0yNTIxNDM3",
    "lastName": "Berkowitz",
    "legacyId": 2521437,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolute worst professor I have had in all 4 years I've been here. I had her for 3350 and 4189S and she was equally terrible for both. Does not communicate expectations for assignments and is a tough grader. ",
        "course": "ASL3350"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "I have genuinely never hated a class so much. I love ASL and was excited for the minor and this class crushed any passion I had for the language. The professor talks in circles and the class is completely disorganized. You have to buy multiple books that are difficult to find and need to have them for graded classwork.",
        "course": "ASL3350"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marla is Governor Mike Dewine's interpreter. She is also the only deaf ASL interpreter in Ohio. She is strict, but if you go to class, pay attention and participate, you'll be just fine. She is nice and cares for her students as long as you are putting in effort. She prepares you very well and tells you exactly what she wants. ",
        "course": "ASL1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marla is the most thoughtful teach and cares about all of her students! Her way of teaching each unit is helpful and you really immerse yourself into Deaf culture! By far the best ASL professor!!",
        "course": "ASL1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marla is an incredible instructor!!! She is deaf which may be intimidating at first, but honestly this only helped! This was my first exposure to ASL and she was so caring and wanted every student to succeed! She also makes sure that everyone understands what is expected of them on exams and prepares you very well!!",
        "course": "ASL1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "Arts & Sciences",
    "firstName": "Yonghao",
    "id": "VGVhY2hlci0yOTc4OTM0",
    "lastName": "Wang",
    "legacyId": 2978934,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "He is a tough grader! I learned NOTHING throughout the whole semester. His lecture is BORING and hard to understand. All he did in this class was keep talking without slides. I am taking another philosophy class by Steven Brown this semester. He is way better than YH W. Steven Brown makes me realize that philosophy is not that hard to understand. ",
        "course": "philosophy1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.7,
    "department": "Arts & Sciences",
    "firstName": "Miranda",
    "id": "VGVhY2hlci0yNjkxMjgy",
    "lastName": "Holmes",
    "legacyId": 2691282,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "c u next tuesday ",
        "course": "ART2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took the Painting I course with Miranda and loved it! She is very sweet and charismatic. She explains the projects well and encourages all students to try their best and take risks. Another thing I liked is she takes the time to walk around the room and talk to each person one-on-one. I would definitely recommend this class to anyone interested!",
        "course": "ART2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved my time with Art 2100 and I think Miranda was a huge part of that. Incredibly sweet, very supportive, great feedback, well-structured classes, and always made class exciting and interesting. I would absolutely take another class by her and find her to be a wonderful professor. Totally recommend any art students to look into her classes!",
        "course": "ART2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.5,
    "department": "Arts & Sciences",
    "firstName": "Diane",
    "id": "VGVhY2hlci0yNDQwNTI5",
    "lastName": "Brogan-Habash",
    "legacyId": 2440529,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The lectures could drag a bit, especially if you already read the book for that week. She is the most caring professor I have ever had, you can really tell she wants us to learn. Her tests were very fair and easy with studying her study guide. Very positive experience as a whole.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very caring prof but I did not like the course. Not a ton of structure and I did not think this class should have daily attendance but it did. I liked how we always worked in groups. She is very passionate over what she teaches which good but this class feels centered for med majors rather than just a GE. The assignments are long but there's only 5",
        "course": "HTHRHSC2530"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Professor Habash! While some of her lectures can get a little repetitive if you're also reading the text, she makes class interesting nonetheless. She is also such a genuinely caring person, which makes her super approachable about class content and life in general. I wish I could take her again.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor! Really enjoyed her class and thought that it was very interesting. She was easy to reach outside of classes and was willing to stay after anytime. There is a lot of reading, but lectures tend to cover the majority of the material so its not a big deal. There arent too many assignments, and they are fairly simple!",
        "course": "HTHRHSC2530"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Habash is a super nice person, but the class itself can drag on. Each week you are given chapters to read and then she lectures about them. The lectures themselves are really boring as it feels like she is reciting what the book discussed. Despite this the exams are pretty easy and the few assignments you have are not awful.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was just a complete disaster. I never knew what was going on and it was so much stress in your final semester of college. Unfortunately, everyone has to take this for 3 fantastic hours on Friday mornings but beware. Quizzes are based on tiny little details in research papers and the final project is just tons of work in a short time.",
        "course": "HRS4300"
      }
    ],
    "SEI": []
  }
]