[
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Athletic Training",
    "firstName": "Josh",
    "lastName": "Tasney",
    "legacyId": 2961589,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Absolute dog"
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Josh is a great Golf instructor, he was fun and really helped improve my golf swing. Attendance is mandatory but you can miss a couple of classes without penalty."
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Athletic Training",
    "firstName": "Josh",
    "id": "VGVhY2hlci0yOTYxNTg5",
    "lastName": "Tasney",
    "legacyId": 2961589,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolute dog",
        "course": "KNSFHP1157"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Josh is a great Golf instructor, he was fun and really helped improve my golf swing. Attendance is mandatory but you can miss a couple of classes without penalty. ",
        "course": "KNSFHP1157"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.4,
    "department": "Athletic Training",
    "firstName": "Tamara",
    "id": "VGVhY2hlci0yNTIxMDg0",
    "lastName": "Rankin",
    "legacyId": 2521084,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Social Dance 1 was super fun with Tammy! She always brought great energy to class each week and was so excited to teach us the different dances. She was really patient and understood that we were all coming from different levels of experience. Tammy makes learning dance fun, and she also makes sure that everyone gets to dance with several partners.",
        "course": "KNSFHP115202"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "For an online class with a mandatory online textbook, the textbook should NOT be $100. Professor does not make modules/assignments on carmen canvas very clear and seems to heavily rely on the textbook, not really doing any type of teaching. Easy class to pass, but not a class I have learned a thing from...",
        "course": "KNSFHP3312"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super great professor and an easy class. I will definitely take another course with her in the future!",
        "course": "KNSFHP1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "nice teacher",
        "course": "KNSFHP1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "nice teacher, She will give some help your final test, ",
        "course": "KNSFHP1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Rankin is v friendly and really cares for her students. Shes extremely helpful if you ask and wants everyone to succeed in getting First Aid & CPR certified. Rankin knows how to bring light into the classroom considering this is a class that helps prepare students for tragic situations. The book is free and the class is easy if you practice.",
        "course": "KNSFHP1102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Tamara is a great one. I enjoyed the class from the very beginning up to the end, and I'm sad that it's a short class. Textbook is super easy to read and understand, the skill tests aren't hard if you put outside practice in it. Final was easy. She makes it clear that she wants all her students to pass and get certified.",
        "course": "KNSFHP1102"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took First Aid and CPR with Professor Rankin and it was not as easy as I expected. She is a tough grader, but that is necessary for the content. She clearly communicates her expectations and I enjoyed going to her class.",
        "course": "KNSFHP1102"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Such an easy class. Weekly quizzes that aren't proctored and you can get 100 on each quiz. Weekly reading you don't have to do to pass. 2 papers that are super easy. 3 discussion posts. This is all just busy work but each thing is due on Sunday 11:59 of each week. All of it is extremely easy I promise. I'm bad at school and I got an A. Love her!",
        "course": "KNSFHP3312"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "I really liked her. She was very nice and funny so going to class was not hard. She also was a fairly easy grader and helped students get a good grade.",
        "course": "KNSFHP1102"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Tammy makes learning First Aid &amp; CPR interesting so I recommend her if you want to take the class. She provided the textbook for free and is very clear on what she is looking for when doing your skills testing.",
        "course": "KNSFHP1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.6,
    "department": "Athletic Training",
    "firstName": "Jimmy",
    "id": "VGVhY2hlci0xOTc5NjYy",
    "lastName": "Onate",
    "legacyId": 1979662,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "jimmy >>>> all other professors at Ohio State",
        "course": "ATHTRNG2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Onate is one of the best professors. He genuinely cares about his students beyond the classroom. His lectures are very engaging and the materials are pretty easy to understand. Get ready to be put on the spot, but it really does help build our confidence. Just make sure to review the material ahead of time so you aren't clueless in class.",
        "course": "AT2000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing Professor, truly cares for his students",
        "course": "ATHTRNG2000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Top 3 professors I have ever had. Very open, honest, and blunt with his students. Genuinely cares for his students well-being and learning. Kept me motivated, checked up on me often and dug deep to help me find what I want to do in life. Lectures and review sessions are fun. Helpful during office hours. Grading is easy. Will follow you on Twitter!",
        "course": "AT2000"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved this class. He kept it really straightforward with you. This class is what you make it but be prepared to work in groups. we had to choose a group at the beginning of the semester and stuck with all year so choose wisely. Exams are fairly easy if you come to class and remember the the key points to take from each module. Great professor!",
        "course": "AT2000"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "In basic Athletic training Jimmy really cared about his students. Make sure you attend lectures because you will learn what are the most important things to know. His tests are generally easy but there are a few questions that are tough.",
        "course": "ATHTRNG2000"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Jimmy Onate is the man! He makes you work for your grades but he was the professor that helped me my first semester here. He is willing to meet with you no matter what. He is a funny professor that loves his job. Get on his good side, he helps decide who gets into the AT program or not. BUY THE TEXTBOOK! Read it because everything is from there.",
        "course": "2000"
      }
    ],
    "SEI": []
  }
]