[
  {
    "avgDifficulty": 4,
    "avgRating": 3.8,
    "department": "Biochemistry",
    "firstName": "Zhengrong Justin",
    "lastName": "Wu",
    "legacyId": 1231008,
    "numRatings": 44,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Not clear! Contradicts self constantly, recitation is a hot mess and your grade is quite literally the exams that are never graded correctly and you pretty much never know what will be on them… anyways, good luck my friends you are in for a nightmare."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Exams are difficult."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Do not take this professor. Unwilling to answer the question you are asking, very tough grader, and contradicts self constantly. Made an already hard class feel impossible."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Great professor. You'll learn a lot during lectures. Go to lectures and study early. This class goes over a lot of information. I would highly recommend this course to anyone prepping for the MCAT."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Extremely condescending. Would not give students straight forward answers when asking questions and tried his best to constantly make sure everyone knew he was the smartest in the room. EXTREMELY lecture heavy. The best way to study for this course is to record his lectures and re-listen to them before the exam. I got a B+ on the final doing this"
      },
      {
        "index": 5,
        "rating": "4.0",
        "comment": "Dr. Wu is a very sweet man and it is visibly apparent that he is trying his best. That said, when I took him he would go overboard on his explaination lecture slides, fall behind and then rather than just adjust the course accordingly, he would speed up and rush through content to get it all on the exam. That said, exams are FAIRLY straightforward."
      },
      {
        "index": 6,
        "rating": "4.0",
        "comment": "Dr. Wu is a great instructor. His lectures are super clear and easy to follow. However, his exams can be quite challenging sometimes. He truly tests your understanding of the material, as his exams are almost exclusively written responses and drawing structures/mechanisms. Do the recommended textbook problems, and know the lecture notes perfectly."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "One of the best professors I've ever had at OSU. Write down and UNDERSTAND every single thing he says in lecture and you'll be prepared for any exam or quiz question he throws at you. Just because he's a great professor doesn't mean it's an easy course. Prepare to be challenged. Go to his/his TA's office hours. They genuinely want you to succeed!"
      },
      {
        "index": 8,
        "rating": "4.0",
        "comment": "Really prepared me well for MCAT. Very difficult class, but I found it to be super interesting! Would definitely take him again. Really liked how he wasn't super pressed about grading, very tired of the premed curve stuff and was happy not to have that."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Great Professor!"
      },
      {
        "index": 10,
        "rating": null,
        "comment": "Grade spamming at the end of the semester \nhighest rate on rmp compared to other two biochem 4511 professors\nBut lowest average grade among three classes\ncheck on grade guide, Wu have 2.9 ish on average, other two have 3.3 ish"
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "Biochem is a tough class, but Wu made the material easy to understand for the most part. The class is extremely test heavy. 3 exams worth 72% of the grade. Tuesday/Thursday lectures aren't the best, so it was hard to focus in lecture. Going to lecture is important to understand concepts. Make sure to study more than just the night before exams."
      },
      {
        "index": 12,
        "rating": "4.0",
        "comment": "Biochem4511 is a difficult class but I would argue that Dr.Wu is the best option. Coming to lecture and taking good notes is vital. He also curves the class at the end so that was great for me."
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "Dr. Wu was absolutely amazing. The exams are difficult and this course requires a lot of effort if you want to succeed. That being said, Dr. Wu wants everyone to succeed and tells you exactly what material is on the exams. He really cares about his students and makes sure everyone is following along and answers questions."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Biochem is arguably one of the most difficult classes that you will take as a pre-med. Dr. Wu really did an amazing job with his lectures and ensuring you were able to ask any questions during lecture. Make sure to review those lecture slides almost every day because theres a lot that he covers. I would suggest recording the lectures too for help."
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "Dr. Wu is by far the best professor I've ever had in a STEM class. He was so helpful, funny, and answered all questions well. I would recommend Dr. Wu to anyone taking biochem 4511, especially for MCAT prep."
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "Class is hard regardless of who you take, but I'm super glad I took it with Wu. He was a great professor that explained difficult topics well enough to where I didn't feel the need to reach out for many external resources. Was very clear on what we'd be tested on. Difficult, but fair exams. 72% of your grade is determined by three exams. Little hw."
      },
      {
        "index": 17,
        "rating": "4.0",
        "comment": "Have to study hard to be successful. Memorization heavy."
      },
      {
        "index": 18,
        "rating": "4.0",
        "comment": "Dr. Wu is a good professor, but the class is inherently very difficult. His expectations are extremely clear in terms of what to memorize and what isn't important. Attending every lecture and taking good notes is essential as the exams only cover information from his lectures. Stay consistent and study early and you'll be fine."
      },
      {
        "index": 19,
        "rating": "4.0",
        "comment": "Super nice guy and very willing to help you out but you have to go to office hours and initiate help."
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.7,
    "department": "Biochemistry",
    "firstName": "Dmitri",
    "lastName": "Kudryashov",
    "legacyId": 1811114,
    "numRatings": 47,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "Difficult class, but everything you needed to know is on the slides. His office hours and review sessions before exams are helpful as he often tells you what details you need to know for specific pathways. Cares a lot about the success of his students and doesn't mind explaining/answering any questions."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Don't take this man's class he is a bad lecturer, his slides and lectures are disorganized and do not make sense. His quizzes are hard and he barely gives enough time for them. I would read every chapter of the textbook and slides and still get bad grades on them. Also the lab sucks and is so much extra work for no reason and graded way too harsh."
      },
      {
        "index": 2,
        "rating": "4.0",
        "comment": "Challenging class, but manageable considering he provides a checklist of things to study for the exams. Provides extra credit, but typically leads to a smaller curve. Could be a lot worse given how extensive the curriculum is."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Do not take."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "so many quizzes and so much information. this class should be 2 classes. so sick of it already. seems to be two camps in this class: people doing really well and really poorly. lectures are boring."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Dr. Kudryashov really cares about his students and helping them understand concepts in this class. It is a difficult class with a lot of content, but if you go to his office hours before exams and stay on top of class notes, you can succeed!"
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "5614 has a lot of material but Dr. Kudryashov made it all very interesting, which certainly promoted my learning & studying. Clearly cares about the content and his students; took time for mental health/confidence check-ins + a metacognition exercise. There's a lot to know but he made quiz/exam expectations clear. He made the class fun & enriching!"
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "I had Dr. Kudryashov for biochem 5614 autumn semester of 2023. He was an amazing professor very knowledgeable and prepared us well for tests and quizzes. I had a great time in his class"
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Really great teaching of the material. Willing to help students when they are stuck or lacking understanding. Class was difficult but enjoyable."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Dr. K was super fun to have as a professor! This class is difficult and requires a lot of studying outside of class. However, Dr. K is very willing to help and encourages students to come to office hours. He provides bonus points. I did bad on an exam, and he worked with me to get my grade up to an A. COME TO CLASS! He is very funny and caring!"
      },
      {
        "index": 10,
        "rating": "4.0",
        "comment": "Pros: \n\nGood lectures with notes posted\nVery clear study guides for exams\n\nCons:\n\nUses in-class tophat quizzes"
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "I enjoyed this class and learned a lot. His exams have a particular format and he grades a specific way but once you learn his style you can do well! Dr Kudryashov was genuinely funny and made lecture interesting. Go to lecture, pay attention, participate, and ask questions! you will do so much better if you invest a little bit up front."
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "Dr. Kudryashov was very caring and supportive throughout the semester. The course itself is content heavy but he made it fun and enjoyable! Going to office hours also helped a lottt and he is always happy to help! I would really recommend him if you want to have a great biochemistry experience!"
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "Great professor and super passionate about the subject. Always helpful/accessible and accommodating when students need help. Definitely cares about his students. Study the lecture slides and you will be set for the exams!"
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "This class is very demanding in terms of how much material you are required to know but it is doable. Dr. Kudryashov definitely cares about his students and this is evident as he holds extra office hours before the exams - GO! He gives helpful hints on what to study. Everything you need to know is in the slides, and grading is very fair on exams."
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "The hardest class I've ever taken due to the amount of material, but so interesting. Dr. Kudryashov does an excellent job translating the intrigue of the material in his lectures. He expects a lot but truly cares about his students. I received a lot of help by simply asking him questions after class. Thanks to him, I did quite well on the final."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "he's a funny guy and you can tell that he cares about biology, but he is extremely difficult to understand and he goes incredibly fast. if you skip class you're doomed. lots of material covered, and it's a very quick-paced class"
      },
      {
        "index": 17,
        "rating": "4.0",
        "comment": "Dr. K was a good guy and you could tell he had fun teaching. He does go in-depth and fast, but it is definitely manageable. I appreciated his dry humor. He is very knowledgeable, and his tests weren't bad at all."
      },
      {
        "index": 18,
        "rating": null,
        "comment": "This class is not weighted and merely point based. The content in the first half is taught by Kudryashov. He seems like a nice guy but has a Russian accent and moves VERY fast. His tests are also extremely specific and didn't focus on content. It was like remembering one sentence out of the 400 slides. Be prepared to study."
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "I screwed up the first exam otherwise Dr. Kudryashov's class was great. He really seemed to care about his students and encouraged us to think positively and eat lots of chocolate. I appreciated him, his accent also isn't thick at all, I think some of the others just can't come to terms with not having done well and are blaming his accent."
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.6,
    "department": "Biochemistry",
    "firstName": "Jennifer",
    "lastName": "Ottesen",
    "legacyId": 974223,
    "numRatings": 37,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Her lectures are a mess and she loves to go on tangents that are a total waste of time. In the last 5 minutes of class, expect to go through at least 30 slides with no absorption of any material. Expect to be lost every class. Exams are fair."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Lectures had no structure and she was always all over the place. You will never know what will be on the exam"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Worst professor I've ever had. Do not take a class with her. She is so condescending and disorganized. Her assignments are always thrown together at the last minute. Our modules were always posted 2-3 days late and deadlines were never adjusted. Her lectures had no structure and we barely got through any content. She is infuriating. Avoid!!!!"
      },
      {
        "index": 3,
        "rating": "4.0",
        "comment": "This was a class she only taught the first half of. Exams were very fair; you did really have to know your stuff, though. Skim the textbook chapter before coming to class and stay engaged in lecture. She will talk about current topics she finds interesting not in the book and you might find some of these on the exam. Answered my emails quickly."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Practically all of the information has been taught in undergraduate classes - both here and at other institutions. She is always late and her worksheets consistently had errors that needed clarification YET she has the audacity to berate other students in front of everyone else if they are fifteen minutes late. Makes you feel stupid. Do not take."
      },
      {
        "index": 5,
        "rating": null,
        "comment": "I think she is easily one of the worst professors I have ever had. She is boring and does not stick to any path when teaching. Her lectures are all over the place and do not cover any major information and expect students to simply know it. She does not act like a professional at all. I was considering dropping my Biochemistry major."
      },
      {
        "index": 6,
        "rating": "4.0",
        "comment": "If you're taking 5613, definitely take it with Ottesen. She is very passionate about biochem and prepares your extremely well for exams (which are very fair). A lot of comments on here say she looks for specifc words, but I've never had a problem with her grading and I feel like I was graded fairly."
      },
      {
        "index": 7,
        "rating": "4.0",
        "comment": "Dr. Ottesen LOVES biochemistry, which is inspiring and makes the class more interesting. She cares about her students and wants them to do well."
      },
      {
        "index": 8,
        "rating": "4.0",
        "comment": "This class is very hard, and easily the hardest class I have taken at osu. Dr. Ottesen though is nice, caring, and empathetic. While going through illness and doing terrible on the exams she still encouraged me and I was able to pass, even with my health issues. Exams are very difficult but the curve is extremely generous. Read the textbook."
      },
      {
        "index": 9,
        "rating": null,
        "comment": "Dr. Ottesen is very peculiar. She's very smart but does not relate to her students level of knowledge on biochemistry. Go to every lecture and study hard, because she is a very tough grader. However, she does give fair exams. I advise reading textbook because she is not the best at explaining things on a simple level. Good luck, and put in the work"
      },
      {
        "index": 10,
        "rating": null,
        "comment": "Friendly & cares about your learning, but teaches as if everyone knows the same amount of biochemistry as her. Her exams are all short essays but very fair. However, she is an extremely tough grader. You will think you did well on an exam then get it back and see -1 -2 or -3 on almost every question because she looks for specific phrases."
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "Professor Ottesen is one of the best, if not the best professor I have ever had. She gives a great lecture, is always open to questions and to help you with whatever you don't understand. Her in class quizzes are easy, her take home quizzes are tougher but hey, they are take home! Her exams are all based on the powerpoints, but the grading is rigid"
      },
      {
        "index": 12,
        "rating": null,
        "comment": "The class requires you to work hard and the details matter. These are upper level majors courses, they aren't supposed to be easy. Put effort into the course and Dr. Ottesen will put effort into you."
      },
      {
        "index": 13,
        "rating": null,
        "comment": "She is very sensitive to students correcting her mistakes. She also does not seem to appreciate students trying to engage in scientific dialog with her outside of what is written on the lecture slides. I would advise choosing another professor if you have an interest in Biochemistry."
      },
      {
        "index": 14,
        "rating": null,
        "comment": "She takes off points for not mentioning extraneous information on exam questions. You can answer a question with 100% accuracy, and will lose credit for not writing details that were not prompted for in the questions. The exams are very easy conceptually, but the the grading is extremely subjective and not reflective of what the questions ask for."
      },
      {
        "index": 15,
        "rating": null,
        "comment": "She's great at confusing you. Every time she lectures, she has this big smile on her face basically saying \"I'm going to screw you over on exams\". Her questions on her exams are confusing! Re-read the questions multiple times to see what she's asking. She over complicates things and assumes that you know the topic before the class. Avoid her."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "Not fun"
      },
      {
        "index": 17,
        "rating": null,
        "comment": "I was so interested in biochem when we started. After taking her, my interest in biochem went down a lot. It's not even the material. It's just the way she teaches. She will talk about stuff in class that isn't even on the exam. Also, her exams are very vague on what to write. Majors can't avoid taking her because she's the only one who teaches it."
      },
      {
        "index": 18,
        "rating": null,
        "comment": "Honestly this class is a pain. The tests are completely written which is really annoying. You can write a ton and her TA's grade for specific words/phrases so your understanding is meaningless if you can't spit out. In the first 2 weeks we had a \"practice quiz\" which then ended up being graded because we were \"practicing drawing structures.\" Bad."
      },
      {
        "index": 19,
        "rating": null,
        "comment": "I'd say avoid this proffessor if you can, but you can't. If you thought biochemistry was about understanding chemistry important life, change majors now. It's graded by blind memory. Learn to speak her language, she will not understand you otherwise. She has a weird thing on her tests, it's like all essays, never multiple choice. Expect the worst."
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.4,
    "department": "Biochemistry",
    "firstName": "John",
    "lastName": "Shimko",
    "legacyId": 1727166,
    "numRatings": 97,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "Say what you will about Shimko, he is good at what he does (though he maybe knows it a little too well). Exams are straightforward in theory but are graded so particularly that Watson and Crick would probably miss a few points if they rose from their graves and took one. This class will truly help you understand and appreciate biochem, though."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Okay, grading criteria was NEVER clear. Exam questions was never clear. Graded super harshly. BUT, lectures were engaging and interesting. As you read these reviews, remember, every perception is a confession. Dr. Shimko is very kind in my experience and willing to go above and beyond for students. Take him! His exams are easier compared to others"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Please save yourself a headache and DONT take this class with him. His exams were all free response and you have to write word by word what he says because otherwise you'll get points taken off. He's also very egotistical and will make you feel bad if you don't know a topic. The curve is okay though (~10%)"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Good teacher who clearly presents the material and provides recorded lecture slides from COVID, but a tough grader. Pretty intimidating which makes him a bit unapproachable for help especially if you don't feel like you understand the content."
      },
      {
        "index": 4,
        "rating": "4.0",
        "comment": "I honestly really liked this class. You can't just blame Shimko for your bad grade if you don't do any work. I read every chapter of the textbook and made flash cards, and did really well. Yes, the tests can be tricky but the curve is equally as helpful. Don't be scared to take this class!"
      },
      {
        "index": 5,
        "rating": null,
        "comment": "Very intelligent, but conceited and arrogant. Very diffuse and broad expectations for what will be on exams. He grades very harshly and expects students to answer short answer responses on exams very precisely without much forgiveness. Tons of content very quickly, but that is to be expected."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "Can't believe this professor doesn't believe in global warming. You're literally a scientist?"
      },
      {
        "index": 7,
        "rating": "4.0",
        "comment": "Shimko's very direct and doesn't mess around. He tells you catagorically what matters and what doesn't, however in return if he tells you that something matters, you'd better know in forwards and backwards because his exams question hinge on details. While more difficult than the other biochem profs, he's by far the best teacher and communicator."
      },
      {
        "index": 8,
        "rating": "4.0",
        "comment": "I disagree with the people who say that Dr. Shimko expects \"every detail, word-for-word,\" on exams. He does not! He looks to see if you can understand the material. If you show your understand, you get full points! He doesn't make exams difficult at all! You just have to study! You can get an A in this class by doing recitation, watching lectures."
      },
      {
        "index": 9,
        "rating": "4.0",
        "comment": "Shimko is one of the most straightforward professors for biochem, he'll always emphasize what is on exams in lecture. He's a lecturer who does not rely on lecture slides to teach, he actually knows it. He uses medical/health examples to connect topics and it's pretty helpful to understand the big picture"
      },
      {
        "index": 10,
        "rating": null,
        "comment": "Exams are obnoxious. Hides behind the other professor teaching another section as to why he can't give more points back on exams - exams are hyperspecific and almost everyone got between a 70-80 on every exam. Probably like 5 people got an A in the class but I'm not sure."
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "Shimko did an amazing job teaching such a hard course! Here is what you need to do if you want an A- or higher -- go to every lecture and record him, make anki/quizlet decks on every chapter, go through the chapter guides and THOROUGHLY answer each statement (those will tell you everything you need to know), and utilize group study!"
      },
      {
        "index": 12,
        "rating": null,
        "comment": "Lectures are actually very informative and you learn a lot from them. Casual, fun guy, pretty egotistical but very sarcastic. HORRIBLE exams. If you don't say EXACTLY word for word what he says in lecture, you'll get way more than half your points deducted. It was genuinely disheartening and really difficult, but the info you learn is valuable"
      },
      {
        "index": 13,
        "rating": null,
        "comment": "Shimko has a huge ego and is a conceited, condescending professor. His lectures are interesting, but his exams and grading criteria are awful. He expects student to write down word for word exactly what he says in his lectures on the exams. If you miss even the smallest detail, you will get many points taken off."
      },
      {
        "index": 14,
        "rating": null,
        "comment": "He was alright, but he'll tell you he will write you a letter of recommendation and then totally ghost you. He did this to me, and we had a good relationship. He also did this to my friends who had him for more than one class.  He's notorious for this, so have a backup plan cause it'll screw you and you'll have to scramble to find someone else."
      },
      {
        "index": 15,
        "rating": null,
        "comment": "Shimko is a great lecturer. I learned more in this class than any other course in my 3 years of undergrad. However, he is an extremely difficult grader, and his test questions don't always make it clear what he wants in the answer. This makes it especially hard because exams were 6-8 pages of handwritten responses with less than 2 hours of time"
      },
      {
        "index": 16,
        "rating": null,
        "comment": "Dr. Shimko is a great lecturer. I learned more in this class than any other course in my 3 years of undergrad. However, he is an extremely difficult grader, and his test questions don't always make it clear what he wants in the answer. This makes it especially hard because exams were 6-8 pages of handwritten responses with less than 2 hours of time"
      },
      {
        "index": 17,
        "rating": null,
        "comment": "I took this course when I had 20 credit hours and a job. Bad idea! Lots of difficult content, but more interesting than gen chem. Prof has big ego, focus on lecture slides and the notes he writes down instead of the words coming out of his mouth. Very difficult class, curve was smaller than predicted but still fine. 80% of each exam is written."
      },
      {
        "index": 18,
        "rating": null,
        "comment": "Good teacher, not a good person. His ego is so humongous that I could not stand to listen to his lectures and he loves toxic pre-meds. When he says \"to the detail discussed in class\"- he means that on exams you will get points taken off for not saying EXACTLY what comes out of his mouth. Exams are like writing novels but it's doable."
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "Shimko is a great professor, and his class IS passable if you put in the effort. Lectures are very important but I watched the recordings instead of going in person and did fine. Expect a decent curve in this class. My one complaint is that he doesn't give many study materials for exams. Take BIOCHEM with him! Don't listen to the negative reviews."
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.4,
    "department": "Biochemistry",
    "firstName": "John",
    "id": "VGVhY2hlci0xNzI3MTY2",
    "lastName": "Shimko",
    "legacyId": 1727166,
    "numRatings": 98,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "If MT1 and 2 both have atrocious medians (even below the average, 40-50%) how can you say an 81+ is an A????? Strict grading ",
        "course": "BIOCHEM5614"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 5,
        "comment": "Say what you will about Shimko, he is good at what he does (though he maybe knows it a little too well). Exams are straightforward in theory but are graded so particularly that Watson and Crick would probably miss a few points if they rose from their graves and took one. This class will truly help you understand and appreciate biochem, though. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Okay, grading criteria was NEVER clear. Exam questions was never clear. Graded super harshly. BUT, lectures were engaging and interesting. As you read these reviews, remember, every perception is a confession. Dr. Shimko is very kind in my experience and willing to go above and beyond for students. Take him! His exams are easier compared to others",
        "course": "BIOCHEM4511"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Please save yourself a headache and DONT take this class with him. His exams were all free response and you have to write word by word what he says because otherwise you'll get points taken off. He's also very egotistical and will make you feel bad if you don't know a topic. The curve is okay though (~10%)",
        "course": "BIOCHEM4511"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 5,
        "comment": "Good teacher who clearly presents the material and provides recorded lecture slides from COVID, but a tough grader. Pretty intimidating which makes him a bit unapproachable for help especially if you don't feel like you understand the content.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "I honestly really liked this class. You can't just blame Shimko for your bad grade if you don't do any work. I read every chapter of the textbook and made flash cards, and did really well. Yes, the tests can be tricky but the curve is equally as helpful. Don't be scared to take this class!",
        "course": "BIOCH2210"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very intelligent, but conceited and arrogant. Very diffuse and broad expectations for what will be on exams. He grades very harshly and expects students to answer short answer responses on exams very precisely without much forgiveness. Tons of content very quickly, but that is to be expected.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Can't believe this professor doesn't believe in global warming. You're literally a scientist? ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Shimko's very direct and doesn't mess around. He tells you catagorically what matters and what doesn't, however in return if he tells you that something matters, you'd better know in forwards and backwards because his exams question hinge on details. While more difficult than the other biochem profs, he's by far the best teacher and communicator.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "I disagree with the people who say that Dr. Shimko expects \"every detail, word-for-word,\" on exams. He does not! He looks to see if you can understand the material. If you show your understand, you get full points! He doesn't make exams difficult at all! You just have to study! You can get an A in this class by doing recitation, watching lectures.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Shimko is one of the most straightforward professors for biochem, he'll always emphasize what is on exams in lecture. He's a lecturer who does not rely on lecture slides to teach, he actually knows it. He uses medical/health examples to connect topics and it's pretty helpful to understand the big picture",
        "course": "BIOCHEM4511"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "Exams are obnoxious. Hides behind the other professor teaching another section as to why he can't give more points back on exams - exams are hyperspecific and almost everyone got between a 70-80 on every exam. Probably like 5 people got an A in the class but I'm not sure. ",
        "course": "BIOCHEM5613"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Shimko did an amazing job teaching such a hard course! Here is what you need to do if you want an A- or higher -- go to every lecture and record him, make anki/quizlet decks on every chapter, go through the chapter guides and THOROUGHLY answer each statement (those will tell you everything you need to know), and utilize group study!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 5,
        "comment": "Lectures are actually very informative and you learn a lot from them. Casual, fun guy, pretty egotistical but very sarcastic. HORRIBLE exams. If you don't say EXACTLY word for word what he says in lecture, you'll get way more than half your points deducted. It was genuinely disheartening and really difficult, but the info you learn is valuable",
        "course": "CHEM4511"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Shimko has a huge ego and is a conceited, condescending professor. His lectures are interesting, but his exams and grading criteria are awful. He expects student to write down word for word exactly what he says in his lectures on the exams. If you miss even the smallest detail, you will get many points taken off.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "He was alright, but he'll tell you he will write you a letter of recommendation and then totally ghost you. He did this to me, and we had a good relationship. He also did this to my friends who had him for more than one class.  He's notorious for this, so have a backup plan cause it'll screw you and you'll have to scramble to find someone else. ",
        "course": "BIOCHEM5613"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "Shimko is a great lecturer. I learned more in this class than any other course in my 3 years of undergrad. However, he is an extremely difficult grader, and his test questions don't always make it clear what he wants in the answer. This makes it especially hard because exams were 6-8 pages of handwritten responses with less than 2 hours of time",
        "course": "BIOCHEM4511"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Shimko is a great lecturer. I learned more in this class than any other course in my 3 years of undergrad. However, he is an extremely difficult grader, and his test questions don't always make it clear what he wants in the answer. This makes it especially hard because exams were 6-8 pages of handwritten responses with less than 2 hours of time",
        "course": "BIOCHEM4511"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 5,
        "comment": "I took this course when I had 20 credit hours and a job. Bad idea! Lots of difficult content, but more interesting than gen chem. Prof has big ego, focus on lecture slides and the notes he writes down instead of the words coming out of his mouth. Very difficult class, curve was smaller than predicted but still fine. 80% of each exam is written.",
        "course": "BIOCH2210"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 4,
        "comment": "Good teacher, not a good person. His ego is so humongous that I could not stand to listen to his lectures and he loves toxic pre-meds. When he says \"to the detail discussed in class\"- he means that on exams you will get points taken off for not saying EXACTLY what comes out of his mouth. Exams are like writing novels but it's doable.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "Shimko is a great professor, and his class IS passable if you put in the effort. Lectures are very important but I watched the recordings instead of going in person and did fine. Expect a decent curve in this class. My one complaint is that he doesn't give many study materials for exams. Take BIOCHEM with him! Don't listen to the negative reviews.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Shimko is a good professor teaching a class many people in my major dislike. While I would argue that this is the hardest class I have ever taken, Dr. Shimko has been very helpful to me whenever I needed it. This class requires a lot of dedication so I would suggest that you take easier classes when you take 2210.",
        "course": "BIOCH2210"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "Amazing Professor! Really cared about students and makes lectures engaging. Tests are hard but if you listen in class he tells you what you need to know. He always makes time to meet students after exams to talk. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Shimko was an amazing professor! His lectures are very informative and he will tell you what you need and don't need to know for exams. The recitation practices are super helpful as well. He does grade pretty hard, so its important you go to lecture so you know what exactly hes looking for. You do need to study quite a bit, but Shimko's great!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Shimko is the best science professor I've ever had at OSU. You HAVE to study, but he tells you exactly what is and isn't on exams. Office hours with him are extremely helpful. Don't bother reading textbook, just take very good notes on what he says in class  and study those. 4511 is tough, but Shimko is the best bet for this course. 10/10. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "I know he gets a really bad rap but Shimko was honestly a great professor. He tells you exactly what you need to know for exams and does not hide anything from you. Getting old tests are very helpful. Also his office hours are very chill and if you get to know him through his nerdy side, he actually is really cool.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "I would heavily advise against taking a class with this professor. He does not respond to emails, and does not care about disability accommodations for some students. He acts like he has better things to do. ",
        "course": "BIOCH2210"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved Dr. Shimko. He's a great teacher and as long as you take good notes during lecture (and study them), you'll do fine. He's funny and keeps lectures interesting. There is a lot of memorization for this class, but if you're paying attention in lecture, he always makes it very clear exactly what you need to know and what you don't for exams.",
        "course": "BIOCHEM5614"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Despite all of the other bad ratings, I really enjoyed his class and his lectures. I was never bored, as he explained all topics in a way that created suspense and curiosity and was never just monotone lecturing. exams were all open ended, but this gave room for partial credit. Lectures were in person and NOT recorded. you MUST attend to do well. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 4,
        "comment": "He bragged to the class about how he pulled down a student's 100 grade to a 99 just because he couldn't stand a perfect score and he constantly belittles other professors. Doable if you get over his ego, attend every class, and make sure you know how to do 100% of his practice tests. Word vomit what he says in class onto the exam - every detail.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is good at teaching, but he isn't exactly that great of a person. I have asked questions numerous times during the reviews, but he always ignores them. His exams are hard, but if you do the practice exams or look for old exams, you should be able to get a good grade. Make sure to start studying early, it will save you from a lot of stress later.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 5,
        "comment": "I went to his office hours once and he was playing a game on his phone. He did not care about his students and goes out of his way to be extremely rude. Fine in lecture but outside of lecture was SO mean. He also called a student deaf even though her family was actually deaf. 0/10 person. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 5,
        "comment": "The exams are so incredibly detailed, and only get harder as you go on. You have to digest so much information in such a short time it feels like you are drowning. 90% of what you need to really pass he will just spurt off in lecture, and while his slides are better than most professors, they still arent comprehensive. Basically your grade is 4exam",
        "course": "BIOCHEM4511"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 4,
        "comment": "Attend all the lectures if you can, I found them extremely helpful and pay attention to any details that are emphasized in class. The exams had no multiple choice and Shimko is also very particular with his grading, so try to use his vocabulary. Utilize any old practice exams!!! Tough class overall but if you put in the work, it will pay off.",
        "course": "CHEM4511"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 4,
        "comment": "Doesnt seem to actually care about student success. Always talks about how much work he has when its his job and talks bad about his other classes. Always says the day before the exam that he hasnt finished writing it yet, so how good can it be. This was too difficult of a class to be required for my specific major (and no prior understanding)",
        "course": "BIOCHEM2210"
      },
      {
        "index": 36,
        "rating": 1,
        "difficulty": 1,
        "comment": "Dr. Shimko is a good lecturer and explains the material. However, he is extremely rude to students and does not care about their success. He jokes about how he ignores students in class and when he is available for office hours he berates students for the questions asked. Exams are hard because of his grading. Answer must be his wording or its a 0",
        "course": "BIOCHEM4511"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 4,
        "comment": "Personally I found the lectures (in person) to provide all of the information necessary to do well on his exams. He is an extremely picky and tough grader though so this is something to look out for. Exams are all written response and you need to make sure you are writing down every last detail for the given question otherwise you will lose points.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "John Shimko is a fabulous teacher who presents the lectures and tells us exactly what we need to know. Doesn't play any games, and if you prepare and take good notes you will do well. Great personality as well and very reachable via email with any questions!!",
        "course": "CHEM4511"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Shimko is arrogant and annoying. He takes forever to grade exams because he does not let his TA's do it (it's literally their job), and he complains about it. When people ask questions, he will make them feel stupid for asking them. He was a decent professor and you can get a good grade if you work hard, but be prepared to dislike him.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is very condescending and definitely thinks hes better than everyone. Also grades so specific that if you dont memorize everything that comes out of his mouth during lecture you will get many points off.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 4,
        "comment": "If you want to do well, make sure you write down literally everything that comes out of his mouth. Exams are superrrr specific and you have to know extreme details or else you'll get a ton of points off. He's super funny though and keeps lectures entertaining. No doubt he's a biochem expert, but he kind of expects his students to be as well.",
        "course": "CHEM4511"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 4,
        "comment": "Kind of disrespectful and that's all I'm going to say.",
        "course": "BIOCHEM21478"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Shimko is a real gem. He teaches you what you need to know about biochemistry. His weekly quizzes, homework and recitation are grade boosters. His exams are reasonable and are an easy A if you put in the work. Memorize what he says in lecture and you will succeed. Also go to his office hours, they are EXTREMELY valuable.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 44,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Shimko is not timely when uploading his recorded lectures, which makes it difficult to keep up when you have a strict schedule for the semester. Additionally, he does NOT respond to emails. I have sent him 5 emails in the past 2.5 weeks, and I have heard nothing back. Extremely disappointed and feeling defeated.",
        "course": "BIOCH2210"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Shimko is one of the funniest professors and his lectures are so helpful. I would suggest recording his lectures if you are taking him in person and if not in person, listen to his lectures carefully and don't fall behind in this class. Also, another thing is he loves his wife. So, be ready to hear stories of him going on dates with his wife.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 46,
        "rating": 3,
        "difficulty": 4,
        "comment": "To get a good grade with Dr Shimko, all you need to do is memorize every single word that exits his mouth during lectures and every word on his PowerPoints. He's a mean grader, taking off points for the littlest things, but you can still be ahead of the curve if you know all the facts and have a decent understanding of prior chem classes.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 47,
        "rating": 1,
        "difficulty": 4,
        "comment": "Record lectures because he says a lot of stuff supplementary to the slides. Really mean, doesn't hold back but he's still probably the best biochem teacher for 4511. Recitation quizzes are a joke but very exam heavy. Grades based off of key words so even if you have the idea down, you'll miss a LOT of points for not hitting those key words.",
        "course": "CHEM4511"
      },
      {
        "index": 48,
        "rating": 3,
        "difficulty": 5,
        "comment": "Prepare to work hard if you take his class. Exams are all writing questions.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 5,
        "comment": "This was his first time teaching this BIOCHEM class and dear god I hope it is his last. OChem is not a prereq, but he teaches it as if it is making everything beyond the first unit incredibly difficult to understand. Literally said on the last day of class &quot;I apologize for not teaching this class how I should have&quot;, so take that for what you will.",
        "course": "BIOCHEM2210"
      },
      {
        "index": 50,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hangs up on students and makes himself inaccessible to students. Made my friend cry because he didn't have time for her questions in office hours",
        "course": "BIOCHEM5613"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hes a really good teacher. Things I found difficult to understand in gen chem and ochem that carried over to biochem he made clear as day, and I finally was able to grasp the concepts. His tests are very long and thorough, but if you know the ins and outs youll be fine. His final was over a LOT of material, tape lectures and keep up to speed.",
        "course": "CHEM4511"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 4,
        "comment": "Definitely one of my favorite teachers, he really cares about his students and will plan around your schedule to help you in anyway. You have to work for it though and its a challenging, rewarding class",
        "course": "BIOCHEM5614"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Shimko is extremely fair. He expects a lot, but was always clear with his expectations! The sample exams he provides are representative of the real exams. I highly recommend recording the lectures and relistening as you study for the exams. Be SPECIFIC (use his terminology) on your exams - the grading is tough. Enjoyable but challenging course!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor, he draws mechanims and discusses material in class. He tells us what to focus on in class and gives us an idea on what will be on the exams. He is also very helpful in his office hours.",
        "course": "BIOCHEM5614"
      },
      {
        "index": 55,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this. The lectures are incredibly dense and to me were like a single run-on sentence that had no points of emphasis. Exams are all short answer and are rigorously graded. Online homework had no relevance to the exams; everything comes from Shimko himself and it's confusing. I had a 4.0 in pre-med reqs before this class, and I got a C+.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Shimko is was good professor for biochem. He always covered everything that would be on the exams in class. He would sometimes stray from what was on the lecture slides, so I would highly recommend going to class. Exams were tough but fair. You don't really need the textbook for the class.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 57,
        "rating": 3,
        "difficulty": 4,
        "comment": "Good professor, material is difficult, need to be able to apply stuff learned on exams, exam questions are usually repeats of years before, definitely the best option for 4511, biochem is just a difficult subject",
        "course": "BIOCHEM4511"
      },
      {
        "index": 58,
        "rating": 3,
        "difficulty": 4,
        "comment": "Shimko is a great lecturer and clearly presents and teaches the material. Weekly quizzes are a breeze, but exams are very comprehensive. Very picky grading on exams as well (all short answer). Curves class to a B-, very difficult to finish with an A-/A. Final is the hardest exam by far, allow plenty of time due to depth of glycolysis/TCA.",
        "course": "CHEM4511"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. shimko is the best professor I have had at OSU. His lectures are very easy to understand and he never tests you on anything that isnt from the powerpoints. Record his lectures and re listen to them and take good notes and you will do just fine on his exams. He doesnt ask trick questions, but you need to know a lot at once. Very nice and fair!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 60,
        "rating": 3,
        "difficulty": 5,
        "comment": "His test is so heavy and there are 10 pages for two hours. You should keep writing without thinking to put everything on the booklet. Even you know and understand the material, it would be very hard.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 61,
        "rating": 4,
        "difficulty": 4,
        "comment": "If you have to take Biochem take it with him. He explains things well and throws in dad jokes to keep you awake. Tests were fair, a lot of information, but nothing you haven't seen or he didn't mentioned. Slight curve, but not enough to make a large difference.",
        "course": "CHEM4511"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Shimko is very clear in lecture, one of the best I think Ive had. Coming from a weak chemistry student, I did well only because I really worked at it every other day or so. Tape lectures, memorize the material as it comes, because come metabolism time it falls on you like a dump truck. Hes more than honest about exam material, the final sucked.",
        "course": "CHEM4511"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 4,
        "comment": "its been said - GO TO CLASS. biochem is NOT something you can pick up from the powerpoint alone. his language and your use of his language will get you points or make you lose them on midterms. metabolism - know everything. if you don't think you need to know it, study it. he finds a way to put it all on there. but he's an amazing instructor.",
        "course": "CHEM4511"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you go to class, you'll be fine! If you don't, heaven help you!! Dr. Shimko is a great professor. He is very honest about what he's going to put on his midterms and the final. They're heavy, but that's just the nature of the course. Learn the material as it comes, don't lump it, you'll regret it.",
        "course": "CHEM4511"
      },
      {
        "index": 65,
        "rating": 5,
        "difficulty": 4,
        "comment": "the tests are graded very meticulously, so answer them using his wording. other than that, Dr. Shimko is an amazing instructor. he communicates the information very well and makes it possible to understand, he isn't vague and gives good insight on midterm/final material. tape lectures, get ready to memorize.",
        "course": "CHEM4511"
      },
      {
        "index": 66,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Shimko is a really good instructor. I would encourage you to record the lectures and listen to them later at home. The powerpoints are good ways to reinforce the material, but going to class is really the only way to understand everything. He says a LOT of things that are not on the powerpoints. His exams are tough, but doable if you study.",
        "course": "CHEM4511"
      },
      {
        "index": 67,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you have to take Biochem, take Shimko! His exams were difficult, but the quizzes were always easy points, and his lectures were very enjoyable! He uses sarcasm and real-world examples to make the course material interesting. Definitely go to lecture, because he says exactly what you do and do not need to know for exams. Overall: Great!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 4,
        "comment": "recitation quizzes are a joke. Midterms are pretty much the power points, the second one was alot of math which kinda sucked. the final is brutal (tape the metabolism lectures). kinda picky on wording on extended response. generous curve if you do above the average.",
        "course": "CHEM4511"
      },
      {
        "index": 69,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good guy, kinda nerdy. But knows his stuff pretty darn well. Easy to understand in lecture, power points predict midterms and final.",
        "course": "CHEM4511"
      },
      {
        "index": 70,
        "rating": 4,
        "difficulty": 4,
        "comment": "First midterm isn't so bad, second midterm and final are TOUGH. a lot of heavy memory. Learn and memorize glycolysis EARLY, that way the rest of metabolism will be a breeze. Great professor, but to be honest he is a little full of himself.",
        "course": "CHEM4511"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 3,
        "comment": "First of all, he's hilarious. He likes to make jokes about the material and tell funny personal stories. I had a Summer class with him, so it was fast paced. But as long as you attend the lectures, take good notes and watch YouTube videos, you'll do fine in the class. The class in curved based on median and not mean. Do well on your first easy exam",
        "course": "BIOCHEM4511"
      },
      {
        "index": 72,
        "rating": 4,
        "difficulty": 3,
        "comment": "Shimko is pretty good. He tells you what you need to know for the exam. First exam is a piece of cake compared to the 2nd one and the final. Do well on the first exam!  Also, don't take the quizzes too lightly. He said during lecture they wouldn't really matter, but they do add up. The first exam was actually pretty similar to the practice.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 73,
        "rating": 4,
        "difficulty": 4,
        "comment": "Shimko is a great professor and teaches the lecture notes very well. Get a friend's previous exams & quizzes if you can because he doesn't change the questions too much. Memorize amino acids, sugars, Glycolysis, and TCA cycle ASAP. Knowing them beforehand makes it easier to connect concepts together and will help with understanding the notes.",
        "course": "CHEM4511"
      },
      {
        "index": 74,
        "rating": 4,
        "difficulty": 3,
        "comment": "No need for the book. Using his powerpoint with videos online for tricks to memorize things like glycolysis and the TCA cycle help. Use his practice midterm for the first exam because that's the best grade you'll probably get",
        "course": "BIOCHEM4511"
      },
      {
        "index": 75,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Shimko is a little bit full of himself, but he's a decent professor. Goes a little fast over lectures, but I guess you have to with the subject. Do NOT fall behind. Its so hard to catch back up with the lecture material. He's big on office hours, so go to them. Also, proofread your emails, if he thinks its a dumb email, he'll let you know.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 76,
        "rating": 4,
        "difficulty": 4,
        "comment": "He might be a little full of himself but he teaches very well. Provides really great notes. Exam 1: 80% Structure, 20% Theory (Best shot at getting ahead, it gets harder) Exam 2 20% Structure, 80% Theory (Be prepared to write long answers. Long exam) Exam 3: 50% Structure, 50% Theory (Start Studying REALLY early, theres a ton on this exam)",
        "course": "CHEM4511"
      },
      {
        "index": 77,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Shimko did an excellent job with lecture. The key to doing well is following very closely what he mentions in lecture. The only things on the midterm are what comes from his mouth. The book and the PowerPoints are only to supplement what he says. He also lets you know what is being tested and most importantly what he will not test.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 78,
        "rating": 5,
        "difficulty": 3,
        "comment": "I like Prof Shimko. It seemed like some of the test material is explained in the lectures but not the notes. The textbook really wasn't helpful. I would recommend studying at least 12 hours per week to make sure you have everything memorized, but I didn't have that kind of time this semester. Curves very generously.",
        "course": "CHEM4511"
      },
      {
        "index": 79,
        "rating": 3,
        "difficulty": 3,
        "comment": "Better than the other Biochem professor i have heard but not that great. Wastes lots of time in lecture and can get hard to follow at times but exams aren't to bad. Not alot of grades so need to watch out. Reuses old exams so try to grab someone's who took him prior.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 80,
        "rating": 3,
        "difficulty": 3,
        "comment": "The guy knows his stuff front and back. Pay attention in class and take notes. But be careful, the average in our class after our first exam was a bit higher than what he wanted so he made the second exam much harder than the first. All in all, he is a great professor and definitely should be taken",
        "course": "CHEM4511"
      },
      {
        "index": 81,
        "rating": 3,
        "difficulty": 3,
        "comment": "100% lecture based. Sit close and recording the lectures on your phone!!! He drops hints about what is important by saying \"The idea here is\". USE THE CHAPTER GUIDES ON CARMEN. The chapter guides tell you everything you need to know. Dont do the optional HW. It's a trap for students who dont come to class.  He will give exam Qs away in office hours",
        "course": "BIOCHEM4511"
      },
      {
        "index": 82,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Shimko for three classes (5613, 5614, and 5621).  He is difficult, but great and is always willing to help.  It took me about a semester to figure out how to do really well in his classes but it was worth it. You'll be prepared for any biochemistry in the future.  I would definitely recommend him.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 83,
        "rating": 3,
        "difficulty": 5,
        "comment": "Horrible. Not very helping. Very condescending and rude humor. Take this class if only you're really good at chemistry.",
        "course": "CHEM4511"
      },
      {
        "index": 84,
        "rating": 4,
        "difficulty": 4,
        "comment": "A lot of work at the beginning of the semester, but drops off as lab gets longer. Lab reports averaged over 10 pages. The first exam is the hardest, as he does not give a lot of detail on what to study. If you pay attention in lecture and understand the overarching concepts you will do just fine. (Also the exams are only 25% of the final grade!)",
        "course": "BIOCHEM5621"
      },
      {
        "index": 85,
        "rating": 4,
        "difficulty": 4,
        "comment": "Demanding professor in terms of understanding material, NOT in terms of homework.  Tests are hard but I learned a lot from him!",
        "course": "BIOCHEM5613"
      },
      {
        "index": 86,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't expect him to be helpful. He'll just say \"meh\" and give you no details. He favors girls over boys in office hours. ",
        "course": "BIOCHEM5613"
      },
      {
        "index": 87,
        "rating": 2,
        "difficulty": 5,
        "comment": "Has an adversarial attitude towards students. Tests are terribly difficult and graded harshly. Doesn't give you a good idea of how to prepare. Something he emphasizes over and over may not be on the test and something he covered for a few minutes might show up for big points. ",
        "course": "BIOCHEM5613"
      },
      {
        "index": 88,
        "rating": 2,
        "difficulty": 5,
        "comment": "Do not take this guy if you are not a chem major or don't like chemistry. He is a tough grader and his course policies are confusing. If you don't pass the online timed quiz he won't let you take the first exam.  ",
        "course": "2310"
      },
      {
        "index": 89,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Shimko is a good guy, however, the actual class is the stuff of nightmares. There are few assignments so the majority of your grade is based on three exams, which are all ridiculously difficult. The average was a 56% for exam 1 and 45% for exam 2. The final is tomorrow and I think my time is better spent praying than studying at this point.",
        "course": "CHEM2310"
      },
      {
        "index": 90,
        "rating": 3,
        "difficulty": 3,
        "comment": "OSU Chem with Shimko was not terrible. He posts all of his notes online, so you don't have to attend class. If you do attend class, as well as the exam reviews, he basically gives you the type of questions that will be on his tests. Lots of online homework which isn't helpful, but it's a good grade booster. Not too bad for an intro Chem class",
        "course": "CHEM1110"
      },
      {
        "index": 91,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is not hard and if you put in the effort you will get an A. That said there is a lot of writing (i.e. lab reports up to 9 pages long). Tests are not too hard 80% of the material was review from BIOCHEM 4511. Dr. Shimko is a nice guy, and a good teacher and the class is pretty fun. Make sure to just follow the rubrics when writing reports",
        "course": "BIOCHEM5621"
      },
      {
        "index": 92,
        "rating": 2,
        "difficulty": 5,
        "comment": "There's a TON of online homework and exams are as said, impossible.  He likes to put answers you *might* get which causes second-guessing.  He's interested in helping students but comes off as a lil condescending sometimes.  Lecture' s boring.  The final's in 10 hours but I just can't study anymore so here I am, may Shimko have mercy on my soul.",
        "course": "CHEM1110"
      },
      {
        "index": 93,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was super hard! He covered more than what most do for an INTRO class.",
        "course": "CHEM1110"
      },
      {
        "index": 94,
        "rating": 1,
        "difficulty": 3,
        "comment": "If I accurately described the experience of sitting in a class taught by this guy, my comment wouldn't be posted. He seems to think that cussing is a substitute for rapport, and that explaining that water hydrogen bonds with itself for an hour (!) allows him to totally gloss over how proteins fold (20 minutes on both 2-structures). Super unclear.",
        "course": "CHEM4511"
      },
      {
        "index": 95,
        "rating": 4,
        "difficulty": 3,
        "comment": "Exams are extremely hard. Sometimes he speaks way above his chemistry 1110 students because he teaches higher level chemistry classes.",
        "course": "CHEM1110"
      },
      {
        "index": 96,
        "rating": 5,
        "difficulty": 5,
        "comment": "His lectures and lecture notes are really easy to follow, he explains things pretty well, however his midterms are impossible no one can pass them in my class our averages are around 54% and the curve makes that a C. I studied for hours and still was not improving. For a GE this was a really hard course.",
        "course": "CHEMISTRY1110"
      },
      {
        "index": 97,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had him for Biochemistry lab and he is an excellent teacher. He's very enthusiastic and is friendly and may like teaching more than researching. I highly recommend him. He's almost always available and responds to emails in a timely fashion. He makes class amusing and encourages participation and is open to suggestions and anecdotes",
        "course": "BIOCH5621"
      },
      {
        "index": 98,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had  Dr. Shimko for his first quarter teaching Biochem 511 and I thought he did a good job. His quizzes were very easy and from his slides, however, the midterm was pretty intense and you should expect to spend hours studying for an A. Beware, after the midterm we lost Shimko and got Dr. Kudryashov who made things much harder. not fun but doable",
        "course": "CHEM511"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.7,
    "department": "Biochemistry",
    "firstName": "Dmitri",
    "id": "VGVhY2hlci0xODExMTE0",
    "lastName": "Kudryashov",
    "legacyId": 1811114,
    "numRatings": 47,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Difficult class, but everything you needed to know is on the slides. His office hours and review sessions before exams are helpful as he often tells you what details you need to know for specific pathways. Cares a lot about the success of his students and doesn't mind explaining/answering any questions.",
        "course": "BIOCHEM5614"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Don't take this man's class he is a bad lecturer, his slides and lectures are disorganized and do not make sense. His quizzes are hard and he barely gives enough time for them. I would read every chapter of the textbook and slides and still get bad grades on them. Also the lab sucks and is so much extra work for no reason and graded way too harsh.",
        "course": "BIO1113H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 5,
        "comment": "Challenging class, but manageable considering he provides a checklist of things to study for the exams. Provides extra credit, but typically leads to a smaller curve. Could be a lot worse given how extensive the curriculum is.",
        "course": "BIOCHEM5614"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take. ",
        "course": "BIOCHEM5614"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "so many quizzes and so much information. this class should be 2 classes. so sick of it already. seems to be two camps in this class: people doing really well and really poorly. lectures are boring. ",
        "course": "BIOCHEM5614"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Kudryashov really cares about his students and helping them understand concepts in this class. It is a difficult class with a lot of content, but if you go to his office hours before exams and stay on top of class notes, you can succeed!",
        "course": "BIOCHEM5614"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "5614 has a lot of material but Dr. Kudryashov made it all very interesting, which certainly promoted my learning & studying. Clearly cares about the content and his students; took time for mental health/confidence check-ins + a metacognition exercise. There's a lot to know but he made quiz/exam expectations clear. He made the class fun & enriching!",
        "course": "BIOCHEM5614"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Dr. Kudryashov for biochem 5614 autumn semester of 2023. He was an amazing professor very knowledgeable and prepared us well for tests and quizzes. I had a great time in his class",
        "course": "BIOCHEM5614"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really great teaching of the material. Willing to help students when they are stuck or lacking understanding. Class was difficult but enjoyable. ",
        "course": "BIOCHEM5614"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. K was super fun to have as a professor! This class is difficult and requires a lot of studying outside of class. However, Dr. K is very willing to help and encourages students to come to office hours. He provides bonus points. I did bad on an exam, and he worked with me to get my grade up to an A. COME TO CLASS! He is very funny and caring!",
        "course": "BIOCHEM5614"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "Pros: \n\nGood lectures with notes posted\nVery clear study guides for exams\n\nCons:\n\nUses in-class tophat quizzes",
        "course": "BIOCHEM5614"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "I enjoyed this class and learned a lot. His exams have a particular format and he grades a specific way but once you learn his style you can do well! Dr Kudryashov was genuinely funny and made lecture interesting. Go to lecture, pay attention, participate, and ask questions! you will do so much better if you invest a little bit up front. ",
        "course": "BIOCHEM5614"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kudryashov was very caring and supportive throughout the semester. The course itself is content heavy but he made it fun and enjoyable! Going to office hours also helped a lottt and he is always happy to help! I would really recommend him if you want to have a great biochemistry experience!",
        "course": "BIOCHEM5614"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor and super passionate about the subject. Always helpful/accessible and accommodating when students need help. Definitely cares about his students. Study the lecture slides and you will be set for the exams!",
        "course": "BIOCHEM5614"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is very demanding in terms of how much material you are required to know but it is doable. Dr. Kudryashov definitely cares about his students and this is evident as he holds extra office hours before the exams - GO! He gives helpful hints on what to study. Everything you need to know is in the slides, and grading is very fair on exams. ",
        "course": "BIOCHEM5614"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 5,
        "comment": "The hardest class I've ever taken due to the amount of material, but so interesting. Dr. Kudryashov does an excellent job translating the intrigue of the material in his lectures. He expects a lot but truly cares about his students. I received a lot of help by simply asking him questions after class. Thanks to him, I did quite well on the final.",
        "course": "BIOCHEM5614"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 5,
        "comment": "he's a funny guy and you can tell that he cares about biology, but he is extremely difficult to understand and he goes incredibly fast. if you skip class you're doomed. lots of material covered, and it's a very quick-paced class",
        "course": "BIO1113H"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. K was a good guy and you could tell he had fun teaching. He does go in-depth and fast, but it is definitely manageable. I appreciated his dry humor. He is very knowledgeable, and his tests weren't bad at all.",
        "course": "BIO1113H"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class is not weighted and merely point based. The content in the first half is taught by Kudryashov. He seems like a nice guy but has a Russian accent and moves VERY fast. His tests are also extremely specific and didn’t focus on content. It was like remembering one sentence out of the 400 slides. Be prepared to study.",
        "course": "BIO1113H"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "I screwed up the first exam otherwise Dr. Kudryashov's class was great. He really seemed to care about his students and encouraged us to think positively and eat lots of chocolate. I appreciated him, his accent also isn't thick at all, I think some of the others just can't come to terms with not having done well and are blaming his accent.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Kudryashov is a great professor, he really cares about his students, and he gives generous curves (5-10%). That said, this course is a 4000-level science course and should be treated as such. Because of the large amount of material to memorize, it's an easy A for people who prepare BEFORE lecture and is hell for procrastinators.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 5,
        "comment": "His accent makes it impossible to understand what he is teaching. I tried very hard to understand him, went to every lecture, and read the book. The class itself is structured well, you get 1/2 of your quiz points in recitation just for showing up. Mastering homework and quizzes are much easier than exams. Exams are all extended response.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "His thick accent is very hard to follow, even after reading the textbook chapters before the lectures. He also talks very fast and studder here and there so relistening to the lecture doesnt help much. Please avoid if you cant understand accents. I have been doing well in all advanced science courses but I dont think I can in this class.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Kudryashov definitely makes you work for your grade. It is a lot of work but your work will pay off. From what I've heard he is more difficult than other professors but you really learn the material. I really enjoyed him and his class and would definitely take him again.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "It's not that bad. You just really need to read and review the material well and really take time to listen in lecture. It's a lot of memorization, so space out your time well to memorize all of the structures needed. The first two exams were pretty easy, but final was difficult. Also you can get points back on the exams by going in &amp; talking to TA",
        "course": "BIOCHEM4511"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 5,
        "comment": "It's a very tough class. There's a crazy amount of material expected of you for exams, which there are only 3 of, so don't mess any up. He's a nice guy and makes himself available, but he never makes it easy to do well. I'd study so much for this class only to be disappointed. If I could do it again, I wouldn't take it with him. There is a curve.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 3,
        "comment": "Doesn't explain things well, very dry. Just reads off of PowerPoint slides and expects you to get it. I believe he means well but it gets hard to stay motivated in his class because his lectures are so dull",
        "course": "BIOCHEM4511"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 4,
        "comment": "Really nice professor with lots of practice problems, but way too much material thrown at you at one time. Other classes had open note, multiple choice tests. Take someone else unless you're really strong at chemistry.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 4,
        "comment": "Though scary at first, he cares about his students and is a very good lecturer. Sometimes he cracks a joke which lightens the mood in a heavy class. He wants you to pass but only if you earn it, which is fair. He is also very clear about what he expects you to know for exams",
        "course": "BIOCHEM4511"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class is very challenging because it requires you to memorize large quantities of material that feels impossible. If you start memorizing the material ( like 2 weeks + before an exam) you will do well. Not much of a curve so start strong. The professor is funny but expects you to put in a lot of effort so don't slack off.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible! His exams are a insane amount of information and very detailed! His lectures aren't helpful because he just reads from the slides fast and with a thick accent. He expects you to have very complex topics and structures memorized after hearing him talk about it for 5 seconds. Exams are all extended response. Good luck.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "Tough class, lots of study required.  Professor was good, humorous, and always available, though the powerpoint lectures were fairly dull.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Kudryashov was an excellent professor. However, I believe we tried to cover too many topics in the semester. This being said, everything he tested us over was very fair. What made the class difficult was the fact you needed to know almost EVERYTHING.  If you keep up, study weekly with the material, and understand concepts you will do very well.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is nice but not that helpful talking fast and reading from lectures is not teaching. High expectation that u should know and memorize every single thing  on each single slides not fair each lecture over 50 slides! Exams are tough and very detailed. YES STUDY EVERYTHING DO NOT SKIP! curve helps students on & below average not above average!!!!!!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 4,
        "comment": "I dont think this class was organized well. The material is all over the place (at times) and he doesn't explain the basics of each lecture well. It was hard to decide what was the most important take aways from each lecture. I ended up watching hours of YouTube videos to figure it out. Would I recommend him? Probably not. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 5,
        "comment": "Hardest class I have taken. Exams are over 200-400 slides and he expects you to memorize every thing on every slide; and the exams are all fill in. Lectures are impossible to keep up with as he spends no more then 30 seconds on each slide. Good Luck.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 3,
        "comment": "I would recommend Dr. Kudryashov over any other Biochemistry teacher. I did feel he went through the lectures relatively fast + had unrealistic expectations like expecting you to and understand the material right when it left his lips and to memorize everything for the exams. Go to office hours, make this class your #1 priority + you'll be fine.",
        "course": "BIOCHEM4510"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 3,
        "comment": "He is a little hard to understand sometimes, and he tells you to remember everything. The exams were all extended responseshort answer, but they were fair and similar to the recitation activities.",
        "course": "BIOLCHEM4500"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 5,
        "comment": "Very hard professor. Took 4 exams total, all of which felt like finals (2 hours long all extended response quetions). He would tell you to memorize basically everything. Unneccessarily hard exams. Looks for very particular answers. Overall, this class is one of the most challenging I have taken, I recommend the other professor instead of Dr. K.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Kudryashov was very helpful and clearly cares a lot about his students. His exams are fair but it kind of feels like he rushes through lecture. Overall, he is a pretty good professor and I highly recommend him.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 4,
        "comment": "Kudryashov is the best! One of the rare ones at OSU who really cares about the students success and not only about their research. The material is very challenging, but like any science class, you won't be handed an A. In short, he makes class enjoyable and this Russian accent makes things a lot more interesting to listen to! I recommend.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class obviously isn't going to be easy. That being said, Dr. Kudryashov makes his exams very fair!The final isn't cumulative which is nice.Quizzes are online, fairly difficult but you can use your notes. His recitation worksheets are also very helpful and representative of exams. Overall, great professor and great class set up.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 4,
        "comment": "You're better of taking it with someone else. His midterms aren't that hard if you study, but his quizzes are ridiculous. He is helpful, though. He's always present at office hours.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "I learn so much from Dr. Kudyrashov's lecture. He is great at explaining things and uses interesting facts and statistics to relate things to real life. He is definitely a good professor for Pre-Med students to take, as he has a great interest and focus on medicine incorporated into biochemistry.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Kudryashov really cares about his students. He is constantly sneaking in little comments about good study habits and eating properly (in terms of biochemistry). The content is challenging, but doable if material is kept up with. Tests are fair, and Kudryashov is more than willing to help struggling students.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kudryashov is a great lecturer and his exams are very fair. Quizzes are online and can be challenging, but they are good preparation for the exams.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy",
        "course": "BIOCHEM4511"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.8,
    "department": "Biochemistry",
    "firstName": "Zhengrong Justin",
    "id": "VGVhY2hlci0xMjMxMDA4",
    "lastName": "Wu",
    "legacyId": 1231008,
    "numRatings": 46,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "This was the hardest class I have ever taken at Ohio State, worse then ochem (in my opinion). Sometimes will SPEED RUN info in lectures if we get behind. You basically need to memorize everything on every slide and write down everything he says. The exams are brutal and I did not think they were straightforward. Veryy specific application questions",
        "course": "BIOCHEM4511"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Lectures are pretty dense in terms of content. We spent a bunch of time writing proofs for various Schr&#246;dinger wave equations. Exams are fairly straightforward, and borrow a lot of content from recitation; however, that doesn't make the questions innately easy. Just prepare from textbook questions and recitation problems, and you'll do fine!",
        "course": "BIOCHEM5722"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not clear! Contradicts self constantly, recitation is a hot mess and your grade is quite literally the exams that are never graded correctly and you pretty much never know what will be on them&#8230; anyways, good luck my friends you are in for a nightmare. \n\n",
        "course": "BIOCHEM4511"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Exams are difficult. ",
        "course": "BIOCHEM5722"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this professor. Unwilling to answer the question you are asking, very tough grader, and contradicts self constantly. Made an already hard class feel impossible. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor. You'll learn a lot during lectures. Go to lectures and study early. This class goes over a lot of information. I would highly recommend this course to anyone prepping for the MCAT.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "Extremely condescending. Would not give students straight forward answers when asking questions and tried his best to constantly make sure everyone knew he was the smartest in the room. EXTREMELY lecture heavy. The best way to study for this course is to record his lectures and re-listen to them before the exam. I got a B+ on the final doing this",
        "course": "BIOCHEM4511"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Wu is a very sweet man and it is visibly apparent that he is trying his best. That said, when I took him he would go overboard on his explaination lecture slides, fall behind and then rather than just adjust the course accordingly, he would speed up and rush through content to get it all on the exam. That said, exams are FAIRLY straightforward.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Wu is a great instructor. His lectures are super clear and easy to follow. However, his exams can be quite challenging sometimes. He truly tests your understanding of the material, as his exams are almost exclusively written responses and drawing structures/mechanisms. Do the recommended textbook problems, and know the lecture notes perfectly. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors I've ever had at OSU. Write down and UNDERSTAND every single thing he says in lecture and you'll be prepared for any exam or quiz question he throws at you. Just because he's a great professor doesn't mean it's an easy course. Prepare to be challenged. Go to his/his TA's office hours. They genuinely want you to succeed!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 5,
        "comment": "Really prepared me well for MCAT. Very difficult class, but I found it to be super interesting! Would definitely take him again. Really liked how he wasn't super pressed about grading, very tired of the premed curve stuff and was happy not to have that.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great Professor!",
        "course": "BIOCHEM5722"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "Grade spamming at the end of the semester \nhighest rate on rmp compared to other two biochem 4511 professors\nBut lowest average grade among three classes\ncheck on grade guide, Wu have 2.9 ish on average, other two have 3.3 ish",
        "course": "BIOCHEM4511"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Biochem is a tough class, but Wu made the material easy to understand for the most part. The class is extremely test heavy. 3 exams worth 72% of the grade. Tuesday/Thursday lectures aren't the best, so it was hard to focus in lecture. Going to lecture is important to understand concepts. Make sure to study more than just the night before exams.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 5,
        "comment": "Biochem4511 is a difficult class but I would argue that Dr.Wu is the best option. Coming to lecture and taking good notes is vital. He also curves the class at the end so that was great for me. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wu was absolutely amazing. The exams are difficult and this course requires a lot of effort if you want to succeed. That being said, Dr. Wu wants everyone to succeed and tells you exactly what material is on the exams. He really cares about his students and makes sure everyone is following along and answers questions.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 5,
        "comment": "Biochem is arguably one of the most difficult classes that you will take as a pre-med. Dr. Wu really did an amazing job with his lectures and ensuring you were able to ask any questions during lecture. Make sure to review those lecture slides almost every day because theres a lot that he covers. I would suggest recording the lectures too for help. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Wu is by far the best professor I've ever had in a STEM class. He was so helpful, funny, and answered all questions well. I would recommend Dr. Wu to anyone taking biochem 4511, especially for MCAT prep. ",
        "course": "BIOCHEM4511"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "Class is hard regardless of who you take, but I'm super glad I took it with Wu. He was a great professor that explained difficult topics well enough to where I didn't feel the need to reach out for many external resources. Was very clear on what we'd be tested on. Difficult, but fair exams. 72% of your grade is determined by three exams. Little hw.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 5,
        "comment": "Have to study hard to be successful. Memorization heavy.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Wu is a good professor, but the class is inherently very difficult. His expectations are extremely clear in terms of what to memorize and what isn't important. Attending every lecture and taking good notes is essential as the exams only cover information from his lectures. Stay consistent and study early and you'll be fine.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 4,
        "comment": "Super nice guy and very willing to help you out but you have to go to office hours and initiate help.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Wu teaches the content at a pretty fast pace, but it is manageable. Always go to lectures when you can as there is so much material that is not included on the slides. He is always so clear with what to expect on exams, and there are usually never any questions that I wouldn't expect on them.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "Partial credit was not given very generously, and there were often mistakes on the answer keys, but he was very helpful, willing to correct mistakes and give points back, and an excellent teacher who gave very helpful lectures.",
        "course": "BIOCHEM5722"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of my favorite professors at OSU. You really need to work hard for this class, but he makes his expectations very clear and his exams are reasonable if you know your stuff. He had some encouraging words to say at the end of the semester, which I really appreciated. Take his class.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Wu is very caring, but His class is tough. I suggest knowing the PowerPoint and do textbook problems before the exam. I tried my best in BioChem, which isnt my fav subject, and ended with a C on Carmen after everything was finalize but he pumped me to a B- on buckeyelink. Maybe cuz I actively participate in every single office hour he has.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Wu was a nice guy, accessible during office hours, and really did help you understand content if you had questions. We used mastering chem and graded on accuracy. Weekly quizzes were not too bad and lowest 2 got dropped. Exams 2 and 3 were very hard. With the curve, you didn't really know how you were doing till the end, so that was tough.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 4,
        "comment": "If you have to take this class during the pandemic, I would consider switching professors if I were you. The tests are quite difficult and there are weekly quizzes that are difficult too. I'm sure if we weren't in a panny, this class would be doable, however, it felt like he didn't really care about the pandemic with the difficulty of the work.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Wu has been one of my favorite teachers so far at OSU. His expectations for exams are super clear and are taken directly from the assigned homework, recitation, and in class examples. He's super positive and upbeat for lectures and makes the class participate. Overall, he's a really good teacher. I only went to office hours a few times.",
        "course": "BIOCHEM5721"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Wu was great, take Biochem with him. All of the exams are straight forward and he tells you exactly what is going to be on them. I recommend recording all the lectures because he tests based on lecture content, the textbook was useless for me. He does a good job emphasizing important concepts and is accessible during office hours.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 4,
        "comment": "Content was interesting as were his lectures. His PowerPoints are thorough, but paying attention in class is extremely important as he explains concepts in greater depth and clarity. Recitation is mandatory to attend but extremely helpful. Exams were a ton of writing but all very fair. Biochem is a tough class, but I am glad I had Dr. Wu for it.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Wu was one of my favorite professors at Ohio State. His lectures were very clear, but very fast-paced. Take notes on what he says, on top of what is already on the slides because his explanations are very important. I also loved how his recitation activities were not graded, yet SO helpful for studying when completed. 10/10 would recommend.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wu was a great professor. His tests are completely lecture based, and I rarely read the book--only when I needed clarification. He straight up tells you everything you need to know for each exam, and his exams are fair. He repeats key concepts over and over in class so you know what will be emphasized on exams. Would highly recommend!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Wu was fairly clear with what he wanted students to learn, and most of the material was from the slides, not the textbook. Some of the free response questions seemed to be fairly open so it was difficult at times to know what he was looking for. He was very knowledgeable, but since your grade is 88% based on exams I might recommend another prof",
        "course": "BIOCHEM4511"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 5,
        "comment": "Really clear about everything you need to know from lectures. As long as you follow his pattern and listen carefully in the class, you would get a good grade. And he is nice to be honest. Also his exam is not tricky, which is good.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome professor and exactly what you need for a tough class. His lectures are easy to understand and he is always clear about what material will be on exams. Recitation is actually very helpful and he gives you sample/old exam questions to study. Very easy to do well if you put in the work. Highly recommend as a prof.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wu is very clear in lecture about what you need to know for exams and will often emphasize multiple times the important concepts to memorize. Recitation was very helpful and you could tell he genuinely cared for his students to learn the material. Biochem is not easy, but he made it fair and manageable. There was a bell curve applied at the end",
        "course": "BIOCHEM4511"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "Justin is an amazing professor. Understand the materials and use his office hours. Recitation assignments are helpful for tests.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Wu was a great professor for biochem. His lectures were very helpful and very easy to follow. His exams were incredibly fair and he was very helpful in office hours and made himself available to students that couldn't make his office hours. He genuinely cares about his students and their success, I would definitely take another class with him.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 2,
        "comment": "one of the best science lecturer that I have. Dr. Wu explains materials on class very clearly and is very helpful during office hour. The lecture is not boring and he explains important materials several time. The recitation helps a lot also.  Do the activities that he suggests and you would do great on this course.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wu had comprehensive lecture notes, often went over the hard concepts two or three times during the lecture, and the lecture before each exam told us exactly what was on the exams. In office hours he was extremely helpful and he really cared about helping everyone. Biochem is tough. Do the work and get help from Dr. Wu and you will do well!",
        "course": "BIOCHEM4511"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 5,
        "comment": "Prof. Wu was a terrible teacher. The class consisted of him showing slides of biochem pathways and saying memorize them. His exams questions were vague e.g.\"Explain biochemistry\". Grading was a joke because he didn't make a key until weeks after the exam so TAs (who didn't know the material) would arbitrarily assign points.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 43,
        "rating": 1,
        "difficulty": 2,
        "comment": "Really couldn't be worse.  Well it was pretty easy to get a good grade, but not due to Wu.  Terrible lecturer, just pulls convoluted math and detail-heavy slides from the textbook and stumbles through them in broken English.  Changed the due date of a HW 9 PM the night before it was due... so that was unhelpful.  Never posts due dates on Carmen.",
        "course": "BIOCHEM5722"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 5,
        "comment": "I would say he is a mean guy.",
        "course": "BIOCH721"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 5,
        "comment": "All I could say is...anything that could possibly go wrong in a class happened in this class. It's hard to avoid this class since there's only one session. The only way to do well is either you study really hard on your own or go to outside source. The TA is so arrogent. Dr. Wu and the TA even used cell phone DURING the final to communicate...",
        "course": "BIOCH721"
      },
      {
        "index": 46,
        "rating": 2,
        "difficulty": 5,
        "comment": "BioChem721.01-- Wu is a horrible teacher! He told my friend that he didn't even want to teach the class. He copied EVERYTHING down to the number values of all our quizzes and midterms from Dr. Wang-- another bad teacher. So people who knew some1 from prev. yr's class got As, the rest of us prayed for B-s. Soo LAZY! Wu should stay in the lab!",
        "course": "BIOCH721"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.5,
    "department": "Biochemistry",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci05NzQyMjM=",
    "lastName": "Ottesen",
    "legacyId": 974223,
    "numRatings": 38,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very bad! She could not have been worse for teaching a beginner's biology course. She is very knowledgeable, but an awful teacher. Please avoid. ",
        "course": "BIO1113H"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her lectures are a mess and she loves to go on tangents that are a total waste of time. In the last 5 minutes of class, expect to go through at least 30 slides with no absorption of any material. Expect to be lost every class. Exams are fair.\n\n\n",
        "course": "BIO1113H"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Lectures had no structure and she was always all over the place. You will never know what will be on the exam ",
        "course": "BIO1113H"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I've ever had. Do not take a class with her. She is so condescending and disorganized. Her assignments are always thrown together at the last minute. Our modules were always posted 2-3 days late and deadlines were never adjusted. Her lectures had no structure and we barely got through any content. She is infuriating. Avoid!!!!",
        "course": "1101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was a class she only taught the first half of. Exams were very fair; you did really have to know your stuff, though. Skim the textbook chapter before coming to class and stay engaged in lecture. She will talk about current topics she finds interesting not in the book and you might find some of these on the exam. Answered my emails quickly.",
        "course": "BIO1113H"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "Practically all of the information has been taught in undergraduate classes - both here and at other institutions. She is always late and her worksheets consistently had errors that needed clarification YET she has the audacity to berate other students in front of everyone else if they are fifteen minutes late. Makes you feel stupid. Do not take.\n",
        "course": "BIOCHEM6761"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "I think she is easily one of the worst professors I have ever had. She is boring and does not stick to any path when teaching. Her lectures are all over the place and do not cover any major information and expect students to simply know it. She does not act like a professional at all. I was considering dropping my Biochemistry major.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "If you're taking 5613, definitely take it with Ottesen. She is very passionate about biochem and prepares your extremely well for exams (which are very fair). A lot of comments on here say she looks for specifc words, but I've never had a problem with her grading and I feel like I was graded fairly.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Ottesen LOVES biochemistry, which is inspiring and makes the class more interesting. She cares about her students and wants them to do well.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 5,
        "comment": "This class is very hard, and easily the hardest class I have taken at osu. Dr. Ottesen though is nice, caring, and empathetic. While going through illness and doing terrible on the exams she still encouraged me and I was able to pass, even with my health issues. Exams are very difficult but the curve is extremely generous. Read the textbook.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Ottesen is very peculiar. She's very smart but does not relate to her students level of knowledge on biochemistry. Go to every lecture and study hard, because she is a very tough grader. However, she does give fair exams. I advise reading textbook because she is not the best at explaining things on a simple level. Good luck, and put in the work",
        "course": "BIOCHEM5613"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "Friendly & cares about your learning, but teaches as if everyone knows the same amount of biochemistry as her. Her exams are all short essays but very fair. However, she is an extremely tough grader. You will think you did well on an exam then get it back and see -1 -2 or -3 on almost every question because she looks for specific phrases.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Ottesen is one of the best, if not the best professor I have ever had. She gives a great lecture, is always open to questions and to help you with whatever you don't understand. Her in class quizzes are easy, her take home quizzes are tougher but hey, they are take home! Her exams are all based on the powerpoints, but the grading is rigid",
        "course": "BIOCHEM5613"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class requires you to work hard and the details matter. These are upper level majors courses, they aren't supposed to be easy. Put effort into the course and Dr. Ottesen will put effort into you.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 2,
        "comment": "She is very sensitive to students correcting her mistakes. She also does not seem to appreciate students trying to engage in scientific dialog with her outside of what is written on the lecture slides. I would advise choosing another professor if you have an interest in Biochemistry.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "She takes off points for not mentioning extraneous information on exam questions. You can answer a question with 100% accuracy, and will lose credit for not writing details that were not prompted for in the questions. The exams are very easy conceptually, but the the grading is extremely subjective and not reflective of what the questions ask for.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 5,
        "comment": "She's great at confusing you. Every time she lectures, she has this big smile on her face basically saying \"I'm going to screw you over on exams\". Her questions on her exams are confusing! Re-read the questions multiple times to see what she's asking. She over complicates things and assumes that you know the topic before the class. Avoid her.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "Not fun",
        "course": "4511"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "I was so interested in biochem when we started. After taking her, my interest in biochem went down a lot. It's not even the material. It's just the way she teaches. She will talk about stuff in class that isn't even on the exam. Also, her exams are very vague on what to write. Majors can't avoid taking her because she's the only one who teaches it.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 5,
        "comment": "Honestly this class is a pain. The tests are completely written which is really annoying. You can write a ton and her TA's grade for specific words/phrases so your understanding is meaningless if you can't spit out. In the first 2 weeks we had a \"practice quiz\" which then ended up being graded because we were \"practicing drawing structures.\" Bad.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "I'd say avoid this proffessor if you can, but you can't. If you thought biochemistry was about understanding chemistry important life, change majors now. It's graded by blind memory. Learn to speak her language, she will not understand you otherwise. She has a weird thing on her tests, it's like all essays, never multiple choice. Expect the worst.",
        "course": "BIOCHEM4613"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 3,
        "comment": "This professor does not care about teaching the material. She is there because she is required to teach a certain number of classes and it's painfully obvious. She's very unclear, makes up exam keys on a whim, and incredibly short tempered. Take 4511 with anyone else.",
        "course": "BCHM4511"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Literally zero surprises from her exams.  Would highly suggest her to anyone out there.  Incredibly approachable and friendly.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Ottesen is so enthusiastic about biochemistry and what she does, it's contagious. She tests on what she teaches and provides detailed supplements to prepare for exams. There were no surprises, and you'll learn a lot at a good pace. I really enjoyed her.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is not helpful at all, ignores emails, and is honestly my least favorite professor I have ever had at this school.",
        "course": "BIOCHEM4511"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "Difficult class and final. Each exam has a page of pure memorization (Amino Acids, Lipids, etc.) and several essay response questions. The format of her exams allows you to show what you know, which was better than having a multiple choice exam. The final was VERY comprehensive and I scored significantly lower than midterms. Hard, but fair.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "She makes this class so much hard that what it really is. Questions on exams and tests are so hard and confusing. Don't take her!!",
        "course": "BIOCHEM5613"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "I don't usually rate profs. When I do, they are either super good or the opposite. Unfortunately, Dr. Ottesen falls in the latter category. She is super demanding but does not have an effective communicating skill that conveys her expectations. This reflects on her confusing exams. I wish OSU could listen to students and stop her from teaching.",
        "course": "BIOCHEM613"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 5,
        "comment": "worst teacher i have ever had. she basically reads from the slides, yet the slides don't make sense. SO many quizzes. she askes you to apply knowledge she doesn't teach or give references to study from. like throwing a stone in a pit. i have never had trouble with a class until i had her as a teacher. very unhelpful outside of class.",
        "course": "BIOCH613"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 5,
        "comment": "i learnt a lot from her class! She is demanding though.",
        "course": "BC613"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 5,
        "comment": "In general she's a good professor. Very enthusiastic about biochem and knowledgable about most of the content and many research topics. Although she could be confusing sometimes when explaining some research techniques; she might assume everyone to have learn some biochem lab already. However, I wish she could curve more generously though.",
        "course": "BIOCH613"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Ottesen is an amazing teacher. Favorite biosci prof ever. Fun lectures, very enthused. Lots of &quot;pop&quot; quizzes, but they're pretty easy. Never got below a B+ on one. Midterms and Final aren't bad either. She's NOT big on mechanisms :)!!! Just review the slides and do the hw prob's. There's office hrs too if you need them.",
        "course": "BIOCH613"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 4,
        "comment": "The best science class I've taking! Dr. Ottesen is an excellent teacher who is prepared above and beyond to teach this class. There are a lot of quizzes but she warns you about them and hints at what you need to know. They keep you on top of the material. Doesn't follow the book exactly but suggests questions to do. Exams are fair but challenging.",
        "course": "BIOCH613"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 4,
        "comment": "Nuissance is a better and appropriate word to call her but she will face hers. Not everone was meant to teach and this one in particular should stay in her lab because being a boring instrutor is not what students neccessarily want at the end of the day. 614 is a better class even with all the mechanism is still more fun than 613 will ever be.",
        "course": "BIO613"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Ottesen was an excellent professor.  She presented the material clearly and challenged the students to apply this material to new situations.  You have to work hard in the class but you learn alot!",
        "course": "BCH613"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 4,
        "comment": "If 613 had a different instructor i believe i would be a more fun class. Teacher was as useless as T.A. unnecessary many quizzes and no scheme of exams. which one had an option of taking the class at Capital University. But she has no choice probably be tenured. she should stay in the lab and OSU should keep looking for the person who can teach the",
        "course": "BIOC613"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 4,
        "comment": "she is pretty terrible.  she does not follow the book which would be fine if her slides were actually complete.  she is very knowledgable about research methods though.  but horrible at answering questions in a comprehensible way.  she also doesn't pass back exams or put up practice ones or tell you anything about the final",
        "course": "BIOCH613"
      },
      {
        "index": 38,
        "rating": 2,
        "difficulty": 2,
        "comment": "Otteson hazes students with random information and she has too many quizes.",
        "course": "BIOCH613"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.2,
    "department": "Biochemistry",
    "firstName": "Kotaro",
    "id": "VGVhY2hlci0yMTU0ODAx",
    "lastName": "Nakanishi",
    "legacyId": 2154801,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Super kind professor and absolutely passionate about biochem, but this class was difficult. Be ready to read the textbook several times (his suggestion) and put in LOTS of memorization time. Go to lecture/reviews because he often hints at common things he asks on exams and quizzes so that can give you the main areas to study for quizzes and exams.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Can't understand a word he says, gives 2 minute quizzes which are absolutely ridiculous, and expects you to memorize the stupidest things. A very nice guy, but the worst professor I've had at OSU. Do not take",
        "course": "BIOCHEM5613"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "very unorganized lecture. He let us memorize a lot of things but I don't even know why I need to memorize those materials. Test focus on memorization and concept applied question. H said read the textbook multiple times you will succeed-not true.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not be rude or disrespectful but, for someone with a PhD, he surely cant speak english. But I take offense when he tell me that I didnt say or wrote it properly, when half the time his own writing doesnt makes sense or has mistakes. He is brilliant no doubt but not a great teacher. BTW every biochem class/ section is same only quizzes and exams.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Kotaro is a very smart Professor. The class is hard and there is a lot of content. He is always available for office hours and when hes not available he makes himself available. He very helpful and explains to you why thing are they way they are. The quizzes are easy he tells you the content. The exams are hard but fair, memorization is key.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "I asked him for help, and he met with me for over an hour on a week that he was supposed to submit a paper for publication. He has a strong accent, but his thoughts are generally well organized, even if his words arent. On top of that, hes been involved in some top-notch research over the years, and hes always happy to chat about that.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Do whatever you can to take it with the other professor. He is a nice guy but it is actually impossible to understand him because of his really strong accent. Half the class doesn't even show up anymore. You have to read the textbook and teach yourself everything and the class is curved with the other section so you are at a huge disadvantage.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "AVOID taking this class with him if you care about learning biochemistry. Nice guy but could not care less about teaching. You have to read on your own. He cannot even read his own slides. very disappointed!",
        "course": "BIOCHEM5613"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "This professor is one of the worst I have ever had. He is a nice guy but, most lectures he spent the whole time just reading off the power points and trying to pronounce the words because he can't. He gave a bunch of quizzes at the end of every other lecture and barely gave you enough time to take them. Be ready to learn and read on your own.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Nice guy, but he should not be teaching. Very scatterbrained and basically just read off the powerpoints. The only way I was able to learn anything was from the textbook, lectures were pointless.",
        "course": "BIOCHEM5613"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kotaro is my research PI.  I can't speak about his courses, but as a person he is incredibly nice, willing to help you, and a good instructor.  He is from Japan and has a heavy accent, but you can piece together what he is saying.",
        "course": "BIOCHEM4998"
      }
    ],
    "SEI": []
  }
]