[
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.8,
    "department": "Biomedical Engineering",
    "firstName": "Ioan",
    "id": "VGVhY2hlci0yMzc0NjAx",
    "lastName": "Beldean",
    "legacyId": 2374601,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class was asynchronous and he uploads the lecture videos at least a day or two before class. Very lengthy lectures. Discussion posts are weekly and graded for participation at the end of the semester. Content isn't challenging. Just make sure you watch the videos and take decent notes. Beyond, he doesn't communicate much but he was very nice.",
        "course": "BIOETHC2010"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "I didn't like how he taught the class. For the first day, we went over the definition of bioethics for at least 45 minutes. So, he seems to emphasize concepts I don't care about. Attendance needs to be above 90% for students to get a 100% on top hat attendance. Midterm was super easy and final was just a lot of work. He's an easy grader.",
        "course": "BIOETHC2010"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great lectures and he really wants you to engage in the material through your own perspective. GO TO CLASS, it will really pay off. Papers were very easy and there were only two, but some advice, don't procrastinate on his take-home final, it seems easy but left alone will take you HOURSS.",
        "course": "BIOETHC2010"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Clearly passionate for the subject, and picks interesting and informative readings for the class. Easy grader. One of my favorite courses ever (and I've taken a lot).",
        "course": "BIOETHC2010"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "One midterm with a study guide (super easy) if you study even a little. Easy grader, just use a mix of the research he provides on Carmen and a mix of your own findings. Take home final was OPEN NOTE &amp; easy. Overall, a lot of writing, but enjoyable &amp; not too overwhelming.",
        "course": "BIOETHC2010"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's an awesome teacher it's like 4? long papers, 7pg, 8pg, 15pg. No exams. You have to attend like 80% of classes to get full participation credit but they're pretty fun even if you don't actually talk- it's cool material. Papers easy grader, I wrote all the day before it was due, got A's on all of them. Research heavy tho.",
        "course": "BIOETHIC2010"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4,
    "department": "Biomedical Engineering",
    "firstName": "Gunjan",
    "id": "VGVhY2hlci0yMTA5NDE5",
    "lastName": "Agarwal",
    "legacyId": 2109419,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Tough tests usually with a curve, heavy homeworks with busy office hours.  She is not a gifted lecturer but overall a decent teacher and decent class. I failed because I did not do the homework, kids don't fail ME 2010, its literally the one class in mecheng you cant fail. ",
        "course": "MECHENG2010"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Agarwal set up her class to be pretty difficult. You might feel like homework problems are too hard or test are harder than expected, but she makes up for the difficulty level with curves and extra credit. Her lectures were a little hard to follow at first but you get used to it. ",
        "course": "MECHENG2010"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She makes statics extremely easy and is very very understanding of the class's grades.",
        "course": "BIOMEDE4110"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's one of the most professional teachers that I have had while I've been in college for 4 and a half years.  With that said, she expects a lot from her students at the same time.  I learned a lot from this class but I would only take it if you are really interested in Bioimaging; and if you are, be prepared to work for your grade.",
        "course": "BIOMEDE4110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Biomedical Engineering",
    "firstName": "Rizwan",
    "id": "VGVhY2hlci0yNDUxOTUx",
    "lastName": "Ahmad",
    "legacyId": 2451951,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hands down the best lecturer I've had at OSU. It was his first time teaching the course and he nailed it, he really cared that his students learned the material well and was able to make difficult topics more understandable. I wish he would teach all my other BME courses.",
        "course": "BME4110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Biomedical Engineering",
    "firstName": "Samir",
    "id": "VGVhY2hlci0yNDQ5MjE5",
    "lastName": "Ghadiali",
    "legacyId": 2449219,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Nice enough person, can tell he's very intelligent. He's the BME department chair so pretty clear to everyone that he didn't care for this class. Often would come unprepared, cancel class, etc One of the most difficult BME courses, so unfortunate that there wasn't much guidance on HWs &amp; tests. Not a very lenient grader, just hope for good TA.",
        "course": "BME3703"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 2.9,
    "department": "Biomedical Engineering",
    "firstName": "Derek",
    "id": "VGVhY2hlci0yMDkzMDcw",
    "lastName": "Hansford",
    "legacyId": 2093070,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "While these other reviews make Dr. Hansford seem like a bad professor but are misleading. 2000 is a hard class to teach and be a student of. It tries to give each student an intro to each aspect of BME while trying to challenge the students to think for themselves as you will have to do in other classes. Ask questions if it doesnt make sense",
        "course": "BME20003703"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great Teacher, sometimes he doesn't explain concepts well, but don't be afraid to speak up in class because most likely many students are not understanding. Do not be afraid to ask questions! If you truly don't understand something, he will make you work for it, but he is nice enough to still help in the end.",
        "course": "BME2700"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Hansford was friendly but not a very good teacher. I think he struggles to explain things so students can understand. Homework was hell so you might as well invest in Chegg and make a study group. Exams were easy because they were exactly like the homework. They take off a lot of points for dumb mistakes on assignments so be aware.",
        "course": "BME2000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "I wanted to say that Derek wasn't awful. But honestly, he was. 2000 was weird. Homework was god-awful and counts for 40% of your grade, and half of the problems are so insanely difficult, with concepts brushed over in lecture. He is extremely condescending and not approachable. Don't expect to be rounded even if you're just under an A.",
        "course": "BME2000"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "Hansford knows his stuff, but doesn't explain it well at all. His HW is all online on chegg pretty much, but if you want to try it, you'll lose a lot of unnecessary points for tiny mistakes. Tests are super easy. Shows up late to office hours repeatedly and never apologizes for his lateness. Comes off very pompous and arrogant.",
        "course": "BME2000"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Goes really fast through the topics. At the beginning it was easy but got harder towards to end. Average at explaining concepts. The homework also got progressively tougher throughout. Just do the homework, clicker questions and quizzes and you should be fine on the exam. Since he went so fast, I never really ended up learning much.",
        "course": "BME2000"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Hansford did a good job covering a lot of material in BME 2000 in only a semester.  His tests were pretty easy, and often the multiple choice/short answer questions were taken directly from his clicker questions.  The homework was tough at times, but he was very helpful in his office hours for answering questions about it.",
        "course": "BME2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.5,
    "department": "Biomedical Engineering",
    "firstName": "Thomas",
    "id": "VGVhY2hlci0yMTUzOTUw",
    "lastName": "Hund",
    "legacyId": 2153950,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Pretty chill dude. Attendance matters for a grade, but lectures don't give a ton of info for the lab, and the labs are mostly straightforward.",
        "course": "BME2700"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "No need to buy textbook or do any readings. The lecture is essentially him explaining what you will do in lab. It is necessary to get a little creative in matlab for the take home assignments, and for this the coursepack is helpful. Free for anyone with a mac. Hund doesnt really do much. Helpful if you get stuck in lab or on HW.",
        "course": "BIOMEDE2700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.3,
    "department": "Biomedical Engineering",
    "firstName": "Sara",
    "id": "VGVhY2hlci0yOTU3NDAx",
    "lastName": "McBride-Gagyi",
    "legacyId": 2957401,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I enjoyed this class and also Professor McBride-Gagyi's teaching style. Due to the class getting updated, things seemed a bit unorganized but she did the best with what she could. Most assignments were given to make sure you understood (multiple attempts, no time limit, etc) and was far easier than a regular anatomy class. ",
        "course": "BIOMEDE2800"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "She means well, but comes off as incompetent. Will laugh at you if you don't understand something and goes off on tangents, giving politician answers to basic questions. Would recommend NOT taking 2800 and just taking real anatomy. Not a hard class, just a waste of time all around.",
        "course": "BIOMEDE2800"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "This professor doesn't care about the interests of the students. Whenever a question was asked, she would laugh in the student's face and not even answer the question. Testing material was always super unclear and not guidance is really ever given. Very difficult grader as well, despite not answering questions of students.",
        "course": "BIOMEDE2800"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. McBride-Gagyi was my favorite professor my freshman year. She is brilliant, and it was amazing to be taught by such an innovator in the field of Biomedical Engineering. She runs her own lab here at OSU and she would incorporate her findings into lecture so we could relate the material to something real. Super sweet and helpful, loved her!!",
        "course": "BIOMEDE2800"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.5,
    "department": "Biomedical Engineering",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0yODkxMjgz",
    "lastName": "Childers",
    "legacyId": 2891283,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "3701 consists of doing six labs and a final project. the labs themselves are fine, doing the post labs and notebooks is a pain (a lot for a two credit hour class). the final project is rough and she's a tough grader but there's opportunity for bonus. also lecture attendance isn't mandatory but lab attendance is and you will lose points if ur late",
        "course": "3701"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "attendance isn't mandatory but there are in-class assignments that you will get zeros for if you don't show up. she's a good lecturer and it's clear she cares about her students' success, but the TA's grade incredibly hard and will take off points for literally anything. the class itself is a lot of work but it's not super difficult",
        "course": "2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 4.2,
    "department": "Biomedical Engineering",
    "firstName": "Lindsay",
    "id": "VGVhY2hlci0xODM5OTk4",
    "lastName": "Tolchin",
    "legacyId": 1839998,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Tolchin is a great professor and advisor. She was always so accessible outside of class, and was always so sweet and considerate during advising appointments. I always met with her 1 on 1 to schedule and she has helped me so much, wouldn't be where I am now without her help. ",
        "course": "ENGR110005"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Lindsay was a good advisor and ran the class well. She taught us a lot of things that proved to be useful navigating college. The course projection assignment was extremely helpful. Understands that survey class should be minimal effort.",
        "course": "ENGR110003"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "Seems hate her job",
        "course": "ENGR110003"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is very nice and understands that survey is not supposed to be a very time-consuming class. The class was fun and helpful, though sometimes I wish it wasn't required to attend because some lectures seemed pointless.",
        "course": "ENGR110003"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lindsay is SUPER nice and helpful, I really liked having her as my survey instructor!",
        "course": "ENGR110003"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome and very nice.",
        "course": "ENGR110003"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1.9,
    "department": "Biomedical Engineering",
    "firstName": "Ben",
    "id": "VGVhY2hlci0yNDYxNDY4",
    "lastName": "Walter",
    "legacyId": 2461468,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "I felt dismissed every time I asked a question, and he was not very helpful overall. If you need assistance with the homework, your best bet is to attend the TA's office hours.",
        "course": "BME2000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "terrible lecturers, extremely confusing and contradicts himself. Gets out of breath talking and stumbles over words which makes it extremely hard to concentrate and understand the material presented. Homework is difficult and graded harshly",
        "course": "BME2000"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "He is nice and everything but when he taught it almost seemed as if he had never seen the information on the slide prior to presenting in front of the class. Sometimes when you'd ask questions he would not know how to answer or help. The class was just not enjoyable (very boring) and the homework was ridiculously hard unless you went to the TAs ",
        "course": "BME2000"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "It felt like he was just very nervous to lecture in front of people which made lectures jumbled and confusing. If you ask questions before or after lectures, he was much more helpful.",
        "course": "BME2000"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Try to avoid. Hard to do at OSU. Just doesn't really seem to know what he's talking about. Will blast music while you're trying to focus and grade homework on a few things.",
        "course": "BME2000"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad\n",
        "course": "BME2000"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 1,
        "comment": "Does not present in a cohesive and meaningful way,. Will often get things wrong and contradict himself on homework/lectures, and it falls on the student to reach out and correct him.",
        "course": "BME2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "Biomedical Engineering",
    "firstName": "Daniel",
    "id": "VGVhY2hlci0zMDExNzE4",
    "lastName": "Conway",
    "legacyId": 3011718,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was always really chill and laid back with homework assignments and deadline. he used a lot of real life applications in class and also will respond to emails quickly.",
        "course": "BME2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Conway is SO funny and made the class very entertaining bc it is a lot of lecturing. Was good about grading and basically we convinced him to drop a quiz. No midterms or final but about 6 quizzes - averages went up through the semester. Final paper and presentation w/ group wasn't that hard either. HW & some class stuff was graded but had 2 drops. ",
        "course": "BME2200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1.5,
    "department": "Biomedical Engineering",
    "firstName": "Stephen",
    "id": "VGVhY2hlci0yMTM1Mzc1",
    "lastName": "Lee",
    "legacyId": 2135375,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "He reads off the slides and when asked questions will once again read off the slides.  Multiple mistakes while grading exams.  4 exams 25% each, each exam is 25 points.  Therefore one point is one percentage point off your total grade.  The biggest mistake of my college career was taking this course.  Run for the hills!",
        "course": "BME4610"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 1.8,
    "department": "Biomedical Engineering",
    "firstName": "Alan",
    "id": "VGVhY2hlci0xODU2MzA2",
    "lastName": "Litsky",
    "legacyId": 1856306,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Litsky was one of the worst professors I've ever had.  He is a nice guy, but overall has no idea how to instruct a class.  I could never hear nor understand him in class.  He talks very softly and mumbles.  Many students fell asleep during lecture.",
        "course": "BIOMEDE4310"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not helpful. Mumbles and tells stories which are not useful in studying.",
        "course": "BIOMEDE4310"
      }
    ],
    "SEI": []
  }
]