[
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Chemical Engineering",
    "firstName": "Shang-Tian",
    "id": "VGVhY2hlci0yNTI0NDQ2",
    "lastName": "Yang",
    "legacyId": 2524446,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Please do not take this prof. He is senile, he reads his slides then we you ask him a basic question he has no clue what is going on. TAs frequently skip office hours. One time he wanted to show us some excel, and he forgot how to do it. We then proceeded to watch youtube excel tutorials during lecture(30min) until he figured it out.",
        "course": "CBE3521"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you're reading this, I'm throwing you a lifeline. I am sparing you from taking Transport II with Dr. Yang. I understand this class is taught through zoom, but this class is honestly an embarrassing product from Ohio State. Dr. Yang barely even understands his own solutions and he frequently makes mistakes. If you don't want a life, take this.",
        "course": "CBE3521"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Yang clearly cares about his students in class and wants them to learn and grow, however his execution of this is pathetic.  His course page is the most unorganized page I have ever seen by a mile, and I have seen some bad ones.  His lecture style is so fast paved and dry (awful combo) and he never understands what you are asking in class",
        "course": "CBE3521"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.1,
    "department": "Chemical Engineering",
    "firstName": "David",
    "id": "VGVhY2hlci0xNzUxNjAy",
    "lastName": "Wood",
    "legacyId": 1751602,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Professor Wood is rude, no matter how much work you put into the class he is annoyed if you ask questions. He goes over practice problems during class but is very bad at explaining his process and where numbers come from. Practice exams are exactly like midterms, making it easy to do well. There is a lot of homework however!",
        "course": "CBE2200"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Wood seems like a great guy but his class is just made too hard. He does not explain much about the chapter but rather just hops into example.s He goes through the examples in class but does not explain the reasoning behind anything. Then the exams are very hard. Seems like a nice guy, I just wouldn't recommend taking this class with him.",
        "course": "CBE2200"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "He uses a lot of examples but he doesn't go through them clearly. He uses a projector for his online course which prevents you from being able to read what he has wrote down. His tests are also too long for the allotted time compared to what other professor give their students and he waits for the last minute to make them. Would not take with him.",
        "course": "CBE2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wood is an amazing lecturer so you won't even need to read the textbook if you listen to him carefully. Also, he has the most generous grading policy you'll ever see. He's going to do the best he can do for all of his students to get A as long as you go to lectures and do the homework by yourself. So if you don't get one, it's your fault.",
        "course": "CBE2200"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "His lectures arent very clear but its evident he cares about his students. Head to office hours if you ever need help with the material",
        "course": "CBE5765"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Wood is a good professor- he really knows his stuff and is accommodating with scheduling homework and exams to benefit the students. It's good to go to class because the problems he does in class are very much like you'd see in his exams, and the homework is for extra mastery. From what I heard his 2200 section is easier than Clay's.",
        "course": "CBE2200"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Wood is a really intelligent guy but he is most definitely not the best professor. He is very disorganized in his work and with the practice problems he gives you. There are no solutions to the problems of the day and most exams do not have worked out solutions. Makes a simple class very complicated. Curves like a god, 77 curved to a B.",
        "course": "CBE2200"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Wood while very intelligent isn't great at explaining what he is doing.  Tests are very difficult but he gives a generous curve at the end of the class.  The text book and his answer keys have many mistakes.",
        "course": "CBE2200"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not very organized, while Dr. Wood is a very intelligent down to earth guy, he is very preoccupied with activities other than teaching. A lot of the answer keys he sends out to homework and practice exam problems are incorrect and at times you have no idea what to expect in this class. Overall he is a solid guy and is very smart.",
        "course": "CBE2200"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "At first I thought Dr. Wood wasn't the best prof. After being in Chemical Engineering department for a few semesters now, I have realized he was amazing compared to some of the other professors.  His test are very difficult and makes you pressed for time. Take Dr. Wood because you WILL get a good grade. Curves like a champ.",
        "course": "CHE2200"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Never in my entire academic career of over 200 credit hours have I ever encountered a professor that made such straight-forward material confusing to the point where you kick and scream the entire way to the end of a semester. Most of the confusion from this course is rooted in terrible communication on behalf of the professor. You have been warned",
        "course": "CBE2200"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worst entry CHBE teacher possible. Spent a lecture saying how he wouldnt put a specific problem on an exam because it would be really cruel so dont study it, then proceeds to do the exact opposite. Comes off as pompous, arrogant, and doesnt finish examples. On the plus side I have friends who have done research with him and say hes a nice guy.",
        "course": "CHBE2200"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is a decent professor, but can get distracted in class easily. HW was only graded for completion, but was worth a very low percentage of the overall grade. DO THE HW ANYWAY it will help you immensely on the tests, which have very low averages and very large curves.",
        "course": "CBE2200"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr Wood is a great teacher but sometimes he can be frustrating. Often times class will be pointless because he will just ramble on the whole period about nothing but you never no when it will be so you can't just plan to skip. He does a ton of example problems in class though which is nice. He would say strange things at times but was funny also.",
        "course": "CBE2200"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is a really helpful prof. His MTs are pretty hard (acg 50) but he promises a large curve. ChemEng is a tough major and 2200 is the easiest class in CBE (Dr.Wood said that) so be well-prepared.",
        "course": "CBE2200"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "David Wood single-handedly taught me how to be a Chemical Engineer. His tests were hard but extremely fair. Averages in the 50-60 range but the curve is ridiculous. Go to office hours and do the homework/worksheets conscientiously. If you see him and show a genuine willingness to learn, he will respect you. Decent prof., even better human being.",
        "course": "CHBE200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.6,
    "department": "Chemical Engineering",
    "firstName": "Xiaoxue",
    "id": "VGVhY2hlci0yNTQ3Mzkx",
    "lastName": "Wang",
    "legacyId": 2547391,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love this man. would die for him. want him to hold my cat. ",
        "course": "CBE3610"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Pros: -VERY good lecturer. Explains things super well in simple, normal language. -Homework and Attendance help &quot;pad&quot; grade. -Gives fulfilling help during scheduled OH. Cons: -Doesn't reply to emails consistently and forwards all inquires to TAs when outside of lecture and OH. -Sample final exam not really representative of the real final exam",
        "course": "CBE2420"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "The exams were fairly straight forward. Attend class, do the homework, and you will do well in the class. Her lectures are very boring, but she shows you everything you need to know how to do. Plenty of office hours and TAs to help. One of the top ChemE professors at OSU",
        "course": "CBE2420"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Has a clear workload and is flexible with deadlines. Her and TA's offer plenty of office hours, and they all want you to understand material. Gives a very clear picture of what will be on exams, and is more than willing to answer questions. Really cares about her students learning!!",
        "course": "CBE3610"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had Dr Wang her first time teaching. She is somewhat dry, but overall does a good job of explaining things clearly. She generally gives you a very good idea of what will be on the exams. The only thing I didn't like was that she crammed a lot of material in right before the final after going over solving for velocity profiles longer than needed.",
        "course": "CBE2420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.6,
    "department": "Chemical Engineering",
    "firstName": "James",
    "id": "VGVhY2hlci00NzA4MjU=",
    "lastName": "Rathman",
    "legacyId": 470825,
    "numRatings": 33,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors in the CBE department and at OSU in general. His slides are thorough, his lectures are engaging (despite having a very soothing voice), his assignments are clear and interesting, and he cares a lot about students and teaching (even as a tenure-track professor). Take him if you can, for any class.",
        "course": "CBE5790"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Rathman is a great professor. He knows how to explain topics in a way where students can understand the material well. There are so many lecture notes though and lectures can be dry at times. Assignments were straightforward and he was always willing to help students.",
        "course": "CBE5779"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Took him for Mod &amp; Sim and Thermo and I can easily say he's one of my favorite professors. Did not require previous coding knowledge which I really appreciated. His lectures are what makes him so special because he goes beyond the standard and puts everything into perspective in a very inspiring and insightful way that makes you think beyond chem E",
        "course": "CBE5790"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Rathman is the best professor at OSU, bar none. I've taken 3 classes with him (Thermo, Exp. Design, Model &amp; Sim.). He's willing to be flexible with homework/tests if you have personal life issues. Dr. R is the prime example of what a college professor should be - putting the education and growth of his students at the top of his priorities.",
        "course": "CHBE5790"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Rathman is an absolute gem, the best professor I've had in my undergraduate career. His classes are tough but if you put the work in, youll get the grade you deserve. He's an inspiration, he's kind, he gives great pep talks, &amp; actually cares about his students. I have taken all his electives, because he's that good. Can't say enough good things",
        "course": "CHBE5779"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's a good teacher. Go to lecture and office hours and make a sincere effort to learn the material and you're fine. He's very knowledgeable, witty and sassy (at times). He's reasonable about exams (timing is rarely an issue) and grading. Don't expect a curve.",
        "course": "CBE3508"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. Not too easy where you don't learn anything, but doesn't go out of his way to make things hard and complicated. Still a difficult class (since it is Thermo) but he makes it manageable. Very fair, very funny, homeworks are actually relevant to exams. 10/10, great guy. Only good prof in the Chemical Engineering department.",
        "course": "CBE3508"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "I wish Professor Rathman taught every CBE course. He is dedicated and has a way of explaining things that helps everything to click. Unlike many professors, he feels if his students do well, it reflects that HE does well as a teacher. His courses are tough but fair, and plenty of learning resources are provided.",
        "course": "CHBE3610"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Rathman is an incredible professor, and he deserves the award he received from the University President for teaching. His PPT slides are very funny and he is very clear in explaining both all the concepts and what he will emphasize on the test. He actually made Thermo somehow fun.",
        "course": "CBE3508"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is wise and a great teacher, work hard and you will get",
        "course": "CBE2200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Rathman is a fantastic professor: he made this course incredibly interesting and fun and is respected by all of his students. He is one of the best professors in the CBE department and you know that any class taught by him will be enjoyable and engaging.",
        "course": "CBE5790"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Rathman is a professor who \"gets it\"; he always takes a step back from the tiny details of the course material and strives to show the applications of the material, he knows that students are human beings and he simply knows how to communicate the material in a way for 20-something year old students to clearly understand an important subject.",
        "course": "CBE5779"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of my favorite professors! He wants you to learn the material and provides you with everything he can to help you. This class is about how much work you want to succeed. Do your work and Rathman will certainly help you get there.",
        "course": "CBE2200"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Rathman (aka Professor X) was a phenomenal professor. I feel like I have a really good foundation to carry me through the rest of the CBE courses. His tests are fair, he revisits topics from homework or worksheets but sometimes he will ask questions that were discussed while working out a worksheet (conceptual questions.",
        "course": "CBE2200"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "good class that Rathman clearly has an interest in teaching.  he's a great professor, too.  I think this class should almost be required; has lots of application to real world.  homework every other week or so, exams are just like his practice exams.  only 2 MTs and a final, though.  I would definitely recommend this class",
        "course": "CHBE5779"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "easily one of the best ChBE profs out there.  all lectures are powerpoint slides on Carmen, but attendance is mandatory (worksheets for a grade every couple classes).  lectures can be dry at times.  exams are almost exactly like practice exams, so focus on those.  homework once a week, no more than a couple hours.  lots of matlab too.",
        "course": "CHBE3610"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Rathman is one of the best professors I have encountered at OSU. Super clear in all of his notes and he is always happy to answer questions (unlike some of our other chemical engineering professors). Just a great guy all around.",
        "course": "CHBE3610"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Rathman is easily one of the best in the college of engineering. His homework sets can be tough, but paying attention in lecture and reviewing his examples is key. After taking his class I emailed him with questions regarding a MATLAB program for a different class. He was very helpful, even though it was not his job. Great guy.",
        "course": "CHBE3610"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good professor.  Fair tests, great notes.  However, useless for office hours.  Leaves you with the feeling that his time is too important to help you",
        "course": "CHBE3610"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures I consistently found to be boring and put many of the classmates, who decided to attend, to sleep.  Before the final, another classmate and myself asked Dr. Rathman a question and he said it wouldn't be on the exam.  It was one of the five questions.  Needless to say, I did not and still do not appreciate that.",
        "course": "CHBE779"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is not an easy professor, you really have to work for your grade. Midterms and homework are fair and really help teach the material but final was terrible. He only gave one A. lectures were kinda boring",
        "course": "CHBE200"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 4,
        "comment": "Amazing Professor. He expects alot out of you, but will be extremely helpful with any thing you ask him. Great lectures and lecture slides make reading the book unnecessary. One of the best professors I've ever had.",
        "course": "CHBE779"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Hands down the best professor I've ever had at the entire university.  He is extremely helpful and is always willing to answer questions you might have.  Gives very good (sometimes boring) lectures and is very clear.  I've had him for three classes and plan on taking him for one more.  Definitely take a class with him if you have the opportunity!",
        "course": "CHBE717"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Rathman is a great professor.  His notes are crystal clear and easy to follow.   The homework and exams are challanging, but deffinately not impossible.  Be prepaired to work for your grade if you have this professor, but also know that you will learn a great deal about the subject matter.",
        "course": "CHBE200"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Rathman was still extremely helpful with this class, but the subject matter turned out not to be as interesting as I had thought it would be.  The lectures pretty routinely put half the class to sleep, and the homework tended to be pretty repetitive.",
        "course": "CHBE779"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "I wish all professors were this good.",
        "course": "CHBE200"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Quite simply, he is the man. Shorter homeworks would be the only way he could possibly improve.",
        "course": "CHBE610"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor.  Willing to teach outside of classroom if you ask.  Makes material seem very easy.  Take this Professor if you get the chance!!!",
        "course": "CHBE200"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great teacher! My favorite in the chemical engineering department.",
        "course": "CHBE717"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Dr. Rathman many times over the course of my undergraduate education.  He is one of 2 profs who really cares about the students and making sure they understand the material.  He's not an easy professor, but you can always count on him to be fair and help you when you ask.  Wish I had him and Dr. T for all my classes!",
        "course": "UNDERGRADCHE"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "I thought Dr. Rathman was a very good teacher.  The worksheets he used in lecture helped me learn how to do the problems, and he seemed to be available pretty often (even outside of office hours) to help students.  Good guy - take his classes if given the chance.",
        "course": "CHE200"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is a terrible teacher.  His lectures are useless and you need to read the book to get anything out of the class.  He is also very unyielding and will not help you a whole lot.",
        "course": "CHBE200"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 4,
        "comment": "Nice guy, and very clear lectures.",
        "course": "CHBE200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4.5,
    "department": "Chemical Engineering",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0yNDkwMzc2",
    "lastName": "Maxson",
    "legacyId": 2490376,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Maxson does a great job of running the Unit Ops lab at OSU. It is Unit Ops, though, so it's going to be a lot of work and it will be hard at times. For some of the labs, you will absolutely need your Separations textbook (Geankoplis). Use your TA and don't be afraid to ask Dr. Maxson, too; he's very easy to talk to.",
        "course": "CBE3632"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "Unit ops in general is rough because of the lab reports but the lectures from Dr. Maxson were well prepared. Make sure you take good notes because the exams go into a ton of small details mentioned in the videos. Dr. Maxson is also a really understanding and nice professor to talk to.",
        "course": "CBE3631"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's always willing to answer questions for not only class materials but also things unrelated to class. He's very helpful and concerned about his students.",
        "course": "CBE3631"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Down to Earth instructor who cares deeply about student safety and comfort.",
        "course": "CBE3631"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Chemical Engineering",
    "firstName": "Xiaoguang",
    "id": "VGVhY2hlci0yODgwNjY2",
    "lastName": "Liu",
    "legacyId": 2880666,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Liu is an amazing professor who really wants everyone to succeed in her class. Transport 2 is a difficult class in general, but Dr. Liu has actually made this class enjoyable. I am currently a senior, and I can confidently say that she has been my favorite professor during my time at Ohio State. She is a gem! ",
        "course": "CBE3521"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.4,
    "department": "Chemical Engineering",
    "firstName": "Kurt",
    "id": "VGVhY2hlci01NzY3NzE=",
    "lastName": "Koelling",
    "legacyId": 576771,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Koelling is a good professor. His notes are great resources and the homeworks/worksheets were helpful in understanding the material. Overall, the mass transfer materials were lacking which made it more difficult at times. The exams were straightforward and the group project was actually enjoyable.",
        "course": "CBE3521"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you actually care about anything related to Transport/Chemical Engineering/Your Grade, do not take Dr. Koelling's class. His lectures consist of him reading off of his slides, which you can do yourself. He also expects you to know Matlab out of nowhere, and a portion of the group project is due right when you come back from Thanksgiving break.",
        "course": "CBE3521"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lectures are exceptionally clear. This dude is really, really good at communicating course content. Exams weren't terrible but I sometimes felt like there was a bit of a time crunch. Small curve at the end.",
        "course": "CBE2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is great professor. The worst thing is that there are exams every 3 weeks but the exams were fair and relatively straightforward. The material could be quite boring, but he was very organized and I found his lectures very helpful. Homework can be long and hard but if you start early there are many opportunities to get help.",
        "course": "CBE2200"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "he is presentation layout is boring but it has good material although it is hard to understand. he is a great teacher but he just needs to not be so bland",
        "course": "CBE3521"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Reads from slides throughout. Slides don't make much sense. Lectures more boring than an unseasoned salad of dried broccoli, turnips and celery. Homeworks and tests full of errors that the TAs had to manually fix while grading. Doesn't follow up on posting material he said he would. Doesn't explain concepts well.",
        "course": "CBE3521"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lot of given material to study from throughout the year. And the practice midterms that are given are very helpful come test time (almost the same).",
        "course": "CBE2200"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Material is boring but that's to be expected (he sure doesn't help). But overall I thought he explained the material clearly and was very fair on exams.",
        "course": "CBE2200"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very Unorganized, makes it difficult to keep track of what material you are responsible. While the material itself is not very challenging, keeping track of what you are responsible for knowing is.",
        "course": "CBE3521"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "Not a bad professor but he made even interesting things become boring. If the color beige could become a person, it would be Kurt Koelling",
        "course": "CBE3521"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "The textbook is way more valuable than the lectures will ever be. Exam averages for my class went 80, 90, 45, 70 so its kind of all over the place.",
        "course": "CBE2200"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "taught similarly to his transport2 class with notes from slides that are posted on carmen. lots of derivations on the board so attendance is pretty important. long homeworks (3-5 hours almost every week), but exams are relatively easy and graded easily. project is on your own topic in partners, graded easy. never used book except for openbook exams",
        "course": "CHBE5775"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class was a little boring, but when I was awake he taught well.",
        "course": "2200"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "Koelling is a really nice guy, you just have to get to know him outside of class. He writes some pretty hard tests, so be prepared to have a curveball or two. Better than other ChemE profs from what I have heard; but if you have the option between Koelling and Clay... always pick Clay. (He's easier than Koelling)",
        "course": "CBE2200"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kurt Koelling was what you expect in a professor. He was clear and understandable in lecture. The homeworks were manageable, and his tests were hard but fair. If you did not study you would not do well but if you put some time into reviewing the material you would do well. I would have him again as a professor if I could.",
        "course": "CBE2200"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 5,
        "comment": "Overall the class was very challenging. 5 hours of homework per week on excel spreadsheets. Exams were manageable if you did the homework well, however it was very difficult to pay attention because his voice is soft and makes you want to go to sleep. Class is generally small.",
        "course": "CBE5775"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Overall, class was very work intensive. Average workload was 5-6hrs per week and class average was a B. However his voice is very soft and puts you to sleep.",
        "course": "CHBE5775"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "Homework problems were long but were helpful for the exams and he was always willing and able to help.  His exams were tough but fair; except for our last midterm (4th of 4 total) where he intentionally gave us an impossible question so he could drop the class average.  Other than the 4th midterm, I enjoyed him and the class.",
        "course": "CHBE2200"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Koelling was a great professor. Direct and to the point, making sure you have clear expectations for the class- including exams and homework. Will definitely try to get into his class for future ChBE courses!",
        "course": "CHBE2200"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Overall an above average CBE teacher and an average teacher otherwise. He isn't very involved in the class itself and relies on slides and TAs to do much of the heavy lifting. Exams were fairly straightforward. Both the homework and the group project  can be tedious and both require significant guidance from TAs in order to be successful.",
        "course": "CBE3521"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 1,
        "comment": "I would rate Dr. Koelling as an above-average professor.  Class is sometimes boring when he over-relies on the slides; but I still recommend attending for the many homework and exam hints he provides.  The homework load is very reasonable (for a CHBE class) and the exams were straightforward and similar to the practice exams.",
        "course": "CHBE3521"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "koelling is an ok prof.  reads off powerpoint slides for lecture (posted on carmen).  gives out plenty of hints in the days leading up to the exams so that exams aren't too difficult.  homework is about 5-10 hours per week, graded.  don't buy the book; i've never opened it and will get an A in the class",
        "course": "CHBE3521"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "very nice guy, easy to talk to. coursework is difficult to understand at times but he's never had a problem helping me understand things further during his office hours. it would be possible to read straight from the book and never come to class but the techniques become a lot more clear once you see them in action.",
        "course": "CHBE200"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a pretty good class, and it's Koelling's specialty so he's good at explaining it.  Pretty light workload for a 700-level class.",
        "course": "CHBE775"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nice job overall, very nice guy and his explanations are pretty good. Known in some parts as &quot;Killa&quot; due to his hard test, and seems a little sadistic sometimes when it comes to said tests. You'll learn a lot but your grade might not appreciate it.",
        "course": "CHEME201"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Kermie is a very nice guy, and I am probably complaining because I am not doing so well in his class, but I think he does a good job of drawing out and complicating the subject matter so it's painful. The stuff he puts on WebCT is like poo on PDF and I want to reach into my computer and rip it up!:)",
        "course": "CHEME201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.3,
    "department": "Chemical Engineering",
    "firstName": "Barbara",
    "id": "VGVhY2hlci02MjY0ODk=",
    "lastName": "Wyslouzil",
    "legacyId": 626489,
    "numRatings": 39,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "I believe Prof. Wyslouzil is very nice and wanted everyone to perform well, however, the material was taught in a boring manner and the class structure was very repetitive. She definitely knows the subject of chemistry very well, I just don't think she is the best at explaining concepts for students to understand.",
        "course": "CHEM1210"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "If I asked her a question during her office hours she would try to guide me to the answer in a really long winded and confusing way. Sometimes she was straight up nasty. She puts students on the spot all the time during review sessions - so don't even think about going to those unless you're ready to explain every answer in front of the whole class",
        "course": "CHEM1210"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "She had good slides that were available online",
        "course": "CHEM1210"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very nice professor and keeps students engaged during lectures. As others have said, the professor in 1181 doesn't impact grading much, so can't speak to that. Very helpful if you ask questions though, she makes herself very accessible! Makes the course easy to get a good grade in as long as you put some effort in to it.",
        "course": "ENGR1181"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Genuinely great professor. She cares a lot about the students and making sure you do well. The course is extremely straight forward and easy - but she will not hesitate to fail students even though the course is only taught in the fall.",
        "course": "CBE5771"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "In 1182, your professor means almost nothing as your TA's will do all non exam grading (and exams mean almost nothing). Prof W was awesome with her bright spirit and definitely enjoyed working with us and took the time to get to know us. Easy class no matter the professor, and W is definitely one of the best",
        "course": "ENG1182"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Doesn't really know much about MATLAB, but honestly your professor in 1181 doesn't matter at all . There are so many outside resources in this class that your professor doesn't matter. Your grade depends on the TA you get, which is totally by random. ",
        "course": "ENGR1181"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had her for Engineering 1182 so I can only speak about that. She loves teaching engineering and gives the class a friendly vibe. ONE OF OF NOT THE BEST PROFESSORS TO TAKE ENGINEERING 1182 WITH. She doesn't teach many engineering courses but if your lucky enough like me to have her, consider yourself blessed.",
        "course": "ENG1182"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "I honestly wouldn't have passed without her helpful office hours. The chemistry at OSU can only be described as sadistic and brutal. However, If you have Dr. Wyslouzil as your professor, you have a chance! ",
        "course": "1210"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She made this class super easy.  She was really nice but her lectures were really boring.  Loved having her for a professor.  Read the book and you'll def get an A",
        "course": "CHEM1210"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "My lab/recitation TA was horrible for this course, but I loved her lectures. She did have to go back and double check some things that were wrong in her slides, but she always corrected it. She held review sessions before exams where she went over practice exams pretty much identical to her own. If you read the textbook you should be fine.",
        "course": "CHEM1210"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very nice, though sometimes unclear on the material. When this happened, she usually sought input from the TA?s and other professors in the department and got back to us with a better answer once she had one. Somewhat quiet voice, though, so if you get put in the back of the room you might not always hear her, especially if the mic isn?t working.",
        "course": "ENG181"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the better professors I have taken a course with",
        "course": "CHBE771"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Read the book, &quot;A&quot; guaranteed! She is very clear; her exams were a piece of cake, seriously. Loved her class!! My favorite chem professor at OSU.",
        "course": "CHEM121"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "A very nice professor. Go to lectures; and most importantly read the text. make sure u understand every thing in z book.If u do all the examples in the book, &quot;A&quot; is guaranteed in the class.",
        "course": "CHEM121"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 5,
        "comment": "She is definitely passionate about chemistry, however, she lacks the ability to effectively explain things.  She held extra review sessions before each midterm and final.  I attended all of these and each one was not very helpful.",
        "course": "CHEM121"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 5,
        "comment": "This teacher is horrible. I really wished that I read this website before I joined her class. Her exams are almost impossible and she loves to pack too many questions in too short of a time. Avoid at all costs!!!!",
        "course": "CHEM121"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "For Chem 121: was a dfficult class, midterm 2 was impossible and final is very very difficult, but she is very helpful if you go to her office hours. Every Friday, she does an experiment (sometimes interesting, sometimes just a waste of time).",
        "course": "CHEM121"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "none",
        "course": "CHEM121"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "she was not helpful and the second midterm was impossible",
        "course": "CHEM121"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "HORRIBLE. DROP THE CLASS WHILE YOU STILL CAN.",
        "course": "CHEM121"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "No. just no. She seems nice and well intentioned so I don't want to personally slander her but I absolutely hated this class with a passion. She is not a very clear teacher by a long shot and the lectures just made me feel inadequate. Choose Woo if you can, I heard that's an easier class. Our lecture average at the end of the year was a 41%.",
        "course": "CHEM121"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 5,
        "comment": "Hard to keep this PG, the frustration this woman gave me and my class. Bottomline if you have a choice to choose between her and another professor, CHOOSE the other one. She relies on T.A's too much, she is pompous, and you'll feel worse off in the end then when you started.",
        "course": "ENG183"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 5,
        "comment": "Lectures weren't very clear nor helpful. The 2nd midterm and final were extremely hard. I would recommend avoiding her if you can.",
        "course": "CHEM121"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lecture was helpful but exams and quizzes were really hard. Make sure to read the book if you're not sure about something. (FYI there was no curve for my class, though many people tell me there would be)",
        "course": "CHEM121"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 5,
        "comment": "She is kind of tough.  Her exams are the worst part.  Lecture are alright, boring some, helpful some.  The balloon explosion is the best part.",
        "course": "CHEM121"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "Pretty good professor. Talked non-stop through lectures and had examples. She went over any questions in office hours and held study sessions. Overall pretty helpful and nice.",
        "course": "CHEM121"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is very creative in her teaching, but she packs a mean exam.",
        "course": "CHEM121"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 5,
        "comment": "She makes you take a lot of power-point notes... and talks at the same time. Which, depending upon your learning style, could make you or break you. For me, it doesn't work out too well. I'd rather just take notes w/ out the talking. Basically, I comprehend nothing when she's teaching.",
        "course": "CHEM121"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 5,
        "comment": "I didn't know it was possible for a chem professor to be so totaly clueless in chemistry&#63; Find a different teacher... you'll be happy you did!",
        "course": "CHEM121"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 4,
        "comment": "She basically just teaches exactly out of the book. Even her diagrams are copied from the book. She tries to mix it up by writing on the board...except no one can see it. Basically if you've had Chemistry before, don't bother going to lecture.",
        "course": "CHEM121"
      },
      {
        "index": 32,
        "rating": 2,
        "difficulty": 3,
        "comment": "Terrible. I learned nothing from this professor. While in class I imagined myself jumping in front of cars in order to keep my mind from crashing due to absolute boredom.",
        "course": "ENG183A"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 3,
        "comment": "I didn't learn anything from this professor.",
        "course": "ENG183A"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 5,
        "comment": "terrible professor. very disorganized. she wasnt sure what she was talking about most of the time. test were always unfair. lecture are a waste of time, just read your book.",
        "course": "CHEM121"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "CHEM121"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof W was decent, kind of boring but ok.  The material was dry and boring, partly from AP chem in high school, same stuff.  Exams aren't bad, pay attention in class and you'll fine.  some questions could trip you up though.  Quizzes were easy and topical.  Struggle some days to stay awake.",
        "course": "CHEM121"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 5,
        "comment": "Terrible teacher...  If you get her for Chemistry 121, either find another lecture to go to or open that book every night... Total waste of time...",
        "course": "CHEM121"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 2,
        "comment": "I thought she was decent, not great. She confuses herself kind of easily and isn't always well prepared, so if you need good organization you might have trouble.",
        "course": "CHBE523"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 3,
        "comment": "Wyslouzil teaches 183 nano, and you won't even know you are taking it until it's too late.  She is terrible.  She is always late, has no idea what is going on, and relies on the TAs to bail her out.  Yet she still expects you to have all the work done on time, even though she cannot explain how to do it. Watch out for her TA Ben too...he's an ass.",
        "course": "ENG183"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3,
    "department": "Chemical Engineering",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0xOTA2MTM0",
    "lastName": "Hall",
    "legacyId": 1906134,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Unclear about to test expectations, poor preparation",
        "course": "CBE4624"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor! I have annoyed here with so many emails and questions and she was very helpful and even got out her way to find extra papers. Definitely one of my favorite professors.",
        "course": "CBE5194"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Hall was a very good professor. She has a very different philosophy from many other ChemE professors in her testing, and exams are very straightforward and similar to her practice exams. If you take the class seriously, it should be a fairly easy A.",
        "course": "CBE4624"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Controls theory naturally has a lot of math. Hall does the derivations quickly because CBE4624 is not a math class. If the derivations confuse you, it's b/c you don't get calculus (your problem). Hall's exams are crazy easy, that's why her grading criteria are \"strict\" (i.e. clear). 2+2 is never 5 however many justifications you can come up with.",
        "course": "CBE4624"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Lisa Hall below average professor. Material should be easy but she somehow finds a way to make it long and confusing  with the derivations.  The tests are grading towards a very strict rubric and points missed are not because you don't understand something. Content + teacher made this class not very enjoyable ",
        "course": "CBE4624"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Hall is a great Process Controls teacher. She clearly likes the topic and wants you to learn it. Her exams are very fair and generally easy. Great professor. ",
        "course": "CBE4624"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "no notes on carmen, everything is on the board. one-page cheat sheet for exams, which are usually pretty similar to practice exam posted. homework weekly, 1-2 hours maybe (solution manual available online for most questions). not a huge fan of hall, but there aren't many alternative options for controls. borrow the book to get hw questions.",
        "course": "CHBE4624"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "I'm not sure if it was her decision to go with a flipped class but regardless it was a horrible one. She lectured maybe 3 times all semester and multiple TAs called her a \"glorified TA\". She was extremely hard to follow when explaining things. Avoid he for Separations at all cost. My only grade below an A- in the CBE department.",
        "course": "CBE2523"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worse professor at CHBE department",
        "course": "4624"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 5,
        "comment": "The ChemE curriculum is not a joke. She wants you to work for a good grade.",
        "course": "2523"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.6,
    "department": "Chemical Engineering",
    "firstName": "Nicholas",
    "id": "VGVhY2hlci0xODkxMDkx",
    "lastName": "Brunelli",
    "legacyId": 1891091,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "What was taught in lecture seemed elementary compared to the exams. He was disorganized in lecture (equations will not add up) and does not give solution keys for midterms. Most of the final answers on the homework relies heavily on MATLAB, homework solution does not give full solutions. Did not learn as much as I wanted to from this class.",
        "course": "CBE3610"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's clear about what he wants from students. His lectures are clear and focus on the topics you need to know in the class. His open book exams are fair, time-friendly and concept heavy. You need to know what you're doing to get through him. As in any CBE class, it's going to be hard. You'll have to work for it. His grading is a bit annoying though",
        "course": "CBE2523"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's a really nice guy and helpful if you talk to him but the way he grades is annoying. Even if you get to the right answer if you don't writ every little detail he wants, he deducts points. He gave extensions on several homework assignments which was nice but to be fair, nobody knew how to do it so..",
        "course": "CBE3610"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Brunelli was the tougher section. If you put the time in to learn the material, you would do well. He was very willing to help students and made lectures enjoyable. Fair exams, long homeworks. In the end, worth it. Separations is an important class for the rest of the cheme curriculum.",
        "course": "CBE2523"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr Brunelli is a challenging and engaging teacher. He answers email questions promptly, but not often thoroughly. For exams he will give problems that are a changed format from the homework problems; I felt they were too tricky. If ChemE comes easily to you, you'll do well. If not, expect to study hard and struggle.",
        "course": "CBE2523"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Brunelli is a pretty good teacher. My only criticism is he could be more clear in his teaching of the material, but he was very willing to answer questions. He was genuinely interested, and well prepared. While he doesn't curve, he does do a 'grade adjustment'. Overall, I felt this section was more rigorous than the other section of the course.",
        "course": "CBE2523"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Brunelli was not a great teacher.  He knew his material, but really did not convey it clearly. He taught the first unit well, because the topic was so easy. When we got into leaching/LLE, you'd better read the book because his lectures are unhelpful. He had much lower averages than the other prof and did not curve, either. Would not recommend.",
        "course": "CBE2523"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loves zeolites.  Can't draw straight lines. Hilarious.",
        "course": "CBE2523"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Brunelli is a great professor. His lectures are interesting and he always makes jokes that liven up learning separations. He really cares about his students learning the material and is there to help. Separations has a lot of content, so be prepared to read the book and do the homework for understanding rather than to just get it done.",
        "course": "CBE2523"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Brunelli was new to teaching a class but as the semester went on he got significantly better at teaching. If you emailed him he would some how respond immediately no matter what day or time of day it was. He is a great guy and loves to help.",
        "course": "CHBE2523"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "Easy class at the beginning, hmwk took a while to do but, was generally examples out of the book. First two test you could do well if you were dead, third one was like a normal chbe test, final was like hell, except worse. Nice guy, puts powerpoints online so non-essential to go to lecture. But, decent class overall. ",
        "course": "2523"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Brunelli was new to the department and I had him his first time teaching the class.  He only got better as the semester went on and he is always around the ChemE buildings if you ever need help. Good guy and definitely invested in what we thought of his class so he could improve.",
        "course": "CBE2523"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "First 2 midterms: easy. Averages were extremely high. 3rd midterm he took it up a notch, but it was pretty fair. The final was insane (I think I got a 65%). Still ended with a good grade. I can't remember how to do much in this class. I just studied right before the exam and forgot it right after. I didn't care much for this class.",
        "course": "CBE2523"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "He was new to the department and unfortunately it showed for the first half of the semester. He got much better and was very helpful in lecture/email. Made good use of Carmen discussions for HW/Exams. His midterms were easy but the final was a joke, much more difficult than anything learned or discussed--not a fair assessment of the material.",
        "course": "CBE2523"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "New prof to the dept, has a good vision for what he wants his class to be.  1 HW/week, plus 1 group HW every other week.  3 MTs and a final, not cumulative; fairly similar to homeworks, but usually with a slight trick somewhere.  decent amount of conceptual / MC questions too.  helpful and funny prof if you get to know him.  would recommend.",
        "course": "CHBE2523"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Always willing to help students outside of class.  Exams were very similar to the homework, until the last one.  Lectures were boring but they were basically a practice problem, very similar to the homework so they were necessary to attend. However, very funny guy in and outside of class.",
        "course": "CHBE2523"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4.7,
    "department": "Chemical Engineering",
    "firstName": "Li-Chiang",
    "id": "VGVhY2hlci0yMjQ3Mjg5",
    "lastName": "Lin",
    "legacyId": 2247289,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors in the CBE department! His lectures are clear and easy to understand! A very funny and genuine guy. Go to office hours for HW help!",
        "course": "CBE2420"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors I have ever had at OSU. His lectures are well organized and clear, and he is very fair, kind, funny, and understanding.",
        "course": "CBE2420"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Super professor, goes through each topic clearly and is always there to help. He's also flexible with everything. His class is somewhat difficult and its a little hard to understand him at first, but he's so nice and always willing to help. Great curve at the end, 85 got curved to an A-",
        "course": "CBE2420"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "His lectures are fine and he's kind of awkward all the time. He grades hard but fairly. Half the class is basically applied math so make sure to learn the math by going to his office hours. He's very reachable in and outside office hours and very prompt about replying to emails.",
        "course": "CBE2420"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lin was one of the greatest professors I've had so far! With 2420 being a derivation heavy class, it would be easy to confuse a class full of undergrads, but that never happened. He teaches the material clearly, and gives lots of extra credit (up to 5% of your grade). Plus he has a great sense of humor that made it fun come to class.",
        "course": "CBE2420"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "A fantastic professor, work extremely hard and want us to learn! I really enjoyed the semester.",
        "course": "CBE2420"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lin was fantastic. Simplified what was really rigorous material. I would take Dr. Lin for any ChemE class that he's teaching",
        "course": "CBE2420"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome guy. Very dedicated to help students understanding the subject. Highly recommend.",
        "course": "CBE2420"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lin is really nice and a cool guy. He seems to be genuinely interested in his students and cares a lot about teaching.",
        "course": "CBE2420"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lin is a great professor, highly recommend his class.",
        "course": "CBE2420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.3,
    "department": "Chemical Engineering",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0yMjcwMTg3",
    "lastName": "Tong",
    "legacyId": 2270187,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Tong is one of the best professors I've had. He can give tough homeworks/quizzes/exams, but this is a senior ChemE class so you outta be expecting this by now. He goes out of his way to help students and tries his absolute best to explain material.",
        "course": "CBE4760"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Good luck learning something in this class.",
        "course": "CBE4760"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr Tong is a very cool professor, easy to reach outside class, plenty of office hours with him and his TAs. The class itself is all over the place in material and very difficult to follow without attending class. The biggest con for me on Dr Tong is the dependency on exams - nearly 80% of the grade and largely occuring after drop deadlines.",
        "course": "CBE4760"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 4.8,
    "department": "Chemical Engineering",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0xOTEzMDk1",
    "lastName": "Bush-Glenn",
    "legacyId": 1913095,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Survey really helped me to figure out what I wanted to do within Engineering. The class is really easy, just do the homework, turn it in on time, and go to class. Thats it.",
        "course": "ENGR11101120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Katie is a great instructor who tries her best to make this class interesting.  She brings in speakers from industry and the project is super easy.  Not a difficult grader and easy to approach.",
        "course": "ENGR1120"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Katie is very clear in her class about what you need to do to get an A and no one should get lower than an A who takes the class.  She doesn't give many assignments, but expects you to attend class.  She is extremely helpful, you just need to talk to her and be open and honest.",
        "course": "ENGR111004"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Survey is ridiculously difficult to get anything other than an A in. I don't know why she chooses to come off so abrasive during survey (so people pay attention? i dont know) but is super nice and helpful if you go to her office.",
        "course": "ENGR1110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seems like a harsh person in Chem E survey, but in individual meetings she tries her best to give good advice without telling you how to map out your degree plan. Overall, nice person and doesn't give out hardly any work for survey, which is genuinely difficult to fail.",
        "course": "ENGR111004"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was generally helpful as an advisor. Chemical engineering survey was really easy. Guaranteed A. Just kinda boring.",
        "course": "ENGR11101120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.3,
    "department": "Chemical Engineering",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci0yODg5NTIz",
    "lastName": "Harmon",
    "legacyId": 2889523,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "What you'll notice is that she's nice. And after that you'll notice how she'll assign homeworks that have nothing to do with what she lectures in class. I'm not the only one to say this, but people don't know what is going on in class and she skips over a lot of important concepts. The study guides and exam reviews she posts won't help. Go to TAs.",
        "course": "CBE2345"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Very kind and sweet person, but also a very poor lecturer. Unfortunately, at least 70% of the time not a single person in class knows what is going on, including her, it seems. It is very hard to learn in this class and most of the learning is done outside of class whilst studying for the exams.",
        "course": "CBE2345"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Harmon is a kind person, but her teaching falls short. Most of the assignments/review don't relate to the exams, but beyond that I don't think her way of explaining subjects is clear at all. She explains things quickly and she doesn't focus that much on the important key concepts. She means well but you'll have to learn most things yourself.",
        "course": "CBE2345"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Let me first get the compliments out the way, she's a nice person. But for how forgettable her teaching is, the exams are way too hard. Many exam problems will NOT have one example that she talked about either in class or for homework. To put it simply, she spends 95% of her energy on the easiest things and 5% on the hardest(exam questions).",
        "course": "CBE2345"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors in the chemical engineering program at Ohio State. Her enthusiasm for the class was evident and made coming to class fun and enjoyable. Homework assignments could be corrected for full credit, which was awesome. Exams were fair and I felt well-prepared for all of them. Take her kinetics class if you have the chance!",
        "course": "CBE3610"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you can choose to have Dr. Harmon you should. She was very helpful with homework, exams and anything in between. She allowed for correction on homework that you messed up on for full credit which helped learn the difficult coursework of kinetics. ",
        "course": "CBE3610"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.6,
    "department": "Chemical Engineering",
    "firstName": "Aravind",
    "id": "VGVhY2hlci0xNTcyNTg3",
    "lastName": "Asthagiri",
    "legacyId": 1572587,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "A sad excuse for an instructor. Exam averages were in the 50-60. The content was theoretical in class and unclear. Homework was light, but because of this, almost no practice problems were ever provided. Exam prep was unguided. He was rude, unhelpful, and did not help the TAs help us. There is no excuse for the incompetence demonstrated here.",
        "course": "CBE3509"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very straightforward and wanted students to do well in class. If you understand the practice material you will do fine on exams. I highly recommend taking him for 3610. ",
        "course": "CBE3610"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Asthagiri's lectures were sometimes hard to follow and pretty intensive. The class is very test heavy but the content on them was straightforward. The only other grades were group homework. He was flexible during covid and other circumstances that came up during the semester.",
        "course": "CBE3610"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed how he taught class. I felt he did his best to get the ideas you need on exams across. There weren't any tricks with him either. He is very straight forward in what you need to know.",
        "course": "CBE3508"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Asthagiri was extremely helpful in getting me through the class and learning the material. He was patient, compassionate and helpful. He would focus on maximizing learning through experience instead of passive exercises and memorization.",
        "course": "CBE5710"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really enjoyed his class. Material is difficult but it is thermodynamics so that is to be expected. During class he solve problems as he goes which is helpful. He gives lots of examples to help prepare for tests and quizzes. His lectures were very interesting and he was a fair grader. 10/10 would take a class taught by him again.",
        "course": "CBE3508"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Straightforward, not too much homework and the class is getting easier each year.",
        "course": "CBE3508"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Designs quizzes/exams so you wont finish them but he gives out tons of partial credit. Can get points for writing down how you would solve a problem and not even numerically attempt it. Do optional homework and focus on getting as much partial credit as possible . Curves almost everyone to a B. Solid professor and very helpful. Best curve ever.",
        "course": "CBE3508"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "A solid Thermo professor. 3-4 group HW, 8 quizzes, 2 exams, and a final are graded. Also assigns individual homework, which isn't always that helpful because it usually requires some sort of iterative calculation, which you won't do on an exam. Go to Office Hours. Fairly straightforward class. He has a dry sense of humor. Would take again",
        "course": "CHBE3508"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Asthagiri was a very good professor: he was both helpful and had favorable class policies (the t-score makes it fairly easy to get an A in a hard class). However, he was teaching his first semester of Kinetics, so at times, he was not fully prepared. Exams are open books.",
        "course": "CBE3610"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Asthagiri uses a simple formula in many of his classes. He assigns \"optional\" homework and a mandatory group homework problem. Do the homework and it will help, or hope that he will cover enough for you to do it without the homework (if you're busy/lazy). The main thing is that his catch all curve leaves most with a B. Open book exams.",
        "course": "CBE3508"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic professor, would highly recommend him for thermo. He is pretty difficult, but he is a good lecturer and always happy to answer questions so if you work through it you should have a better time than taking thermo with some of the other professors.",
        "course": "CBE3508"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "I'm so happy I got to take thermo with him. Obviously the class is hard because it is thermo but he makes it enjoyable and not impossible to pass. The averages of exams were low (50% or below on all) but if you do the homework, the quizzes and exams are very similar. Exams and quizzes are open book so get the book and read it prior to class!",
        "course": "CHBE3508"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Thermo is a subtle topic but Asthagiri makes it straight forward and enjoyable. The formula for an A is simple: Go to Class,  actual do the homework, understand the homework, do the practice exams and quizzes. You need the book because you need the formulas and information when doing the tests. Hard but rewarding class.",
        "course": "CBE3508"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "When I started thermo with him I did not know how to feel, but by then end I really did enjoy his teaching style. Here is how to succeed with him: do his homework assignments and read the \"Essential Thermodynamics\" book. Really, that is it. I promise, he might seem odd but he really is a good guy. ",
        "course": "CBE3508"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr Asthagiri is a great person. He is super nice, and helpful at office hours. Although he curves the class to a B average it can be very difficult to get an A because he uses a t score method and you must be 1 std device above average or in top 15% of class. Overall going to his office hours really helps!",
        "course": "CBE2523"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 2,
        "comment": "I went to class 2 times in the whole semester. Just do the homework and the practice midterms and make sure you know how to do the problems and you'll be fine",
        "course": "CHBE2523"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "I found him to be a really good professor and I might just be the minority here. His exams are hard but fair. The best way to ace this class is going to office hours and doing the homework problems.",
        "course": "CHBE508"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Im probably in the minority here, but I think Asthagiri is a fairly decent professor. His tests are fair, and he teaches you what you need to know. Sure he is harder than most professors but after all its Thermo. Really helpful during office hours.",
        "course": "CHBE508"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 5,
        "comment": "I knew Thermodynamics was supposed to be hard, but come on!  Any teacher who aims for a class average in the 50% range is absurd.  The book is much more useful than lecture.  I skipped about 2/3 of the classes and managed a B-: lecture is useless.  Overall, avoid him at all costs.  He will destroy your GPA and make you wish you we'rent a ChBE.",
        "course": "CHBE508"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "Tough class in general if you're not a natural thermo genius. His lectures are useless. He focuses on concepts and not on how to apply them. Very hard exams. Very nice guy but not a very good teacher. Plus side is he curves to a B-",
        "course": "CHBE508"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 4,
        "comment": "I had Dr. Winter the first half of this class, then he was her replacement for the second half. He made the material far more difficult then he needed to. He wasn't very good at explaining topics either. If you go to his office hours you can see he is actually a caring prof and understanding, he just isn't a very good teacher.",
        "course": "CHBE201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 4.3,
    "department": "Chemical Engineering",
    "firstName": "John",
    "id": "VGVhY2hlci0xOTY2NjMw",
    "lastName": "Clay",
    "legacyId": 1966630,
    "numRatings": 51,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "MEB is hard but Dr. Clay is very supportive and will help you succeed. His lectures are fast paced but he's good at teaching and his office hours and meeting with him outside of class helped me. His genuine care for students is what sets him apart from other professors, for example he's the only professor I've had here who learns students' names.",
        "course": "CBE2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "Clay is the only reason I could have ever passed this class. Although his lectures are fast paced over hard and new material, he works with that in making time for students and creates ample amounts of office hours with his TA's. GO TO OFFICE HOURS. He wants you to succeed in this course, so use him to help you succeed. Only mandatory for quizzes.",
        "course": "CBE2200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cares deeply about his students and is a very active/encouraging lecturer. Looks forwards to office hours to help guide his students. Class difficulty will be lessened if you meet with him when need be and use his resources.",
        "course": "CBE2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr Clay is always available to meet outside of class and wants his students to succeed. By no means is this class easy but he teaches the class so that if you pass you are very well set up for your future courses. The homework is extremely lengthy but his ta's are super helpful and meeting with them is detrimental to doing well. Office hours!!",
        "course": "CBE2200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "good professor gives u all the knowledge but be ready to work. ",
        "course": "CBE2200"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Messes up while going through examples frequently (some of his solutions are also wrong) and goes through content way too quickly. Gives a ridiculous amount of homework and expects you to make his class your #1 priority. The only good part of this class were the TA's, they will actually teach you the content.  ",
        "course": "2523"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Honestly avoid at all costs. Expect a massive amount of work while taking this class. Don't expect a curve. Students will suck up to him because they want to work at Batelle ",
        "course": "CBE2523"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Clay is not only a great professor but also a great person. He cares about each individual's health, well-being, and success in pursuing a chemical engineering career. Sure, the class is tough and the workload is a decent amount, but, for the most part, there really is no busy work - all the work done prepares you well for exams and the future.",
        "course": "CBE2523"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Clay cares a lot about getting to know you personally. Not only is he a great lecturer, he's a fun person to talk to. The workload is a lot, but you'll learn a lot more than you would with another professor. Also his office hours are golden and you need to take every chance you can to go to them. When in doubt, assume steady state.",
        "course": "CBE2200"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 5,
        "comment": "Name the four ways to find vapor pressure? -Antoine Eqn. -Cox Charts -C.C -Steam Tables Name the five ways to get a Steam Economy greater than one? -High Feed Temp -Solvent other than water -Multi-stage -Super Heated Steam -Vapor Recompression #Assume steady state",
        "course": "CBE2200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Clay is a real gem. He strives to know you by name and forms an interpersonal connection with you during his office hours. His love of memes is unmatched, and he's always available to help if needed. Yes, his class is very difficult, so expect lengthy homework assignments that are impossible to complete without help from the TA's.",
        "course": "CBE2200"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clay is a great lecturer and has an emphasis on applying the material to problems. I swear by his office hours, and you can tell that he really cares about the well-being and success of his students. His class is definitely challenging, but if you put in the effort you can do well. He is a real gem.",
        "course": "CBE2200"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "I am not sure why he is rated so highly. He gave a ton of homework, made zero connection with me, and was incredibly fast paced. His hand-picked TAs told me they they could not help me on a question. My expectations were high, but were not met. I also wanted the good news first.",
        "course": "CBE2523"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Clay is an excellent professor; however, he is very difficult and has a teaching style that some may not like; he puts people on the spot all the time in lectures. Overall, he is difficult, but you really learn the material and if you can get past this class with a good grade, you will be fine in your later chemE courses.",
        "course": "CBE2200"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Clay does a great job teaching this course, but there is A LOT of homework. The best way to describe his teaching is tough but fair. He goes out of his way to be accessible to students outside of class to ensure they understand the material.",
        "course": "CBE2200"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clay is the best! If you have the choice, always pick Clay. He is preparing students for the real world, so you will have to work hard, but it is definitely worth it. Go to his office hours as much as possible. He is very helpful in a smaller setting and he never makes you feel stupid!!",
        "course": "CBE2523"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 5,
        "comment": "I did better in Clay's Separations than in his MEB. Still, he gives lots of homework, moves faster than you thought possible, and loves to give hard exams. His lectures weren't as helpful in separations as in MEB, but he still explains things very clearly when you ask questions/go to office hours. If you put in the (lots of) work, you'll be okay.",
        "course": "CBE2523"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Clay's class is probably one of the hardest classes I have ever taken. His exams are pretty hard and time constrained. His lectures and homeworks do a good job preparing you. Dr. Clay expects a lot from his students but he is a very nice person and a good professor. I learned a lot from him even though my grade wasn't the best. Prepare to work.",
        "course": "CBE2200"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best (and toughest) profs/teachers I've ever had (Fall 2018). I learned a LOT in his class. However, to do well, his class really has to be your top priority. Homework requires a decent time investment, and you really need to also do the supplementary worksheets he provides to prep for the quizzes/exams. He is very helpful 1:1 as well.",
        "course": "CBE2200"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Solid professor overall, but moves at a quick pace. He only uses slides to teach, which I don't find very effective, but it is quick and gets the job done. Flexible professor and knows his stuff well. Highly recommend talking to him since he gives good advice and is a nice guy overall. Curve is small, my 92 got curved to an A and about 16% get As.",
        "course": "CBE2523"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 5,
        "comment": "He is the only professor I've ever had who truly cares about his students. That being said his class is very very time consuming and tough. Clay gives you opportunities to excel but you have to be willing to put in the time week to week.",
        "course": "CBE2523"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you truly care about material and high volume work causes you not to learn well, don't take his class. He's a nice guy, but picks favorites. He will make you feel like he thinks your smart, or you will succeed in his class in the beginning but as soon as you start to struggle a little bit his attitude towards you changes completely.",
        "course": "CBE2523"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 5,
        "comment": "For a 3 credit class the work needed was more along the lines of a 6 credit class. The homework and tests are unnecessarily difficult, but you definitely learn the subject very well. Dr. Clay is the most caring and accessible teacher I've ever had. I hated the course, but I really didn't want to let him down and that pushed me to work harder.",
        "course": "CBE2523"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was a great professor, probably the best I have ever had! He went through the trouble of memorizing the name of every person in the class, so clearly he really does try to connect with the students and help them. He is very clear in what he expects you to learn and provides lots of actually helpful and relevant resources.",
        "course": "CBE2523"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Clay may be tough, but because of that, you will 100% learn something in his class. He's always willing to help (even in matters outside of academia, like job preparedness), and in fact lent me some books to read because I was feeling a bit uneasy about my job search. He cares about his students, is a great lecturer, and very knowledgeable. A+",
        "course": "CBE3631"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clay is the best professor I have come across in the Chemical Engineering Department at OSU. He explains things well in his ppts, and he will go out of his way to help his students understand material as long as the student reaches halfway. Definitely homework heavy, but I've never learned so much and understood so much from a class before.",
        "course": "CBE2523"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 5,
        "comment": "Don't take him if you struggle with anxiety. He will stress you out to no end and then not help you when you need it. He is good in class and can explain topics well but he is very harsh and causes more stress than necessary. I don't like him.",
        "course": "CBE2200"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 5,
        "comment": "He has too high expectations for the 3 hour class",
        "course": "CBE2523"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clay is by far the best professor I've had. His class is definitely harder compared to the other lecturers, but I'm sure it'll pay off in the future. He'll tell you that his 3 main focuses are on 1) teaching you what you need to know 2) your mental health and 3) your happiness. He's easy to talk to and explains material clearly. Exams are long.",
        "course": "CBE2200"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 5,
        "comment": "He's not just a professor. He's a coach. He takes pride in the quality of students he trains. He's the sort who might randomly call on you and ask for fifty pushups. You'll spend &gt;10 hrs on each weekly problem set. Exams are a time crunch and even fail straight A sophomores. If you hate working a lot, don't take his class. Also switch majors!",
        "course": "CBE2200"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is the best prof I've had so far! Super encouraging, friendly and makes the effort to know everybody in the class. He was genuinely interested in us and although I found the class very challenging he will always help and answer emails.",
        "course": "CBE2200"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "His class model is to teach you how to deal with a ridiculous amount of work, but is also set up to where you have to go to his office hours if you want to do well.",
        "course": "CBE2523"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 3,
        "comment": "He will put you on the spot, but is most likely the most knowledgeable professor I have had to date. Unit ops papers suck, but that really isn't a product of the professor.",
        "course": "CBE3631"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 4,
        "comment": "Clay is by far the best prof I have ever had. He challenges students by giving them tools to think on their own, but offers help in doing so. He goes above and beyond what is necessary. Don't understand a concept from lecture? He'll simplify it and you'll have it down within an hour. He offers an incredible amount of resources out of the classroom.",
        "course": "CBE2200"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "He will be the best professor you ever take. Lot to learn from him, worth all the effort he expects.",
        "course": "CBE2523"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 4,
        "comment": "Daddy Clay is one of the best chemE profs at OSU. Very nice, loves to get to know you on a deep and personal level, and overall a chill guy. Lots of homework, but honestly this course is really cool and the information is very informative.",
        "course": "CBE2523"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's nails.  He will help you to the best of his ability at any time, even during the tests and quizzes.  He comes in on weekends to hold review sessions and takes all regrades seriously.  The only downside to him is he will make you work.  We probably did near 200 long problems for homework.  Best teacher I have ever had.",
        "course": "CBE2200"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great guy and professor. Really tries to get to know you. Is very helpful in one-on-one situations. Class moves too fast for him to get into too much detail during lecture, so if you have questions, ask him during office hours. HW is long, sometimes quite tedious. Quizzes and tests are straightforward and you get a cheat sheet. Overall good prof",
        "course": "CBE2200"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor all around, takes personal interest in students.",
        "course": "CBE 2200"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 4,
        "comment": "By far my favorite professor I have ever had.  He will learn everyone's names in the class by the second week and he really cares about his students.  The most approachable professor I've ever had and is always willing to help.  Expect to spend a lot of time out of class on homework because he makes you work. But hey, that's what college is for.",
        "course": "2523"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 4,
        "comment": "Clay gives pop quizzes. They're only pop quizzes if you don't go to class or you aren't paying attention, otherwise it's pretty obvious when he's hinting at having one. Clay is probably the best professor I've ever had. If you're struggling, go to office hours. The story about surprising everyone with pizza during a blizzard is true. That's Clay.",
        "course": "SEPARATIONS"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very approachable, nice, and genuinely cares about teaching. He'll MAKE YOU WORK your grade but by the end of it you'll realize he is probably one of the best instructors  you'll ever have. Plus he understands that GPA matters and curves very generously. Took him during his first year teaching and he'll only get better.",
        "course": "CBE2523"
      },
      {
        "index": 43,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Clay is someone the genuinely cares about his students and their progress in the class. He really wants to get to know you, so that you feel comfortable going to him for help. While his lectures weren't necessarily helpful when it came time to do the homework, he is more than willing to meet with you in or out of his office hours for help. ",
        "course": "2523"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clay makes the class tough, and you are going to have  to work for your grade. However, he will make sure that you understand everything no matter how long it takes him. This guy showed up the night before the exam in a blizzard to bring pizza and to hold a review session because he cares about his students! Ask questions and you will be fine.",
        "course": "CBE2523"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 4,
        "comment": "Clay is a great guy and really cares about his students. Unit Ops just plain sucks. Grading varies from TA to TA and the reports are very long, but manageable in the given time. Clay's lectures are decent but his exams don't test knowledge they test memorization (AKA if it's not on your cheat sheet you're screwed.) ",
        "course": "CBE3631"
      },
      {
        "index": 46,
        "rating": 1,
        "difficulty": 3,
        "comment": "This applies only to Separation Processes.  I have heard that Dr. Clay is excellent when he teaches other classes.  However, in CBE 2523 he very lacking.  The majority of the information you are tested on is not what he goes over in class.  He spends a lot of time on information that is interesting, but not important.  TAKE DR BRUNELLI!!!!",
        "course": "CBE2523"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 3,
        "comment": "John Clay is one of the most intellectually stimulating professors you can have.  He always has a question that will stump you, but he makes you stop and think because he knows that you can come up with an answer for him.  HOWEVER, unit ops lab reports are the absolutely worst thing you will do in college...",
        "course": "CHBE3631"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great guy.  Really loves chemical engineering.  He is clear that he expects you to work hard but he makes sure you know he does it for your own benefit.  Lots of pop quizzes (go to lecture).  Homework took a while but helped solidify concepts.  Tests were difficult because of heavy time constraints.  Be smart and work quickly on exams!  ",
        "course": "CBE2200"
      },
      {
        "index": 49,
        "rating": 4,
        "difficulty": 3,
        "comment": "Really cares about students. Tests start out easy but get really hard really fast. Homeworks are very long but help a lot. If you have the chance to take him, do it. You'll work really hard but it will be worth it",
        "course": "CBE2200"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very clear in his lectures. Tells you what he expects from you in order to do well. One of the few 8 am classes I have had were I didn't doze off into sleep. Always willing to help students. Some HWs are long but they help you understand the topic. Don't expect this to be an easy class, it may come off as such but it will get difficult in the end.",
        "course": "CBE2200"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor I have ever had the privilege to have at OSU. He was incredibly clear, cared about his students more than anybody I have ever met and is an all around good guy. The class wasn't easy (welcome to ChemE), but he graded fairly and there was a curve at the end. He was willing to do anything to make sure you got the grade you wanted. ",
        "course": "CBE2200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.3,
    "department": "Chemical Engineering",
    "firstName": "Jonathan",
    "id": "VGVhY2hlci0yMjk1ODY4",
    "lastName": "Brown",
    "legacyId": 2295868,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Every assignment in this class only counted for attendance points except for the weekly quizzes and quiz reflections. The quizzes were frustrating, I would often get a better grade when I didn't study than when I did. There is a lot of opportunities for extra credit. Very annoying class but got a better grade than I expected to get. ",
        "course": "MSE2010"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Just remember this class ain't trying to trick you, do some studying before the weekly quizzes and use some common sense and you should be fine. Go to recitations to get a good understanding of what the quiz will ask (I recommend the thursday recitation because quizzes are friday). ",
        "course": "MSE2010"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class is basically read the textbook, 2 lectures, recitation and quiz each week. The quizzes are not that bad if you study/ review (which I often didn't do... probably would've done a lot better in the class if I did). The class is kinda boring and it is a lot of lecturing each week. Prof Brown was good at explaining stuff during lectures though. ",
        "course": "MSE2010"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy, really interested in making the course as good as possible and his lectures are great. MSE2010 is very informative and manages to teach you a ton without causing much stress. Very highly recommend taking him.",
        "course": "MSE2010"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Brown enjoys teaching and tries new methods of teaching to make the course more engaging such as tophat and skeletal notes. He got assigned to teach this class late which may be why he struggled at times to explain concepts, but he was fair and did a good job overall. There are 3 exams and an optional final that were relatively difficult.",
        "course": "MATSCEN5641"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "MSE 2010 is primarily based on weekly quizzes. I think Professor Brown nailed explanations for the quizzes, and when he taught, I felt ready. An hour or so of preparation can get you an A- easily, or good guesswork. It's a decent class and you learn a lot. ",
        "course": "MSE2010"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Brown was a fair grader on tests, unlike some of the other 1182 professors. He was also knowledgeable about the material and explained it clearly. This class is mostly group project based; Dr. Brown cared about the work distribution and would adjust grades accordingly if some people did not contribute while others did.",
        "course": "ENGR1182"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Brown is a great guy! Super nice and always willing to help. He may not be the best lecturer, but overall, I would recommend him for 1181!",
        "course": "ENGR1181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Chemical Engineering",
    "firstName": "Mandar",
    "id": "VGVhY2hlci0yODU0MTcz",
    "lastName": "Kathe",
    "legacyId": 2854173,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor. Good lectures, makes topics easy to digest. Homework is not too much. Very friendly and approachable. Lenient with deadlines.",
        "course": "4760"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "First time I've ever felt a professor attempt to be personable with his students on his own time. You feel he is invested in you personally and he tries his best to make the content interesting. Additionally, he keeps the class as stress free as possible and focuses on learning.",
        "course": "4760"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Chemical Engineering",
    "firstName": "Carlo",
    "id": "VGVhY2hlci0yMTM5MjUz",
    "lastName": "Scaccia",
    "legacyId": 2139253,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very easy senior class, but be prepared as he will not curve. He really strives to get participation from the class, so I feel for him, but at the same he is expecting a class of graduating senior to be as involved as a class of freshmen. Overall a great guy.",
        "course": "CBE4760"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 2.2,
    "department": "Chemical Engineering",
    "firstName": "Andre",
    "id": "VGVhY2hlci0xMTgyODA4",
    "lastName": "Palmer",
    "legacyId": 1182808,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class focuses mostly on chapter 3. Everything is open note which is nice. Material learned in classroom is unclear in its application to the real world. Very little instruction for the group project and a ton of work, but most of the grades seemed to be in the A-B range.",
        "course": "CHBE2420"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "For most of the semester we focused on chapter 3 of the book we were learning after going over the appendix that was not even relevant to the class. His group product was really open ended, but he seemed to grade fair on these. Exams introduce new types of problems, which make his exams hard to study for.",
        "course": "CBE2420"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Palmer doesn't actually teach anything in this class. The only way to pass is to copy down everything that he writes since that is all that will appear on the quizzes and exams. If you can avoid taking him for Transport, do so.",
        "course": "CBE2420"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr Palmer's accent can be frustrating at times, especially hearing him go off about a \"tree by tree matrix mon\" but his class was very easy. Go to class and copy down everything he writes so you will have all of the examples for the open note exams. The exams were essentially higher weighted quizzes. Homework is only and not relevant to the course.",
        "course": "CBE2420"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "He has slides and prewrittwn notes that he lectures on in class. Fairly easy to follow and the class can be very repetitive. Open book and open note tests.",
        "course": "CBE2420"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "I heard Palmer wasn't that great of a teacher, but I didn't have any problems with him. He is repetitive but I've actually learned things in this class and I think he explains things better than the book can at time. He's a nice guy and the class is easy as long as you pay attention.",
        "course": "CBE2200"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Professor Palmer is a great teacher. His exams are pretty easy as long as you go lecture. He's a cool guy, very funny, and classes are not boring. I recommend him for transport.",
        "course": "CHBE2420"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Basically a class clown, minus the class part. His class was a joke, he didn't care about his students and never answered ?, he replied with a ? which made no sense(ALWAYS).But his lab?Even worse, his Ph.D's are a joke. His lecture is bad, research is terrible (he doesn't care about either),why did this guy get hired? He is just a bad professor.",
        "course": "CHBE2200"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "This guy repeats himself on end.  The tests weren't difficult if you could teach yourself the material from the slides he posted online and from the book. His office hours were USELESS!",
        "course": "CHBE2200"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 1,
        "comment": "Getting an A with him is as easy as the other professor (for 420).  Not much benefit in going to class.  If you want  to do a study-abroad to the Carribean/West Indies, I recommend this professor, as his lectures take you there.  Make sure you bring your rasta hats and sunglasses, you here me mon'?",
        "course": "CHBE420"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 5,
        "comment": "I had Dr. Palmer for both ChBe 201 and ChBe 420. In 201, the class average was an 80% and he curved the class another 3 %. In 420, the class average was a 77% and he curved it 1.8%. He has his TA's do all the grading, and a lot of teaching. Depending on what TA's you get, the class can either be really bad or really good.",
        "course": "CHBE420"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "pretty easy class, with open notes/open book quizzes and exams.  homework (esp group hw) is annoying but not bad.  not a very good teacher though, i didnt really like him.  seems confused a lot.  figure out his style of question asking and youll be fine, though.  posts lecture slides online, can use on quizzes/exams",
        "course": "CHBE201"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great professor, the class is soo easy. Take him if you can.",
        "course": "CHBE201"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 2,
        "comment": "Palmer just talks. I didn't learn anything at all. He'll explain how to solve a problem, but not tell you what it means, so you don't know how to attack different types of problems. Never clearly explains the point of definition of a topic. He is unsympathetic to student needs and just writes on the board. His tests are pretty much straightforward",
        "course": "CHBE420"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very nice guy. Rambles during lectures and not very clear on the subject matter.  Exams are straightforward so just pay attention to his practice exams. Assigns a project the other class who has a different professor didn't have to do, which kind of sucks. Not too bad though.",
        "course": "CHBE420"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 1,
        "comment": "His notes are off of a power point that you can print and bring to class and he teaches straight from there. Essentially you could skip every class except for quiz days. He doesn't seem to know how to answer students questions that well or he gives a very vague explanation. He's not horrible but still below average I think.",
        "course": "CHBE201"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 1,
        "comment": "Nice guy. Gets off track easily. Exams are very easy and straight forward. They are straight memorization. Went off on a tangent talking about anal plugs and ended class 30 minutes earlier.",
        "course": "CHBE421"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.8,
    "department": "Chemical Engineering",
    "firstName": "Holly",
    "id": "VGVhY2hlci0xMzE3NjMz",
    "lastName": "Prouty",
    "legacyId": 1317633,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Smokin hot, always available to give advice/help schedule. easy class, and its mandatory so u have to go anyway",
        "course": "ENG100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great Survey teacher! She was easy to get along with and was always available for help with anything related to scheduling.",
        "course": "ENG100"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Only thing I did not like was mandatory attendance.",
        "course": "CHBE100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Chemical Engineering",
    "firstName": "Daniel",
    "id": "VGVhY2hlci0xNTg3OTYw",
    "lastName": "Heath",
    "legacyId": 1587960,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "First quarter teaching.  Seemed to genuinely want to do a good job.  Very enthusiastic.  Material for 523 is not difficult.",
        "course": "CHE523"
      }
    ],
    "SEI": []
  }
]