[
  {
    "avgDifficulty": 2.2,
    "avgRating": 3.5,
    "department": "Civil Engineering",
    "firstName": "Eblal",
    "id": "VGVhY2hlci0yMzE5ODM5",
    "lastName": "Zakzok",
    "legacyId": 2319839,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Zakzok is the best professor ever. Exams are easy as they are based off of the lectures. HW is not too bad, just ask a lot of questions. Labs are always fun especially with Raimi!! He is the reason why all future engineers succeed.",
        "course": "CIVILEN2410"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Zakzok basically reads off of a bland PowerPoint in lectures. Mandatory to go to labs, and although sometimes lengthy, they help you learn better than his lectures. Mastering HW has random due dates, and he doesnt post when they are in Carmen, so students often forget to do them. HW based off book and lectures rarely help. Exams/quizzes were fair",
        "course": "CIVILEN2410"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Good at responding to emails, but that's about it. Homeworks are not connected to the lectures and the class organization is awful. His labs are pretty clear, but if the GTA decides not to follow them then they're useless which was the case 90% of the time. Also, the grading is very lab report heavy, but the lab report guidelines are vague.",
        "course": "CIVILEN2410"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "When I took this class online, we still had scheduled meeting times for the class. Instead of doing this, he posted videos at the beginning of the week and expected us to do fine with just those. There was no chance for us to ask questions during lectures.",
        "course": "CIVILEN2410"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professors like Dr. Zakzok are scarce, who really take pains to explain concepts and drills it over and over again. Attending his class is an eye-opener amongst all these classes where you just end up learning engineering. Dr. Zakzok is real genius. He breaks down the most difficult concepts into simple understandable concept.",
        "course": "CE2410"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Not a very fun lecture as most of the time he just read the slides but you still need to come to class for the attendance. If you take lab session with him, don't worry as he is willing to help you if you have any problem during the lab session. The exam is open book, no need to worry much about remembering all the stuff.",
        "course": "CE2410"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 1,
        "comment": "Nice guy, but lectures are dry as dirt. He just reads off the slides and example problems are confusing. Homeworks can also be very difficult because most of the problems don't even show up during lecture. Exams are open note and book, you just can't use the Internet.",
        "course": "CE2410"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a very nice person.",
        "course": "CIVILEN5001"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a nice person. Fair lectures and easy exams.",
        "course": "CE2410"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "Zakzok makes midterms and homework very easy, albeit labs can be confusing and boring. The lectures are mandatory with a sign-in sheet, and Zakzok is a dull lecturer.",
        "course": "CE2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Civil Engineering",
    "firstName": "Ethan",
    "id": "VGVhY2hlci0yNDIxODE0",
    "lastName": "Kubatko",
    "legacyId": 2421814,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Kubatko is a very reasonable professor. He will work with you. He gives out labs to help with your grade (which by the way were super helpful). He is also super funny and makes the lectures fun.",
        "course": "CIVILEN3130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4.8,
    "department": "Civil Engineering",
    "firstName": "Anthony",
    "id": "VGVhY2hlci0yMzIyMzI5",
    "lastName": "Massari",
    "legacyId": 2322329,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the hardest classes Ive ever taken, but Dr. Massari cared so much about everyone succeeding in the class. What type of Professor buys donuts and coffee for his class for every exam and sits 12 hours to allow flexibility for the students. Additionally he is almost always accessible out of class and extremely genuine. One of my favorite profs",
        "course": "CIVILEN4320"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Massari was so great. During COVID he made so many accommodations for students. It's definitely a class you have to work for, but he made it feasible. He was extremely accessible and would give students his cell phone number to help out with the final project. If you're taking this class, make sure you have him!",
        "course": "CE4320"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Massari is undoubtedly the best professor I have ever had. His lectures are captivating, he explains things very well, he is widely respected by students, and he has great industry experience. His tests and assessments are very clear and fair. He is an all around great guy and genuinely cares about his students and their education.",
        "course": "CIVILEN4320"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Massari is the GOAT",
        "course": "CE3310"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "This class was an eye opener. One of the final lectures Dr. Massari showed us a video that brought tears to my eyes. He is inspiring and brilliant. This guy deserves awards.",
        "course": "CE4320"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "On a scale of 1-10, Dr. Massari is a Lasagna.",
        "course": "CE4320"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 5,
        "comment": "5 professors walk into a bar. One of them is not Dr. Massari, he's in his office helping students",
        "course": "CE4320"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Probably the smarted professor I've met. Generous curve for challenging tests. Doors always open. Pay attention and go to class, he covers a lot of material very fast. Overall a gem.",
        "course": "CE4320"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "Massari is a rocket of a professor. He doesn't know the meaning of slow down. Besides this major blemish hes great. Behind his cool cover, hes a dweeb.",
        "course": "CE4320"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Massari is a super down-to-earth and approachable guy with some fantastic experiences he often references in lectures. The material is challenging, but Massari presents it in an understandable way. He is always willing to review things and is very helpful both in and outside of class.. He's also a very fair grader.",
        "course": "CE4320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.2,
    "department": "Civil Engineering",
    "firstName": "Natalie",
    "id": "VGVhY2hlci0yNDM4MTY2",
    "lastName": "Hull",
    "legacyId": 2438166,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Hull is a professor that seems to try very hard to teach her students the content and an organized way. I appreciated the class organization and clarity on grading. She does get behind easily and sounds like she gets flustered very easily which can make me feel stressed and concerned. Other than that pretty good professor",
        "course": "ENVENG3200"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Prof. Null's lectures are easy to follow although she sometimes ran into confusion that had to be clarified later. Homework is challenging so make sure to attend office hours &amp; communicate with peers for clarification. She provides answer keys to assignments &amp; exams are very straightforward.",
        "course": "ENVENG3200"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Hull was a pretty good professor, but sometimes she would get confused on course content during lecture which of course made it harder for students to understand.",
        "course": "ENVENG3200"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Her lecture notes are simple, but provide enough information to do well on exams. Homeworks are challenging enough, but she provides help through email/office hours and posts an answer key after due date. She records lectures so you can rewatch them. Tests range from easy to somewhat challenging. Tests online given &gt;24 hrs of time to ease stress.",
        "course": "EVENG3200"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "I'll just say this: given all the typos and errors Natalie makes in her example problems and on exams, I'd be surprised if she could get a B+ on an exam of equal caliber that she has not written with respect to the subject material covered in the class. Unnecessarily difficult considering it's a fundamentals class. Be prepared to grind for the A.",
        "course": "ENVENG3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.3,
    "department": "Civil Engineering",
    "firstName": "Gil",
    "id": "VGVhY2hlci0yNDYxODYx",
    "lastName": "Bohrer",
    "legacyId": 2461861,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Professor Bohrer is extremely boring to listen too and not very well organized. His assignments ask for a lot more detail than taught in class and his verbal expectations are high for how poor his teaching abilities are. However, grades are not awful as long as effort is applied.",
        "course": "CIVILEN3160"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "When I took Dr. Bohrer he was very hard to follow at times in class. Granted, this was an online class so it was harder over zoom, but he still was rather confusing. Things in this class made more sense when the other professor was teaching (there were two professors co-teaching the course).",
        "course": "CIVILEN3160"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Favorite professor and class I've taken so far. Interesting and easy to pay attention to until you get your head into the weeds with equations, but still interesting if you follow the modeling stuff. Very knowledgable guy, you will learn all sorts of unexpected things about the world around you.",
        "course": "ENVENG5218"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Civil Engineering",
    "firstName": "James",
    "id": "VGVhY2hlci0yNjg1MDk2",
    "lastName": "Stagge",
    "legacyId": 2685096,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Stagge really enjoys teaching students water resources. He is really helpful in office hours and is patient for you to understand the concepts. Would take a class with him any semester.",
        "course": "CIVILEN3160"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.5,
    "department": "Civil Engineering",
    "firstName": "Nigel",
    "id": "VGVhY2hlci0yMTM3NDEw",
    "lastName": "Carter",
    "legacyId": 2137410,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Probably the class that gets you the most ready for the civil engineering world if your going to be a PM. Ive been graduated for over two years and a lot of the content hsa saved me a lot of headache in the field",
        "course": "CE5820"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "It is a 3 hours lecture (only one class per week) but he usually will end his lecture early. You need to read a lot for the quizzes, but the question is straight forward. 2 projects which he usually will give you full credit if you follow the requirements. Midterm are not hard if you study and you need to be careful as 1 question  4 mark.",
        "course": "CE5820"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "3hr lectures are a bit tedious, but Nigel typically ends them early. Text book a must with quiz questions pulled straight from it. Often applies real-world experience to class, making it more engaging and interesting. Teaches concepts well, but doesn't go into program specifics - leaves that for students to discover on their own, which can be hard.",
        "course": "CE5830"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.4,
    "avgRating": 1.8,
    "department": "Civil Engineering",
    "firstName": "Chin-Min",
    "id": "VGVhY2hlci0yNDgwODg2",
    "lastName": "Cheng",
    "legacyId": 2480886,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I learned a lot about water treatment from this class and enjoyed it overall! I would recommend groups start the project early and get clarification/confirmation from Professor Cheng as early as possible on their work. Exams were not too bad- make sure to understand the homework problems and ask for extra review problems.",
        "course": "ENVENG3210"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Prof. Cheng was very cryptic in what he wanted for the group project. I think that the class required a lot of work, but the exams were fair. He is a very nice guy and you can go to him for questions, but I found that because the rubrics were poorly written, I was in his office consistently for help and clarification. ",
        "course": "ENVENG3210"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Avoid this professor. His lectures are okay, but do not go as in depth as the exams or homework problems. Homework problems can be very challenging, but his feedback is not helpful and eventually he simply asks you to look at the lecture video. Exams are take home and can take 20+ hours to complete and are hard. Project is doable with a good group.",
        "course": "ENVENG3210"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor Ive had. I had online version and he didnt teach at all. The numbers he writes for example problems come out of no where with no explanation. Midterms take 12+ hours to complete. Huge design project that is outside the scope of this class. Totally unfair amount of work for 3 credits. He makes the class impossible.",
        "course": "CE3210"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "He expected that the students know everything. The project is so hard. He evem get mad when student ask question to him.",
        "course": "ENVENG3210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3,
    "department": "Civil Engineering",
    "firstName": "Rongjun",
    "id": "VGVhY2hlci0yMzUzMTA3",
    "lastName": "Qin",
    "legacyId": 2353107,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor was hard to follow in lecture, and mostly expected you to figure it out on your own. The way the class was set up (CIVILEN 2060) did not help with this either.",
        "course": "CE2060"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a good lecturer. He provide lots of oppurtunity for extra credits in assingments and exams. He is a good grader as well.",
        "course": "CE2060"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 1,
        "comment": "Super easy class. All his lectures are online so you don't need to be there to learn. His lectures are terrible, but his the notes he posts are great. Homework is 40% of your grade, and he offers 20 extra points for coding assignments on every one. You can use your homework to take quizzes, and you get more cheat sheets than you need for exams.",
        "course": "CE2060"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.2,
    "department": "Civil Engineering",
    "firstName": "Fabian",
    "id": "VGVhY2hlci0xOTg2OTAy",
    "lastName": "Tan",
    "legacyId": 1986902,
    "numRatings": 35,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolute legend of a professor. Taught entirely new material in a way that made it easy and interesting. Always funny, always engaging, always interesting.",
        "course": "CIVILEN2810"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "amazing course!!!",
        "course": "CE2810"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Attendance is so important, not only there are attendance points, but you won't be able to do homework and exams if you don't show up since most of the stuffs aren't in the lecture slides. Lectures can be quite boring, but he will give you all the answers for homework and exams.\n\nHowever, he gives tons of extra credits on exams which is awesome.",
        "course": "CIVILEN2810"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Tan is an awesome professor! He can get a bit demanding with participation but he teaches the subject material well!",
        "course": "CIVILEN2810"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fantastic professor! Would take courses from him again!",
        "course": "CE2810"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Tan is the nicest and most caring professor here at osu. He has some really cool stories/experiences, and I enjoyed my time in class with him. Attendance is graded and answers to the homework are straightforward if you come to class. ",
        "course": "CIVILEN2090"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Tan is a very respectable professor. It is obvious he loves his job, and is always available to help students. His lectures can get pretty boring, but attendance is collected every lecture. However we go over the homework answers in class, so if you show up and pay attention, easy A. Both exams are fair and directly come from class content. Great!",
        "course": "CIVILEN2810"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Love the way his material is structured! Great balance between easy and challenging exercises",
        "course": "CIVILEN2810"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent class, very informative! Would recommend it to anyone interested!",
        "course": "CIVILEN2810"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent and informative course work! Looking forward to taking classes from him again in the future!",
        "course": "CIVILEN2810"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "I feel that he teaches things in a straightforward fashion and helps us succeed. I like his style!",
        "course": "CIVILEN2810"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wonderful professor! I'd love to take one of his courses again in the future - they're always very informative, entertaining, and comprehensive!",
        "course": "CIVILEN5810"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "He provides many useful examples that help clarify things dramatically, also provides relatable experiences in ethics. Overall a must-have course in the field of civil engineering!",
        "course": "CIVILEN2090"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Seems to be adapting well to online courses, plus provides many chances for bonus points! Would highly recommend again",
        "course": "CIVILEN2810"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 2,
        "comment": "I had Dr. Tan in person during a different semester, and it wasn't terrible. However, he DOES NOT know how to teach online class. He does not effectively relay information and then makes his exam questions extremely tough. He's also the only professor I have that refuses to record his lectures.",
        "course": "CIVILEN2810"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Tan is a favorite amongst Civil students. He clearly cares about his students and is excited to teach the subject matter. His lectures consist of a great mix of not just the knowledge needed for the upcoming test/quiz/exam, but practical knowledge of being a working engineer, soft skills that you should be thinking about.",
        "course": "CIVILEN4800"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "This course was excellent! I learned about real life scenarios that can happen to me in the future. I feel much better prepared to work as an engineer after taking this class. Ethics should be a bigger priority in the engineering curriculum. This class will be very important to my future. This course was so good because of the professor teaching it",
        "course": "CIVILEN2090"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Straightforward to follow, rigorous, overall a great experience!",
        "course": "CIVILEN2810"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lectures (attendance taken) were boring and he would go off on tangents, but he did every homework problem in class and really personally cares about students passing. Tests weren't easy but you were allowed a cheat sheet and about 6/40 questions were counted as extra credit. Showed clips of construction accidents and told bad jokes every class.",
        "course": "CE2810"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 3,
        "comment": "Keeps talking about irrelevant things to the lecture. No textbook and the slides aren't helpful. His voice is too low so if you don't get to the front seats early you will have a hard time hearing what he says.",
        "course": "CIVILEN2810"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "I also took 5810 and I really enjoyed the mock trials there! It is intensive but if you work smart you will definitely succeed :)",
        "course": "CIVILEN2810"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 4,
        "comment": "Learned a lot from his practical experience and would def take again! He speaks a bit soft but he more than makes up for it by his caring style",
        "course": "CIVILEN2810"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 3,
        "comment": "I did not know I had to become a lawyer while trying to become an engineer ! He will make you be an attorney and defend a case !! And if you fail to be a good attorney youll will receive 0!!!!! Btw this is done 4 times a semester . Yes, sadly some people received 0 on all four cases (presentations) and the jury ( are the students themselves )",
        "course": "CIVILEN5810"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 1,
        "comment": "This was one of the most boring classes I've ever taken. He is always talking more about things that are random than what we are actually learning in the class. Convinced he takes attendance because nobody would come if he did not. Easy material, but unbearably boring lecture.",
        "course": "CIVILEN2810"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really like the way he relates his experience to the course. He gives an overview about how engineer works on-field and how to apply them. Overall I would say he is really good in teaching this course. The exams are fine and all you have to do is read the slides and come to class",
        "course": "CIVILEN2810"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "If you pay attention to the in-class examples, you will do fine on homework and exams. His lectures can be a little confusing because he is scatter brained and even forgot which class he was teaching at some point. We got a cheat sheet for exams and the class is a pretty easy A.",
        "course": "CIVILEN2810"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very nice but kind of scatter brained sometimes. Exams were fairly easy and you could always have a cheat sheet. Lectures were long and boring at times, and he went on some confusing tangents, but overall a pretty easy class with not a lot of studying involved.",
        "course": "CE2810"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Need to take notes, easy A. Nice guy!",
        "course": "CIVILEN2810"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 4,
        "comment": "Homeworks were long and difficult, although TA office hours were a tremendous help. Lectures long and boring with Dr. Tan mumbling to himself and often going off on unrelated spiels. And tests were a complete guessing game, although Dr. Tan was nice enough to offer plenty of extra credit on them, plus curve them as needed.",
        "course": "CE2810"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best professor I've had! An amazing person. The only thing for you to get an A is to come regularly to his class. All exam problems were very similar to class problems.",
        "course": "CIVILEN2810"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 2,
        "comment": "Coming to Dr. Tan's  classes is a must if you want to earn an A. His exams are rather tough but he gave us bonus points. ",
        "course": "CE2810"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Gave a very keen perspective on the historical context of engineering; if he ever writes a book I WILL buy and read it! :D Very engaging and fun opportunities to apply your knowledge through hands-on group projects. His exams are quite interesting and test your knowledge in a concise but accurate fashion. Would HIGHLY recommend to others :)",
        "course": "ENG2361"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "I really enjoyed this course and truly felt like I learned a lot; he is the only one in the department who combines engineering theory and practical application, especially in a construction environment. Tough midterms, but if you work hard and participate in classes you will get an easy A. Best teacher I have ever had A+++ ",
        "course": "CE2810"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 4,
        "comment": "One of the worst professors I've ever had.  Extremely boring and not at all energetic about teaching.  He doesn't give you enough time to complete his exams.  Over all not a professor you want to take. ",
        "course": "2810"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 3,
        "comment": "The lectures were awful to sit through as it was him just drudging through this notebook that he makes you purchase (which saves you a lot of notes later).  He's hard to understand and was very hard to approach with quesitons. Also, the graders  had no idea how to do the homework and grading was almost always inconsistent. Have to work for an A.",
        "course": "CIVILEN2810"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.2,
    "department": "Civil Engineering",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0yMzU1ODg5",
    "lastName": "Burris",
    "legacyId": 2355889,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof. Burris truly cares about the subject matter and makes herself very available to discuss your needs (group issues, late work, grading). Lab is engaging but you really need to pay attention &amp; attempt to understand the material to be successful. Lab assignments are extensive so make sure you have good communication with other students &amp; TAs.",
        "course": "CIVILEN3510"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Burris wants you to succeed and enjoy the study of materials just as much as she does. She is disorganized and is terribly slow at getting assignments graded, but she does care and it's also still a pandemic so I have some understanding there. Even though she comes off as a know it all who is never wrong she sends very detailed email responses",
        "course": "CIVILEN3510"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Often times Dr. Burris seemed to be more interested in commitments outside of the class. She's also not the most approachable person.",
        "course": "CIVILEN3510"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Probably the worst professor I've had at this university. The amount of mistakes she made on assignments was laughable and directly impacted grades and impeded understanding. Condescending when confronted about mistakes and did not enjoy answering questions. Daily quizzes were worth 15-20% and were all or nothing. Lab and lecture were disorganized.",
        "course": "CE3510"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "I have never seen a professor make so many mistakes in so many areas of a class before. Her mistakes are constant. It is extremely frustrating and affects students' grades. This is only her worst quality, though. She is just an overall bad teacher.",
        "course": "CE3510"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "One of the worst professors I've had. Class and lab are disorganized, which leads to unnecessary difficulty for students, she often makes major mistakes when explaining concepts in lecture that we have to catch/ask about, she does not like to answer questions, she grades lab reports at the pace of a turtle, and her &quot;think-pair-share&quot; needs gone.",
        "course": "CE3510"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Everything about this class is a disorganized joke. The labs are a complete circus and nobody knows what they're doing or what is expected of them. Online quizzes always have mistakes. She seems annoyed when you ask questions and gives off a &quot;I can't believe you don't understand this&quot; vibe while teaching.",
        "course": "CIVIL3510"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Her handwriting is awful. Lab report every week, which sucks so bad. No the best professor, but not the worst professor either.",
        "course": "CE3510"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "Her first time teaching this course. Hope she improves her teaching method for next semester.",
        "course": "CE3510"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.9,
    "department": "Civil Engineering",
    "firstName": "Alper",
    "id": "VGVhY2hlci0xNTQ1OTY4",
    "lastName": "Yilmaz",
    "legacyId": 1545968,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Easy A for not learning anything!",
        "course": "CIVILEN2060"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "I took CIVILEN 2060 with Prof. Yilmaz. It was completely asynchronous through Carmen. He seemed to be really absent from the entire course. I'm not sure if he's more focused on his research or what but he basically gave us all free points on almost every assignment. I didn't learn really anything but still received an A-.",
        "course": "CIVILEN2060"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "He does a great job of explaining material and will warn you if he sees something wrong on your quiz (not for exams). My only complaint is that his exam questions were so poorly worded to the point that he would have to make an adjustment mid-exam or scratch the question, so I could not take them at the SLDS office like I was supposed to.",
        "course": "CE2050"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "I like professor Yilmaz. He is an easy grader. I had him both 2050 and 2060. 2050 is very easy if you take it with him. 2060 you need to put some effort to get an A. But 2060 final is very hard, but somehow I get an a. A good cheat sheet is really important in this class. Basically, the final is very similar to the example he shows in class.",
        "course": "CE2050CE2060"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "I mean he is really easy for 2050, but not for 2060. Tests for 2060 were challenging.",
        "course": "CE2050CE2060"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Yilmaz is a great lecturer and cares a lot about the class. He can go at a pretty fast pace sometimes so it is easy to get lost if you aren't paying close attention. All of the homework, quizzes, and exams were online and he gives multiple attempts on exams. Easy A if you pay attention, take notes, and do the work",
        "course": "CIVIL2050"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you go to class, this class will not be difficult. All of his assignments are out of a possible 110-120 points, but scored out of 100, so the averages are very high. He is a little disorganized when it comes to assigning homework and setting quiz/exam times, but overall he's pretty good. Example problems in class are the same as homework/tests.",
        "course": "CE2060"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really enjoyed this class with Dr. Yilmaz. He was a really good professor that made the material bearable, and as long as you make an effort you should be fine. Extremely helpful in class and in office hours. Although attendance isn't mandatory and slides are posted, it makes the class much easier when doing homeworks if you attend class.",
        "course": "CE2060"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wonderful lecturer, material was really dry and was very dense but Dr. Yilmaz made it bearable and very clear cut. Gives lots of extra credit and you get to make your own cheat sheets for exams. I feel this professor cares and that's hard to come by these days. If you attend class and  take notes, no reason you shouldn't pass with at least a B. ",
        "course": "CE2060"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. YIlmaz is a really good guy. Really wants all of his students to understand and be interested in the topics he presents. Attendance isn't mandatory, but sometimes you will get rewarded with a bonus quiz or two. Homework and quizzes almost every week, but it prepares you for the exam.",
        "course": "CE2060"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Tests were challenging and lectures were sometimes confusing and unrelated to the posted slides, but Yilmaz is a genuinely nice guy who has student success in mind. He also offers a boatload of extra credit, enough to where I could've skipped the final and still had an A-.",
        "course": "CE2060"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "Tough class.  He tried every way he could to give students the benefit of the doubt.  Midterm is tough, he grades very easy, and final project you'll get an A just by turning it in. DO ALL the homeworks, even if you know you don't know how to do one...HW is 55% of the grade.  Don't buy the book, lecture notes are online.",
        "course": "CE406"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class has a lot of content, so expect each lesson to be content-packed. Dr. Yilmaz can be slightly boring but its only because of the mostly dry content. Midterm was tough but he's quite lenient with it. He's VERY helpful outside of class. Go to office hours if you don't understand anything. He's extremely patient! Also, GO TO CLASS!",
        "course": "CE406"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "N/A",
        "course": "CE406"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.3,
    "department": "Civil Engineering",
    "firstName": "Rabi",
    "id": "VGVhY2hlci0xNTQ2NDY1",
    "lastName": "Mishalani",
    "legacyId": 1546465,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "The class is no joke, its tough and it will test you. As someone who has their final exam tomorrow, the tests are tough. Like most tough classes, there was a fair curve. Mishalani as a prof is extremely willing to help. He is friendly, easy to talk to, and explains things clearly. Great prof, 10/10 honestly, exams are just HARD (sorta unfairly).",
        "course": "CE5770"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "A very good lecturer that is easy to follow. Very helpful outside class.",
        "course": "CE7770"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is the hardest class that I have ever taken. I have never been scared of failing the class until I took his class. I barely passed the exam. He is a good lecturer but his materials are too hard and not able to help you for the final. Good Luck if you wanna take it.",
        "course": "CE5770"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Rabi is extremely hard to understand.  He talks in circles.  The material is not difficult, however he makes it more complicated than it is.  Class is extremely boring.  It is good to go though and fill in some of the notes.",
        "course": "CE540"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Civil Engineering",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xMzk4Mzgz",
    "lastName": "Durand",
    "legacyId": 1398383,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you need an easy lab gen ed, definitely take this class. There are weekly quizzes with two attempts based on the readings for the week and the lecture slides he posts. Along with the quizzes, there's homework with unlimited attempts. There are 10 labs in total and are an easy A as well. No midterm or final, just a couple of group projects.",
        "course": "EARTHSC1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Durand gives a very easy to pass, Gen-ed fulfilling science class with a lab. His lectures and course organization are extremely well organized and the material itself is easy enough that the course should be a walk in the park.",
        "course": "EARTHSCI1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class during covid- weekly modules are straightforward with reading, lectures, and a quiz along with a few group assignments throughout the semester. Lab was pretty easy as well. He did a great job checking in with students and adapting to make the class work better for everyone, and Id definitely recommend this class for a science GE.",
        "course": "EARTHSC1100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was amazing. The professors were incredible. Each week they had us fill out a form asking how we were/what we thought was too hard/what we disliked etc.. and they actually took our feedback and CHANGED the class each week based on what we said. If you do the work you will get an A. Multiple attempts on quizzes and NO MIDTERMS OR FINAL.",
        "course": "EARTHSC1100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest GE I've ever taken. He has lots a lecture videos &amp; what he says in the videos is what your weekly quizzes are based on. So watch them! Take good notes. But other than that, there were no exam, no finals. Simply group projects here and there and weekly quizzes. Such a great guy and very caring to student needs.",
        "course": "EARTH1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest GE I have taken, Professor Durand was a great teacher. Easy A",
        "course": "EARTHSC1100"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Durand was okay. He was passionate about the material, but had lots of errors in his slides and was sometimes aloof (he just skipped class one day and didn't alert us). Exams were trickier than they needed to be but still easy. Labs had no connection to the course and were also easy. Overall he was pretty easy, but frustrating at times.",
        "course": "EARTHSC1100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "He really cares about the subject matter and really wants you to care too.",
        "course": "EARTHSC1100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Durand is a great professor overall and compensated for a lot of students, knowing they have their own things to worry about. Very few assignments and midterms have clear review. Study the powerpoint slides he gives and take slight note of what he mentions in class and you will do fine.",
        "course": "EARTHSC1100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Durand is a great guy honestly; this class was interesting but also very easy. TopHat quizzes every class but he gives you the answer to them. Labs are also easy. Overall, great and easy choice for science GE-would recommend.",
        "course": "EARTHSC1100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great GE class, very easy, tophat quizzes everyday, he posts all notes online and tests are very straight forward. Lab is also extremely easy.",
        "course": "EARTHSC1100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great GE class. He is nice and cares about what he teaches. No need for textbook, just study his slides. Top Hat quizzes every class, but the questions are easy. Labs are mostly simple and easy. Exams are pretty easy and he gives study guide. If you go to class, you should be fine. Take ES 1100 with him, I think he only teaches it in the fall.",
        "course": "EARTHSC1100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Durand is a good teacher.  He enjoys what he teaches and it shows. The class wasn't too difficult.  Show up and you'll do fine.  Learn MATLAB because he loves it and doesn't teach it too well.  He expects you to know how to use it.  He's difficult to reach  email and sometimes doesn't answer them for a few days up to a week.",
        "course": "EARTHSC5655"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is an easy class if you need another science credit.  No need for a textbook.  Lectures are understandable and the exams are easy.   Speak up in his class, he loves class participation!  In class clicker questions every class for attendance. ",
        "course": "EARTHSC1100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Two midterms and a final that are very straightforward- he tells you the exact topics that will be on the exams and does not thrown many, if any, curveballs that deviate from these \"study guides\". Show up, pay attention, study what he tells you and you should do well. ",
        "course": "EARTHSCI1100"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "So slow getting grades up.  Clicker quizzes make attendance mandatory.  Tests are hard, but he gives review sheets.  Don't buy the book.",
        "course": "ESCI1100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Durand is a great professor. He tries to make class enjoyable as much as possible for this class. i strongly recommend, this class its easy and theres no problem getting an A in labs and on tests if you attend lecture. The book is not necessary.",
        "course": "EARTH1100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy prof, but full of himself.  Very full of himself and SO SLOW getting grades out it's ridic.  Even when he says they'll be posted, they won't be for like 2-3 weeks.  All class material is online, but he takes attendance, so don't miss too many classes for that reason- just show up with 10 minutes left and do the clicker quiz and you're set.",
        "course": "ESCI2102"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good professor, wants you to know the information. As long as you study, you will do well.",
        "course": "EARTH1100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "I never used the book at all. Lecture notes are on Carmen and a bullet point study guide is given before each test. Labs start out really short and easy and end semi short and easy. Never used all of lab time. Take this class. Professor Durand knows his stuff and speaks 100% english",
        "course": "ES100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Civil Engineering",
    "firstName": "Barry",
    "id": "VGVhY2hlci0yNzUxNzI0",
    "lastName": "Tolchin",
    "legacyId": 2751724,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Barry is super nice! He is very helpful and informative in survey class and a good academic advisor. I recommend him for sure!",
        "course": "ENGR1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.9,
    "department": "Civil Engineering",
    "firstName": "Tarunjit",
    "id": "VGVhY2hlci0xOTg2OTAw",
    "lastName": "Butalia",
    "legacyId": 1986900,
    "numRatings": 44,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Butalia went above and beyond to be available to his students. Definitely a professor you want to get to know!",
        "course": "ME2040"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "To simply put it- I wish they could all be like him. A great educational experience paired with support outside the classroom. Dr. Butalia cares about every single student!",
        "course": "ME2040"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best professor I have ever come across. Genuinely cares about the success of each and every student, cares about every student genuinely and ensures perfect understanding of the material. Even if Dr. Butalia has a class at 8am, take it. Learning around him will not only make statics easier but will motivate you throughout!",
        "course": "ME2040"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Butalia might be the best professor I have had at my time at OSU. Although the class was at 8am he came with energy. He listens to the students and is willing to adapt to the students needs whether that is additional office hours or zoom review sessions. He truly is the best. ",
        "course": "MECH2040"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Butalia is a fantastic professor. Even if his class is at 8 am, TAKE IT!! He is available outside of class and checks up on students on the class GroupMe. The 2nd half of the class is difficult (so go to class!), but there is extra credit. He makes the workload easy to work through, and I am glad I had Dr. Butalia as my professor.",
        "course": "ME2040"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Enjoyed this class overall. Grading was very fair and he gave plenty of time and opportunities to ensure we understood topics being covered. ",
        "course": "ME2040"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors at OSU. Very challenging class due to the amount of material and speed of the class. He offered office hours outside of class almost every day. He cares about the students and wants you to pass but also learn the material. If you put the work in, you'll pass. go to office hours and you'll be fine. Great class",
        "course": "MECH2040"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Butalia genuinely cares about his students and always goes above and beyond to have office hours for his students. One of the best professors OSU has. ",
        "course": "ME2040"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr.Butalia was probably one of the best professors I've ever had and probably will ever have. He really cares for his students make sure that we learn from him and suffer from his class. Thanks Dr.Butalia for an amazing semester!",
        "course": "ME2040"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Butalia was a great professor. His personality made an 8AM class very enjoyable. Of course the material can be hard but he made a great effort to make office hours available for everyone and answer any questions during class or in our class groupme. Just actively attend lectures and you will stay on top of this class. Do ask your questions!",
        "course": "ME2040"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Butalia was an amazing professor to have for ME2040! He truly cares about his students and created a strong sense of community throughout the class. The content of statics can be difficult but if you attend office hours, work on extra problems, and watch videos on some of the topics, you should be in good shape.",
        "course": "ME2040"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Butalia has been the greatest professor that I've had here. He is very caring about his students and is very sociable. Lectures are easy to understand and many Office Hours are available for students who need help. Gives plenty of chances for extra credit on quizzes, exams, and cheat sheets. Truly one of the best professors you could ask for.",
        "course": "ME2040"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Butalia is one of the best professors I have ever had. He truly cares for each one of his students and wants to see them succeed. As long as you put in some effort and ask clarifying questions you will do fine. He offers plenty of chances for extra credit and several office hour options as well. I HIGHLY recommend using his office hours!",
        "course": "ME2040"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Covers materials for exams, homeworks and quizzes week by week, and the material builds naturally. \nHe will take the time to answer a question or misconception. He stopped a whole class to review for the quiz because so many people felt unprepared. \nHe is also very compassionate to all his students, regardless of gender, disability, or otherwise. ",
        "course": "ME2850"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. \nOnly tests you on problems similar to examples you've already seen in class or on previous assignments\nGenuinely cares about your feedback and implements it throughout the course\nProvides more than just academic support but also makes their classroom a safe space for conversation/self-expression\nWish they could all be like him!",
        "course": "MECHE2850"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wonderful professor, exceptional man.",
        "course": "ME2850"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "An amazing professor and such a caring person. Provides a lot of extra credit, is very communicative with students, and is always open to questions/helping. Even when content becomes difficult, he does his best to teach it in a way thats easier for us to understand. He cares for students well beings and adjusts accordingly. Definitely recommend!",
        "course": "MECHENG2040"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Butalia is by far the most caring, genuine professor that I have had. The class has some difficult concepts, but he does well to break them down to understandable levels. You can tell that he really cares about his students going so far as to be in a Groupme with the whole class just to talk about life and how our days were. Would recommend.",
        "course": "MECHENG2040"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Probably the best professor I've had at OSU. He cares a lot about his students and he makes his class a uniquely fun experience. Also, all the tests and quizzes are fair and easy. Just study the practice material and look at recitation slides and you should get an A easily.",
        "course": "MECHENG2850"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely amazing professor! Really cares about students and wants them to succeed. Very helpful and explains complicated topics in a clear way.",
        "course": "MECHENG2850"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor i have ever had, hands down. Enough said",
        "course": "MECHENG2850"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Butalia is the best professor I have ever had. He cares about you as a person and only wants you to succeed. He has made a lasting impact on my educational journey and life. I have never met a more compassionate and inspiring teacher. I am grateful that I had the opportunity to take a class with him.",
        "course": "MECHE2850"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Butalia is one of the best profs at OSU. The guy is super caring and wants you to learn not suffer. Do the homeworks which will prep you for the quizzes, do the quizzes and the study guides which will prep you for the midterms.",
        "course": "ME2850"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really great professor, and he explains the content on the midterms very well which allows students to be well prepared. Definitely recommend taking him if you can!",
        "course": "ME2850"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Butalia cares about you! The class itself is not difficult because he gives you everything you need to be successful. My one regret is that I did not get to take the class in person because of COVID. He will randomly call on people in the class but I thought all things considered, that kept people more engaged!",
        "course": "MECHE2850"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "5/7 perfect professor",
        "course": "ME2850"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Butalia is a saint. If you have the chance to have him as a professor, even if it's an 8am, take it. His midterms are easy, not because of the questions, but because he prepares you insanely well for them (the average for our first midterm was a 100.5%). He's also a very caring professor and will happily help with any questions.",
        "course": "MECHENG2850"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very fair professor, all of his exams and quizzes are straightforward. Study the textbook questions!! He generally pulls exam and quiz questions directly from the book. He is a very fair grader and gives you many opportunities for extra credit.",
        "course": "MECHENG2040"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Butalia is the best professor I've had at Ohio State! He always walks into lecture with a smile on his face and he tries to make a boring subject matter as interesting as he can. He brought his dog, Raja, to class occasionally which was always a treat! Also, he wants everyone to get an A, and if you put in the effort he requests, you will.",
        "course": "MECH2040"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "At the beginning of the course, Prof Butalia made it clear that it is a lot more difficult in the beginning of the semester and it was. However, concepts became easier after the first midterm. He offered an extra credit paper (worth doing) and offered regrading on midterms. A truly nice guy who wants everyone to succeed.",
        "course": "MECHENG2040"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. Goes above and beyond with helping students. Informs what will be on quizzes and midterms and has exceptional study sessions. Knows what he is talking about and accepts when he makes a mistake.",
        "course": "MECHENG2040"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 2,
        "comment": "Best professor Ive had grading wise. He gives lots of extra credit opportunities (10 point extra credit question on each exam and 5 point extra credit group report). He also tells you exactly whats on each weekly quiz if you ask. Midterm reviews tell you exactly what will be on the exam and we had an optional final. Just study and do Homework",
        "course": "MECHENG2040"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best teacher at OSU. Easy to understand and actually wants his students to do well. Is very straightforward with what is on the exams and is very fair with all quizzes and exams.",
        "course": "MECH2040"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Butalia is hands down one of my favorite professors. He wants everyone to succeed and does all he can to help ensure that happens. He holds exam review sessions that are very helpful. Also he makes class enjoyable and is very understanding. Would definitely recommend taking a class with professor Butalia.",
        "course": "MECHENG2040"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Butalia goes the extra mile to make sure the students in his class are set up for success. He was available through email and office hours and set up extra guided study sessions outside of class. 10/10 would take a class with him again.",
        "course": "MECHENG2010"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "Explains all the material well. Gave ENORMOUS amounts of bonus points and opportunities for extra credit. If you go to lecture and put in minimal effort you will finish this class with a 107%. Really nice guy, funny, very happy that he was my professor.",
        "course": "MECHENG2010"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 2,
        "comment": "easy A if you do the homework and attend help sessions.",
        "course": "CIVILEN2050"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Butalia is one of my favorite professors I have had at OSU. He is a great lecturer that can get through dry material with the greatest enthusiasm. Very happy guy that goes on some tangents and loves to connect with his class and does his best to help students. Wish he could lecture every class of mine!",
        "course": "ME2040"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Butalia is truly a great teacher! He is invested in making sure that his students learn the material. I would recommend him to anyone who has to take ME2040. The material is hard but he makes learning it bearable.",
        "course": "ME2040"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 2,
        "comment": "My Favorite professor, I have had over my 2 years at OSU. He is fun, very interested in teaching and wants you to succeed. All around a fantastic guy and the class is pretty easy. Very straight forward",
        "course": "ME2040"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Butalia was a great professor. He was very flexible with exams and extra credit and went at the pace of the students. He would always answer questions both in class and in office hours. His exams were very fair and were straight from the book. The only downside was how heavy exams and quizzes grades were in this course.",
        "course": "ME2040"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love this man. He is very caring and wants all his students to succeed. He gives lots of extra credit opportunities, and even exempted students from the final exam if they did well enough on the previous midterms. The only complaint I could have is that his pacing was a bit inconsistent.",
        "course": "MECHENG2040"
      },
      {
        "index": 43,
        "rating": 1,
        "difficulty": 3,
        "comment": "Super friendly guy, but incredibly arbitrary grading and an almost non-existent syllabus. What started off as 2 midterms, 4 labs, and a paper somehow dissolved into a lone midterm and a couple labs by end of the semester. And the material was presented via sloppy handwriting and no clear schedule of topics. But super nice and helpful.",
        "course": "CE5561"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor's main goal is to give every student an A in the class. His homeworks were straight out of the lecture examples and were simple to complete. He allowed a note sheet on exams and the exams were really easy too. Each homework assignment had extra credit opportunity. Great guy that actually cares about his students.",
        "course": "CIVILEN2050"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.9,
    "department": "Civil Engineering",
    "firstName": "Colton",
    "id": "VGVhY2hlci0xOTk2MDk1",
    "lastName": "Conroy",
    "legacyId": 1996095,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "just go to class! you will be fine",
        "course": "CE3130"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "he was good but longer exam with very little time",
        "course": "CE3130"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Willing to Take time to help you understand.  Very personable and approachable.  Keeps it interesting. ",
        "course": "CE3130"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is new to teaching but you wouldn't be able to tell. He goes a little bit fast but he kind of has to for this class because there is so much material. Great at helping students achieve with a good balance of  help and practice problems as well as extra credit and hints. Also has a good sense of humor. He cracks jokes every once in a while. ",
        "course": "CE3130"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's new to teaching but he's really supportive and explains the material well. He always tells us to learn the concepts and he'll take care of our grades. Also, looks like a model. Seriously, i'm a dude and all my friends have man crushes on this guy",
        "course": "3130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Civil Engineering",
    "firstName": "Zuzana",
    "id": "VGVhY2hlci0yMzQzNjY3",
    "lastName": "Bohrerova",
    "legacyId": 2343667,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I find Bioprocesses with Prof. Bohrerova was a great class, even in an online setting. Topics are split into modules, with a mix of live and recorded lectures. Live-lectures are often calculation based, which is similar to the homework. Tests for each module are all conceptual and open-note. She replies to emails often and lectures are engaging.",
        "course": "EVENG5110"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Bioprocesses is a hard class and can feel like a lot of numbers and equations thrown at you at once, but as long as you take the time to get the concepts you'll do fine. Talk to her in office hours, answer questions in class. Good luck if you're in Civil.",
        "course": "ENVENG5110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 5,
    "department": "Civil Engineering",
    "firstName": "Soroush",
    "id": "VGVhY2hlci0yNTQ5MzU4",
    "lastName": "Zamanian",
    "legacyId": 2549358,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Overall a great instructor. He's very helpful and friendly. He presents it in an understandable way. He's always willing to review things. He exactly knows the potential challenges for students and emphasizes on those a lot. He's also a very fair grader.",
        "course": "CIVILEN3541"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Must come to class. The labs are very eye-openers. He genuinely cares about their students and their education.",
        "course": "CE3541"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 1.6,
    "department": "Civil Engineering",
    "firstName": "Karen",
    "id": "VGVhY2hlci0yMzE2NDY2",
    "lastName": "Dannemiller",
    "legacyId": 2316466,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "please just please take something else. the workload for this class is INSANE. no feedback is given on assignments and you have to get a 90 to move on in course modules. its a joke actually. ",
        "course": "PUBHEHS3320"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "One of those professors that gives way too much work (especially for a 3000 level course) and acts like they are better than you. This is a college course, not being her personal servant. ",
        "course": "PUBHEHS3320"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "I had her for ENV5110 Bio Processes, not public health. She's one of the worst professors I've had in a long time. Lecture slides were literal screenshots from the (equally as unhelpful) textbook. Provided nothing extra in lecture. Gave us awful grades on some projects without ANY feedback. Even when asked, just said it was wrong and didn't help. ",
        "course": "PUBHEHS3320"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "Class is extremely overwhelming with material. Not clear instructions given. You have to retake material until you get a 90% . So much to do for a 3320 class. Do not recommend at all",
        "course": "PUBHEHS3320"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "She's a new professor and it shows, completely changed the class after the low average on the first midterm, but made it ridiculously easy instead. Easy to go to class and get an A without learning anything, but if you pay attention to the lectures you can learn a lot.",
        "course": "PUBHEHS3320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 3.7,
    "department": "Civil Engineering",
    "firstName": "Andre",
    "id": "VGVhY2hlci0yMzU5NjMy",
    "lastName": "Carrel",
    "legacyId": 2359632,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Enjoyed taking class.clear material.make sure you work on worksheets before exams",
        "course": "CIVIL3700"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "The assignments take forever. The first exam was fine but the second was extremely difficult. Many hours every week spent on the assignments -- more than a 3 credit hour course should have. Very tedious. However, the Professor himself is very helpful if you have questions. ",
        "course": "CE3700"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Carrel is an excellent professor.  Knows the material very well and knows how to help students understand the material.  The homeworks are long, but they are graded fairly.  Exams were fair, with practice exams being handed out for each one with very similar questions",
        "course": "CIVIL3700"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Carrel did a good job. He is always willing to answer questions and wants students to succeed. The assignments do take a long time, but if you follow instructions you can get a good grade. The lectures could get boring, but I believe it's due to the overall content, not Dr. Carrel teaching. The exams were fair, especially if you attended class.",
        "course": "CIVIL3700"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Carrel really cares about what he is teaching. His online lectures are well put together and the exams have been open note which is stress relieving. It is not an easy class and the homework grading is nit picky, but other than that it has been a very enjoyable class.",
        "course": "CIVIL3700"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Carrel was really great. Came into the semester addressing the poor past RMP reviews, and made a noticeable effort to teach the class well. The notes are fill in the blank, with guided examples that align w exams. Assignments can be time consuming but you have over a week to complete. Did very well with the transition to online instruction.",
        "course": "CIVIL3700"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lectures are dry, but I guess you cant help that. What you can help is how useless the homework is, how tough the grading on the homework is, or the fact he doesnt attend his own office hours and instead has a GTA facilitate. Dont expect to have useful problems to practice before exams.",
        "course": "CE3700"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "The tests are HARD. The old exams passed back during class are so much easier than the ones given. Homework's are terrible! It will take over 7 hours for each one and they are pointless.",
        "course": "CE3700"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "He will give you big surprises on the exam. Avoids if you can",
        "course": "CE3700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.9,
    "department": "Civil Engineering",
    "firstName": "Daniel",
    "id": "VGVhY2hlci0yMzI2MTU2",
    "lastName": "Pradel",
    "legacyId": 2326156,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Took the first year they offered the class. \"co-taught\" with Cristina Millan, but she was only on zoom. Daily top-hats graded on accuracy. Bi-weekly group projects and papers. Unhelpful when group member were unresponsive. Would grade things harshly and update directions after-the-fact to include what they wanted. Participation was worth 1000 pts. ",
        "course": "CIVILEN3530"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "I had him for 2090. Honestly, he was just kind of mediocre. Points were often taken off from assignments for unclear reasons, and a big group project was sprung on us at the end of the year without him talking about it at all in class. Besides that, he seemed pretty knowledgeable and the class wasn't hard.",
        "course": "CE3540"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Grading of lab assignments seemed to be completely arbitrary. Participation grades were given with zero feedback as to how that score was determined. ",
        "course": "CIVILEN3540"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Pradel's lectures in the natural disasters class were some of the most interesting I have ever heard. He is very friendly and humorous. He is beyond knowledgeable on the subject.",
        "course": "CIVILEN3530"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Pradel is nice and funny. His exams are just awful and worth 75% of your grade which in my opinion is totally unfair. His exams are super hard as he tries to include the lectures, hws, and labs. If he didnt make the exams worth almost your entire grade, then he would be a great professor. Unfortunately no. Even professor Hur is better than him.",
        "course": "CE3540"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "He helps me find out that I am interested in geosystem, and I went to UC Berkeley for my Master's degree. If you want to learn some real stuff, go take his courses.",
        "course": "CE3540"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Pradel is very knowledgeable. There is a lot of info in the lectures that aren't in slides, so you should attend. The exams are fair, however they take up most of your grade. The graders are really picky, tough and don't seem to communicate. The labs are really fun, but don't expect much guidance on reports/final project. Interesting content. ",
        "course": "CIVILEN3540"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "The exams do not match his in class preparation at all. Goes through very few problems through out the semester which makes preparation for exams extremely difficult. The professor comes across as a nice guy but do not be fooled, he could care less on how you are doing in the class and grades harsh.",
        "course": "CE3540"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Pradel has some humor but thats about it. His tests are extremely difficult as he tries to attach the labs and lectures together in exam problems that dont make much sense. He is a strict grader who doesnt really care if you succeed or not in his class because you will make a lot of money eventually and nobody will care about your grade.",
        "course": "CE3540"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "This was an easy class as a first year elective. Its basically just lectures that you don't have to pay attention to and then easy research presentations every other week. Some &quot;executive assignments&quot; which aren't hard. He gave me 80% credit back for turning in a 100 pt assignment a week late.",
        "course": "ARTSSCI1137"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "Rambles during lecture and lectures are confusing. Homework and labs are nothing like exam. Not very lenient when it comes to late assignments.",
        "course": "CE3540"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hes quite rude. Snatched a flask out of lab partners hand during lab. Exams are confusing and 75% of your grade.",
        "course": "CE3540"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 5,
        "comment": "The golden goose. The unicorn of professors.",
        "course": "CE3540"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "This professor is hands down one of my favorite professors in the civil department. The material can be challenging at times, but Dr. Pradel is always willing to help. He makes himself available outside of office hours and truly cares about his students. His lectures are straight forward and communicates the course material well.",
        "course": "CIVILEN3540"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 4,
    "department": "Civil Engineering",
    "firstName": "Jordan",
    "id": "VGVhY2hlci0yNDIxNzIz",
    "lastName": "Clark",
    "legacyId": 2421723,
    "numRatings": 25,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "The GOAT",
        "course": "CE2060"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clark is so laid back but somehow makes you think at the same time. I learned a ton of stuff from him with like no effort. Go to class. Ask questions in lab. He'll basically do it for you. Everyone got an A that I've talked to. Beware of dad jokes. ",
        "course": "CIVEN2060"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great class if your into green buildings",
        "course": "CE4210"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": " ",
        "course": "CIVEN4210"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Way better than what I heard about 2060. You definitely have to come to class and lab,  which is long,  but if you do he works through all the problems with you and you barely have homework. Tests are like the labs and you can recycle code. Pleasant surprise.  ",
        "course": "CE2060"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "The course is partially at fault because the material was changed the semester I took it then was changed back when they realized it was terrible. This dude was the worst though, not from his teaching, but being just straight-up mean. He practically bullied the TAs and gave us assignments that were never taught. Learned 90% if the material myself. ",
        "course": "CIVEN2060"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Clark clearly cares about HVAC and makes it interesting.  I learned a lot.  Just do the hws and do ok on the quizzes and you'll get a decent grade. ",
        "course": "FABE5820"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clark made numerical methods interesting. These complex methods were pretty straightforward for me thanks to his delivery style. Humorous and loves slowly. This was probably my favorite course at OSU. ",
        "course": "CIVILEN2060"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Grades are competitive (he wont go off of Carmen grades), topics are confusing sometimes because he goes off track, quizzes and homeworks can be difficult and take long",
        "course": "CE4210"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clark is extremely practical. He makes up his own tests which are always real world design problems from situations he encountered in his career. Super down to earth and accessable. I learned way more about buildings than I thought I ever would. Tours and field trips were great, and a break. He grades things hard but curves at the end.",
        "course": "FABE5820"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Clark was very accommodating with issues that popped up this semester with my health. I appreciate the effort and humor he puts into his classes as well.",
        "course": "CIVIL4210"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good class.",
        "course": "CIVEN4210"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Clark did a great job teaching during the pandemic. He really cares about the material. Assignments are pretty vague sometimes but they're real-world and I feel like I can do something now. The curve is good. Overall I recommend this class.",
        "course": "FABE5820"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good class overall. He obviously cares about the material a lot and it is interesting for sure.",
        "course": "CIVILEN4210"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very interesting class for tech elect. Clark is a fountain of information. You just gotta try and keep up. Can be kind of all over the place at times, but was first time class was offered. Listens to suggestions. Big curve. Overall recommend.",
        "course": "CE4210"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Class was a lot of work but it was his first time teaching it. He worked a lot with us about moving deadlines and making projects or HW easier when needed. Very interesting class. Would recommend if you are interested in home/building heating/cooling optimization. He really cares about this class material.",
        "course": "CIVENG4210"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 5,
        "comment": "Straight up so much work. The homework can be 2 questions and will take 4 hours and like 50 lines of excel. The first homework was reasonable everything after that is ridiculous. The homework isn't particularly hard just very time consuming. The projects make little sense and are so much more work than is worth it. Even in excel its way too much.",
        "course": "CE4210"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Haha. Clark's so laid back I sometimes thought he might fall asleep in the middle of class. I think he's from California originally. Great teacher and helpful, especially if you want to talk about real engineering/research. Signed up for his other class this fall. we'll see.",
        "course": "CIVEN2060"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "Easily the worst instructor I've had at OSU. He got angry very quickly and was unpredictable. Several people I heard actually reported this. This guy should not be teaching. in general the class was terrible.",
        "course": "CE2060"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "I learned a ton in this class. I'm a sophomore and I can simulate ODE's which is not something I thought I'd be doing at this point in my career. Dr. Clark definitely challenges you and some people wanted simpler routine homework, but they shouldn't be in engineering school. Lots of whiners wasted class time but teacher is great.",
        "course": "CE2060"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor posted student first and last names with corresponding grades projected on the lecture screen in class. From what I have heard, not with consent. This is not within university policy or federal law (FERPA). His approach to students is unprofessional. Loosely guided instructions. Quick to anger when asked for clarification.",
        "course": "CE2060"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Clark is good teacher. I learned very much. If your grade is good he hire you for his researches.",
        "course": "CE2060"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "material is hard and kinda dry but Dr. Clark will spend time explaining if you go to his office. In the end, nearly everyone I talked to got an A. Homeworks are challenging at first if you don't know matlab. He keeps things interesting by making fun of Isaac Newton.",
        "course": "CE2060"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "Clark is funny and makes things as good as they could be at 8 in the morning. Grading is fair. Makes you think, sometimes a lot.",
        "course": "CIVILEN2060"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Clark does not appear to show interest in his students nor does he appear willing to help during office hours. He puts headphones on when you are in his office hours. He is very MATLAB heavy even though it is not a prerequisite to the course. He is poor at explaining topics and tends to make them way more difficult than they need to be.",
        "course": "CIVILEN2060"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.5,
    "department": "Civil Engineering",
    "firstName": "Natassia",
    "id": "VGVhY2hlci0yNTkxODM5",
    "lastName": "Brenkus",
    "legacyId": 2591839,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Brenkus did a great job during lectures by engaging the class. She is funny and has a good sense of humor. Be prepared to listen to lengthy lectures and run through long example problems.",
        "course": "CE4350"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Terrible experience when taken completely asynchronously. Unreasonable expectations for completion of the school work. Youll lose all your points if the formatting isnt correct. Take the steel class",
        "course": "CE4350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.9,
    "department": "Civil Engineering",
    "firstName": "Abdollah",
    "id": "VGVhY2hlci0xODk0OTA1",
    "lastName": "Shafieezadeh",
    "legacyId": 1894905,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": " ",
        "course": "CIVILEN3310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very good overall. Explains well and can follow his work. I would be able to go into class late and look at the work and still be able to follow. Very good at explaining. Would take as many of his classes as I could.",
        "course": "CIVILEN3310"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 5,
        "comment": "One of the best Professors I have ever had. Go to his office hours. He is friendly, considerate, and approachable. The material is difficult but he is a lenient grader. I learned a lot from his course.",
        "course": "CE3310"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "Content is difficult but Professor is very kind and willing to work with you.",
        "course": "CE3310"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good professor, knows what he is talking about. Class is pretty interactive as in he asks students questions to think about and answer. Homeworks can be a real pain but they are manageable. Exams are not bad, probably easier than the homework questions (besides being closed book). A few pop quizzes throughout the semester that can be whenever.",
        "course": "CE3310"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "Yes his notes are really hard to read, lectures aren't clear, and the exams are not very easy, but Professor Shafieezadeh cares about helping his students learn. I found office hours to be extremely helpful. If you're hoping for an easy class where you don't learn and get a decent grade this is not it. He makes you put a lot of time in to succeed.",
        "course": "CIVILEN3310"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "His classes was probably the hardest class I took with my class load. His hand writing is almost illegible. The lectures are pretty much useless because he does not really go step by step and takes short cuts to leave you wondering how he got his answer. Home work is hard and takes a lot of time to do. Exams are tough as well. Horrible online class",
        "course": "CE3310"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "The lectures are basic and won't explain clearly the steps to solve problems, just conceptual stuff. Homework are really hard for that same reason, so you have to look at his solved examples to figure out how to solve your homework. Tests and Midtems are ok if you understand the concepts. Recommend having a tutor for this class.",
        "course": "CE3310"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is a really good prof. His lecture materials (problem examples) really important and helpful. Dont be shy to ask question in his class.",
        "course": "CE3310"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Shafi is an excellent teacher for this class. I learned a lot from him in this class, but be prepared to spend a lot of time on his homework. Exams can be kind of tough but he is a relatively easy grader.",
        "course": "CE3310"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is extremely helpful, especially during his office hours. Exams might be a little tough but he is an easy grader. If he see's you have put in even some amount of work he gives most of the credit. Knows his stuff. ",
        "course": "CE3310"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "His exam material can be tricky and homeworks require work and a lot of thought but he is EXTREMELY helpful and patient if you see him outside of class. Had to do that and he ended up re-teaching me a lot of the stuff he did in class but he made sure I understood what was going on. Go to office hours, especially since things can be confusing!",
        "course": "CE3310"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Shafi loves to make his exam questions as tricky as possible, to the point where you don't even know where to begin. This is an issue when ultimately you need 2 pages worth of work for a question. He also includes types of questions that he says won't be on the exam (and are NOTHING like hw problems). Attendance not mandatory, but gives pop quizzes",
        "course": "CE3310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.3,
    "department": "Civil Engineering",
    "firstName": "Jeff",
    "id": "VGVhY2hlci0xOTg1NTE5",
    "lastName": "Bielicki",
    "legacyId": 1985519,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Interesting course content taught well. Class participation matters, & there are several pre-class readings. Final presentations have an unconventional grading style, thankfully the rubric is shared beforehand. Beware of picking a topic unfamiliar for your classmates-their lack of understanding could lead to negative feedback and lower grades.     ",
        "course": "ENVENG5600"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "he only knows how to teach the students who does well in his class, does not care about people who are struggling. does not want to change his teaching style. inform to come for a meeting who got less score but the meeting was open to whole class during his office hours, waste a whole class explaining quiz but does not talk about midterm revision. ",
        "course": "CE3080"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "The weekly quizzes suck so bad. Exams could be easier.",
        "course": "CE3080"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very entertaining professor. He cares a lot about the class and students. The weekly Friday quizzes suck, but it ends up making the exams much easier. Overall, great experience having him as a professor.",
        "course": "CE3080"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you want to get an A just go to all of his lectures and do the practices problems (optional). Don't be shy to ask him any question. Do well in the quizzes and midterms. Also, he is the best teacher I ever had for my undergrad.",
        "course": "CE3080"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "Best teacher in the department",
        "course": "CE3080"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really like him as a prof and a person. CE 3080 is not an easy class by any means but he will make time to explain things if you ask questions. ALWAYS ask about the homework questions in class if you expect to get examples. I am surprised by his reviews on here because he seems like he really genuinely cares about his students!",
        "course": "CE3080"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a great professor and wants you to succeed. The textbook is expensive and if you can split the cost and share it with others do it, Its useful. Also, If you get confused on a subject go to his office hours or email him, he is extremely helpful and wants his students to do well. Its a mandatory class to take for CE but its enjoyable.",
        "course": "CE3080"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is very clear on the subject matter, and explains it in easy to understand ways. He is absolutely willing to help anyone and answer any questions. And he certainly does seem enthused about his course. He is legitimately one of very very few professors I've had in the past three years at OSU that I was genuinely impressed by.",
        "course": "CE3080"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class involves a fair amount of reading and writing.  The assignments aren't too difficult--their are two during the semester and both are papers.  The midterm consists of answering 3 essay questions 500 words in length.  My only complaint is that he didn't adequately outline the rubric for the papers so I wasn't sure how he was grading them.",
        "course": "ENVENG5600"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Poor execution of syllabus. Most lectures devolve into class discussions composed of subjective opinions and is dominated by only a few students. Grading is harsh and are assigned in increments of ones (no decimals, so 4/5s for assignments that aren't perfect. His feedback is confusing (says \"good job\" but gives you a C). Don't take the class.",
        "course": "ENE5600"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "Nice dude and will help if you approach him, but it's evident he doesn't care about the class based off the minimal effort he puts into it. Difficult online homework and tests where a single mistake could mean a failing grade, plus a super expensive textbook that could've been substituted by lecture slides.",
        "course": "CE3080"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you can take this course with someone else, do it.",
        "course": "CE3080"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class sucks. I don't think I've ever sat through such a boring lecture. Doesn't seem to care much about what's he's teaching. When asked a question Bielicki often responds with \"it's in the book.\"",
        "course": "CE3080"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "Not really interested in the subject, he didn't make it anymore interesting.  WileyPlus was used to do homework and quizzes which always malfunctioned and was confusing",
        "course": "CE3080"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "Absolutely awful. I've only been in the class for a third of the semester and I hate him. He's extremely unclear and really unhelpful. Avoid this class at all costs if you don't have to take it, but more importantly, avoid taking it with him. Answers questions vaguely and unclearly.",
        "course": "CE3080"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 2.3,
    "department": "Civil Engineering",
    "firstName": "Benn",
    "id": "VGVhY2hlci0xMDQ1Njc0",
    "lastName": "Coifman",
    "legacyId": 1045674,
    "numRatings": 53,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "(2nd time as prof)When the subject matter is interesting, he makes jokes and makes sure everyone understands him. Less interesting classes can be boring with him, but would highly recommend his tech electives. Will not force you to participate besides TopHat, but encourages you to think about his questions. Don't fake the attendance or he will COAM",
        "course": "CE2050"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "(ece 2020) Worst professor i have had so far. doesnt give practice exams, assigns a plethora of hw and most of all, hides your grade so you dont know if you are doing well in the class or not until the very end where it is too late to do anyting about it. avoid this professor at all costs, take a professor that does not have difficult exams. ",
        "course": "EE205"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "(For ECE 2020)\n\nStarted the semester off \"right\" by marking a correct quiz answer as *incorrect*, and refusing to admit his fault and change the score for the majority of the class that got it wrong. Also had 45% average on our first midterm (I scored far above that, I'm not just being negative because of a low grade).\n\nAVOID AT ALL COSTS!",
        "course": "ECE205"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Coifman makes his class very hard. I would not recommend taking traffic flow theory with him. He does not cover the content very well and expects you to know traffic flow theory without ever seeing any examples. He will also deviate from the syllabus on working with a group for programming assignments. I would not recommend to anyone.",
        "course": "EE205"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "I'll start by saying Coifman was always a nice and reasonable person. That being said, I would avoid taking a class with him ever again. 100% completion requirement for homework, fairly harshly graded (although still nice to have) note sheets for exams, mandatory attendance of very boring lectures where he talks a lot and says nothing. ",
        "course": "CE2050"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "He was a little boring at times in class but overall he cared about us learning the material and made it decently easy to get a good grade. Every exam we were allowed a cheat sheet and there was extra credit for doing pre lecture assignments that otherwise were not graded besides attempting them.",
        "course": "CE2050"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "I think he gets bored so he just makes things confusing so that you will use Carmen messages a lot and give him something to do. Do the hw and know it and you will get good grade. Don't need to pay attention to lectures",
        "course": "CE2050"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "The BEST. Professors like him are scarce, who really take pains to explain concepts and drills it over and over again. Attending his class is an eye-opener amongst all these classes where you just end up learning engineering. He breaks down the most difficult concepts into simple understandable. would definitely take again. A real genius.",
        "course": "CE2050"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Some might think Prof. Coifman is monotone and dry, but I particularly enjoyed his lectures. His wealth of knowledge and anecdotes made class much more interesting. Prof. Coifman is a genius. lots of extra credits opportunity and the entire grade was comprised of 3 tests equally weighted.",
        "course": "CE2050"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Avoid this professor if you can. His lectures are very dry and he teaches off a word document which usually contains an enormous amount of words. He rambles a lot and isn't able to clearly answer people's questions in class. I learned pretty much everything from reading the textbook, but the examples he does in class can be useful.",
        "course": "CE2050"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "AVOID AT ALL COSTS.  - Ask a question that's not written word for word on his lecture notes? He gets flustered and can't give you an answer. - Makes SIMPLE statistics concepts seriously confusing; just read the book instead. - No equations given on tests. There are a lot of equations in statistics. - Won't respond to emails. and much more ...",
        "course": "CE2050"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Awful lecturer. Long, repetitive, tedious, homework. Spent six hours on a quiz problem on Carmen that I couldn't figure out. Went to ask him how to do it TWICE. He couldn't do it. Then received and email saying that he put three-ring answer in. Funny trendiest lecture, then it's all downhill from there.",
        "course": "CE2050"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "Avoid at all costs. Coifman has very long and boring lectures. He somehow finds a way to make a very easy topic somewhat difficult. He often gets lost and if you ask him a question that he can answer he gets very flustered. ",
        "course": "CE2050"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "The material isn't too hard, but Coifman's lectures make the class way more boring and frustrating than it could be. He repeats himself, awkwardly rambles, and you get the vibe that he just doesn't really want to be there.  Exams didn't get feedback. Don't recommend him. ",
        "course": "CE2050"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was AWFUL while he was the professor. He has the worst handwriting ever, and insisted on trying to \"teach\" the class off of his ipad. He somehow would come up with examples of like oilspills and stuff that made zero sense at all. He had a knack for making a SIMPLE class extremely hard!",
        "course": "CE2050"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "This is only my second week in this class and I already hate the guy. He can't teach, he gets his lecture straight from the book, and I can't stand his voice. Stay away, far away.",
        "course": "CE2050"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible. Writes all class on an Elmo but his handwriting is illegible. Takes points off for not doing things exactly how he wants you to, even though it's 100% correct. I got 10% off a quiz for summing currents going into a node instead of going out for nodal analysis. When asked about grading, all he says is &quot;ask the TA.&quot;",
        "course": "ECE320"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lectures and examples are from the book verbatim, making it easier to just teach yourself from the book. He goes a little overboard with the homework too. He was absolutely no help in office hours,I went several times and he never gave a clear answer. Has a big curve but not worth the trouble.  Avoid him for this class.",
        "course": "ECE351"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Avoid this guy at all costs. I wish I did.",
        "course": "ECE351"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "worst class of my entire life.  he is the worst professor and makes zero sense.  i would rather take any class over this one.",
        "course": "CEECE675"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 5,
        "comment": "I'm a 4.0 student and this guy removed that distinction.  In addtion to having test averages below 50% on both midterms and final, his curves don't take into account higher scores as well as they do lower scores.  Missed the A by 3 points on the final, I guess he couldn't just bump it up.  Would NOT recommend.",
        "course": "ECE320"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "This guy should be forced into early retirement.  I thought Dr. Cruz was bad, but he was a saint compared to Coifman.  NEVER take Coifman. Wait a quarter and take this class with anyone else.",
        "course": "ECE320"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 5,
        "comment": "Probably my least favorite teacher ever.  Didn't manage to get more than 50% on either midterm or the final, and went to every class and office hours on occasion.  I think he did maybe one legitimate example the whole quarter during class.  Overall, a horrible experience.",
        "course": "ECE320"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Coifman is the most underrated mistake on campus.  My grandfather would have done a better job teaching the class, and he's been dead for 30 years. While asking him questions in office hours, his response is consistant with what you would expect while taking a test.He only gives you hints towards a possible response, effectively driving you insane.",
        "course": "ECE320"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "Instead of selecting portions of the material to learn or just the basics (since this is an overview class for non-majors not a real ECE class) Coifman just makes you responsible for all the material and expects you to fail his exams. He curves extremely well, but its very overwhelming at times. Would not recommend.",
        "course": "ECE320"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "This professor sucks in lecture...He just write everything out and let the students to figure out themselves...I think it mainly because the syllabus is quite broad and lengthy. The book is very helpful for you to understand...If you want to score in his class...read his lecture notes and you will get a decent grade.",
        "course": "ECE205"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Like others have said, the Exams aren't the easiest, but if you pay attention in class you can easily get a B or higher.  You get a lot out of going to class especially since he prepares his lecture material and has all problems worked out before hand instead of wasting time trying to find errors he made trying to calculate stuff on the fly.",
        "course": "ECE205"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 5,
        "comment": "You will learn nothing and god help you on the exams.  Not enough time, and too complex of problems.",
        "course": "ECE205"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 1,
        "comment": "Let's say you showed up every day, didn't do the homework, got 15%'s on all exams...  You'd get a C-.  Let's say you showed up every day, DID do the homework, got 45%'s on all exams... You'd get an A-.  Either way, you're going to pass.  Oh, and on Coifman... he loves Legos and plays Dungeons and Dragons Saturday nights in his mother's basement.",
        "course": "ECE320"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is so smart that even the simplest thing will be so difficult when he teach it. The only positive thing about him is that he's very generous in giving curve!!",
        "course": "ECE320"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 3,
        "comment": "Coifman isn't a bad guy or teacher.  Yes, his exams are un-merciful and I don't understand why he makes them so hard.  But he does try to motivate you to give that little extra effort, and he tries to prepare you for real world situations that won't have clear solutions.  I was actually kinda inspired by him, kinda, then I took the final.",
        "course": "ECE205"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "He isnt necessarily a bad professor, but I just dont agree with the way he teaches. For example he aims for a 50% on his exams. I would rather take an exam that I have a chance of passing. There is homework every week, and he gave a pop quiz. He could be helpful at times during office hours. Other times he took the long way to explain something.",
        "course": "ECE205"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 4,
        "comment": "He's completely unable to admit when he is wrong. He wrote 'find the transfer function for such and so' on our second test, and then when people did what he asked instead of what he meant in his mind, 'derive from first principles, don't use the op amp transfer function', he said that 'in the real world' you do more than people ask. -10 pts, woo.",
        "course": "ECE320"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 4,
        "comment": "He's a decent professor. The tests really aren't all _that_ hard, if you actually understand the material. On the other hand there have been a handful of times when he shows a lack of solid grounding in mathematics (when he's drawing log plots for filters comes to mind). Still, it's quite possible to learn the material in his class.",
        "course": "ECE320"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 5,
        "comment": "Makes Exams terribly hard.  (30% averages).  If you have trouble learning from the book you might have trouble with this class.  Lectures are not very helpful.",
        "course": "ECE205"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 4,
        "comment": "This guy is truly passionate in becoming the biggest dick professor at OSU. Lacks the ability to teach, horrible lectures, assigns crazy homework, and purposely makes his tests difficult. The only positive thing is that his class averages are so low, a 80% is a solid A.",
        "course": "EE320"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 5,
        "comment": "what a dick.  thats all i can say about the guy.",
        "course": "ECE205"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 4,
        "comment": "Absolutely terrible as a professor.  Doesn't really teach so much as solve equations in front of you on an overhead transparency.  If you were able to see what he was doing, maybe things would make sense.  Moves very fast and overcomplicates the exam.  Does offer generous curve, but 32% average is still ridiculous.  Take another section if possible",
        "course": "EE205"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 1,
        "comment": "This guy is a joke.  Worst professor I've had.",
        "course": "EE694"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 4,
        "comment": "If you're smart, you'll have no problems",
        "course": "ENG652"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good professor. Lectures are easy to understand and are very informative. Grades on a very generous curve. Would recommend.",
        "course": "EE205"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 2,
        "comment": "I don't understand the harshness to this guy.  His tests are tough, but he grades on an easy curve.  He teaches the fundamentals well and I always found his lectures easy to follow.  His door was always open to answer my questions.",
        "course": "EE205"
      },
      {
        "index": 43,
        "rating": 1,
        "difficulty": 5,
        "comment": "he is my worst professor.he made me cry.nobody can make me cry",
        "course": "EE205"
      },
      {
        "index": 44,
        "rating": 3,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "EE205"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "EE205"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 2,
        "comment": "His lectures made a lot of sense to me.  His tests were ALL variables.  He wants and gets 50% averages on the exams he gives.",
        "course": "EE205"
      },
      {
        "index": 47,
        "rating": 3,
        "difficulty": 3,
        "comment": "Brilliant guy, but tough to understand",
        "course": "CEEE694"
      },
      {
        "index": 48,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is smart. But...he always make simple things become difficult..",
        "course": "EE205"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 5,
        "comment": "I never, EVER should have passed 205, but somehow, I did.  This guy is the absolute worst (and most difficult) professors I have ever had at OSU.",
        "course": "EE205"
      },
      {
        "index": 50,
        "rating": 1,
        "difficulty": 5,
        "comment": "Smart guy.  Horrible professor.",
        "course": "EE205"
      },
      {
        "index": 51,
        "rating": 2,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "EE205"
      },
      {
        "index": 52,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I ever had",
        "course": "EE205"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good lecture notes, with a heavy side of sarcasm and tangential conversation.",
        "course": "EE205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.7,
    "department": "Civil Engineering",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNDI4NjY=",
    "lastName": "McCord",
    "legacyId": 242866,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Mark knows how to explain his points clearly, even making people laugh along the way. Homework can be time-consuming and graded strictly for technical communication (page numbers, etc.). Attendance is taken every class. Mostly an enjoyable course, except he can make people uncomfortable or weirded out. Cool enough guy",
        "course": "CE3700"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "It is a fairly easy class but made hard for no reason. I got a lot of points taken off on HWs for minor things. Class is mandatory and the lectures are long and boring. The homework doesn't align with the exams so the class is a bit disorganized. If you don't understand his notes then it can be a struggle to follow along. ",
        "course": "CE3700"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor and very supportive.",
        "course": "CE775"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Mark McCord is honestly one of my least favorite professors at OSU. I am a senior civil engineering student and I have never had a professor take off as many points on assignments and tell me that I was wrong for spelling, grammar or something and have his comments not even make sense. If you have the chance to avoid him, do it. 0/10 for me.",
        "course": "CE5720"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is very driven in his research and helping students learn. I had several personal issues so my grades dropped but he was very encouraging and helped me a lot. Exams are tough, study hard. Be in class to fill out the notes. He has a strict grading format, which helps build technical writing skills you'll need in other classes. Great professor",
        "course": "CE3700"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor McCord was such an annoying professor, but the class was pretty easy. Just pay attention during class (esp when he assigns HW because he gives you most of the answers) and make good cheat sheets. The exams aren't nearly as difficult as everyone says they are, so long as you understand all the homework assignments and lecture problems.",
        "course": "CE3700"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Really good professor who is very passionate about the topic and has a lot of experience in the field that he shares in class. His lectures can be confusing at times but he provides really thorough notes that help you follow. Exams are pretty easy since be provides previous exams to study off of.",
        "course": "CE3700"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Hes a good teacher and hes very knowledgeable about what he does. Is a good teacher. But the exams are absurd. The questions are not straight forward, he twists them to ask things you wouldve never thought to study. Exam 2 is the worst, and make sure to study stuff from exam 1 for exam 2 also. Good teacher, but exams are the worst.",
        "course": "CE3700"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super compassionate professor. Very good guy! He makes understanding engineering easy.",
        "course": "CE570"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor who truly cares about his students. Super understanding when students are going through hard times.",
        "course": "CE570"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class isnt like any other classes that i have taken and its a fun class for me. Many activities outside of the class which is super fun for me as you can imply the skill that has been taught in the class.",
        "course": "CE5720"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Take all these comments and form one giant comment. That's him in a nutshell. I should have taken surveying.",
        "course": "CE3700"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. McCord knows what he's talking about, plus he really cares about his student. He would explain both materials and assignments to make sure that students fully understand. His exams aren't hard, and are consistent to the previous exams that he posted online as a study guide. Basically if you come to class and do practice exams, you'll be fine.",
        "course": "CE3700"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 5,
        "comment": "McCord is a great guy and really wants you to learn, but the material brutally mundane. No textbook, so if you don't understand McCord's notes, you're out of luck. Lots of work and hard tests.",
        "course": "CE3700"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very knowledgeable professor, he has a lot of ongoing projects/research so he's pretty up-to-date with the transportation engineering field. Assignments were pretty tedious but it makes up for the lack of quizzes in the class. Can be quite entertaining in class with his hand gestures and actions.",
        "course": "CE3700"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took so many classes in transportation engineering and I would do it all over again. very knowledgeable and organized and makes the material look so easy and tries to help students a lot. He's a big plus in the department for students in Civil Engineering.",
        "course": "CETRAN"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "Class is pretty easy, although lecture is extremely boring/useless, only go to turn in homework and get it back(takes off points for homework not picked up. Hes rude and acts like hes the man. Is entertaining to watch and laugh at. Makes crazy hand gestures. Kinda reminds me of a creepy old guy lookin to mack on some young girls, he could never get",
        "course": "CE570"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "Mediocre professor.  Material from lectures is on exams.",
        "course": "CE540"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. McCord is a great professor. He is a flippin genious though and is sometimes on a level above his students.",
        "course": "CETRANS"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 1,
        "comment": "He is nice, but his notes look like they've been written by a five year old.  He's very lucid in his teaching instruction, but, his class is not at all challenging, and is kind of a disgrace to engineering give its level of difficulty (low).  Also, he wears sweatervests (nuff said).",
        "course": "CE5SOMETHING"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very fast talking, but will explain things more if people are having problems.  Gives fair homework and the test wasn't bad at all.  If you can keep up with him and participate in his lectures, you'll do well.",
        "course": "CE775"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very Good and Awesomely Inspirational",
        "course": "CE775"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Civil Engineering",
    "firstName": "Andy",
    "id": "VGVhY2hlci0yOTA2MzAy",
    "lastName": "May",
    "legacyId": 2906302,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Good course, solid lectures. 2 group projects instead of the exam which involve making 15 minute videos to learn more about concepts. Funny professor, makes a lot of jokes to hold your attention ",
        "course": "5140"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was the best professor I've had at Ohio State. Fluids is a hard class, but Andy made it fun. He is extremely understanding with any absences, and loves answering any questions you might have. He enjoys interacting with his students, always heard you out, and speaks to everyone as if they're equals. ",
        "course": "3130"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. May is one of the best professors within the Civil community. He genuinely cares for his students and is willing to help them wherever they're at in the material. Fluid Mechanics is not an easy subject, but he makes it easy to succeed and to learn the material. Can't recommend taking his course enough. ",
        "course": "3130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.8,
    "department": "Civil Engineering",
    "firstName": "Kadri",
    "id": "VGVhY2hlci0yNTQwNzU1",
    "lastName": "Parris",
    "legacyId": 2540755,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor, funny, cares about his students. Attendance was mandatory, but he made every class enjoyable. Makes material easy to understand, and has accessible office hours if needed.",
        "course": "ENGR1181"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "THIS IS THE BEST PROF EVER!  TAKE !! Take 1182 with him and reach out to him if you have any issues ",
        "course": "ENGR1181"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "A super amazing professor who is always excited to teach others. ",
        "course": "ENGR1181"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I've had by far. Always dressed up in suits and was inspirational in class. keeps lectures interesting and can tell that he loves to teach. Super nice and amazing professor. Flexible with deadlines and makes time to help everyone. ",
        "course": "ENGR1181"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Overall great professor and is extremely understanding when it comes to deadlines or missed quizzes. The class is a lot of work and graded tough but that is just ENGR 1181. Class material is fine and he mostly reads from the signs but still does his examples and occasionally gave rewards for partcipation",
        "course": "ENGR1181"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Parris is an interesting guy and has a lot of relevant industry experience. He was also very flexible with deadlines when our entire team got sick one week. Unfortunately, he teaches a really boring and unnecessarily work-heavy class. If youre stuck taking 1181, hes a good choice overall.",
        "course": "ENGR1181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 2,
    "department": "Civil Engineering",
    "firstName": "Lei",
    "id": "VGVhY2hlci0yMjU0NzIx",
    "lastName": "Wang",
    "legacyId": 2254721,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "I strongly recommend avoiding any class taught by Lei Wang. He is extremely difficult to work with, both in terms of communication and accessibility. Despite having scheduled office hours, he is rarely present, making it nearly impossible to get assistance when needed. Emails go unanswered, leaving students frustrated and unsupported. ",
        "course": "CIVILEN5461"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Lectures are hard to sit through, but mandatory. Doesn't upload slides in some classes. Randomly grades homework harshly.",
        "course": "CIVILEN5441"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Wang cares about student success and will work with students as needed, but his lectures are very dull and it is challenging to retain any of the information covered. Thankfully he uploads the slides online though, so it's easy to review from there. His labs also seemed arbitrary and pointless, but the class was not overly difficult.",
        "course": "CIVILEN5441"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Civil Engineering",
    "firstName": "Michael",
    "id": "VGVhY2hlci0yMjU3Nzkw",
    "lastName": "Hagenberger",
    "legacyId": 2257790,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fav professor ever. Funny, helpful, and certainly a character you won't forget. ",
        "course": "CE4000"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Hagenberger encourages students to think on their own and often pushes them toward projects with little to no guidance. His lectures also seem unnecessary, as he spends a good chunk of time telling personal stories, and the content he does cover could be easily sent in an email.",
        "course": "CE4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.2,
    "department": "Civil Engineering",
    "firstName": "Golnazalsadat",
    "id": "VGVhY2hlci0yMjU0NzE4",
    "lastName": "Mirfenderesgi",
    "legacyId": 2254718,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's a good professor and very understanding. The class just sucks. Boring material. ",
        "course": "Aero3581"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Makes everyone comes to lectures even when people are sick and coughing around you because attendance is for a grade. When lecturing all she's doing is coping off another tablet and is way to focused not making mistakes that she forgets we are trying to learn. Terrible lecturer. ",
        "course": "MECHENG2850"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Mir is a good person and an OK prof. She cares and tries. I felt bad for her since the class doesn't pay attention; lectures are a snoozefest. HW was annoying to me, felt tedious and long. Exams were like the homework. Recitation has attendance. Would be better as inverted classroom. Again, she's nice, but lectures are monotone and boring.",
        "course": "MECHENG2850"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Not the greatest lecturer but I think she understands that. Do the homework, exams are the same as study guides, she grades very leniently. She does explain very well if you go to her office hours.",
        "course": "MECHENG2850"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "I had heard prior to taking the course that she made exams fair and finals much more difficult, and this is exactly what happened. Exams 1 and 2 were similar to the practice exams, but the final was much more difficult than expected and brought my grade from an A- to a C+. ",
        "course": "MECHENG2850"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "The midterms were pretty accurate to the homework. The final was slightly longer and harder than the midterms, but if you study enough and do enough practice you will be fine. She was a great lecturer, and she really cared that her students were learning! Going to TA office hours were super helpful for completing the homeworks. I def recommend her!",
        "course": "MECHENG2040"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Mir was awesome! Showing up to her lectures every day helps a lot with the class. While homework was time consuming, doing it really helps prepare you for midterms and finals. I learned a lot from her and I'd definitely take her class again.",
        "course": "MECHENG2040"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Midterms were fair and on the easier side compared to the homework problems. The final was similar to the homework and reviews although I can see how some people think it was hard as it was harder than the midterms. Gives a surprising amount of extra credit in the homework, tests, and participation.",
        "course": "MECHENG2040"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had her for both mech2040 and aero3581, she is the goat with the latter, definitely redeemed herself after the former",
        "course": "Aero3581"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Mir went pretty slow in lectures but this was helpful in truly understanding the material outside of class. She was very fair on homework and TA's provided examples of similar problems in recitation. The midterms and finals were all very fair. She offers a lot of small extra credit chances. She was also super helpful in office hours every time ",
        "course": "MECHENG2850"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "I like Professor Mir but her teaching style is not for me, it is a little too slow-paced in lecture. I would've preferred to not go to any of the lectures but she had bonus quizzes in class but they ended up not counting for much. I did not like 2850 because many concepts felt useless, but I've heard it's a helpful class for the future.",
        "course": "MECHENG2850"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Rather than keeping a consistent difficulty throughout, she makes the midterms really easy to build a false sense of security, then destroys the whole class on the final. Makes sense though, SEIs happen right before the final so the department will never hear anything but positives about her class. Solid teacher, unfair course structure.",
        "course": "MECHENG2020"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very boring and difficult to follow lectures with long and poorly explained homeworks.  My TA was nice but very little help. I struggled immensely in this class.  Plus side is pop quizzes are extra credit and the tests are very doable with excellent equation sheets.",
        "course": "MECHENG2850"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Mir was genuinely invested in our learning and explained the topics excellently, especially during the live lectures. She provides extra credit opportunities for assignments and was very lenient when grading the exams, so trust that you'll do great if you learn and apply the core concepts well. ",
        "course": "MECHENG2040"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "dr mir is just bad. there's a ton of content and she doesn't help much even though she asks for feedback throughout the semester. her final exam is awful and brought my grade down 10%",
        "course": "MECHENG2040"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "The final took her from a 4/5 to a 2/5. The final was one of the worst I've ever taken, and was impossible to do in the provided time. The rest of the class was do-able if you worked hard. However, her lectures were long and boring, and her quiet voice and lack of 2x speed made them worse. Best advice, do as many practice problems as you can.",
        "course": "MECHENG2040"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "All she does in the zoom is go over the pre-recorded lectures word for word which is very unhelpful since the questions she answers do not clear things up. Learned much more from my TA than from her for 2040.",
        "course": "MECHENG2040"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "Lectures are not good and you can make it through the class without attending a single one with an A. However, the final is 100 times harder than any midterm or practice midterm she gives. The class average for the final was an F and it's worth 30% of the grade which is insane. Avoid this professor if you can because she screws you over at the end.",
        "course": "ME2850"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 5,
        "comment": "Lectures were overwhelming, my hand would hurt after. I liked this class UNTIL the end of the semester.  midterms were very fair and I did well. But EVERYONE got killed by the final and she didn't curve which ruined our grades. I also asked for an extension on HW and she said no because she didn't see the email I sent before she posted solutions...",
        "course": "MECHENG2850"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 4,
        "comment": "Lectures are kind of boring but notes are published. Homework was usually very long taking 5+ hours a week and some problems you had to go to office hours or else you won't get the points. Midterms were fair but the final was not fun, I thought I failed but she gives a lot of partial credit. She curves if needed.",
        "course": "ME2850"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "I liked having her as a professor and feel like the homeworks and midterms were very fair. However, her finals are very difficult and usually drop your grade a little bit.",
        "course": "MECHENG2850"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Mir was a pretty solid professor, though mechanics of materials is a pretty boring class. The material is super important and start the hws at least 3 days in advance as it requires time to understand. She is very responsive to feedback (shortened hws &amp; added extra credit questions to exams). The midterms were ok, but the final was brutal.",
        "course": "MECHENG2020"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my best professors at OSU",
        "course": "CE5220"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 3,
        "comment": "Mir's lectures are a little dull, but she puts all the material online and it's not a necessity to attend class. She's available during her office hours though and will work with you one-on-one to make sure you understand the subject matter. As long as you review the notes and do the homeworks, you should be okay to pass.",
        "course": "CIVILEN5220"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Civil Engineering",
    "firstName": "Jim",
    "id": "VGVhY2hlci0yMTQyNDUw",
    "lastName": "Barnhart",
    "legacyId": 2142450,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Nice lecturer and shares his real-world experience, but kinda drones on at times and the midterm questions are random, seemingly-minor details from the slides.",
        "course": "CE3510"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Civil Engineering",
    "firstName": "Paula",
    "id": "VGVhY2hlci0yMTM3NDM0",
    "lastName": "Mouser",
    "legacyId": 2137434,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Nice and will help if you ask. Class consist of difficult materials which, at times, could benefit from more thorough coverage. But she offers extra credit opportunities through labs and current events. Also allows for \"cheat sheet\" on quizzes and tests, which makes difficult material much more doable.",
        "course": "CE3160"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.7,
    "department": "Civil Engineering",
    "firstName": "Cody",
    "id": "VGVhY2hlci0xNTM5NDY0",
    "lastName": "Allison",
    "legacyId": 1539464,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "What a bro.  He will help you out if you have any trouble/questions.  This is his last semester, sadly.",
        "course": "ENGR1182"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Is a cool guy, doesn't know as much as some other TAs but is as helpful as he can be. Has a good sense of humor that lightens class up",
        "course": "ENG183"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very interested in helping his students, so nice, and very sexy, makes going to class so worth it. Best TA ever!!!!",
        "course": "ENG183"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great TA, very helpful, down to earth guy once you get to know him, very friendly and worth going to class because he will help you alot",
        "course": "ENG183"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great guy, loves to help you out when you have questions.  Easy person to talk to.  He is a down to earth guy who loves to help.  Great TA and funny guy",
        "course": "ENG183"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dudes awesome,  'Nuff said.  also I'd tap that. (coming from a completely heterosexual male of course)",
        "course": "ENG181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.8,
    "department": "Civil Engineering",
    "firstName": "Robert",
    "id": "VGVhY2hlci05OTk5OTk=",
    "lastName": "Mergel",
    "legacyId": 999999,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Everything is open note and he goes over every homework assignment before it's due. An awesome guy, and even though he makes it a fairly easy class, a lot is still learned and it's the perfect way to get a confidence boost starting in the major",
        "course": "CE2050"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr Mergel is awesome. You dont have to go to lecture but it helps a lot to go because he explains everything including homework and tests. Labs are great and he helps with everything.",
        "course": "CE2410"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Best professor in the department. The only thing to remember: Go to class. He explains everything including how to do the homework, step-by-step. Labs are hands on and is also clearly explained during lab sessions. ",
        "course": "CE2410"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Intro to surveying was very easy.  He pretty much told us step by step what to do on everything and all tests were open notes.  Overall a great teacher.",
        "course": "CE2410"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "An extremely easy class and you ACTUALLY feel like you're learning stuff. Has weekly assignments, 2 midterms & a final. Exams are open book. Mr. Mergel is very helpful and wants students to really understand basic surveying rather than simply taking exams. You learn a lot from the field work which is a ton of fun! Do the homework & practice exams!",
        "course": "CE400"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Mergel makes this class EXTRA easy, Our first midterm had an average of 92, the second was 100 due to the extra credit opportunities on it.  Both were open note.  Don't expect to learn much from the Lectures, but the labs are a really great experience. Midterms are nearly identical to practice midterms he provides.",
        "course": "CE400"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Exceedingly easy class. Has a very odd but entertaining sense of humor. Easiest A I've ever received.",
        "course": "CE400"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the all time greatest professors at ohio state.  His class is *extremely* easy (97% avg on the first midterm), but I think I learned more in this class than any other class i've taken so far.  Hes got a dry sense of humour but is really hilarious.  Labs are kind of difficult sometimes but fun and you don't have to worry about your grade.",
        "course": "CE400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 2.9,
    "department": "Civil Engineering",
    "firstName": "Shive Kumar",
    "id": "VGVhY2hlci0xMjMwNDQz",
    "lastName": "Chaturvedi",
    "legacyId": 1230443,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't get on his bad side! He was never willing to work with me after hours and in office hours. If he doesn't like you don't expect to get a decent grade because it will no happen. He does not care and in my opinion was hired to do research and not teach. Would not take him again if not nessacary but it is. Try to get on his good side early!!!",
        "course": "CE3310"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Exams are straight memorization with a couple homework-type problems at the end. Attendance not mandatory, but he'll take attendance on days that a lot of students skip and uses to bump your grade if you're in between grades. You also kind of need to attend to fill in blanks in notes but if you get those notes from another student, I'd say skip it.",
        "course": "CE3510"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Cool Guy",
        "course": "CE3310"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "I thought I was going to get an A-, ended up with a C-. Class is so unbelievably boring (because he is an awful teacher), yet so simple. It's that easy class that you brush aside because the lecture is pointless and the homeworks are easy but since you ignore it you end up getting a bad grade.",
        "course": "CE3310"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Do not bother getting the text book for this class, it is not used. Do your best not to miss this class. It is extremely boring but you but all test questions come right from lecture notes. This class is all memorization. Exams were very similar to those given to classes in previous years.",
        "course": "CE3510"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is probably unavoidable if you're a civil engineering major.  But it's not going to be a pleasant experience. No curve, exams are straight memorization, need to memorize exact answers.  only 2 homeworks, each worth 6% of your grade for course.  Labs are a good time though, you get to make concrete!",
        "course": "CE3510"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "I was very disappointed. His syllabus is useless as he announces exams a week before and only gives out hw in class. His lectures are awful as he will waste your time and half the class on random digressions. He is a seemingly nice man, but he is simply a bad professor and the otherwise great CE department would benefit from his retirement.",
        "course": "CE3310"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Had him for 431, and 451. Pretty useless as a professor, he acts very unprofessional and doesn't really have any strategy for teaching the material. He turned an easy class hard.",
        "course": "CE451"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "One of my favorite profs in CE.  Just a loveable guy, and very nice.  He has a unique teaching style, but gets the material across.  I recommend this guy highly.",
        "course": "CE451"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Had him for ce431, 451, and 535. Great professor, learned much from him. Go to class as he makes things much clearer than the book. He sometimes sings the notes as he writes on the board, and occasionly has some funny jokes. One of the best in CE",
        "course": "CE535"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Has a very good lecture style where he provides many notes to you, so you can listen to what he says.  Labs were fun and educational.  Had 2 homeworks both were fairly easy.  His tests are difficult make sure to know definitions, homework solutions",
        "course": "CE451"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very very good professor. Really helpful, home works covered 30% and we had only 4 which were very very easy. His mid terms are very  tough, make sure you understand the concepts, the final was very easy and expect A- to B in his class. ME/CE 662 is a grad level course, comes under tech. electives in design and manufacturing for ME students",
        "course": "ME662"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.8,
    "department": "Civil Engineering",
    "firstName": "Gajan",
    "id": "VGVhY2hlci0xNzQyMzIw",
    "lastName": "Sivandran",
    "legacyId": 1742320,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was the first semester Gaj taught this class - so the material was new to him - but he still did an amazing job getting across really complex ideas in a way we could understand. Very approachable and willing to spend time outside of class if you need it. Take this class if you can",
        "course": "UCSF137"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "LUC Students -- you only have one more semester to take Gaj for UCSF137 and you will not regret it. A teaching style like I have never experienced before -- engaging, energetic, and he does not bore you with details. Lots of easy homework assignments/reading quizzes to pad your grade. 3 quizzes and a final (study sheets are allowed)",
        "course": "UCSF137"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loyola students, take Professor Sivandran for UCSF 137. Great professor with clear expectations.  Lectures are not always exciting, but material is straightforward. If you go to class, you will get an A.",
        "course": "UCSF137"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Loved the storied - made it worth coming to class. Tough grader - but always willing to work with you outside of class",
        "course": "CIVILEN5130"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Gaj is tough. But by the end of the class i realized i learned alot. He knows alot about this this stuff, and he loves to tell stories (it keeps things interesting).",
        "course": "CIVILEN5130"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Gaj is a vey intelligent person and is obvious from the outset.  His lectures are interesting and engaging.  Sometimes the math is difficult to follow. His tests are tough.  Don't expect to see math problems directly from the homework.  They will be similar but a harder variation. Gaj cares. If you are struggling, go see him.  He wants to help you.",
        "course": "CIVILEN5130"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "My favorite CE professor (EnvEng Major here). Always helpful, knowledgeable, and never overloaded us",
        "course": "CE5130"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is just awesome. Always relevant topics discussed, really interesting, isn't going to give you BS stuff to do. Always willing to help. ",
        "course": "CIVILEN5130"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Gaj really wants his students to learn how to think about a problem rather than robotically repeat what you have done in homeworks. He has changed the way i think about engineering",
        "course": "CIVILEN5130"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Gaj is great as a professor--helpful, unbelievably laid back, great lecturer, and obviously loves what he teaches. He's not the kind of prof to leave the classroom and just ignore your emails, either: to anyone looking for a mentor or just some solid advice about their engineering career, I highly recommend you find a way to connect with this guy.",
        "course": "CIVILENG2060"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a great teacher. He lays everything out very clearly. His homeworks are tedious but are usually graded for completion and effort. Exams are more conceptual and less math based. You get to make a cheat sheet for both tests. Make sure to go to him for regrades, he gives back lots of points.",
        "course": "CE2060"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Awesome professor, class was tough but I learned alot.",
        "course": "CE2060"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is very helpful and engaged in your success in his class. He is very interactive which makes class time interesting.",
        "course": "CE5130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.8,
    "department": "Civil Engineering",
    "firstName": "Dorota Alicja",
    "id": "VGVhY2hlci0xNjU1MDU4",
    "lastName": "Grejner-Brzezinska",
    "legacyId": 1655058,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "If you're looking for practical applications of GPS in the civil engineeringsurveying field, you won't learn any of that with her. She only covers a lot of the theory and it's more tailored to graduate students who are more keen on research and theory than practical applications.  There are quizzes, midterm, finals and a final project.",
        "course": "CE5441"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was excellent.  She was ill for about half the quarter but she was fantastic the half she taught.  Accent is easy to understand, tests are straightforward, not difficult to earn an A or A-.  Project is 10% of grade, very open-ended.  Her office hours were helpful as well.",
        "course": "CE405"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "This was an intro statistics course for CE majors. Entire course was based on two midterms, a research paper, and a final. Very helpful professor. Very willing to help students in answering questions and improve. She's a great professor to seek help from during office hours. Exams were pretty straightforward.",
        "course": "CE405"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.6,
    "department": "Civil Engineering",
    "firstName": "John",
    "id": "VGVhY2hlci0xNTQxMDM4",
    "lastName": "George",
    "legacyId": 1541038,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "The best Civil teacher I have had. The class was not the easiest but you get what you put into it. John graded very fair and was always willing to help.",
        "course": "CE532"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I learned a lot from this instructor. Like any class, it definitely helps to go talk to him.",
        "course": "CE1"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor. Teaches relevant material. Willing to help students who ask for help. Easy to understand. Tests are long but not difficult. Take this class if you want to actually learn relevant material from a great instructor.",
        "course": "CEA"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "2 hour class, gave no break.  Nothing from class is used on homework. Exams so long not a single person finishes them. Tries too hard to be funny. Writes things on the board and erases before you can copy. &quot;Lectures&quot; by flipping thru a powerpoint. Very few examples in class. You definitely need to teach yourself from the book. Avoid if you can",
        "course": "CE532"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Civil Engineering",
    "firstName": "Kaveripatinam",
    "id": "VGVhY2hlci0xNzQ1MTg2",
    "lastName": "Balasubramanyam",
    "legacyId": 1745186,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class ever! No one can understand what he is saying, and he gets worked up about everything.  Also, he gets mad when you show too much work.",
        "course": "CE4310"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Prof. K.V. Balasubramanyam teaches CE4310 (Structural Analysis). Genial & approachable guy. Teaching method consists of writing on chalkboard, mostly notes found in the textbook. Could make class better by use of visual aids and more interactive. Class lecture feels like a long one-way sermon.",
        "course": "CE4310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Civil Engineering",
    "firstName": "Dean",
    "id": "VGVhY2hlci0xNzE3MzUx",
    "lastName": "Ringle",
    "legacyId": 1717351,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dean knows his stuff. He makes the class interesting by having field trips and mini-tasks where you have to search for information or go to certain locations. He loves surveying law and history and would give you a lot of insight into that as well as things about engineering. Very unique course. He covers things that a civil engineer ought to know!",
        "course": "CE5411CE5412"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Civil Engineering",
    "firstName": "Amir",
    "id": "VGVhY2hlci0xNDkwMDYw",
    "lastName": "Asgharzadeh",
    "legacyId": 1490060,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amir was by far the best TA I had ever had in my life. He is very picky in grading but he is the best. Always smiling, always helpful, and always caring for his students.",
        "course": "ENG360"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Cool guy as well as very caring. Highly recommended.",
        "course": "ENG360"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amir is awesome! He will improve your quality of life.",
        "course": "ENG187"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Civil Engineering",
    "firstName": "Dr Raul",
    "id": "VGVhY2hlci0xMzg2MTY5",
    "lastName": "Ramirez",
    "legacyId": 1386169,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love his lectures. 7:30am never missed a day, he is never late and always seated before anyone arrives. Exams are fair, notes are very useful and final presentation is as fair as the outside world....Just study and you would be dancing with a smooth A.",
        "course": "GISC563"
      }
    ],
    "SEI": []
  }
]