[
  {
    "avgDifficulty": 1.5,
    "avgRating": 2.3,
    "department": "Comparative Studies",
    "firstName": "Melissa",
    "id": "VGVhY2hlci0zMDYxODM4",
    "lastName": "Curley",
    "legacyId": 3061838,
    "numRatings": 4,
    "summary_comment": "Professor Curley's teaching quality is mixed; while some found the class assignments manageable and discussions engaging, others felt the content was superficial and the class lacked depth, failing to meet their expectations. Students also noted issues with outdated materials and perceived grading inconsistencies, with one student describing the experience as more like a high school class than a graduate seminar.",
    "summary_comment_short": "Professor Curley's teaching quality is mixed; while some found the class engaging and assignments manageable, others felt the content was superficial and that she focused more on note-taking skills than substantive learning. Many students expressed disappointment with the course material and delivery, citing outdated resources and a dismissive attitude towards student feedback.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Class was interesting sometimes and assignments do not take too much effort. There are no exams or quizzes. Although, my expectations for this class were high and I did not learn nearly as much as I thought I would. It felt like a joke at times rather than a genuine reflection on different religions.",
        "course": "RELSTDS2370"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "I had her for a one credit, graduate cohort class. Her primary goal for the class was teaching Masters/phD students how to take notes???? I'm sorry, but I'm pretty sure we all know how to take notes by now. We tried to bring this up, but she was really offended??? And she argued with us on matters of opinion for the rest of the semester. Don't take",
        "course": "EALL7897"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "I don't have a single good thing to say about her. She used outdated materials, most of which were irrelevant to the topic she chose for the seminar discussion. She criticized students to the point a number of us were concerned she was bullying on of the foreign exchange students. She could be a high school teacher. Wish I had room to expand.",
        "course": "COMPSTD8791"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Curley is a sweet person but she tends to put grades in late and is hard to reach outside of class. This class was a breath of fresh air however, lots of chill assignments and fun discussions in class.",
        "course": "EALL3223"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "5691",
        "Class Name": "Topics in Comparative Studies",
        "Class Number": "22214",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8200",
        "Class Name": "Interdisciplinary Learning Laboratory II",
        "Class Number": "34567",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.8"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8990",
        "Class Name": "Dissertation Writing Workshop",
        "Class Number": "30504",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "EALL",
        "Catalog": "7897",
        "Class Name": "Introduction to Graduate-level East Asian Studies",
        "Class Number": "34097",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "East Asian Languages & Lit",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "2370",
        "Class Name": "Introduction to Comparative Religion",
        "Class Number": "23569",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "32",
        "Rating": "4.45"
      }
    ]
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.5,
    "department": "Comparative Studies",
    "firstName": "Jason",
    "id": "VGVhY2hlci0yNDc4NDg5",
    "lastName": "Payne",
    "legacyId": 2478489,
    "numRatings": 28,
    "summary_comment": "Professor Payne is highly regarded for his dedication and intelligence, making his class both engaging and informative. Students appreciate his clear expectations, minimal reading requirements, and interactive lectures, though some note that discussions sometimes lack student participation due to his dominant role. Overall, Professor Payne is seen as a very approachable and supportive instructor who ensures students understand the material effectively.",
    "summary_comment_short": "Professor Payne is highly regarded for his engaging and supportive teaching style, evident in his clear expectations, interactive lectures, and emphasis on student engagement. Students appreciate his passion for the subject matter and his commitment to their learning, though some note that discussions can sometimes be dominated by him.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Payne was a PHENOMENAL Professor. You can really tell he cares about all of his students and wants them all to do well. He is very intelligent and you will learn a lot from him if you participate. 100% if you need to fulfill a requirement like literary/p.a. or race/ gender studies, TAKE HIS COMPSTD CLASS!!!!",
        "course": "COMPSTD1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not much reading required, super chill, basically a free A, wants students to engage with ideas",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason is a great professor who is hilarious and witty yet still creates an interesting class you look forward to. He was one of my first professors at OSU and you can tell he cares for his students and genuinely cares about students mental health. Class isn't a lot of work but you still are challenged and learn a lot from the lectures.",
        "course": "COMPSTD1100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "He makes the expectations for the class very clear and expect to read short stories, some textbook material that is provided online. And there are three novel readings that are not provided but are cheaper than textbooks, so I am grateful. But overall the information talked about in class is interesting and easy to understand. ",
        "course": "COMPSTD1100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Without a doubt the most chill professor I've had at osu. Lectures are like a group discussion and class material is relatively light with only a few pages of reading before class. 3 papers, midterm, and final which are all extremely easy. He makes each lecture interactive and interesting. Not even a comp studies major but got valuable information",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Good professor",
        "course": "COMPSTDS1100"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "You just need to pay attention in this class to get a good grade. To be honest the material wasn't the most interesting but Jason is passionate about the content and wants his students to think for themselves.",
        "course": "COMPSTD1100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good professor. Easy course, interested and knowledgeable in the course material. However, he says that he promotes dialogue and discussion, but it often ends with him dominating the conversation. ",
        "course": "COMPSTD3608"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was an amazing professor! Class consisted of discussions about short readings each day. There were 3 opinionated papers and a midterm and a final consisting of short answers and an essay question over reading material. Jason was so down to earth, and a truly fun professor. Be sure to contribute in class discussions! Highly highly recommend him!",
        "course": "COMPSTD1100"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "Took it for a GE, loved the books that we read. Only 6 grades all semester. No one got below an A on any assignment as far as I know. Prof really encourages discussion and loves to talk about the books which he clearly loves. Best choice for a GE. also participation was technically mandatory but by the end less than half the class went every day",
        "course": "COMPSTD3608"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "best prof",
        "course": "COMPSTD1100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest and most interesting class I've ever taken. Very eye opening. Such a great GPA booster. All you do is show up to class once in a while, and write 3 essays that everyone gets above a 90 on no matter what. Jason is so down to earth and really cares for his students.",
        "course": "COMPSTD1100"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 1,
        "comment": "Only 7 grades in the textbook and the class was very easy. Jason said he was a woke professor yet he was racist toward students of color. Called out people in my classes for being from parts of the world and made generalizations about races at large. Expected him to be liberal but his attitudes were easily seen through his internal divisions.",
        "course": "COMPSTD1100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jason was honestly one of the most down-to-earth professors I've ever had. His lectures are so fun and I learned so much in his class. The due dates are super flexible, and he is happy if you just get the paper in. I really enjoyed his class. He loves participation, so at least talk once or twice and you'll be fine. ",
        "course": "COMPSTDS1100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Attendance is \"required\" but if you just go to half the lectures and talk at least once you'll get an A. A few papers not too bad don't really have to read all of the required readings",
        "course": "COMPSTD1100"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was very interesting and a good choice if you need a gen ed. Jason is a great guy and led a lot of good discussions. He is very blunt and not afraid to say what's on his mind. There's a handful of books you need to buy but not too expensive.",
        "course": "COMPSTDS1100"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 1,
        "comment": "Took this class hybrid during Fall of 2020. It was fine. Get ready to read a bit of sci-fi. Very discussion-based. No textbook, but did buy a book for the class.",
        "course": "COMPSTD1100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy A. The class was 3 response papers, a midterm, and a final. The response papers were graded on effort and completion. The exams were graded similarly to the response papers. Jason is flexible with deadlines and understanding. Classes are discussions on the readings, not lectures.",
        "course": "COMPSTD1100"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "true king",
        "course": "COMPSTD1100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "AHHHH THIS PROFESSOR IS AMAZING! EVERYONE IN CLASS LOVED HIM! The only thing he lacks is grading. he is very slow to grade papers, but other than that this class was mostly reading and then you'd have to write reflection papers on the books you've read in class. This class comes with 3 (1 page response ) papers and 2 exams, very easy, good prof.",
        "course": "COMPSTD3603"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my fave professors/class ever. The class discussions were so enriching and interesting. The readings are also really interesting for the most part. I didn't read every assigned reading or attend every class but its still extremely easy to get an A. Jason is a great guy",
        "course": "COMPSTD1100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason is awesome! I genuinely looked forward to his class. The discussions were great. I always felt he was open to discussion and liked listening to what students had to say. There are weekly readings but it isn't super intense. You could skip a few and be fine. His tests and assignments are pretty open-ended. He just wants to see that you read.",
        "course": "COMPSTDS1100"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 2,
        "comment": "He is generally pretty chill but sometimes his sarcasm is so heavy theres no point in opening his mouth. Im very sarcastic too but ultimately can answer a question without going great lengths to be moderately funny and unnecessarily confusing. Tends to talk over students with opposing views during discussions, luckily ours align.",
        "course": "COMPSTD1100"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hung onto his every word -- truly a prince of a man.",
        "course": "COMP3603"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jason is a great and chill guy. Very clear grading criteria. If you put forth effort in class as well as on the assignments, you will get an A. His lectures are very casual and funny. Lectures go by fast. Would take another class of his in the future.",
        "course": "COMPSTD3608"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 2,
        "comment": "Not a huge fan of Mr. Payne. If you are offended easily, do not take his courses. He isn't very respectful of his student' opinions, either.",
        "course": "COMPSTD1100"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely interesting class based on instructor-lead discussion of sci-fi books, novels, and short stories. You should do the assigned reading so you can participate and understand what's going on. All papers (3 response papers, 1 midterm, 1 final) are fairly open-ended and not graded super hard. Jason is a great teacher and cool person in general.",
        "course": "COMPSTD2104"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best professors I have ever had. Very personal and makes you think about things. Midterm and final is answering a couple essay questions and that is it. No quizzes, but attendance is taken daily. Definitely learned a lot.",
        "course": "COMPSTD1100"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "14380",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.75"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "24382",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.68"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "17959",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.68"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "17971",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.41"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "12405",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "31",
        "Rating": "4.81"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2101",
        "Class Name": "Literature and Society",
        "Class Number": "19795",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.71"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "12083",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "35",
        "Rating": "4.49"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2101",
        "Class Name": "Literature and Society",
        "Class Number": "12092",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "4.47"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "16438",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.62"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "27805",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.71"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18619",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.28"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18626",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "4.77"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19319",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "29693",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.68"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19029",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.69"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19035",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.73"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.3,
    "department": "Comparative Studies",
    "firstName": "Lucia",
    "id": "VGVhY2hlci05ODA3MjE=",
    "lastName": "Bortoli",
    "legacyId": 980721,
    "numRatings": 58,
    "summary_comment": "Professor Bortoli is generally described as a sweet and kind instructor who encourages critical thinking and broadens students' perspectives. Her class involves significant reading but is considered relatively easy if students attend lectures and participate. However, some find her lectures and grading criteria somewhat unstructured and her focus on older literature challenging. Overall, her teaching style is appreciated by those interested in the subject matter, though it may not suit all students.",
    "summary_comment_short": "Professor Bortoli is generally considered an easy and kind instructor who encourages critical thinking and broad perspectives. However, her classes can be quite lecture-heavy and sometimes boring, with a focus on reading and occasional essays, though grading is relatively lenient as long as assignments are completed on time.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is very boring! Lectures are her rambling about beauty and society. She is a sweet woman though. A good amount of reading outside of class, but that's the only assignments really (besides the 2 1000 word essays midterm and 1000 word final collage). Little grading criteria, but as long as you put effort into the finals, you'll get an A.",
        "course": "CMPSTD1100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class. If you just go to class and do the readings everything will be fine. Sometimes grading criteria is a little confusing and class can be a little boring, but she is nice and will help you if you have any issues. ",
        "course": "CMPST3603"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a very sweet lady. If you enjoy literature classes you will be just fine. ",
        "course": "COMPSTD3603"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Bortoli is, perhaps, an okay literature/english professor. However, as a class in the comparative studies department, there is an apparent lack of teaching about textual analysis in any meaningful way--meaning you basically read the assigned texts (or skim them, most likely), show up to class and listen to her surface level, old-school lecture.",
        "course": "COMPSTD3603"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is an extremely kind woman who cares a lot about what she is teaching. You can get away with reading simple summaries. She grades easily as long as you turn everything in on time. She's like a sweet grandma. The lectures are long but they're not hard to follow. The books are also interesting as well and are worth the read.",
        "course": "COMPSTD3603"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lots of papers, but they're only a page single spaced, if your turn them in you pass. Anything you say in class is right. I never did any of the assigned readings I just paid attention to in class discussions and looked at cliffnotes once in a while, that was good enough.",
        "course": "COMP1100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Her class isn't hard per se, but she has very specific expectations within how she grades. lots of reading (like 100 or more pages a week), long lectures, and she expects you to understand old greek and Babylonian literature. not worth taking in my opinion unless you love what she teaches, otherwise it will make for an unbearable class",
        "course": "COMPSTD3603"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bortoli was one of my favorite professors. She really encouraged her class to think and really broaden their view on things. Through her class topics, she showed the importance of listening to other's opinions or seeing their backgrounds even if you did not agree with them. She was super kind and was very interesting to listen to. 10/10",
        "course": "COMP100"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 1,
        "comment": "Confusing assignment expectations. Rarely responds to emails. She was simply rude to me and did not respect my attempt to communicate with her. An easy concept class but hard to understand her grading techniques. I have never had issues with a teacher except for with this course. She changed the syllabus halfway through the course unfavorably",
        "course": "COMPSTD3603"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Unclear instructions, poor communication, and takes points off for no good reason. The assignments are easy, but her lack of direction makes them hard. She tells you exactly what she was grading for AFTER she's graded your assignment. Class is boring and if you skip, your grade will be impacted. Take literally any other GE course.",
        "course": "COMPSTD3603"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "I got an A in this Literature class without ever reading one assignment. Beware that this class is EXTREMELY boring though, and she takes attendance every single day for points. If you want the easy A, take the class. It's just ridiculously boring. She is a nice lady though.",
        "course": "COMPSTD3603"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 2,
        "comment": "One of the most boring classes I have ever taken, but it was a very easy class. Don't need to work very hard for a good grade. Write some papers, give a nice presentation, and show up to class.",
        "course": "COMPSTD3606"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "If your looking for an easy lit class look no further. I took this class and you have a total of five one page reflections on movies that you watch in class and then three three page papers about love reflecting on books talked about in class that is legit all you do and Lucia is not a tough grader. Very easy you do not have to read the material",
        "course": "COMPSTD3603"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "A super easy Gen Ed. Attendance factors into the grade. Besides that, you don't have to stay on top of the readings and can write papers based off class discussions and films (also shown in class). Bortoli is wise and actually gives really good life advice.",
        "course": "COMPSTD3603"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 2,
        "comment": "I missed 3 classes at the beginning of the year and she seemed to have it out for me ever since, do not skip class or she will grade you harder than necessary for the rest of the year. Her lectures are boring, and early in the morning, so be prepared.",
        "course": "COMPSTD2103"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very easy class. Attendance is taken for a grade so show up and you will be fine. Easy logs over the reading as long as you do the reading which is very short. Final is a book made from the logs you did during the semester. Easy grader as well.",
        "course": "COMPSTD2103"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "The reading does not matter as much as she says they do",
        "course": "ENGL1100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "I didn't read one thing is this class and fit and did just fine. I would recommend this class! Super Easy! She is super unorganized. Just go to class and participate a little bit and you'll be fine",
        "course": "COMP100"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "love this class because you can read her books for enjoyment and not have too come to class worried ab a test. no tests or quizzes, just interesting class discussion (she is brilliant when talking about books btw). 5 informal1 page ppers (Easy A's), 2 formal 5pge ppers on books ( she helps you lots don't worry) &amp; 1 presentation that she helps lots",
        "course": "COMPSTD3606"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Bortoli is the most caring professor I have ever had. It was really interesting learning about love in the many different culture around the World including love from Babylonia, China, India, Japan, and much more. Go to class and participate and you will do well. When you do that you will be able to do the papers easily.",
        "course": "COMPSTD3603"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 2,
        "comment": "She says some wild things. You'll probably disagree with everything she says. It's not hard at all so I guess I recommend this class.",
        "course": "COMPSTD2103"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lucia is nice but scatterbrained. Paper prompts are often unclear, and she does not believe in 100's. She will give you an 87 and then change your grade with no explanation. You don't need to read to pass the class!!!!!!!!!!! Tells some weird stories. Pretty easy as long as you show up and laugh at her bad jokes (and occasionally participate)",
        "course": "COMPSTD2103"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 3,
        "comment": "Nice woman, understandable about life occurances. Assignments are straightforward and not difficult. Material is very interesting. Often cuts off students, and occasionally gives lower grades without explanations as to why, but means well. Could take or leave class.",
        "course": "CMPST3603"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr Bortoli is nice. Occasionally scatterbrained but overall a good prof. Daily presentations for context for readings are easy &amp; helpful. Doesn't really give clear instructions on whats expected from you on papers but is a pretty easy grader. Readings are actually enjoyable! Read them if you can. Dont have to pay close attn in class but its helpful",
        "course": "COPSTD3606"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take her for an A, show up to class to ensure your grade, say anything during discussions for credit. She's unorganized but sweet. Try on papers and you'll get an A. You don't have to pay close attention, just follow general ideas. You don't even have to do readings before class really. Sparknotes or reading 15 minutes before class is enough.",
        "course": "COMP3603"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very nice woman who encourages deep discussion about societal issues that stem from class material. However, she does not post grades on Carmen, assignments are pretty unclear, and grading requirements are not spelled out. I would recommend going to her office hours for papers to see what she expects. Although confusing sometimes, easy to get an A.",
        "course": "COMP3603"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you have a chance to take one of her classes, you should.",
        "course": "COMP100"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is so sweet and really knows /is passionate about what she is teaching. There are a lot of reading assignments but you don't really need to read them. However I would recommend reading so you could have something to talk about in class. She appreciates participation. There is no final exam just a written journal done out of class. It's easy!",
        "course": "COMPSTD3603"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a super sweet teacher! There are a lot of reading assignments but you could get by with not reading. The novels are not too bad of a read. There are writing assignments but they are pretty easy.",
        "course": "COMPSTD3603"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 5,
        "comment": "By far the best professor I had at OSU. She teaches her students beyond the curriculum proposed. I still use many of the tools she taught us. She teaches real-life lessons and really challenges you to be a better you.",
        "course": "COMP203"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 4,
        "comment": "If you want to take  an easy comparative studies GE stay away from this course. You will be reading book after book and then be writing comparative essays over those books. If you're a bookworm then this is your class. Bortoli doesn't upload grades to Carmen and she might answer your email. Make friends with her by participating and you'll be set.",
        "course": "CMPSTD1100"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not a bad literature class to take. Attendance is mandatory and the readings aren't that bad. There are no tests, grades depend on 2 journals, attendance, and participation which she barely keeps track of. I would recommend, just make sure to attend class. ",
        "course": "3603"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 2,
        "comment": "Not a bad literature class to take. There are 2 journal assignments and participation points. Attendance and participation matter, but overall an easy class and she is a very easy grader! Just attend class participate and do the few assignments ",
        "course": "3603"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is interesting. There are no tests. Papers are journal-like and partly based on your reaction to different topics. Each student puts together a power-point presentation so almost each class is started by one of this presentations that summarize the reading assigned for that day or compliment it. She grades fairly and is knowledgeable.",
        "course": "3603"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor is extremely nice. The material is pretty easy and as long as you say a couple of thing in the class discussion you will get your participation points. It was an easy A and an enjoyable class.",
        "course": "COMP2214"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had soooo much fun in this class. very easygoing teacher, although absent minded interesting literature. Also if you ask before hand mangos are permitted in the class",
        "course": "COMP301"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 1,
        "comment": "The class is extremely simple and as long as your participate a tiny bit she will be satisfied. The material is not hard, but she is hard to get along with. She presents an extremely biased perspective on the literature we analyzed in class. She is pretty conservative, traditional and absent minded. Very disappointing...",
        "course": "COMPSTD2103"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a very sweet lady! Read the stories and you will be fine!",
        "course": "ENG215"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class could have been much more interesting. The novels we read were fine, but if you disagreed with her, you were made to feel stupid. I didn't like her class because I felt as thought I wasn't allowed to discuss how I felt, which defeats the purpose of the class.",
        "course": "COMP203"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 1,
        "comment": "Had her for COMPSTDS 203.  Easy A if you can manage to write some high school level papers and fuel her ego a bit.  Never answers emails, no rubric for grades, simply just gives grades.  Learned NOTHING",
        "course": "CMPST203"
      },
      {
        "index": 41,
        "rating": 1,
        "difficulty": 4,
        "comment": "really really chill, super clear on everything, accent is really awesome, answers all emails, best teacher on campus, not boring at all, no reading required, she always shows up on time. now think of the exact opposite of those things and that is your class.",
        "course": "CS100"
      },
      {
        "index": 42,
        "rating": 2,
        "difficulty": 2,
        "comment": "An easy A if you show up and stroke her ego. Very arrogant, talks down to students and probably the least helpful teacher I?ve had at OSU. You will learn next to nothing from her teaching but like I said, an easy A if you just show up.",
        "course": "CS201"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 2,
        "comment": "She was an ok teacher. Very vague in what she wanted from you. Lacked any grading strategy. Never posted anything on Carmen. She seemed to favor some students over others. If you put in more work than asked, you'll get an A but if you do what's asked your grade could be anything. Didn't answer emails unless she liked you.",
        "course": "COMP100"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 1,
        "comment": "Unclear sometimes, and repeats herself constantly. You'll hear about the same project and it's requirements at least 100 times.",
        "course": "CS301"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 2,
        "comment": "class was kind of a joke. We had just 2 papers, and a presentation. the papers were not very diffucult topics either. let you pick your topic and was always helpful. was not a tough grader by any means. she does not start early, rather right on time. trys to help you whenever you need it.",
        "course": "HUM308"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very nice lady, and is very passionate about teaching. She seems very rough at first, but is really willing to help and very interesting in helping you. Class was writing two short papers and doing an assignment.Most things were graded very easily as long as you did what was assigned. I would definitely recommend her.",
        "course": "COMP308"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 2,
        "comment": "Charming accent, caring individual, interesting texts, Attendance is mandatory & she does like to start early, but has interesting projects & our group final project was moving & personally meaningful. She doesn't micro-manage every little detail, lets you find your own voice. Highly recommend this Prof, - take any class of hers you can.",
        "course": "COMP203"
      },
      {
        "index": 48,
        "rating": 2,
        "difficulty": 2,
        "comment": "Most days the class content was pretty interesting. She's easy going if you attend and participate in class.",
        "course": "COMP301"
      },
      {
        "index": 49,
        "rating": 4,
        "difficulty": 4,
        "comment": "Honestly I was not looking forward to this class at all, but it wasn't bad. The novels were interesting and the papers were pretty short. Most of grade based on being in class and participating.",
        "course": "COMP301"
      },
      {
        "index": 50,
        "rating": 2,
        "difficulty": 4,
        "comment": "Seriously the worst class I have ever taken. All she does is talk for 2 hours, and call people out if they're late or leave early. If you're a complete brownnoser or have a lot of stupid things to say.. youll get along great with her. She doesn't respond to emails and her instructions were always vague.",
        "course": "COMP301"
      },
      {
        "index": 51,
        "rating": 3,
        "difficulty": 1,
        "comment": "i really don't understand all the negative comments for this prof. basically, if you read the books (they were interesting too), did the one presentation, and showed up for class, you got an a. some instructions were vague, but if you asked her to clarify them, she would. our class also convinced her to make an exam much easier. good prof!",
        "course": "COMP100"
      },
      {
        "index": 52,
        "rating": 2,
        "difficulty": 1,
        "comment": "Against what everybody else says, I thought the class was fun and easy. You just have to read the novels she assigns and show up for class. There is one project which she doesn't really explain how to do clearly, but it is an easy project anyway. The novels are great-- fun reads and a couple are contemporary",
        "course": "COMP301"
      },
      {
        "index": 53,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was hands down the worst class I have ever taken.  She talked the entire period, and nothing she said ever made sense.  She changes the syllabus when she feels like it, and has no grading criteria.  Attendence is taken everyday, and if you leave early shell retake it. She is not willing to help students at all. Worst teacher ive ever had",
        "course": "COMP301"
      },
      {
        "index": 54,
        "rating": 1,
        "difficulty": 4,
        "comment": "Really bad class,  The syllabus gets changed regularly, and she does start every class early and gets pissed if you are &quot;late.&quot;  The worst is the assignments, you will never have a clear idea of what you are supposed to be doing. Writing papers is fine, but don't give bad grades to people for not following non-existent instructions.",
        "course": "COMP301"
      },
      {
        "index": 55,
        "rating": 1,
        "difficulty": 3,
        "comment": "Shows no interest in what the class thinks and will talk at you for two hours. Class begins early and thinks she's doing you a favor by ending on time. If you leave early she'll retake attendance. Unclear and continually changing syllabus with assignments that don't make sense. Waits until the end of the quarter to explain what she expects from us.",
        "course": "COMP301"
      },
      {
        "index": 56,
        "rating": 1,
        "difficulty": 4,
        "comment": "DO NOT take this class. The class was terrible, it would have been relatively interesting with ANY other professor. We were held hostage each class, yelled at for leaving early, and every lecture was rambling. We spent 20 minutes watching her surf google. The assignments were difficult and SO VAGUE. This class was MUCH harder than it needed to be.",
        "course": "COMP301"
      },
      {
        "index": 57,
        "rating": 2,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "COMPS301"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lucia is a nice, fun, and good looking Italian lady. Her classes were fun. We read a book and watched lots of videos. No exams, take home final, and she graded homeworks very fairly. Definitely recommended.",
        "course": "ITAL420"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "23434",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3606",
        "Class Name": "The Quest in World Literature",
        "Class Number": "20450",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.25"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "17956",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.38"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "17972",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "12404",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.61"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3606",
        "Class Name": "The Quest in World Literature",
        "Class Number": "18473",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.71"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "12091",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.35"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "12099",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.15"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "16437",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.38"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "37651",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.7"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "37475",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.23"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "35442",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.29"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19318",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.2"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "19328",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19036",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.3"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3603",
        "Class Name": "Love in World Literature",
        "Class Number": "30359",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "3.93"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Comparative Studies",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0xNzY1ODcx",
    "lastName": "Borland",
    "legacyId": 1765871,
    "numRatings": 5,
    "summary_comment": "Professor Borland is highly regarded by some students as one of the best at OSU, known for her genuine passion for the subject and ability to engage students. However, others find her classes challenging with tough grading and dry lectures, and criticize her approach to discussions and assignments. Overall, opinions vary widely, with some praising the class's enlightening content and flexibility, while others warn against her demanding workload and teaching style.",
    "summary_comment_short": "Professor Borland is highly regarded by some students as one of the best at OSU, known for her genuine passion for the subject and ability to engage students in meaningful discussions. However, others find her classes challenging and less than ideal, citing hard grading, dry lectures, and a focus on rote discussion rather than substantive learning.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Words can't explain my feelings here. This is just a terrible professor. Don't take any class that relates to her. Hard grading and dry lectures, and she is not a nice person. ",
        "course": "CMSTD2864"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Expects us to just discuss the readings instead of using the readings to springboard into the topic in general, and since the entire class period is just discussion only, the entire time you're just repeating the author instead of learning anything about the concepts. The readings don't seem to relate to the goals of the class or are off-topic.",
        "course": "CS4597"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Borland is one of the best professors that I have had at OSU. She genuinely cares about the subject and incites everyone to become engaged in the material. Very enlightening, everyone should take this class about the development paradigm.",
        "course": "CS2864"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Borland is a great professor.  She knows her stuff and will lecture a bit to further student's understanding, but she also encourages class discussion.  Occasionally there can be a little confusion on what her requirements are on collection assignments, but if you actually go in and talk to her she is more than willing to clarify and help you.",
        "course": "CSTDS5957"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "A LOT of work for a GEC course; SIX papers, and 150-word responses for each article due (usually 2-5 PER CLASS). But the class is very enlightening about development efforts around the globe and covers a wide array of topics. Dr. B keeps the class interesting and is flexible about getting assignments done if you have a lot going on. Great class!",
        "course": "CMSTD2864"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "6400",
        "Class Name": "Critical Foundations: The Humanities and Collaborative Practices",
        "Class Number": "33011",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.25"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "6750",
        "Class Name": "Introduction to Graduate Study in Folklore I: The Philology of the Vernacular",
        "Class Number": "24321",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "4193",
        "Class Name": "Individual Studies",
        "Class Number": "12122",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "N/A",
        "Class Name": "Comparative Studies Field School",
        "Class Number": "22638",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "4597.03",
        "Class Name": "Global Folklore",
        "Class Number": "37046",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8100",
        "Class Name": "Interdisciplinary Learning Laboratory I",
        "Class Number": "29699",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4.5,
    "department": "Comparative Studies",
    "firstName": "Fabian",
    "id": "VGVhY2hlci0zMDUyMzY3",
    "lastName": "Romero",
    "legacyId": 3052367,
    "numRatings": 2,
    "summary_comment": "Professor Romero excels in conveying complex material with care and dedication, though the course workload is substantial. Students appreciate his commitment to the subject matter and find the challenging readings and concepts well-managed and worthwhile.",
    "summary_comment_short": "Professor Romero demonstrates a strong commitment to the subject matter, covering extensive material with care and dedication. Despite the demanding workload, students appreciate his expertise and the quality of instruction provided.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "My only critique is the workload of this class well exceeds what I believe should be expected of a 3 credit hour course, but it is evident that the work is there because Dr. Romero cares about the material they present. This course covers a lot of material that can sometimes be hard to digest but Dr. Romero was a wonderful professor.",
        "course": "COMPSTD2323"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Despite the reading and tough concepts in this class, I thought Dr Fabian did an excellent job teaching throughout the course of the class. They were incredibly caring for the wellbeing of the class and assigned challenging yet understandable readings. Overall this was an amazing class I would retake.",
        "course": "COMPSTD2323"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "2323",
        "Class Name": "Introduction to American Indian Studies",
        "Class Number": "35344",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "4822",
        "Class Name": "Native American Identity",
        "Class Number": "35582",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "Enrico",
    "id": "VGVhY2hlci0yMzkzMzg3",
    "lastName": "Zammarchi",
    "legacyId": 2393387,
    "numRatings": 8,
    "summary_comment": "Professor Zammarchi is highly regarded for his exceptional teaching, particularly in language classes. Students praise his passion, knowledge, and care for their success, noting his accessibility and willingness to help outside of class. His engaging teaching style and clear explanations make him an outstanding professor, with many recommending his classes enthusiastically.",
    "summary_comment_short": "Professor Zammarchi is highly regarded for his exceptional teaching skills and genuine care for his students' success. Known for his passion, knowledge, and accessibility, he is consistently praised for making complex material engaging and accessible, especially in a language class setting.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "New Teacher to Coastal and he realizes not everyone is majoring in a language. Cares for his students and wants people to succeed. Homework is not too difficult, and quizzes are a little difficult but doable. Easy to access outside of class as well. Really good teacher to have for a language class.",
        "course": "ITAL101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Enrico is such a great guy and passionate about what he teaches. He really cares about the students and their development of the language. Take time to get to know him/go to office hours. He is very interesting to talk to and has great life advice to give",
        "course": "ITAL201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Enrico might be GU's best language professor. He is so great. Clear, friendly, extremely knowledgable. Italian is his first language. Take him for class! You'll learn so much.",
        "course": "ITAL101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had to read a ton for this class. However, I learned a lot from his lecturing. Super nice and cool guy.",
        "course": "COMPSTD3360"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is the best professor at OSU wishing he taught another class. I enjoyed the material that was discussed throughout the semester. This class left me with a lot of questions! I recommend this class and professor to anyone truly amazing!",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Enrico is a real gem among the teachers who are just doing it to get paid. He is extremely knowledgable and passionate about the content he is teaching. Would definitely recommend for others to take his class!",
        "course": "COMPSTDS3360"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "By far my favorite instructor I have had so far at OSU. It is so clear how much he cares about what hes teaching and the success of his students, it makes it hard to be disinterested. This is his first year teaching and I can only imagine itll get even better. I looked forward to every single class the whole semester. 100/10 would recommend!",
        "course": "COMPSTD3360"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Enrico is one of the best professors I've had at OSU &amp; it's only his first year teaching this class! He is extremely passionate about what he teaches and his Italian roots &amp; background in hip hop culture adds so much to this class. Logistics: No exams, no textbooks! Just do the readings, write a few papers &amp; participate in class. 1000% recommend.",
        "course": "COMPSTD3360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "Kate",
    "id": "VGVhY2hlci0zMDQzNzEy",
    "lastName": "Kaura",
    "legacyId": 3043712,
    "numRatings": 1,
    "summary_comment": "Professor Kaura is an excellent lecturer known for her engaging and interesting content, with minimal homework. She is highly understanding and grades students based on a paper and project involving a site visit. Her classes are both intellectually stimulating and effective for general education requirements.",
    "summary_comment_short": "Professor Kaura is an excellent lecturer known for her engaging and interesting content, with minimal homework. She is highly understanding and grades primarily based on a paper and project involving a site visit, making the class both intellectually stimulating and manageable.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "i had RELSTDS 2102.02 w/Kate Kaura. Excellent lecturer/professor, very little homework and she is super understanding; grade is determined by a paper and project about a site visit. the information isn't difficult and is extremely interesting so taking this class works well as a GE filler and or an intellectual pursuit.  ",
        "course": "29124"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.3,
    "department": "Comparative Studies",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0yNDg0OTgy",
    "lastName": "Vu",
    "legacyId": 2484982,
    "numRatings": 12,
    "summary_comment": "Professor Vu's literature class is demanding, requiring significant reading and discussion participation, but students who commit the necessary time can earn an easy A. However, the workload is substantial, with multiple assignments and discussions per week, making it challenging and time-consuming, especially for a three-credit course.",
    "summary_comment_short": "Professor Vu's class is known for its substantial workload, requiring regular reading and active participation in discussions. While some students found it manageable and even enjoyable, others deemed it overly demanding and not well-organized, leading to significant time commitment and inconsistent grading.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is a literature class so be ready to read at least two texts weekly and discuss them. Dont let that scare you though as long as you read something and can talk about it in a discussion post youre fine! Very easy A if you do the work but it is a good chunk of work. ",
        "course": "COMPSTD1100"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was a lot. Many assignments, and busy work was tedious. Definitely not an easy GE, so do not recommend. It took up way too much of my time, and the material amount should not be for a 3 credit hour course. Lack of organization, communication, and expectations. I just wouldn't take this course as it was a waste of time in my opinion. ",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "COMPSTD1110 was such a large workload. So many projects, papers, and readings. Like 5 discussion boards every week on top of the projects. It got ridiculous. Some assignments were interesting, but this class should not only be 3 hours. It wasn't difficult, but be prepared to SPEND $$$ on the readings required, and to do lots of essays and projects.",
        "course": "COMPSTD1100"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "This was the easiest A. might seem overwhelming the first few weeks but I slowly got a hang of it and the class was really enjoyable. A few discussions every week and assignments throughout the semester. There's a midterm paper (350 words) and a final paper (500 words) &amp; (400words course reflection). Ended with a 99%.",
        "course": "COMPSTD1100"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "This was the most ridiculous class I have taken at Ohio State in the FOUR years I've been here. There is an insane amount of work to complete for a, let me remind you, ENTRY level GE course. And they don't grade super easy either and if you miss even one assignment you probably will not receive an A because you are not allowed to drop anything.",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was such a big workload. Longer readings every week, about 5 discussion posts every week, 6 one page papers, 3 longer papers (intro, midterm, final), plus more random assignments. This was by far the most work I ever had to do for a class and it was just a GE for me. Would not recommend.",
        "course": "COMP1100"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "Although the assignments weren't difficult to complete, this was a very hard course to take online. The material is very hard to understand without having live lectures. Professor Vu really leaves it up to you and your own interpretations, and it's not easy for the topics for this class. The TAs' grading also does not seem to be consistent.",
        "course": "COMPSTD1100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor for a Literature GE. The class is pretty straightforward and the TA's are good. I learned a great deal from this class and felt as if I learn a lot.",
        "course": "COMPSTD2001"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is made up of loose and very casual discussions. Make sure to participate! There is a lot of reading, but I know many people just skimmed or used SparkNotes. Although the readings can be tough to understand, the essays that make up the majority of your grade are graded SUPER easily. Highly recommend.",
        "course": "COMPSTD3603"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is AMAZING. She is extremely engaging and gets you to think about in-depth situations. I truly feel that I grew as a person/student through taking her Love in Literature course. We read really interesting books and it felt like a fun book club. If you are looking for a good Literature GE or just a fun class, I highly recommend.",
        "course": "COMPSTD3603"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Overall stellar professor. While it is a lot of reading, she doesn't penalize and even encourages you to sometimes read the sparknotes in order to catch up or do whatever it is you need to do. Readings are typically pretty interesting, though some are a little harder to get through. Really recommend her.",
        "course": "COMPSTD3603"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Vu is a super nice lady. You'll have to read a lot for this class, but it's 100% worth it. She picks interesting readings to discuss and we watched movies as well. I would recommend this class and this professor.",
        "course": "COMPSTD3606"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18266",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "13",
        "Rating": "4.25"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "35454",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "201",
        "Rating": "4.24"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18845",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "48",
        "Rating": "4.7"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "34537",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "165",
        "Rating": "4.4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18813",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "36",
        "Rating": "4.5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18146",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "124",
        "Rating": "4.12"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "33928",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "102",
        "Rating": "3.76"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18924",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "43",
        "Rating": "4.4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "21866",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "133",
        "Rating": "3.87"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "29781",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "114",
        "Rating": "4.28"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "18847",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "33",
        "Rating": "4.27"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "24418",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "81",
        "Rating": "4.03"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "29075",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "61",
        "Rating": "4.19"
      }
    ]
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 3.6,
    "department": "Comparative Studies",
    "firstName": "Frank Dan",
    "id": "VGVhY2hlci0yNDIzNTk3",
    "lastName": "DiPiero",
    "legacyId": 2423597,
    "numRatings": 7,
    "summary_comment": "Professor DiPiero is highly regarded for his engaging and informative lectures, particularly in his online courses, which are described as well-structured and easy to follow despite being reading-heavy. His classes focus on the intersection of race and music, with a strong emphasis on critical thinking and writing. Students appreciate his approachable nature and his clear communication, though some find the coursework demanding, especially the extensive reading and essay requirements.",
    "summary_comment_short": "Professor DiPiero is highly regarded for his engaging and interesting lectures, particularly in his online courses, which focus on music and race in history. Students appreciate his clear communication and willingness to help, though some find the class challenging due to extensive reading and writing requirements.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Took his summer course. He does state that his in-person class is more challenging but the online one is pretty easy. Lots of reading, listening to music, and watching lecture videos. However, everything he picks out is very interesting. Lecture videos are easy to follow and help you to grasp the topics. One of my favorite professors at OSU so far",
        "course": "COMPSTD3686"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class wasn't very difficult, just reading heavy. The professor is too good to give feedback on papers and you have to ask for criticism which is frustrating for a comparative studies class, as all you do is write papers. The class focuses heavily on race dialects and black music in particular. Class info is interesting, just very repetitive. ",
        "course": "COMPSTD3686"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took 2 classes from this professor and got As in both. As long as you submit your essays on time and put minimal effort into it, you'll do fine. He told us his first day his goal was for everyone to earn an A. Because of COVID, we got participation points through weekly discussion boards. I never attended lectures. He's a relaxed grader.",
        "course": "COMPSTD3686"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "There are lots of readings. Usually I skim them. The only time you need deeper info from them is for the papers. This prof is a clear communicator and if you are into music and history, then this class might be for you. However, be mindful that one of the readings is the Communist Manifesto and there is an expectation for you to agree with it...",
        "course": "COMPSTD3686"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Several smaller essays leading up to one big essay. Readings are required for essays and pop-quizzes. Mandatory attendance, and a lot of group discussions. Really focuses on race in music in the past and now.",
        "course": "COMPSTD3686"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 5,
        "comment": "Taken for VPA GE req. Midterm was listening to songs and having to write many details about it in social context and take home paper. Final is take home paper (6 to 10 pgs). Readings are long and pretty difficult and lectures are critical to pass. Doesn't use Carmen so you don't know what your grade is. Tough grader, but super nice guy!",
        "course": "COMPSTD3686"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "mandatory attendance, but gives you up to 3 absences without it effecting your grade. There is only 4 papers that the majority of your grade is based on and 5 short pop quizzes. A lot of reading, but he wont quiz on the super hard readings. he does a good job explaining all concepts which you will need to know to do good on the essays.",
        "course": "COMPSTD2264"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "33054",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.36"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2103",
        "Class Name": "Literature and the Self",
        "Class Number": "17965",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.78"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2264",
        "Class Name": "Introduction to Popular Culture Studies",
        "Class Number": "33055",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3686",
        "Class Name": "Cultural Studies of American Musics",
        "Class Number": "22794",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.79"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "34889",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.91"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2281",
        "Class Name": "American Icons",
        "Class Number": "18470",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.71"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2367",
        "Class Name": "American Identity in the World",
        "Class Number": "12410",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3686",
        "Class Name": "Cultural Studies of American Musics",
        "Class Number": "12417",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.65"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "N/A",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "22338",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.43"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2281",
        "Class Name": "American Icons",
        "Class Number": "34559",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.42"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2367.08",
        "Class Name": "American Identity in the World",
        "Class Number": "12098",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3686",
        "Class Name": "Cultural Studies of American Musics",
        "Class Number": "16920",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.47"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3686",
        "Class Name": "Cultural Studies of American Musics",
        "Class Number": "22909",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.75"
      },
      {
        "Subject": "ENGLISH",
        "Catalog": "2264",
        "Class Name": "Introduction to Popular Culture Studies",
        "Class Number": "33547",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "English",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.36"
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Comparative Studies",
    "firstName": "Emma",
    "id": "VGVhY2hlci0yNzQ5MjU3",
    "lastName": "Cobb",
    "legacyId": 2749257,
    "numRatings": 3,
    "summary_comment": "Professor Cobb is known for being easy-going, relatable, and encouraging critical thinking in her lectures. Students appreciate her willingness to help and find her lectures interesting with a participatory approach. However, there are challenges with delayed posting of readings and assignments, and grading can take several weeks. The course workload increases towards the end with a significant group project and final paper.",
    "summary_comment_short": "Professor Cobb is known for her engaging and relatable teaching style, encouraging critical thinking and active participation in class. Students appreciate her willingness to help and find her lectures interesting, though they note that grades are returned slowly and some materials are occasionally posted late.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Emma is a super nice and relatable person who knows her subject. Her lectures are interesting and participation-heavy. However, you won't get grades back for weeks or even a month, and she often forgets to post readings and assignments. You'll read quite a bit, but it's not anything crazy. I would definitely recommend her!",
        "course": "COMPSTD2350"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Cobb is really easy-going and relatable. The weekly readings can be a bit of a pain and she sometimes posts next week's readings really late, which can be inconvenient. She encourages critical thinking and discussions during her lessons. This course gets kind of heavy towards the end since there's a paper and also a group project due.",
        "course": "CS2350"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Emma is amazing and understanding. She is always willing to help her students. This course was very content heavy at the end. Every week we had two (easy) discussion posts and at the end we had a huge group project and final paper. If you follow instructions, it will be easy. Don't let group members slack off because your grade will suffer too.",
        "course": "COMPSTD2350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.7,
    "department": "Comparative Studies",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yNDEyMTMz",
    "lastName": "Craycraft",
    "legacyId": 2412133,
    "numRatings": 3,
    "summary_comment": "Professor Craycraft is highly regarded for her insightful and comprehensive lectures that offer unique perspectives on the subject matter, making her class and recitations essential for success. However, some students find her lectures and explanations confusing and unhelpful, citing difficulties in meeting with her outside of class and a lack of clarity in both lectures and readings.",
    "summary_comment_short": "Professor Craycraft is highly regarded for her insightful and comprehensive lectures that offer a unique perspective on the subject matter, making class attendance essential for success. However, some students find her lectures and interactions confusing and unhelpful, citing difficulties in meeting with her and a lack of clarity in explanations.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Craycraft is a pleasure to be around. At first, I wasn't sure about the class, but when she became my recitation leader, I was delighted. She offered many insights and gave me a new way about the world. Her lectures were eye-opening. She is unequivocal and in-depth. Attend class and recitation, and you will be successful. 11/10. ",
        "course": "COMPSTD1100"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Extremely confusing and not helpful. She is very difficult to meet with outside of class and is not helpful or caring. She never clarifies anything, especially the readings. Tough grader. Lacks reason. Speaks in circles ",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Sarah is one of the best TAs I've ever had. She is easy to meet with and will help you a ton with your papers. Make sure to participate in class and show up.",
        "course": "COMPSTD1100"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "22609",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.29"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "35943",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "51",
        "Rating": "3.6"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "36305",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.17"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "36306",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2367.08",
        "Class Name": "American Identity in the World",
        "Class Number": "16442",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.36"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2367.08",
        "Class Name": "American Identity in the World",
        "Class Number": "38005",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.29"
      }
    ]
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.5,
    "department": "Comparative Studies",
    "firstName": "Phillip",
    "id": "VGVhY2hlci0yMjA2NzM0",
    "lastName": "Armstrong",
    "legacyId": 2206734,
    "numRatings": 4,
    "summary_comment": "Professor Armstrong is highly regarded for his supportive approach and passion for the subject matter, despite some challenges with the course's rigor and specific pop quizzes. Students appreciate his clear guidance on midterms and find his use of films and documentaries engaging. However, the course also faces criticism for its demanding reading load and reliance on subjective assessments.",
    "summary_comment_short": "Professor Armstrong is highly regarded for his supportive approach and engaging course material, despite challenging assignments and assessments. His passion for the subject matter is evident, though some students find the pop quizzes difficult and the readings tedious.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Armstrong really was one of my top professors this semester. With having COVID and struggling to meet deadlines because of life, he met me halfway and didn't penalize/scold me. A great professor and interesting course material! Most of grade is determined by group presentations on films as well as your own research.",
        "course": "COMPSTD4597"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class is way too challenging for a GE tons of readings over 5 books for the course! The pop quizzes in recitation are ridiculously specific even if you go to lecture a lot of people in my class struggle which is dumb because that assignment is meant to gage your attendance. Finally the class makes a lot of conclusions based on feeling not fact",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "A lot of stupid pop quizzes about the lectures in recitation that I could rarely get 100% on even though I attended every class. Armstrong is very passionate about the subject and shows interesting films and documentaries though the readings are generally very boring and hard to get through.",
        "course": "COMPSTD1100"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "The midterms are essays but he tells you what the questions are and pretty much gives you the answers on the slides, which he posts on Carmen. I would take him again.",
        "course": "COMPSTD1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "Mercedes ",
    "id": "VGVhY2hlci0yODY3NzQ2",
    "lastName": "Chavez",
    "legacyId": 2867746,
    "numRatings": 1,
    "summary_comment": "Professor Chavez is highly regarded for his effective teaching methods and engaging material, with students praising his ability to make complex topics accessible. He assigns two reasonably priced books (approximately $30 total) that complement his lectures well. Students who engage with the material and put in effort are likely to achieve good grades and gain significant knowledge from his class.",
    "summary_comment_short": "Professor Chavez is highly regarded for his effective teaching methods and engaging material, making the class both informative and enjoyable. Students find his approach valuable, though note that it requires consistent effort and the purchase of two reasonably priced books.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Chavez is an amazing professor and I would highly recommend. The two books we read were interesting and I learned a lot in this class. You have to purchase two books, but they are fairly inexpensive compared to textbooks, around $30 total. If you do the assignments and give effort, you will get a good grade in this class and learn a lot too. ",
        "course": "COMPSTD2105"
      }
    ],
    "SEI": [
      {
        "Subject": "AFAMAST",
        "Catalog": "2270",
        "Class Name": "Introduction to Black Popular Culture",
        "Class Number": "27766",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.71"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2105",
        "Class Name": "Literature and Ethnicity",
        "Class Number": "12411",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "35",
        "Rating": "4.89"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "4921",
        "Class Name": "Intersections: Approaches to Race, Gender, Class, and Sexuality",
        "Class Number": "16921",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2864H",
        "Class Name": "Modernity and Postmodernity: Issues and Ideas",
        "Class Number": "28704",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.5"
      },
      {
        "Subject": "FILMSTD",
        "Catalog": "3660",
        "Class Name": "Documentary Film Studies",
        "Class Number": "27814",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Film Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.47"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "2700",
        "Class Name": "Criticizing Television",
        "Class Number": "20666",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Theatre, Film and Media Arts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.87"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4921",
        "Class Name": "Intersections: Approaches to Race, Gender, Class, and Sexuality",
        "Class Number": "24021",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "Rhiar",
    "id": "VGVhY2hlci0yNjc1NzE4",
    "lastName": "Kanouse",
    "legacyId": 2675718,
    "numRatings": 3,
    "summary_comment": "Professor Kanouse (Rhiar) is highly regarded for her empathetic approach and deep understanding of the subject matter, which she effectively communicates through well-organized and engaging discussions, both facilitated and student-led. Students appreciate her adaptability and understanding of the academic pressures faced by students, making her a supportive and passionate instructor.",
    "summary_comment_short": "Professor Kanouse, known as Rhiar, is highly regarded for her empathetic approach and deep understanding of the subject matter, which she effectively communicates through well-organized and engaging discussions that blend readings and films. Students consistently praise her ability to balance structured guidance with student-led exploration, making her courses both informative and enjoyable.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Rhiar was awesome. She was very empathetic to student concerns, and I was very impressed with her cognizance of the world and the background she did on her assigned readings. Like other COMPSTD classes, lots of reading and film watching. Great facilitated but also student-led discussions. Highly recommended course and professor.",
        "course": "COMPSTD2101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Rhiar is amazing and you can tell that she has a true passion for both learning and teaching. The course is well organized and was adjusted throughout the semester to best accommodate the class. There are a few novels to read throughout the semester but you also get to watch several films. I would definitely take a class taught by her again.",
        "course": "COMPSTD2101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Rhiar is very accommodating and understanding. She is a grad student herself, so she understands what it means to be overwhelmed by heavy course loads. This class is also very interesting!! Super great experience overall.",
        "course": "COMPSTD2101"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "2301",
        "Class Name": "Introduction to World Literature",
        "Class Number": "19264",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.2,
    "department": "Comparative Studies",
    "firstName": "Barry",
    "id": "VGVhY2hlci0yNTQxMzc=",
    "lastName": "Shank",
    "legacyId": 254137,
    "numRatings": 21,
    "summary_comment": "Professor Shank is highly regarded for his engaging and passionate teaching style, which helps students delve deeply into musical analysis and theory. His classes are challenging yet enjoyable, with a focus on critical thinking and active participation. While the material is demanding, his flexible approach and detailed feedback make the learning experience rewarding.",
    "summary_comment_short": "Professor Shank is highly regarded for his engaging and passionate teaching style, which helps students think deeply about the subject matter. His classes are challenging yet enjoyable, with a focus on critical thinking and music analysis, though they require significant reading and active participation for top grades.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved professor shank this semester! he was very understanding and also engaging during this tough time of covid! definitely I would recommend his classes",
        "course": "COMPSTD3686"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Shank gives great lectures that help you a ton if you show up and pay attention, although he does not take attendance the whole semester- just the first couple weeks. There's only two exams which are easy if you study and 4 short papers due throughout the course. Its a very heavy reading based class, but you can get by without reading.",
        "course": "COMPSTD3686"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best professors that I have had. He is very chill and pushed his students to think deeper than they ever thought that they could. Class grading is subjective, but good feedback is always provided.  Lectures are interesting and he is flexible with office hours, which are incredibly helpful. Would definitely take a course with him again.",
        "course": "COMPSTD3686"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very subjective grading, but he gives excellent feedback. Very passionate about teaching, wants us to learn from him. Very helpful. When he gets excited he will jump around the classroom and off the desk. He is a lot of fun to learn from. ",
        "course": "COMPSTD3686"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Barry has his opinions but won't judge anyone's tastes. He gives a lot of material to read but not mandatory and can survive without reading easily. It's definitely harder than your usual GE but it is still too much fun and you get to find out great songs  and learn a lot about music. Oh and you HAVE to participate if you want an A.",
        "course": "3686"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Barry was great, he was really opinionated, but when it comes to music who isn't? I only say that because he never knocked anyone for what type of music they listened to. He also never made anyone feel stupid if they tried to analyze a song. The class was great too, I got exposed to a lot of artists and music that I didn't know I would enjoy.",
        "course": "COMPSTD3686"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Shank definitely takes the material seriously - this isn't exactly a standard GEC class.  Reading the books is a must; an appreciation for music is helpful. It's best if you listen to a variety of music. The class will definitely change the way you look at your music. Go to his office hours, too - his passion really comes through there.",
        "course": "CS336"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "challenging but fun.  anyone taking this class would be a pop culture minor, so if they weren't interested in the subject matter than that is their problem.  did not have to do all of the readings because everything was discussed in class and papers were not difficult.  he gave out a very detailed study guide that told you what was on the test.",
        "course": "ASC264"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Too much reading with very little coming out of it. Two exams, four pages of study guide for each, two papers that ended up being the same thing, one sided in his way of thinking and doesn't like to be challenged. Don't take this class expecting to have your own opinions because he literally laughs at you when you voice them. Awful!!!",
        "course": "ASC264"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Like listening to an opinionated music freak.  MUST GO TO CLASS!!!  I like music, so it was very interesting for me.  If you don't really like music, don't take this class.",
        "course": "CMPST336"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very good professor, really cares about the subject matter. Deals with some abstract ideas that might be hard for some students to pick up on, however.",
        "course": "CS234"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very nice guy, but I felt every lecture was very one sided. Far too much reading (at least a 200 page book a week). Not very good at presenting the &quot;whole picture&quot; of everything. Still a nice guy with somewhat cool things to say while acting crazy when he talked.",
        "course": "CS398"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is an okay professor. He often doesn't answer questions like he should. You must go to class and you must read the all the readings! His exams are easy if you have been to class and have read. He isn't too helpful if you ask him a question through e-mail, he says things like &quot;you should already know that&quot; or &quot;we talked about that in class.&quot;",
        "course": "CSTD234"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "This is an interesting class and Dr. Shank is really cool, but if you aren't a liberal hippy it can be difficult.  There is A LOT of reading, even for a comp std class",
        "course": "CS336"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Shank makes each class fun, but more importantly, interesting.  He is not easy, but you don't mind doing the work because he makes you care about the course material.",
        "course": "COMPSTUDIES"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "dr. shank does an excellent job of creating interesting and complex relationships between society, culture and pop music in america. the quizzes are pretty intense if you don't pay attention in class or take notes. he outlines all the arguments he wants you to know from the assigned reading.",
        "course": "CS336"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great course concepts. Fun, interesting and easy to understand materials and lectures. Shank is an interesting instructor with passion for what he is teaching. great experience.",
        "course": "CS234"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "totally cool, would love to party with him one day. made an early morining class easy to go to.",
        "course": "COMP336"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "He loves pop implications of culture and is open to fresh perspectives. The class was definitely challenging and outside the box but it was a good experience.",
        "course": "COMPSTD274"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great teacher, nice guy.  Would love to take another class with him!",
        "course": "COMPST201"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Totally hottt.",
        "course": "COMPST336"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "3686",
        "Class Name": "Cultural Studies of American Musics",
        "Class Number": "14393",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3990",
        "Class Name": "Approaches to Comparative Studies",
        "Class Number": "14394",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.27"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "6200",
        "Class Name": "Critical Foundations: Interdisciplinarity & Methods",
        "Class Number": "33921",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3990",
        "Class Name": "Approaches to Comparative Studies",
        "Class Number": "16450",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.8"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3686",
        "Class Name": "Cultural Studies of American Musics",
        "Class Number": "22980",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.67"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3990",
        "Class Name": "Approaches to Comparative Studies",
        "Class Number": "19330",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.83"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "6200",
        "Class Name": "Critical Foundations: Interdisciplinarity & Methods",
        "Class Number": "36894",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "Noah",
    "id": "VGVhY2hlci0xOTY1NjA3",
    "lastName": "Tamarkin",
    "legacyId": 1965607,
    "numRatings": 2,
    "summary_comment": "Professor Tamarkin is an effective instructor who emphasizes learning and clear communication over grades. His lectures, while sometimes枯燥，内容却非常实用且有价值。课程要求阅读量较大，但通过完成阅读和外部论文作业，学生可以很好地掌握材料。",
    "summary_comment_short": "Professor Tamarkin is an effective instructor who emphasizes learning and clear communication over grades, and his course material is highly applicable. However, his lectures can be somewhat dry and the reading load is substantial.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Noah is a great professor because he wants you to learn the material, be able to communicate your views and opinions, and not have to worry too much about grades. If you do the readings and follow his clear rubrics youll do very well. There are discussion posts and the final/midterm are both papers that you do outside of class.",
        "course": "COMPSTD2340"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved Prof. Tamarkin! Lectures could get kinda boring and reading was really heavy but the info was really applicable and good to know",
        "course": "COMPSTD2340"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "2341",
        "Class Name": "Technology, Science, and Society",
        "Class Number": "21540",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "36",
        "Rating": "4.42"
      }
    ]
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.6,
    "department": "Comparative Studies",
    "firstName": "Miranda",
    "id": "VGVhY2hlci0xODkzNjc5",
    "lastName": "Martinez",
    "legacyId": 1893679,
    "numRatings": 5,
    "summary_comment": "Professor Martinez is highly regarded for her passion and unique perspective on cultural matters, particularly through the lens of finance, which she shares in a sassy and engaging manner. However, her classes are primarily lecture-based with limited discussion, and she is known for infrequent email responses, making office hours a better option for communication. Students find the class manageable and rewarding for its new insights into cultural issues, though some have criticized her approach to writing instruction.",
    "summary_comment_short": "Professor Martinez is highly regarded for her passion and unique perspective, particularly from a New Yorker's viewpoint, though her communication via email is limited. Her classes emphasize critical thinking and cultural analysis through discussion and various writing assignments, though some students found her approach less effective for writing instruction.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "She's clearly passionate about her work, but, as a New Yorker, she often focused on New York experiences rather than a general urbanite's view. Classes are typically discussion-based, but there are some lecture days. She hardly responds to emails though, so if you need to contact her outside of class, go to office hours. 3 essays &amp; weekly readings.",
        "course": "COMPSTD3661"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is honestly the best, just a super nice person who causes you to think outside of societal norms. The class was an easy A but you really do look at cultural matters in a new light--which is her goal.",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Super easy class and shes super nice and understanding. Take this class if you want an easy A.",
        "course": "COMPSTD1100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "There are a few shorts papers in this class and a final paper. She does not require books aside from one that can be purchased in paperback from B&N. The rest of the readings are free online PDFs, which is nice. She's a sassy, funny lady from Brooklyn and has a unique perspective on culture through through the lens of finance. Very knowledgeable.",
        "course": "COMP2360"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "I took her for my second writing course and she is not a good writing teacher. She gave very little direction on our writing assignments and her grading was bias. The class was set up more like a history class and there was very little discussion, which I feel is important for a writing class. I do not recommend taking her class!",
        "course": "COMPSTD236702"
      }
    ],
    "SEI": [
      {
        "Subject": "AFAMAST",
        "Catalog": "5240",
        "Class Name": "Race and Public Policy in the United States",
        "Class Number": "24906",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8990",
        "Class Name": "Dissertation Writing Workshop",
        "Class Number": "34923",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8990",
        "Class Name": "Dissertation Writing Workshop",
        "Class Number": "37179",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8100",
        "Class Name": "Interdisciplinary Learning Laboratory I",
        "Class Number": "27815",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8200",
        "Class Name": "Interdisciplinary Learning Laboratory II",
        "Class Number": "29967",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8990",
        "Class Name": "Dissertation Writing Workshop",
        "Class Number": "29701",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "2.5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8990",
        "Class Name": "Dissertation Writing Workshop",
        "Class Number": "29549",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "3.5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5240",
        "Class Name": "Race and Public Policy in the United States",
        "Class Number": "5888",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5240",
        "Class Name": "Race and Public Policy in the United States",
        "Class Number": "5889",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "3.2"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5240",
        "Class Name": "Race and Public Policy in the United States",
        "Class Number": "6267",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5240",
        "Class Name": "Race and Public Policy in the United States",
        "Class Number": "6268",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "2242",
        "Class Name": "Introduction to Latino Studies",
        "Class Number": "34929",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.75"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Comparative Studies",
    "firstName": "Parisa",
    "id": "VGVhY2hlci0yODMzNDU3",
    "lastName": "Ahmadi",
    "legacyId": 2833457,
    "numRatings": 5,
    "summary_comment": "Dr. Ahmadi is known for her passion and kindness, making the class engaging and easy, with high chances of earning an A if one does the readings. However, she is criticized for being unorganized, inconsistent in grading, and prone to changing criteria frequently, which can be frustrating. Some students describe her as entitled, unfair, and non-objective, and suggest she should lose her job due to her confrontational behavior online.",
    "summary_comment_short": "Dr. Ahmadi is known for her passion and kindness, making the class engaging and easy, though her lack of organization and inconsistent grading criteria can be frustrating. However, another perspective praises her for her caring nature and effective teaching methods, recommending the course highly.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "While obviously knowledgeable and passionate about what she teaches, Dr. Ahmadi is painfully unorganized. She is easygoing and cares deeply about her students, but is constantly changing her mind on the criteria for the readings and assignments and takes weeks to grade. Ultimately a relatively easy class, but can be frustrating. ",
        "course": "COMPSTD-2301"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Would avoid. \n\nThinks highly of herself and looks down on others. Entitled is the word that comes to mind. \n\nNot balanced. Not fair. Not objective. \n\nFails to understand context and is generally non observant. ",
        "course": "COMPSTD-2301"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "Awful person. \n\nResorts to being a keyboard warrior and forcing her opinion on individuals regardless of circumstances or negative consequences. \n\nShould lose her job. Immediately. Maybe then she will see the negative effects of being a keyboard warrior and negatively impacting other people's lives! \n\n\n\n",
        "course": "COMPSTD-2301"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ahmadi is extremely passionate, and it shows through her teaching. I had a great time in this course, it was relatively easy, and as long as you do the readings, you're pretty much guaranteed an A. Extremely kind and thoughtful, and the class was engaging. ",
        "course": "COMPSTD-2301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Overall I loved taking this class with Dr. P. She truely cares for her students and wants them to succeed. Their were different reading prompts each week where you would have to annotate and some homework assignments that really did not take long. 10/10 recommend taking this course!",
        "course": "COMPSTD-2301"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "2301",
        "Class Name": "Introduction to World Literature",
        "Class Number": "19039",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.92"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.9,
    "department": "Comparative Studies",
    "firstName": "Nicholas 'Nic'",
    "id": "VGVhY2hlci0yMDM4NzM2",
    "lastName": "Flores",
    "legacyId": 2038736,
    "numRatings": 7,
    "summary_comment": "Professor Flores is highly regarded for his exceptional teaching quality and genuine care for his students. Students consistently praise his structured and engaging classes, which foster an environment where critical thinking and open dialogue are encouraged. His enthusiasm and commitment to his students are evident, making him one of the top professors at OSU.",
    "summary_comment_short": "Professor Flores is highly regarded for his exceptional teaching quality and genuine care for his students. His structured yet engaging classes, coupled with his enthusiastic approach, make him one of the standout professors at OSU, fostering an environment where students feel valued and encouraged to think critically.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "i lov him a lot ",
        "course": "CS2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nic is great, the class is structured really well and quite interesting. Obviously theres a lot of reading so just keep up with the readings and pay attention in class.",
        "course": "COMPSTD2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nic cares. I'm very happy to have had the chance to be his student. His enthusiasm and passion are second to none. &lt;3",
        "course": "CS2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nic is by far one of the best professors I have had at OSU. He truly cares about teaching and his students. I definitely looked forward to go to his class because the class structure was seminar based so it was more welcoming in a way and it felt more comfortable to participate if you wanted to. He knew how to make us feel important. He is great!",
        "course": "COMPSTD2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Nic is one of the only professors I've ever had who truly made me think about my life and question my understanding of the world. He welcomes all points of view and chooses interesting topics to discuss in class. I wish I could go back to this class all the time.",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "My favorite professor thus far in OSU. Genuinely cares about every student. Encourages everyone to have an open mind and makes students think for themselves. Very easy to get along with, and understands the stress that students undergo in university. I would recommend him to anyone.",
        "course": "COMPSTDS2105"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Unless you do the short readings and participate in class your good to go.",
        "course": "2105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Comparative Studies",
    "firstName": "John",
    "id": "VGVhY2hlci0yODQ2NjIx",
    "lastName": "Brooks",
    "legacyId": 2846621,
    "numRatings": 3,
    "summary_comment": "Professor Brooks is known for his engaging lectures and interesting course material, though he is a strict grader with frequent quizzes that can challenge students. The class requires consistent attendance and significant effort, including multiple papers on similar topics and a major presentation, with grades being sensitive to even minor deductions.",
    "summary_comment_short": "Professor Brooks offers engaging lectures and interesting course material but is known for being a tough grader, particularly with frequent quizzes that can challenge even those who complete their textbook readings. The class structure includes numerous graded components such as quizzes, papers, and presentations, emphasizing consistent attendance and participation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "The lectures were very engaging and the course material in general was interesting. He is a tough grader and the one question quizzes could trip you up even if you did do all the text book readings, but it wasn't too bad if you put in a little effort.",
        "course": "THEATRE2700"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. John Brooks means well as a professor, but lacks the enthusiasm for the class. You write 3 papers almost about the same topic in the course and you must attend every lecture.",
        "course": "THEATRE2700"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class is called \"American Icons\" but covers less history and more diversity. Almost every class has a graded quiz/participating point about the reading assignment and missing one point heavily affects your grade. There is also a 50-minute presentation about half-way through the semester and a final paper.",
        "course": "COMPSTD2281"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "2281",
        "Class Name": "American Icons",
        "Class Number": "22165",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.2"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2281",
        "Class Name": "American Icons",
        "Class Number": "29963",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.2"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2105",
        "Class Name": "Literature and Ethnicity",
        "Class Number": "19324",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.92"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2105",
        "Class Name": "Literature and Ethnicity",
        "Class Number": "27779",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2281",
        "Class Name": "American Icons",
        "Class Number": "29179",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "3"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "2700",
        "Class Name": "Criticizing Television",
        "Class Number": "27309",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Theatre",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "2700",
        "Class Name": "Criticizing Television",
        "Class Number": "27620",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Theatre",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "2367.02",
        "Class Name": "African American Theatre History",
        "Class Number": "20667",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Theatre, Film and Media Arts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "2700",
        "Class Name": "Criticizing Television",
        "Class Number": "28617",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Theatre, Film and Media Arts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.46"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "2700",
        "Class Name": "Criticizing Television",
        "Class Number": "20944",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Theatre, Film and Media Arts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.53"
      }
    ]
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.3,
    "department": "Comparative Studies",
    "firstName": "Ashley",
    "id": "VGVhY2hlci0yMzU0NTc3",
    "lastName": "Perez",
    "legacyId": 2354577,
    "numRatings": 7,
    "summary_comment": "Professor Perez is highly regarded for creating an engaging and enriching learning environment, particularly valued for her focus on discussion and participation. However, her class is considered more suited for students early in their academic journey, as seniors may find it less efficient for meeting quick deadlines. Students appreciate her understanding and supportive nature but note that the class requires significant time commitment, especially through extensive reading and frequent assignments.",
    "summary_comment_short": "Professor Perez is highly regarded for creating an engaging and enriching learning environment, particularly valued for her dedication to fostering discussion and deep understanding. However, her class requires significant time commitment, including extensive reading and frequent participation, which may not suit students looking for a less demanding course load.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Do NOT take if you are a Senior. She is very focused on a holistic learning environment which is great but not when you just want to get things done. Also if you're not into the whole elementary teacher super positive vibe I would not recommend it. So much work random assignments for no reason. ",
        "course": "COMPSTD2301"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Perez was an awesome and understanding professor who truly wanted you to learn and leave the classroom with new knowledge. ",
        "course": "COMPSTD2301"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was my favorite class of the semester. Ashley creates the best learning environment I have yet to be a part of. This is a discussion based class where participation is the key to advancing your knowledge, so be prepared to talk. I found this very enriching and it really helped me learn. Be warned though, there is a lot of reading.",
        "course": "COMPSTD2301"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "It was not hard, but very tedious work that you spend more time than necessary completing just for her to pick and chose when she actually grades the assignments. ",
        "course": "COMPSTD2301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super nice and understanding professor. There is a daily homework assignment but it isnt difficult. Oh and lots of reading. You also shouldnt take this class if you are uncomfortable talking and participating in class.",
        "course": "COMPSTD2301"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor at OSU hands down",
        "course": "CS2301"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I was super nervous the beginning of the semester because she talked about how much reading there was to do, but she's very organized and made everything simple and to the point. There is a lot of reading, but there wasn't one book I didn't enjoy. She's a big goofball that will say the corniest jokes but, overall it's a great, fairly easy class.",
        "course": "COMPSTD2301"
      }
    ],
    "SEI": [
      {
        "Subject": "ARTSSCI",
        "Catalog": "1138.13",
        "Class Name": "First-Year Seminar",
        "Class Number": "36263",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.91"
      },
      {
        "Subject": "ARTSSCI",
        "Catalog": "1138",
        "Class Name": "First-Year Seminar",
        "Class Number": "37049",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "17",
        "Rating": "4.87"
      },
      {
        "Subject": "ARTSSCI",
        "Catalog": "1138.05",
        "Class Name": "First-Year Seminar",
        "Class Number": "36820",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "ARTSSCI",
        "Catalog": "1138.04",
        "Class Name": "First-Year Seminar",
        "Class Number": "29214",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.79"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2301",
        "Class Name": "Introduction to World Literature",
        "Class Number": "14388",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "34",
        "Rating": "4.48"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3903",
        "Class Name": "World Literature: Theory and Practice",
        "Class Number": "27463",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2301",
        "Class Name": "Introduction to World Literature",
        "Class Number": "22208",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.87"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "7301",
        "Class Name": "Theorizing Literature",
        "Class Number": "34566",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "2301",
        "Class Name": "Introduction to World Literature",
        "Class Number": "16444",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.8"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3903",
        "Class Name": "World Literature: Theory and Practice",
        "Class Number": "27408",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "6500",
        "Class Name": "Teaching Seminar in Interdisciplinary Studies",
        "Class Number": "36863",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "3903",
        "Class Name": "World Literature: Theory and Practice",
        "Class Number": "27228",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Comparative Studies",
    "firstName": "JL",
    "id": "VGVhY2hlci0yNzQ0Mzc5",
    "lastName": "Holler",
    "legacyId": 2744379,
    "numRatings": 2,
    "summary_comment": "Professor Holler (referred to as JL) maintains a fair grading system that makes achieving a high grade possible despite the heavy workload in COMPSTD 1100. While the class content can be repetitive and the setup initially confusing, students appreciate Professor Holler's passion and kindness.",
    "summary_comment_short": "Professor Holler is known for his passion and fair grading, making it feasible to achieve high grades despite the heavy workload in courses like COMPSTD 1100. However, some students find the class repetitive and confusing due to inconsistent scheduling and due dates.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "COMPSTD 1100 actually. Online midterms. Weekly tasks consisted of reading 100+ pages a week or watching a movie, 2-3 discussion posts, and page long essay due. Workload was crazy high, but fair grading made achieving an A feasible. Teacher is definitely passionate.",
        "course": "COMPSTDS2340"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class is pretty repetitive so it can get a little boring, but the work is all rly easy and JL is very fair, accommodating and SUPER sweet. The only thing is that the set up was incredibly weird and JL was a little all over the place and due dates and things were really confusing throughout most of the semester. JL is a great person tho!",
        "course": "COMPSTDS2340"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19477",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.38"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "1100",
        "Class Name": "Intro to the Humanities: Cross-Cultural Perspectives",
        "Class Number": "19313",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.1"
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "David",
    "id": "VGVhY2hlci0xMzcyOTY4",
    "lastName": "Horn",
    "legacyId": 1372968,
    "numRatings": 9,
    "summary_comment": "Professor Horn is widely praised for his exceptional teaching, evident in his passion for the subject matter and genuine care for his students. His classes are described as engaging and manageable, featuring minimal testing and a single paper. Students consistently recommend his classes and highlight his availability and willingness to assist with any issues or concerns.",
    "summary_comment_short": "Professor Horn is highly regarded for his exceptional teaching and passion for his subject, making his classes engaging and enjoyable. Students consistently praise his willingness to help and his approachable nature, recommending his classes enthusiastically.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Horn was definitely my favorite professor of this semester! He cares so much about his students and is passionate about what he is teaching. I highly recommend taking any of his class but especially this one because it is very interesting and there are only two tests and one paper. Also go to his office hours if you need help!",
        "course": "COMPSTD3645"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor David Horn was a pleasure to have as a teacher. David has a true passion for teaching and cares a lot about the subject he is teaching. There was only 1 Midterm, 1 Five Page Paper, and 1 Final in his class. Those were the only assignments, but the reading were very long and dry. Lucky, you do not really need to read the books to do well!",
        "course": "COMP2340"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr.Horn is FANTASTIC!  He is a wonderful professor, terribly helpful and more than open to helping students with ANY issue or concerns they have regarding the class material/university life.  Also his socks were the highlight of my day...check them out for sure!  Do the work and you will succeed.",
        "course": "CS598"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Horn is amazing at everything. Disregard anything on here about him being hard or awful, as those comments are about someone else. Also, make sure you check out his socks. Cause they're flipping fabulous.",
        "course": "CS598"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "BEST professor I've EVER had, taken four of his classes and LOVED all of them. Class is always stimulating - go and you will do well. Very willing to meet outside of class & average amount of work. He is an inspiring, intelligent professor. Our discussions are always interesting, Dr. Horn makes going to class enjoyable. TAKE HIS CLASS!",
        "course": "CS598"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Everything everyone else said. Love him.",
        "course": "CS367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely fantastic man and teacher. One can tweak their essays to a good grade if you use the course material intelligently. He's very sympathetic to student's needs and a down-to-earth yet brilliant anthropologist. The best OSU professor I've ever dealt with with no exaggeration.",
        "course": "COMP367"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Horn is a great professor. His discussion groups are very interesting and fun. He is willing to acknowledge if he's assigned a lot in a certain week, too. Very helpful, I would highly recommend taking his class.",
        "course": "COST305"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a great lecturer. One of the better ones for sure. He's really interested in what he's teaching. He's funny, and likes to make a lot of sex jokes. Most of the time you don't have to fight to keep your eyes open. I definately recommend him.",
        "course": "BIO101"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "2341",
        "Class Name": "Technology, Science, and Society",
        "Class Number": "24856",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "103",
        "Rating": "4.68"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8100",
        "Class Name": "Interdisciplinary Learning Laboratory I",
        "Class Number": "34919",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "8200",
        "Class Name": "Interdisciplinary Learning Laboratory II",
        "Class Number": "34567",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.75"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Comparative Studies",
    "firstName": "Kelly",
    "id": "VGVhY2hlci0xNzQ0MTU4",
    "lastName": "Duke Schultz",
    "legacyId": 1744158,
    "numRatings": 28,
    "summary_comment": "Professor Duke Schultz, known as Kelly, is highly regarded for her passion and depth of knowledge in her lectures, effectively encouraging critical thinking and discussion among students. While some noted her grading can be challenging, many praised her availability during office hours and recitations, where she clarified complex material and provided valuable insights. Her approachability and friendliness contribute to an engaging learning environment.",
    "summary_comment_short": "Professor Duke Schultz, known as Kelly, is highly regarded for her passion and depth of knowledge in her lectures, which challenge students to re-examine their assumptions and engage in meaningful discussions. She is described as approachable and supportive, particularly during office hours and recitations, where she clarifies complex material and encourages active participation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I didn't expect to enjoy this class (basically a lit requirement class looking at religious texts), but Kelly really forced us to reexamine some things I take for granted and she always had interesting debates for us to discuss. Definitely go to her office hours- she knows her stuff and it's fun to chat about religion with her. ",
        "course": "COMPSTDS2102"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Kelly was okay for the time I had her. Since she was prego Idk that she was on her A game as much. Her recitation was a little boring, seems like the topics discussed in the actual lecture were more interesting topics. Overall nice lady would probably take her again, she was much more relaxed than the other TA Conrad who can be a little out there. ",
        "course": "2102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kellye did a great job making space for class discussions, and getting everyone to think about and understand other's positions.",
        "course": "2102"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was passionate about the material she was teaching and was eager to make sure the students really understood the topics we discussed. She also prompted deeper thinking by providing thoughtful questions to ponder. ",
        "course": "CS210202"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Kelly is a tough grader but if you ask questions she is willing to answer them during recitation. It was hard getting used to her grading",
        "course": "CS2370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I don't know how I would have done in this class if it wasn't for Kelly's recitations. The lecturer (professor) was often unclear and sometimes gave us wrong information (according the the bookInternet). Kelly always clarified and fixed any wrong info from lecture, making it approachable and understandable. She's very helpful and knowledgable. ",
        "course": "2370"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Kelly was very approachable and always available if you needed extra help during office hours or after class. She's super friendly and always made sure to keep class engaged in discussion and participation. Overall, great class!",
        "course": "COMPST2370"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Kelly was really nice and friendly. A lot of the discussion is participation based, so sometimes it's hard when people don't talk. She always answered any of our questions and made sure that we knew what was going to be on exams.",
        "course": "CS2370"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "I would recommend this class in a heartbeat. I developed a professional portfolio that I could easily expand in the future. Kelly was very helpful whenever I had questions & would change the syllabus if the work load was too heavy. Assignments were very reasonable & very helpful - each had a purpose and a learning goal. Great class, great teacher.",
        "course": "COMPSTDS236708"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kelly is VERY flexible with student schedules and takes time to make sure that her students succeed! At first, the assignments were overwhelming, but as the semester continued, they became easier. Come to class ready to discuss material from the weekly readings. As long as she can see that you put in the time on your assignments, you will succeed!",
        "course": "COMP236708"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kelly was very helpful and tests your time management skills. Lots of work but it is worth it if you wish to become a better writer. Classes are discussion based which is great because you get familiar with your classmates. Overall she makes the class interesting and I am glad I took her class.",
        "course": "236708"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good professor. I would take the class again and recommend it.",
        "course": "COMP2367"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "A lot of assignments and reading, but usually not boring. Discussion based so it is very interactive. Class is not mandatory but it is worth it to show up. No exams, which is expected for a writing course. A lot of the time assignments are due on Saturday night, not long things but things nonetheless.",
        "course": "CS236707"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kelly really understands students and is very flexible. She is willing  to work with students in order to see them succeed. No textbook or exams. There are a lot of assignments but if you do the work and she can see that you put in a lot of effort you will do well on them and in the class. Come   to class ready to actively participate everyday!",
        "course": "COMPSTD236707"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "No textbooks- the readings/videos are all online. A lot of work, but if you do the work you will be fine. Kelly is very helpful, and makes a dry topic like religion interesting. The class is mostly discussion/ writing. I've learned a lot from Kelly and recommend taking her class.",
        "course": "CS236707"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really learned a lot from Kelly. Even though I wasn't that interested in the class to begin with, she made it a class I looked forward to attending. You won't get by without putting in the work, but if you do the class is easy to do well in! Kelly is super helpful and passionate about what she teaches.",
        "course": "COMPSTD1100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kelly is a great instructor. Even when the course materials weren't interesting to me, she found a way to make the class worth going to. Do the work and you will be fine.",
        "course": "CS1100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kelly was very helpful and always answered any questions I had about my papers, class readings, etc. She is clearly passionate about teaching. Overall, the class wasn't the easiest I've taken but if you do the work you should have no problems.",
        "course": "CS1100"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "First of all, she is very helpful and passionate in teaching. Discussions in class are very interesting. She makes you to think out of box. But you really have to put effort in the class. I would not say her class is easy but definitely recommend to take her class. Very interesting.",
        "course": "COMPSTD1100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is really nice. As an international student in the class, she provide a lot help for me. Choose her class~",
        "course": "COMPSTD1100"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Incredible, helpful teacher. One of the best",
        "course": "COMP1100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kelly was a great teacher for this course. Made you think outside your comfort zone which generated a lot of class discussion. The class was not difficult. Do the readings, participate, and ask questions.",
        "course": "CS1100"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class was well taught and very enjoyable, was definitely a good elective class, and was very eye opening",
        "course": "CS2370"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor, always willing to help and wants to make sure students understand and appreciate material.",
        "course": "CS2370"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a great TA and is very helpful. his is a wonderful class to take.",
        "course": "COMPS2370"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very helpful with any questions you have about the information learnt. She is prompt with emails. During recitation, she offers a different perspective of the subject than the professor does.",
        "course": "COSTD2370"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is great! Very helpful and can work with you after class if you need help!",
        "course": "COMPS2370"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "Friendly and willing to help.",
        "course": "CS2370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Comparative Studies",
    "firstName": "Monamie",
    "id": "VGVhY2hlci0yMjg1NTQw",
    "lastName": "Bhadra",
    "legacyId": 2285540,
    "numRatings": 1,
    "summary_comment": "Professor Bhadra is highly regarded for her exceptional teaching quality, with lectures consistently described as engaging and fascinating. Her grading is noted for fairness, and she is known to be readily available to assist students, making her a highly recommended instructor.",
    "summary_comment_short": "Professor Bhadra is highly regarded for her exceptional teaching quality, making lectures engaging and ensuring fair grading. Students consistently praise her willingness to assist and recommend her classes enthusiastically.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "The BEST professor I have ever had. Lecture was always incredibly interesting and grading was very fair. I really loved this class and the professor was always willing to help. Would really recommend taking a class from her!!",
        "course": "COMPSTD2340"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 1.6,
    "department": "Comparative Studies",
    "firstName": "Matt",
    "id": "VGVhY2hlci0yMTMyMjI2",
    "lastName": "Brenn",
    "legacyId": 2132226,
    "numRatings": 3,
    "summary_comment": "Professor Brenn is generally seen as a likable instructor who finds ways to make lectures engaging, though his disorganization is a significant issue. Students frequently complain about missing assignments, unposted readings, and delayed responses to emails, leading to frustration with the class structure. Overall, while some find the subject matter interesting, the lack of consistent preparation and communication makes the experience suboptimal.",
    "summary_comment_short": "Professor Brenn is generally considered a pleasant instructor whose lectures are engaging, but his classes suffer from significant organizational issues, including missing readings and assignments posted late or not at all, frequent cancellations, and poor communication through email. Students find his unpreparedness and frustration with students who are not equally prepared problematic, leading many to advise against taking his class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Nice guy, enjoyable lectures, but my god he was disorganized.  Would assign readings that weren't on Carmen, class was cancelled due to outside circumstances a handful of times  I enjoyed the class and found subject interesting, but the structure of it all left some things to be desired",
        "course": "CPSTD2281"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Matt is a nice guy, just kind of a flake. He would never put assignments, readings, or grades up on Carmen when he said he would. He also is HORRIBLE at responding to emails.",
        "course": "COMPSTD2281"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "So if you have any questions about the class or your assignments, don't expect to hear back from him. He also never posts the readings or portals for discussions that he says he will. He doesn't come to class prepared and gets frustrated if you don't either even if you don't can't. He was kind of all over the place. 9/10 would not recommend.",
        "course": "COMPSTD3603"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4,
    "department": "Comparative Studies",
    "firstName": "Zeynep",
    "id": "VGVhY2hlci0yMTUzNTYy",
    "lastName": "Aydogdu",
    "legacyId": 2153562,
    "numRatings": 5,
    "summary_comment": "Professor Aydogdu is highly regarded for her knowledge and passion for teaching, fostering engaging discussions and encouraging critical thinking. However, her classes are demanding, with extensive reading assignments and strict grading criteria. Students appreciate her clear expectations and structured approach, though some find the workload and anti-American sentiment in certain course materials challenging.",
    "summary_comment_short": "Professor Aydogdu is highly knowledgeable and passionate about her subject, fostering engaging discussions and encouraging critical thinking. However, her classes can be demanding in terms of reading and grading, and some students find them unsuitable for those seeking a more neutral or less challenging academic experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Zeynep is a great professor and is extremely knowledgable, kind, and respected. The class though, is not recommended for anyone who has pride in America. It had an anti-American sentiment and most assigned texts are biased towards how America is viewed. This is not Zeynep's fault, but should be warned before taking the class!",
        "course": "COMPSTD236708"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Zeynep was truly one of the best professors I've had thus far at this university. Not only did she provide lessons that showed how much thought and time she put into creating it, but she established a constructive environment that fostered really strong discussion.",
        "course": "COMPSTD2367"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took this course for a GE credit and to balance out my challenging, upper division, courses for my major. Unfortunately, I made a huge mistake. This course was alot of reading for a GE 2000 level course. She would assign a new book every week. She was a strict grader took pts off for things that were not in her instructions/prompts.",
        "course": "CS2105"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely adored having her as a teacher. She is clearly passionate about what she teaches, which makes the class that much more interesting. We read a total of 6 novels for her class, and each one was interesting and thought-provoking. You're graded on participation and in-class discussion, and she encourages you to think for  yourself.",
        "course": "COMPSTD2105"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Aydogdu has been one for my favorite college professors thus far. She clearly lays out what the class will be like and what you need to do to get an A, which turns out to be not much. The class is really interesting and actually changed my perspective on how I view the world. I'm so glad I took this class and  I recommend it to everyone!",
        "course": "COMPSTD2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.8,
    "department": "Comparative Studies",
    "firstName": "Puja",
    "id": "VGVhY2hlci0yMTM1OTQ1",
    "lastName": "Batra-Wells",
    "legacyId": 2135945,
    "numRatings": 6,
    "summary_comment": "Professor Batra-Wells is highly regarded for her passion and dedication to teaching, earning strong recommendations from students. Her engaging and discussion-based approach, combined with her genuine care for her students' learning and comfort, makes her classes enjoyable and effective. Students appreciate her availability and clear explanations, though some note the lack of online grade tracking.",
    "summary_comment_short": "Professor Batra-Wells is highly regarded for her passion and dedication to teaching, earning strong recommendations from students who find her approachable and caring. Her classes are described as engaging and discussion-based, with clear expectations and fair assignments that encourage thoughtful participation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's she sweetest ever! You can tell she really loves to teach and cares about her students. I originally had this class with another professor who was just awful and so I switched and it was the best decision! She is very helpful and will kindly answer any questions. WOULD HIGHLY RECOMMEND",
        "course": "COMPSTD1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Batra-Wells was one of the best teachers I have had at OSU! She is clearly passionate about what she is talking about. It is an easy A IF you come to class and participate. There is one midterm, two &quot;papers&quot; (2 pages max), and a final. The only complaint I have is that she does not use Carmen, so you don't know your grade until the end of the c",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher who does a fantastic job facilitating engaging conversations relevant to the course material. Responds to emails in a timely fashion. Genuinely cares about the thoughts, learning, as well as comfort of students. Very relatable and easy to talk to. She is obviously very passionate and knowledgeable about the subject.",
        "course": "COMPSTD236708"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Puja Batra-Wells is my favorite professor I have ever had at Ohio State. She is very passionate about all of the material that she teaches. All of the assignments are fair and not too complicated, but they make you think about the readings and the discussions from class. I am taking another one of her classes next semester! Highly recommend!",
        "course": "COMPSTD2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Puja is super passionate about her stuff and teaches it so well. She adds in personal examples to help you understand it. There are a lot of lectures but more in class discussions so as long as you do the readings and participate you'll be fine for the tests. She doesn't let you have ANY electronics so you have to hand write notes.",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's clearly passionate about what she lectures. I found the class very enjoyable, and it is heavily discussion based. As long as you attend and participate in class discussions, you'll be fine on all the exams. You do have to read before every class, sometimes a lot, but it varies.",
        "course": "COMPSTD1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.8,
    "department": "Comparative Studies",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci05NjQyOTY=",
    "lastName": "Black",
    "legacyId": 964296,
    "numRatings": 13,
    "summary_comment": "Professor Black is highly regarded for her engaging and interesting lectures, making complex material accessible and enjoyable. Students appreciate her kindness and care, though some find her lectures lengthy and prefer more interactive sessions. Overall, she is praised for her teaching quality and positive impact on students.",
    "summary_comment_short": "Professor Black is highly regarded for her engaging and interesting lectures, which many students find enjoyable and memorable. She is described as a caring and knowledgeable instructor who connects well with her students, though some note that her lectures can sometimes feel drawn out.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Black left OSU which is a real shame. I took Comp 2367 last year and wanted to take another class with her before I graduate. Her class was incredibly interesting and I liked the way she presented her lectures.",
        "course": "COMP234"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Black was extremely kind and caring. The course involves reading a ton of books, BUT there were no tests or assignments based on these readings... thus you technically do not need to read any of them (let's face it, no one in our class read any of them). There were 2 easy essays (the class average was a 90-something on both) and a group project.",
        "course": "COMPSTD1100"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "This professor is very nice and knowledgable, but it is hard to sit in class and listen to the lecture for almost an hour and a half. The lecture could be done within 30-45 minutes but she draws it out way too long. She asks for class participation but would interrupt anyone who tried to talk. A kind person, but loves to hear herself talk.",
        "course": "COMPSTD1100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved her class and always looked forward to going. She makes the material interesting and connects to students well. Also, quick with grading. All in all a real role model of an instructor.",
        "course": "CS1100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Black is a great teacher and even a better person. Would highly recommend to anyone that needs a credit in this area. Class is simply readings, three small papers, and one large 10 page paper that serves as the final. No exams or quizzes.",
        "course": "COMPS2367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "amazing teacher. Has so much cultural knowledge and experiences outside the US. takes attendance every class but going to class is fun. a lot of reading but most of the books are pretty interesting. 2 writing assignments, 1 final, and 1 group project. interesting class, but even more interesting teacher. would definitely take another class with her",
        "course": "COMP1100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved her. She cares about her students, gives interesting lectures, and is funny. The class is pretty easy, but you have to read a few books but they're fairly easy reads. Best professor ever.",
        "course": "COMPSTD2367"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Just the nicest lady ever. Take a class with her. ",
        "course": "COMP234"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Now that I've graduated I can honestly say the class I took with Jennifer was the best of my college career. Passionate and compassionate, Jennifer truly shifted my paradigm and I've never looked at History, the media, pop culture or the news in the same way. Plus, honestly, her class and teaching style is straight-up fun.",
        "course": "AFAM218"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great teacher. really easy going and is extremely interested in everything she teaches its always fun to go to class she is very engaging and wants you to be also. Not a hard grader and just a fun and fair teacher. she teaches a bunch of classes too. I also had her for comparative studies 367",
        "course": "AFAM218"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved having a class with Jennifer.  She is extremely nice and respectful to everyone in the class, and she doesn't make it too difficult.  She understands that it is more about making ideas comprehensible then dense.  Overall I would give her a grade of an A.",
        "course": "COMP274"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an AWESOME teacher! All of the topics studied were very interesting and she offered good insights to everything. Plus, she wants everyone to do well, so she does not grade very hard!",
        "course": "COMPS367"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had her for comparative studies 234, American Icons. This was a great, easy class. I recommend it for anyone interested in pop culture. The readings, although required were very interesting. Jennifer is a very fair, easy going teacher who is genuinely interested in helping her students. This was a great class and take it with Jennifer!",
        "course": "COMP234"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Comparative Studies",
    "firstName": "Vidar",
    "id": "VGVhY2hlci0yMTcyNzYz",
    "lastName": "Thorsteinsson",
    "legacyId": 2172763,
    "numRatings": 4,
    "summary_comment": "Professor Thorsteinsson (referred to as Vidar in comments) is known for assigning a significant amount of reading, with exams accounting for 70% of the grade and six pass/fail papers making up 24%. Students find the material interesting but note the high volume of reading required. The class structure allows some flexibility with attendance and reading assignments, though consistent engagement is crucial for success.",
    "summary_comment_short": "Professor Thorsteinsson (referred to as Vidar in comments) is known for assigning substantial reading, with exams accounting for 70% of the grade and six pass/fail papers making up 24%. Students find the material interesting but note the high volume of reading and frequent, brief writing assignments. Overall, the class is demanding, with mandatory attendance and strict requirements for passing.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lots of effort reading for not really tough grading but had to read some becuase of \"familiarity questions\" on exams. Tons of reading. 6, 1500 word papers (24% of final) where the prompt is \"pick and quote and tell me why you picked it\" they are P/F, then 6% for coming to class, then 70% from the midterm and final (35% each) easy A if you read",
        "course": "COMPSTD1100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Vidar is a pretty good teacher. You get assigned books to read, 2 were interesting and 2 were not at all. Didn't read all of them and only missed 4 points the entire semester. Papers are based on your opinion and how you want to go about writing them but be prepared for 2 page papers pretty much every 2 weeks. Class is mandatory",
        "course": "COMP1100"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class is a ton of reading, but the material was very interesting. Vidar is a very smart professor and he tells you exactly what's going to be on the tests (2 for 70%). However, if you don't read, you'll fail the tests. The reading responses are you're own commentary and they are P/F so those are pretty easy.",
        "course": "COMPSTD1100"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "70% of the class is exams 24% of the class is 6 papers that are 4% of your final score (all are pass/fail basis) 6% is group work occasionally  You can skip 2 days throughout the semester no questions asked, but  you have to get 4 reading books.   This is my first time using Rate My Professor, because I didn't like this class at all.",
        "course": "COMSTD1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.5,
    "department": "Comparative Studies",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0yMDg2NjA4",
    "lastName": "Hendy",
    "legacyId": 2086608,
    "numRatings": 7,
    "summary_comment": "Professor Hendy is highly regarded for her engaging and entertaining lectures that help students understand course material, making even complex topics accessible. Students appreciate her thoughtful approach and respect for their learning needs, though some note that attendance in recitations is crucial for full understanding and participation points. Overall, her teaching is effective and enjoyable, with many students expressing a willingness to take her classes again.",
    "summary_comment_short": "Professor Hendy is highly regarded for her engaging and effective teaching methods, making complex topics accessible and interesting. Her lectures are detailed and helpful for understanding course materials, though some students find they need to attend recitations and read assigned materials thoroughly to fully grasp the content.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "The t.a's grade everything she does nothing but lecture. she wouldnt round my grade but at the last minute of the new semester i got an email and my grade got rounded.... not sure if it was her",
        "course": "COMPSTD2341"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Hendy was a great teacher and kept class fun and entertaining as well as relevant.",
        "course": "COMPSTD2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Loved the class. Very nice prof, makes boring stuff really interesting.",
        "course": "COMPSTD2341"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Hendy is a great teacher. Her lectures me understand the readings. She's thoughtful and respects students. I'll take her class again!",
        "course": "COMPSTD2341"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lectures were great and helped to understand the readings. Prof. Hendy was helpful and gave really good comments when I talked to her in office hours. Loved this class!",
        "course": "COMPSTD2341"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "Only one midterm and one final. MUST go to recitation or you don't get participation points at all. Her lectures were interesting but if you didn't go to class and listen to what she lectured about some of the stuff didn't make sense if you just tried to look it up. MUST read if you wanna pass, tons of online readings and books assigned.",
        "course": "COMPSTD2341"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Talks like she's constantly reading out of a peer reviewed journal.  Zero laymen speak, B.S. class.",
        "course": "COMPSTD2341"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Comparative Studies",
    "firstName": "Ankita",
    "id": "VGVhY2hlci0yMTQxNTM4",
    "lastName": "Sikdar",
    "legacyId": 2141538,
    "numRatings": 2,
    "summary_comment": "Professor Sikdar is an effective teacher who simplifies complex concepts for easier understanding and provides useful homework. However, lectures can be枯燥无味，而项目则较为有趣且易于完成，但部分测验和考试难度不一。",
    "summary_comment_short": "Professor Sikdar is an effective teacher who simplifies complex concepts and provides useful homework assignments. However, lectures can be枯燥乏味，而项目则较为有趣且难度适中，部分测验和考试难度不一。",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I thought she was a really good teacher. The concepts were abstract but she was able to put into terms that were easy to understand and the homework helps learn as well. She's also kind and supportive in office hours!",
        "course": "CSE2122"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lectures were pretty boring. The projects were interesting and fairly straightforward. Some of our quizzes and tests were easy, others were tougher.",
        "course": "CSE2122"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4,
    "department": "Comparative Studies",
    "firstName": "Ilana",
    "id": "VGVhY2hlci0xMDAyMTk4",
    "lastName": "Maymind",
    "legacyId": 1002198,
    "numRatings": 12,
    "summary_comment": "Professor Maymind is highly regarded for her passion and expertise in religious studies, consistently providing supportive and engaging classroom environments. Students appreciate her availability and willingness to assist outside of class, though some note the heavy reading load, especially in writing-intensive courses. Her classes are described as intellectually stimulating and well-organized, fostering a supportive and open-minded atmosphere for discussion.",
    "summary_comment_short": "Professor Maymind is highly regarded for her passion and dedication to teaching, providing extensive support both in and out of class, and fostering a comfortable environment for discussion. Students appreciate her knowledge and commitment to her students' success, though some note the heavy reading load, particularly in newer semester formats.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Maymind is the best professor I've had at OSU. She knows students take her class for GE credit but this doesn't deter her. She is passionate about what she teaches and is so helpful in and out of class. I am interested in taking more religious studies courses after her class. She expects strong writing but provides plenty of resources for help",
        "course": "CS236707"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof. Maymind is an extremely nice person and always willing to help and send as many emails outside of class as it takes for you to understand the material.  The problem is that (at least during the switch to semesters) there is an extreme amount of reading, especially in a course meant for writing, and more was added on as the class continued.",
        "course": "CS2367"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is a fantastic teacher; she knows her stuff and thoroughly enjoys teaching. Funny too! It is very, very busy, having to read so much all the time, but if you do the work it isn't terribly hard. Also, attendance isn't completely mandatory, but it helps to take for writing the papers later, and you need participation points.",
        "course": "CS301"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Comparative Studies 367.03 was an easy A and if you are interested in studying religion and reading articles based on views of religion this class is for you. The only thing is attendance is mandatory and there is a LOT of reading. 2 short papers, reading summaries each week, and 1 final paper is what makes your grade. I recommend this professor!!",
        "course": "CS367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "I loved this class! Ilana is awesome! Very knowledgable and very approachable. Really cares about the students and knows her stuff!",
        "course": "CS367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is my favorite teacher I've had so far at OSU. She really cares about her students and responds to e-mails quickly. She's also very open minded and provides a comfortable environment for discussion.",
        "course": "COMPS367"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Ilana is a great teacher. Knowledgeable and invested in students' success. Reading were interesting and there were always questions for readings posted to make these readings more focused. Also, always had supplementary materials posted according to students' interests. Provided for a comfortable atmosphere for discussion.",
        "course": "CS367"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Interesting course, she never really adds much to the conversation, leaves it up to students. Seems kind of scatterbrained",
        "course": "COMPS367"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Intellectually stimulating!",
        "course": "CS367"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Could not stand her...she's very closed minded and does not allow you to have an opinion...condescending...her presence in the classroom is pointless because she adds very little to the conversation...NOT RECOMMENDED!!!!!",
        "course": "COMPCOMP"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 2,
        "comment": "Basically, scatterbrained. Discussions were pointless. She just asked a question and relied on the class to just take it away. Never had an opinion to offer. Class was like pulling teeth. But I got through the course with an A. Disappointed because the topics were interesting but discussions did not relate well to lectures.",
        "course": "CMPST270"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 1,
        "comment": "Very nice lady. She's a very helpful TA. Always responds to e-mails. Very helpful in answering questions. Gives great reviews before midterm. Very easy grader and nice grader. Does not make you do quizzes instead she gives cl**** discussions of what is going on in lecture. Take her as your TA if you can.",
        "course": "COMPT270"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 3.3,
    "department": "Comparative Studies",
    "firstName": "Leo",
    "id": "VGVhY2hlci0xODE1NDM1",
    "lastName": "Coleman",
    "legacyId": 1815435,
    "numRatings": 2,
    "summary_comment": "Professor Coleman is a highly intelligent and engaging scholar who is praised for his precise definitions and deep understanding of complex concepts. However, his lectures are often criticized for being overly verbose, making it difficult for students to grasp the material without additional study.",
    "summary_comment_short": "Professor Coleman is a highly intelligent and engaging lecturer who defines terms meticulously, which some find challenging due to his complex explanations. While appreciated by those who value precision and depth, his lectures are criticized for being overly detailed and difficult to follow, leaving some students feeling they learn little despite attending regularly.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "He's too wordy and doesn't know how to dumb the topics down enough to clarify what the hell is going on in lecture. I sat in class for almost 2hrs twice a week an learned nothing.",
        "course": "INTSTD4661"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "What a great scholar. I loved this class. Attracts an interesting, intellectual group. Professor Coleman is so smart, speaks wonderfully and I like that he takes time to define the terms he using, forcing students to be precise when using famous concepts like commodity fetishism or even neoliberalism. Very engaging, very intellectual, great work.",
        "course": "CS5864"
      }
    ],
    "SEI": []
  }
]