[
  {
    "avgDifficulty": 3,
    "avgRating": 3.6,
    "department": "Comparative Literature",
    "firstName": "Lindsey",
    "id": "VGVhY2hlci00OTQ5",
    "lastName": "Jones",
    "legacyId": 4949,
    "numRatings": 31,
    "summary_comment": "Professor Jones is highly knowledgeable and enthusiastic about his subject matter, which students find valuable despite the extensive reading load. His lectures are often described as informative but sometimes tedious, with little room for interaction or discussion. While some students appreciate his depth of knowledge and positive attitude, others find his classes overly long and monotonous.",
    "summary_comment_short": "Professor Jones is highly knowledgeable and enthusiastic, making his classes valuable despite their often boring nature and extensive reading requirements. His lectures are comprehensive and engaging when presented through powerpoints, but the class itself can be monotonous and lacks interactive elements.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "There will be attendance sheet pass around. A lot of materials, he knows what he is talking about, but it is a little boring. A very nice professor though. You need the textbook and there will be reading on carmen as well. a LOT of reading.",
        "course": "COMPSTD2370H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lectures 2 days a week. 1 midterm (25MC, 5 definitions, 5 short answer, one &quot;comparative&quot; problem). 2 papers, 5-7 pages each. First was on an article you find yourself pertaining to Religion, the second was comparing 3 religions. Final just like the midterm, perhaps a little bit longer.",
        "course": "CMPST270H"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "I hated having him as a professor.  It was an hour and 48 minute class and all he does is talk and talk and talk.  There is no discussion or classroom involvement at all.  And also I feel like he finds himself to be a very important person and wants all his students to think so too.  I hated COMP STUDIES 270H.  :(",
        "course": "CPSTD270H"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof Jones was by far the best professor I've had here. He is so incredibly knowledgeable and does a fantastic job of communicating. His tests are kinda tough but definitely manageable if you study. However, only take this class if you are genuinely interested in religion or you'll be bored out of your mind!",
        "course": "CS270H"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very, very boring class. Tried to get into it, but had to fight to stay awake during lecture. Generally only attended on days where essays were due. Stay on top of the readings, remember the basic events of the novel, and you can bs your way through a 5-page essay.",
        "course": "CS202"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Nice, interesting guy; uninteresting class.  Powerpoints were excellent, but class was very dull and extremely repetitive.",
        "course": "CMPSTH270"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "oops I meant a 3 for easiness instead of a 1!",
        "course": "CS620"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 5,
        "comment": "I am sad to see LJ has received bad comments-I have had him for 2 qtrs. (620,651) and I think he's amazing. His knowledge and enthusiasm are motivating. There was a TON of reading for this class, but the knoweldge gained is well worth it-just be prepared. Positive attitude, good stories, and knows everyone in the Religious Studies field! :)",
        "course": "CS620"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great Prof. Lots of reading, good amount of work, but well worth it. LJ knows his material.",
        "course": "CS620"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "I was really disappointed with the class. It's a shame really because Dr. Lindsay has had extraordinary life experiences, but he doesn't even share these in an interesting way.  The readings were excellent, but in general the class was lacking.  He also has an interesting grading style.",
        "course": "COMPSTDS202"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "I felt like he used a &quot;comparative&quot; religion class to preach about Buddhism. He even got defensive when the discussions actually became comparative. I also don't feel like he taught much, he just let us talk with expectations of what we should say, so most weren't really honest, just trying to please him to get a good grade. I wouldn't do it again.",
        "course": "COMPSTDS201"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "I felt like i was taking a class on buddhism, not comparative religion. Class not that bad...get involved in discussion, and he'll respect you. Hard to know what was gonna be on the final because all we did was write 3 papers, and we didn't have much prep",
        "course": "CMPSTDS20201"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I LOVED this class and this professor.  It's not often you feel like you're hearing from someone who really has seen it done it and been a part of it, but Jones has!  He has EXCELLENT powerpoints... and really interesting real life experiences.  He is an incredible teacher, and really cares.",
        "course": "COMPSTDH270"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really really good professor. His life is interesting to say the least, I've never of someone being able to do so many diverse things. Prepare for the tests well and on the papers, really go out on a limb! He'll like it",
        "course": "RELSTDH270"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 3,
        "comment": "Class was interesting, but lectures were kind of dry at times...Prof Jones helped this by his amazing Power Point skills and using examples from his (very diverse) life experience. Two papers that were graded pretty tough.",
        "course": "COMPSTDH270"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "lectures are interesting so long as the student is interested in the subject. Dr. Jones is very knowledgable and a nice guy. easy to talk to and ask questions. His personal experiences are also pretty interesting.",
        "course": "CSH270"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "He might know what he is talking about, but he is thrown off by questions.  His lectures drag, but the readings were helpful.",
        "course": "CSTD270"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 2,
        "comment": "Sometimes talks in circles, but the man knows what he's talking about.",
        "course": "RELSTDH270"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 2,
        "comment": "Extrememly closed minded and self absorbed.  He will not listen to you he just waits for his turn to speak again.  Boring and not want you want out of the class.",
        "course": "RELIGH270"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "RELIGON"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Hard to understand exactly what he is asking for...",
        "course": "CSTH270"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very knowledgeable.",
        "course": "RS651"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "After taking several grad courses and one lower level with L.J. it is clear that he is an excellent teacher, encouraging, helpful, brilliant, and demanding (but this is not a bad thing if you want to learn).  3 for easiness because of subject, not prof.",
        "course": "RELSTDS651"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Jones is an interesting person as well as an inspirational professor of Comparative Studies",
        "course": "COMPSTD2"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. Jones is very boring and extremely strict.  Prepare to  orientate  yourself.",
        "course": "COMPSTD2"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great teacher for anyone with genuine intrest in the study of religion",
        "course": "RS651"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "gains back your favor at the end of the quarter (end of last lecture)",
        "course": "COMPSTD2"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "REL270"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very Boring",
        "course": "RELSTDS27"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 3,
        "comment": "Prepare to sleep",
        "course": "CS270"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "CS270"
      }
    ],
    "SEI": []
  }
]