[
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "Construction Management",
    "firstName": "Brad",
    "lastName": "Nadolson",
    "legacyId": 2716001,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Eh. He is a good guy who cares about the subject. Attendance is mandatory even though you do not learn much in lecture. Usually full of guest speakers. Exams and Quizzes are online not in class. BUY THE BOOK it will save your grade and make quizzes and exams easy. The questions are pulled straight from the book for all homework, quizzes, and exams."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Great guy. Great class to take for learning projects . Writing review after he bought everyone in class a cup of coffee"
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "This class definitely wasn't easy, but he was thorough in his lectures and always offered explanations. Quiz heavy course with detailed labs."
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "Construction Management",
    "firstName": "Brad",
    "id": "VGVhY2hlci0yNzE2MDAx",
    "lastName": "Nadolson",
    "legacyId": 2716001,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Eh. He is a good guy who cares about the subject. Attendance is mandatory even though you do not learn much in lecture. Usually full of guest speakers. Exams and Quizzes are online not in class. BUY THE BOOK it will save your grade and make quizzes and exams easy. The questions are pulled straight from the book for all homework, quizzes, and exams.",
        "course": "3451"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy. Great class to take for learning projects . Writing review after he bought everyone in class a cup of coffee ",
        "course": "3451"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class definitely wasn't easy, but he was thorough in his lectures and always offered explanations. Quiz heavy course with detailed labs. ",
        "course": "3451"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.3,
    "department": "Construction Management",
    "firstName": "Anastasia",
    "id": "VGVhY2hlci0yMTM5Njc0",
    "lastName": "Britt",
    "legacyId": 2139674,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible. Does not listen or help. ",
        "course": "CSM2305"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "She bribes students to take SEI's for extra credit and at the end does not give any. She takes points off for basic things. Doesn't reply to emails. Basic points were taken off of projects.",
        "course": "CSM2305"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3,
    "department": "Construction Management",
    "firstName": "Jeff",
    "id": "VGVhY2hlci0xOTc3OTU4",
    "lastName": "Suchy",
    "legacyId": 1977958,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jeff is an awesome teacher for both the material and methods class and the electrical class for CSM and ASM.  Very hands-on labs. Electrical class is math-heavy.  Material and methods is so easy and fun handling concrete and framing sheds,  All around very knowledgeable professor and offers a lot of wisdom to his students.  ",
        "course": "CSM2241"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Wouldnt recommend taking this professor, you fail one test in his class? You fail. Missing any day of class will result in a percentage drop. He's very old school and makes material seem harder than it actually is. Not a bad guy just wouldn't recommend taking any classes with him.",
        "course": "CSM2241"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Suchy is by far one of the best professors in the CSM program. He genuinely cares about all his students and is an awesome person to talk to. The lectures can be dry but the material is very easy to learn. Best professor ive had at OSU in 3 years here",
        "course": "CSM2241"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class shouldnt be as hard as the professor makes it. If your a slow learner do not pick this course with this instructor. I have to voice record every lecture just to keep up. Honestly if you have a tough semester, take this course next semester",
        "course": "CSM2241"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "He was really prepared and helped students get prepared for the real world after graduation.  Had informative lectures and was prepared.",
        "course": "AGSYSMT4605"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Class was Building Materials and Construction in Agriculture.  He was not very organized and prepared for class, but a good guy.  Ask for help!! Not much homework but the few homeworks took awhile.  Tests were pretty hard.  Need to go to class to succeed.",
        "course": "AGSYSMT2241"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Construction Management",
    "firstName": "Phil",
    "id": "VGVhY2hlci0yNjA5MTkx",
    "lastName": "Sutton",
    "legacyId": 2609191,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr.Sutton brings desires and a personal connection with every one of his students.  He is very knowledgeable and has experience as a project manager/ estimator for a variety of companies.  He has connections everywhere for internships and is considered by me as my favorite professor as well as a dear friend.  ",
        "course": "CSM4900"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Phil is one of the most caring individuals you will meet in your entire life. The man loves teaching and genuinely cares about your success. His coursework is manageable and he will teach you valuable lessons from his extensive construction career along the way. The man has forgotten more about construction than you'll learn at OSU; great teacher.",
        "course": "CONSYSM4900"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I can with confidence say that Phil is my favorite professor in the program. Cares a lot about students, and is heavily invested. He will treat you like you are his best friend. Gives great feedback and is willing to put in the time to help you understand. Great professor and great guy in general. Lots of site visits and interactive activities.",
        "course": "CSM4900"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.4,
    "department": "Construction Management",
    "firstName": "Larry",
    "id": "VGVhY2hlci0xMjU2NzQw",
    "lastName": "Heckendorn",
    "legacyId": 1256740,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of two instructors who were very 'real world' about teaching and grading projects.  If not done right, try again.  I love that.",
        "course": "CSM240"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very dry. Very outdated, doesn't use Carmen to keep grades updated. Inconsistent with grading. Absolutely acts like a jerk if you ask a question or for help with anything in the lab. He takes his dear sweet time getting to lecture and expects you to stay over. Same thing with Labs and the end of the semester is a total rush and very sloppy.",
        "course": "CSM2240"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Fairly poor in lectures, try not to have him too early or your more likely to fall asleep. You can get by without really going to class, just dont miss labs. Get your labs done quickly if possible and do the extra lab items. AND chances are you won't be building this structure because every class falls behind.",
        "course": "CSM240"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Larry was a great professor! He is extremely passionate about what he teaches and incredibly helpful. I wish he taught more classes at OSU.",
        "course": "CSM240"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "larry's great. dry and dull as can be. real laid back, doesn't really explain things too well. moves at a slow pace, but is just great to be around. if he goes off on you in a lab, you probably deserve it. it's welding, it's not plant science. there's a lot of safety involved. good guy, cool class.",
        "course": "CSM240"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "He's crazy. Get really mad about little things. He went off on someone in each of my labs. I really didn't like him....&quot;Watch your eyes&quot;",
        "course": "CSM240"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "larry is hilarious. crazy about safety (memorize the expiration dates on the fire extinguishers because he WILL ask you) knows more about welding than anybody and makes sure you know that you can kick out the vent grate and escape if all the doors are blocked by fire.",
        "course": "CSM240"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Construction Management",
    "firstName": "Adrienne",
    "id": "VGVhY2hlci0yODI4MTA2",
    "lastName": "Sraver",
    "legacyId": 2828106,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Sraver is one of the best professors at OSU. She's very helpful when you ask any questions and responds quick to emails. Alot of professors tell you they want you to succeed but with professor Sraver you can tell she actually cares.",
        "course": "CONSYSM2205"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class material is easy to follow along with",
        "course": "CONSYSM2205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Construction Management",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNDUyODQ2",
    "lastName": "Banta",
    "legacyId": 2452846,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The CSM program at Ohio State could use a lot of work still, but Mark's class I would say is the best class to prepare you for what you will be faced with when you become a project manager. Class is really easy and great to follow. \n",
        "course": "4641"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Construction Management",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNDUyODQ3",
    "lastName": "Scott",
    "legacyId": 2452847,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super awesome teacher.",
        "course": "CONSYSM4642"
      }
    ],
    "SEI": []
  }
]