[
  {
    "avgDifficulty": 4.6,
    "avgRating": 1.4,
    "department": "Consumer Science",
    "firstName": "Dean",
    "lastName": "Lillard",
    "legacyId": 2342679,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "DO NOT TAKE THIS CLASS! I highly recommend you stay away from this professor unless you absolutely have to take him. You won't understand anything if you don't go to class. He randomly calls on you and doesn't let you off the hook. Late to exams. Lectures completely unorganized. Exams and quizzes are not like what he teaches. STAY AWAY!!!"
      },
      {
        "index": 1,
        "rating": null,
        "comment": "This course is all poorly worded quizzes/tests, not enough time allotment for tests, outdated teaching methods (no canvas, you must print your own homework, randomly calling on students and not letting them off the hook if they don't have an answer). Prof. Lillard is a nice guy and lectures the material well, but the class is built to fail."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Avoid at all costs"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Very hard class"
      },
      {
        "index": 4,
        "rating": null,
        "comment": "horrible at using carmen. grades are updated in chunks, so you never know your current grade. all the files are uploaded into one single folder for you to sort through. generally annoying to deal with"
      },
      {
        "index": 5,
        "rating": null,
        "comment": "ConSci 3930 has been the most pointless class I've taken. His slides never made sense, he calls on you randomly and forces you to figure out the answer. The entire class is built on an outdated form of consumer decision making. Most assignments took hours to complete and even then you didn't really get it. Avoid being with him if you can."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Dean Lillard is a professor that strays from the typical teaching style seen in college evidenced by his essay exams. Iff you attend lectures, he will provide all the information you need. The class size is small and he engages with the students each class. Take this course if you have a desire to learn more than you would in typical class."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "Simply the worst prof I have ever had at OSU! He doesn't use Carmen for grades, exams don't cover material from class, he is incredibly late on handing back quizzes/tests, he cancels class without telling you in advance and overall has no respect for students. Would avoid him at all cost!! Hopefully future students will check this website!!"
      },
      {
        "index": 8,
        "rating": null,
        "comment": "So incredibly difficult. He does not want to give away grades. I have worked my ass off for this class and I'm practically failing."
      }
    ]
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.8,
    "department": "Consumer Science",
    "firstName": "Drew",
    "id": "VGVhY2hlci0yNDgwNzUx",
    "lastName": "Hanks",
    "legacyId": 2480751,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Hanks was an amazing professor & will help when needed. Attend office hours & class cause it's pretty lecture heavy. A tough grader but as long as you put something down that makes sense he will give partial credit. Only thing that was a bit annoying was that assignments and grades were never updated on time in Carmen.",
        "course": "CONSCI3940"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Hanks does a very good job of teaching the class. The content is complex and can be hard to understand, but he does a great job explaining it in lectures. He is also very nice, so if you don't understand a concept, he is always willing to help you understand and go into more detail to dissolve confusion",
        "course": "CONSCI3940"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "\nDr. Hanks is one of the best professors at Ohio State and he does wonders making 4150 one of the most fun classes here. His engaging teaching style and commitment to student success create a positive learning environment. Despite challenging coursework, his patience and extra support make the class truly rewarding. Highly recommended!\n\n\n\n\n",
        "course": "CSCFFS4150"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Hanks is a great professor! His class is very beneficial for the real world, especially learning tools in Excel like Pivot Tables. He really cares about his students and helped me graduate in my last semester. The material in his course is detailed and helpful outside of class. I would recommend him to anyone looking for a Data Analysis course.",
        "course": "CONSCI3940"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I'm not sure why the other reviews are bad because Dr. Hanks is a good professor. In order to pass this class make sure you attend lectures, read over powerpoints, and if you need help do not be afraid to ask. Dr. Hanks will not hesitate to help if you reach out to him. As long as you read and follow directions, you'll pass this class.",
        "course": "CONSCI3940"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Idk what is up with these other reviews, but I think Dr. Hanks was great. I attended his office hours pretty much every week, at which point he was more than happy to help me out. Attending lecture is critical if you want to excel, but you should at least pass by just looking at PowerPoints. He even changed the curriculum based on our feedback!",
        "course": "CONSCI3940"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Hanks is a really nice professor who makes it a point to get to know students names. Quizzes became online in the middle of the semester, he also told us what problems would be graded on problem sets. It's clear he took student's opinions and used them to better the course. Overall, it wasn't hard as long as you attend class. ",
        "course": "CONSCI3940"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor is extremely unorganized, gives last-minute quiz assignments and lectures are not interactive or interesting. Carmen syllabus and modules are never updated and oftentimes confusing. Professor won't make changes until told to do so. Assigns 5 point quizzes but grades them so harshly and does not offer that much extra credit. ",
        "course": "CONSCI3940"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "His lectures are never organized nor are they correlated with quizzes / problem sets. Failed to update the syllabus, due dates were from last semester and after recognition of wrong due dates, they were still not updated.",
        "course": "CONSCI3940"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Hanks is unorganized and often makes mistakes. He will help you if you ask. However, I would not recommend taking this class unless you are passionate about statistics and Microsoft Excel. For people who do not want to learn that stuff you will hate this class because Hanks is not very articulate or on top of things.",
        "course": "CONSCI3940"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is a little tough. After All, we're dealing with quantitative methods in consumer science. However, Dr. Hanks is an incredible teacher and is willing to help along the way if you ask.",
        "course": "CSCFFS4150"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "The course is very very difficult. There're lots of homework. There's none extra credit at all!",
        "course": "CSCFFS4150"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Consumer Science",
    "firstName": "Alexandra",
    "id": "VGVhY2hlci0yMjA2NTY3",
    "lastName": "Suer",
    "legacyId": 2206567,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Such a kind lady! I had an issue on one assignment, and she gave me an extension with full credit. She leaves feedback on all assignments and is so encouraging. Weekly quizzes but they're only 10 questions and open book, pretty easy. 3 PHOTOSHOP ASSIGNMENTS! These assignments were fun, but very time consuming and super teach savvy. Extra credit! ",
        "course": "CSFRST2370"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Alex is a great professor! Super helpful and very understanding. Her videos lectures were long and had a ton of material, but were easy to understand. Assignments were straightforward and the TA's gave good feedback. A lot of opportunities for extra credit, so take them to get extra points. You will know photoshop inside and out after this course. ",
        "course": "CSFRST2370"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best fashion professor OSU has right now. She is so understanding and helpful in all situations. Its so easy to tell she wants the best for you and is a great resource for whatever you need in this class and has great experience to talk about the industry. ",
        "course": "CSFRST3471"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I could not say better things about Alex! She is cares so much about her students and is extremely passionate about what she teaches. She made this class so fun and I would take it again if I could! Shes amazing! Take this class for sure!!!!!",
        "course": "CSFRST2370"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "genuinely the best and most kind Professor Ive ever had. she cares so much about her students and all of her assignments are so fun. exams and quizzes are open note, lecture, etc & theres tons of extra credit. photoshop assignments are SO SO FUN!! Id take this class over and over if i could. def take this class if u can!!",
        "course": "CSFRST2370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the best! Very accessible outside class. She really cares about her students and truly wants her students to succeed. I learned a lot in this class, too!",
        "course": "CSFRST2370"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best teacher ever! class is so interesting and fun!! I wish I could take this class over and over again. Alex really wants everyone to learn photoshop skills and do well for the sake of their own future. She is so compassionate &amp; can tell she really loves teaching this class. I'd recommend this class to anyone whos interested in fashion &amp; photoshop",
        "course": "CSFRST2370"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easily one of the best professors I've ever had at OSU. She really cares about her students and wants you to do well. Occasional pop &quot;quizzes&quot; done via magazine but it's incredibly easy to do well in this class. She rocks!",
        "course": "CSFRST2370"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "I would take every class with Alex if I could. She cares about her students and tries to do anything to help you out. You do have to show up to class (pop assignments &amp; participation pts) but she makes class interesting. Group project is worth a lot of the grade but its easy. 10/10 would recommend!",
        "course": "CSFRST3471"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely love her as a person and as a professor. Clearly cares about all of her students and loves what she does. Always willing to meet outside of class for things related to her course or even for things that aren't. She went above and beyond to help me with my resume and internship search even though she didn't have to.",
        "course": "CSFRST3471"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class is very easy & you learn a lot. The group project will go well if everyone gets along & does their part. She cares about her students & is very passionate about fashion & retail. Gives a lot of extra credit opportunities.",
        "course": "CSFRST4575"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great professor who seems to really love what she does and cares about the students. The class is interesting and the projects are fun. She also gives a couple extra credit opportunities.",
        "course": "CSFRST2370"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my most favorite professors so far at OSU. You can tell she truly cares about helping students find their own paths, and makes herself very accessible to help others. Her class gave a great intro to the fashion industry, and her emphasis on business and marketing was very helpful. Her industry experience is also reassuring.",
        "course": "CSFRST2370"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "My favorite professor I've had at OSU. Very nice and gives good individualized feedback on assignments. The textbook is supposedly required, but I didn't even open it. Really would like to take a class with her again. I met with her during office hours once or twice, and she was very helpful.",
        "course": "CSFRST2370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.6,
    "avgRating": 1.4,
    "department": "Consumer Science",
    "firstName": "Dean",
    "id": "VGVhY2hlci0yMzQyNjc5",
    "lastName": "Lillard",
    "legacyId": 2342679,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS! I highly recommend you stay away from this professor unless you absolutely have to take him. You won't understand anything if you don't go to class. He randomly calls on you and doesn't let you off the hook. Late to exams. Lectures completely unorganized. Exams and quizzes are not like what he teaches. STAY AWAY!!!",
        "course": "ConSci3930"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "This course is all poorly worded quizzes/tests, not enough time allotment for tests, outdated teaching methods (no canvas, you must print your own homework, randomly calling on students and not letting them off the hook if they don't have an answer). Prof. Lillard is a nice guy and lectures the material well, but the class is built to fail.",
        "course": "ConSci3930"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Avoid at all costs ",
        "course": "ConSci3930"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very hard class ",
        "course": "CFFS5140"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "horrible at using carmen. grades are updated in chunks, so you never know your current grade. all the files are uploaded into one single folder for you to sort through. generally annoying to deal with",
        "course": "ConSci3930"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "ConSci 3930 has been the most pointless class I've taken. His slides never made sense, he calls on you randomly and forces you to figure out the answer. The entire class is built on an outdated form of consumer decision making. Most assignments took hours to complete and even then you didn't really get it. Avoid being with him if you can.",
        "course": "ConSci3930"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dean Lillard is a professor that strays from the typical teaching style seen in college evidenced by his essay exams. Iff you attend lectures, he will provide all the information you need. The class size is small and he engages with the students each class. Take this course if you have a desire to learn more than you would in typical class.",
        "course": "CSCFFS5140"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Simply the worst prof I have ever had at OSU! He doesn't use Carmen for grades, exams don't cover material from class, he is incredibly late on handing back quizzes/tests, he cancels class without telling you in advance and overall has no respect for students. Would avoid him at all cost!! Hopefully future students will check this website!!",
        "course": "CSCFFS4130"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "So incredibly difficult. He does not want to give away grades. I have worked my ass off for this class and I'm practically failing.",
        "course": "CFFS5140"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.3,
    "department": "Consumer Science",
    "firstName": "Caezilia",
    "id": "VGVhY2hlci0yNDMzNTU0",
    "lastName": "Loibl",
    "legacyId": 2433554,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Overall a great professor who actually cares about her students and is willing to go out of her way to help. ",
        "course": "CFFS3260"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "She's seems to be very caring but she disappeared for 1/4 of the semester and had random CFP's come to teach the class. I understand her wanting us to learn firsthand from them but there was no consistency to it and made it hard to stay motivated.Obviously my grade is nobody's fault but my own. However,I'm not a fan of how she delivers the content.",
        "course": "CFFS3260"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "My favorite professor at Ohio State, hands down. Took her 3260 course and ended up working for her for a semester too. She really cares a lot and is very willing to help you out in class and outside of class. Go to office hours if you need help. A lot of people take her the wrong way but she is very intelligent and caring.",
        "course": "CFFS3260"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I'm the girl who commented about her 2260 course. I got 95.85% in her 3260 course. It's very nice! I will do UGR with her next semester!",
        "course": "CSCFFS3260"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Loibl is such a leader in her field. Class was interesting and very relevant. She teaches us skills that are invaluable in our financial life. She truly cares about her students success and enjoys helping students learn. I Wouldnt say it's an easy A, but if you go to class and put forth the effort, it is manageable.",
        "course": "CSCFFS3260"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "She truly cares about you if she knows your name (she will if you attend class). You can skip two classes a semester and she drops the lowest homework or two also. She is a big believer in &quot;group exams&quot; so they're super easy. Definitely recommend.",
        "course": "CFFS3260"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Ms. Loibl is really nice and is easy to get in touch with regarding anything - even outside of class.",
        "course": "CFFS3260"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is good. Take her courses!",
        "course": "CSCFFS2260"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took her CSCFFS 2260 last semester and got an A with 97.77%. I did really well in this course, and also because of a lot of extra credit. I will take her CSCFFS 3260 next semester.",
        "course": "CSCFFS2260"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.2,
    "department": "Consumer Science",
    "firstName": "Deborah",
    "id": "VGVhY2hlci0xNDk0NDMw",
    "lastName": "Sharp",
    "legacyId": 1494430,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Made the class material easy to understand which made the overall experience much more enjoyable. Had a good chunk of extra credit opportunities, but didn't really need them if you did all of the material. Some questions on quizzes and exams would be a bit tricky at times, but overall pretty easy. All online, so could do at own pace.",
        "course": "CONSCI2910"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Sharps lectures were always very thorough, and you can easily ace the weekly quiz just by reading her PowerPoints. However, I dont recommend that because theres a lot of valuable information in the other assignments that you can apply to your life. The course is an easy A and builds on your life skills.",
        "course": "CONSCI2910"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved her class. I took the online course and it was awesome! Every Friday we had a quick activity and reflection to complete. On all activities she grants two attempts and all questions on attempts are the same. Very easy course and learned a lot! She is so sweet and so caring and gave out extra credit. I completely recommend this course!",
        "course": "CS2910"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Please avoid her at all costs. I had a miserable time during her class, and I heavily advise you to stay far away. Her class is set up so that the only thing you'll lose points for are small details that are irrelevant to the subject matter. She was very unhelpful during COVID19, and her decision making made me embarrassed to be a Buckeye.",
        "course": "CONSCI2910"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Weekly activity and reflection that takes maybe 20 minutes. Super lenient grader. There's one midterm and the final that are done online, you only get one attempt but it isn't difficult at all. I really never read any of the readings/watched the videos and was completely fine. This is a great class if you have a really heavy schedule.",
        "course": "CONSCI2910"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is pretty difficult if you don't spend adequate time studying her powerpoint. I got a bad grade because you need to spend several hours to master the content. Take this class at your own discretion, I Warned you.",
        "course": "CONSC2910"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is composed of 3 exams, weekly quizzes and discussions. One of the easiest classes you can take. I recommend the online class to everybody!",
        "course": "CONSCI2910"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Do the work and put in the effort  A",
        "course": "CSCFFS2990"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was done online and was very easy!  We only had a quiz almost every week, 3 exams, and 3 discussion posts.  I highly recommend this class for online only since it is a very easy A!  She seemed very nice and willing to help if you needed anything via email.  No textbook & power points were provided online.",
        "course": "CONSCI2910"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took the class online, super easy. She is a great professor and the learning opportunities are immense.",
        "course": "CONSCI2910"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class is entirely online and her lectures and articles she posts are actually pretty interesting. Should be an easy A nonetheless because everything you need to know on the exams are on the powerpoints and articles she posts.",
        "course": "CONSCI2910"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "I don't think I can say enough good things about Deborah Sharp. This is the third class that I have taken with her as my online instructor. OSU doesn't offer many online courses to their students and it's not easy for every instructor to engage their students but she does a fantastic job at doing so. OSU is lucky to have her!",
        "course": "CS2910"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ms. Sharp is one of the nicest professors I have ever had, 10 online quizzes worth 100 points where you can use your book. She gives guided notes and study guides for the exams, if you go to class you don't even need them, easy and interesting class I got an A with no effort.",
        "course": "CS340"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 1,
        "comment": "Online course. Super easy. You basically build a resume. The final is the only test and is 25 multiple choice questions. It's a mandatory class for CS majors and she basically expects next to nothing from you. Don't bother reading unless it's for an assignment. Need book. Accepts late assignments but will deduct a point or two.",
        "course": "CS595"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ms. Sharp helps every student whenever we need help. Although she did not take attendance, you should better to attend to get hint of exams, assignments and so on. I love her way of teaching since I remember what I done the class.",
        "course": "CS340"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.4,
    "department": "Consumer Science",
    "firstName": "Wendy",
    "id": "VGVhY2hlci0xNzQ5ODA2",
    "lastName": "Goldstein",
    "legacyId": 1749806,
    "numRatings": 45,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Wendy is a nice woman that means well. Her exams covered a few weeks of material at a time, and it was easy to miss details considering the exams often had irrelevant details. However, she is very kind and easy to work with. Projects are also relatively easy. Only complaint is the exams.",
        "course": "CSFRST2300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Goldstein is super sweet and definitely knows what she's talking about. Assignments aren't hard and you know about them way ahead of time. Take advantage of easy extra credit points, too!",
        "course": "CSFRST2300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved this class. Super laid-back gen ed that was fairly easy. You can get an A if you turn everything in on time and complete all the assignments. There's lots of extra credit that can help to raise your grade! Sometimes just busy work but overall, super manageable. ",
        "course": "CSFRST2374"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "I get GOOD grades + WASNT an easy A. Hours of lectures + readings + quizzes r very specific + difficult. If u arent a fashion major I dont recommend taking her class. (I heard other prof same class assigned 1/2 work), teacher + many TA's = near impossible to get ahold of all semester - v unresponsive, if you stress ab grades this is not for u! ",
        "course": "CSFRST2374"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy A, the weekly outline is easy to follow, with the same assignments due each week (1 discussion post ?, 2 discussion replies, lecture module quiz, mini-quizzes). Only slightly annoying this is having to pay for Packback and that she coughs in every video, which was recorded in 2016. Definitely recommend this class for an easy history GE. ",
        "course": "CSFRST2374"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "CSFRST 2347 is not a hard class to get an A in because there is so much extra credit, but the online version is formatted poorly. In the first couple weeks it was very confusing to manage all the different types of quizzes, but the content isn't that hard. I got a 71% on a quiz, emailed Prof. Goldstein 4 times to review it and she never got back.",
        "course": "CSFRST2374"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "this class has a lot, but its honestly extremely easy and i prob spent maybe 2 hours a week on it. if you watch the lectures & use the notes for your exams, you will get an A. theres so many extra credit opportunities too. start the final project ASAP!! & use the lectures to help you with the written portion. youll get a 100. great Professor!",
        "course": "CSFRST2374"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Taken as asynchronous SP21. Not an overly difficult class, but some weeks the lectures can be very time consuming. There are 4 exams, 10 quizzes, 3 big assignments, and weekly discussion posts. She tells you what is going to be on the exam and does a good job going over it in lectures. She gives a fair curve on exams and a ton of extra credit.",
        "course": "CSHSPMG2300"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "She gives a lot of quizzes and discussion posts for homework, but they are very easy, just time consuming. The final project is also time consuming but if you start it early its not bad at all. If you just watch the lectures once you can pass the quizzes no problem.",
        "course": "CSFRST2374"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class is so incredibly easy. Take it online I almost got 100% because of all the extra credit. For most of the semester, I had a 103% but it went down after the final project. The final project is definitely the toughest part about the course but take it online and you don't really need to watch the lectures.",
        "course": "CSFRST2374"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Goldstein did a good job despite having to teach an in-person class online. There is plenty of material to look over, and the projects are not too bad. I wasn't a huge fan of the online proctoring system.",
        "course": "CSFRS2373"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was super easy and required minimal studying for exams. Her lectures are interesting and she stays relevant with things happening in the world today!! There are only a couple projects that are pretty easy to get an A on.",
        "course": "CSFRST2300"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class is interesting with materials that are relevant to us  what people wear and how those fashion trends coming into being. If you put time into it, you will do well and learn a lot. The final historicism project is very interesting too.",
        "course": "CSFRST2374"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "Not a difficult class theres just a ton of work. That being said none of the assignments are very difficult, just annoying and somewhat pointless. The major drawback is that there are tons of spelling errors in slides, quizzes, and exams that make things difficult. Slides are also unnecessarily long and disorganized",
        "course": "CSFRST2374"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you wanna get an easy A in your GE history, don't hesitate to choose this class online. Even though someone might say there're lots of assignments, like quizzes, they are fairly easy and won't take you so much time. There're four exams, but all are easy and open-book. Tons of extra credit for you to get. Final project may take time, but not hard",
        "course": "CSFRST2374"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class is incredibly easy to do well in if you put in the work. There's a metric ton of work, especially in the first couple of weeks, but none of it is very difficult. All exams are open notes. There is a lot of extra credit, and many of the grades are participation grades. Never opened the required books really, just watched the lectures.",
        "course": "CSFRST2374"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took this class online and it was pretty easy. Tests and quizzes are open note and not too difficult.",
        "course": "CSFRST2374"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class was super disorganized and difficult to get through. Typos in every quiz and assignments taking forever to be graded. Getting an email back was basically impossible, and due dates always being changed around. Maybe this class would be a lot better not online. The textbook was barely used.",
        "course": "CSFRST2300"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 2,
        "comment": "For a summer online class, there is too much things we have to participants with. The course should be considered as an easy A since I just did what is in the carmen assignment and nothing else. It just the quantities of assignment are too much.",
        "course": "CSFRST2374"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 4,
        "comment": "The lectures are painfully long but because of this, I didn't need the book. Exams are very time consuming with open notes, but a majority of the time stuff cannot be found within them. Tons of extra credit opportunities. If you keep up on assignments the class is totally doable.",
        "course": "CSFRST2374"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "Overall, this class is very interesting to learn about our history and fashion icons; Wendy seems to know a lot. There is SO MUCH WORK and time that you need to put in each week; lectures are pretty long and confusing. Open note exams is nice, but too much material (disorg). I thought this would be a fun GE for the summer but it is a lot of work.",
        "course": "CSFRST2373"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "Do not take the History of Fashion in the 20th Century class. Lectures are completely disorganized and exceedingly difficult to follow. They're also unnecessarily long. I took the online class and there was a ridiculous amount of work involved. Exams are open notes, but your notes are text-book length because the course is so disorganized.",
        "course": "CSFRST2374"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "WHATEVER YOU DO DO NOT TAKE THIS CLASS!!!!! I was looking for an easy GenEd and I found a class with a lot of busy work. Wendy is cool and all but her exams are challenging and there is a lot of work exam week. AGAIN DO NOT TAKE THIS CLASS it was more work than my engineering classes do not do it to yourself.",
        "course": "CSFRST2374"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wendys got a heart of gold. Shes sometimes disorganized and a little spacey but shes such a nice person. She has a lot of experience in the fashion world and if you really take an interest in the class, you will enjoy it. I got to know her pretty well and at the end of the semester she rounded my 91% to a 93% without me asking.",
        "course": "CSFRST2374"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 2,
        "comment": "Super easy class and Wendy is a good professor. You don't have to read any of the required readings, I would just keep up with the lecture videos every week. Packback is an important part of this class and you can get a lot of extra credit from it.",
        "course": "CSFRST2374"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "Took for an easy GE, but ended up not that easy. Can be doable if you have to dedicate to this class. Quiz &amp; discussion each week are easy, but exams asked detailed questions you have to listen to every lecture &amp; video to know. Open book/note but proctored. Lots of EC--do it. Do not take if you want a blow off class.",
        "course": "CSFRST2374"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you want to take this class as an easy GE, TAKE IT ONLINE! Easiest class ever! Four OPEN NOTE exams and one final project that requires MINIMAL effort to get a 100%. Lectures she posts are interesting (if you care to watch them, increase 2x speed) but NOT REQUIRED to get an A in the class. Enough extra credit ops to raise by a letter grade.",
        "course": "CSFRST2374"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor is passionate about what she does with that being said, she has a lot to say. My class was taken online so her lectures were like hour long videos. There are two books required and she makes you visit 2 exhibits but you have a good amount of time to visit. Wish i had more time to give to this class.",
        "course": "CSFRST2374"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 2,
        "comment": "I was really excited for this 20th century fashion class and I am DISAPPOINTED. Lectures are basically read of 100+ slide power point that looks like it was made by a middle schooler. Wendy's voice is very boring and the class would be interesting with a different professor. She also does not use correct grammar while talking which is irritating!",
        "course": "CSFRST2374"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 4,
        "comment": "My experience with Dr. Goldstein has not been pleasant. I took this class for an easy GE, but it has turned out to be more difficult than it needs to be. Exams ask extremely detailed questions and not the important concepts. Dr. Goldstein is also very bad at communication; on several occasions I have e-mailed her questions and she doesn't respond.",
        "course": "CSFRST2374"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "She gives so much extra credit! If you take her online section, you should speed up the lectures because she does speak a little slow. She is really willing to work with you if you need help on anything. This is an Easy A class and I would recommend taking it online rather than in person! None of the exams are cumulative! MAKE SURE TO TAKE NOTES!",
        "course": "CSFRST2374"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "For anyone who wants an EASY GE don't take. Otherwise, the class itself is very interesting and the prof seems super knowledgeable about the topic. Both textbooks will be read all the way through and the tests are open-note but still pretty difficult. There is a lot of weekly work&amp; lectures can drag on. There is some extra credit offered throughout",
        "course": "CSFRST2374"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 5,
        "comment": "She was literally the hardest professor I've ever taken. I took fashion history for an easy GE and barely got by with a B. I took notes in every single lecture, brought my notes along with printed out powerpoints and the books to the exam and never got higher than a 72%. She test on irrelevant things that she brings up in class for 5 seconds.",
        "course": "CSFRST2374"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 4,
        "comment": "Many people in the past had said that this would be a very easy history GE, bit it is not! All she does in her lectures is talks about the pictures on her slides and then before the exams she gives you a study guide and barely any of it is on the test and then she will ask you questions about things that are not on any notes or talked about. AWFUL!",
        "course": "CSFRST2374"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 2,
        "comment": "Most of the video lectures are over an hour long, repetitive, & very dry. Her syllabus does NOT match up with Carmen assignments. She randomly put 1-2 mini quizzes up every week. If you do not check Carmen 1-2 days, you easily miss out on points. The group project was not explained clearly & is not well organized.",
        "course": "CSFRST2374"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 4,
        "comment": "The tests are extremely specific and taken online but in the testing center. They are open note but sometimes that isn't even enough help. The lectures sometimes turn into random pictures of clothes and little rants but she is overall a very nice lady. If you need to contact her, stay after class instead of emailing",
        "course": "CSFRST2374"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 3,
        "comment": "The class overall is easy for a history GE, however the tests are very specific and somewhat challenging. Professor Goldstein was very bad about getting back to me via email. It took her three weeks to reply to one email. Overall, it is an easy GE but can be very frustrating at times.",
        "course": "CSFRST2374"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 2,
        "comment": "She required clickers but  we used them maybe 10 times over the semester. Then, at the end of the semester she got my friend and my grade wrong. Her lectures are long and boring if you don't live and breathe fashion (I took it as an easy GE). She's technologically inept and is horrible at responding to emails. I wouldn't reccomend. ",
        "course": "2374"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 1,
        "comment": "Wendy is very interested in her subject and knows a lot, but the powerpoints are so long and monotonous, it's so hard to sit through an entire lecture. Otherwise, it's a pretty easy class to pass; all exams are online and open note. Easy if you just need a history GE.",
        "course": "CSFRST2374"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy classes finish reading means good grade nice prof and willing to help with anything you need.",
        "course": "CSFRST2373"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy & fun class. Exams are open note, 1.2 hours long, multiple choice, with bonus. Plenty of extra credit in the course as well. Notes and lecture tell you everything you need to know. I didn't even have to open the books all semester. If you're looking for a laid-back GE history course, this is the one.",
        "course": "CSFRST2374"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was an excellent professor! She communicated the information very clearly and wanted everyone achieve. She also offered extra credit.",
        "course": "CSFRST2373"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wendy Goldstein has a lot of experience in the fashion industry which is apparent while she is lecturing. Attendance not mandatory and powerpoints can get boring but not a hard class at all. She's funny and passionate about fashion which helps. Group project is easy and all exams are MC with extra credit questions.",
        "course": "CSFRS2373"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wendy Goldstein has a lot of experience to share. Powerpoints are to the point, but she adds a lot of personal stories which lets me learn from the lectures.",
        "course": "FRS2373"
      },
      {
        "index": 45,
        "rating": 1,
        "difficulty": 2,
        "comment": "Get the textbook.  The midterms are MC, with a lot out of the book.  Pretty easy with a group project that is easy.  She is not a very good lecturer but class is easy.  Class isnt mandatory.  The class though has very little to do with the business side.  It is all about fashion/textiles.",
        "course": "CSFRS2373"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4.3,
    "department": "Consumer Science",
    "firstName": "Robert",
    "id": "VGVhY2hlci0yNjEzMDUw",
    "lastName": "LaTour",
    "legacyId": 2613050,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Rob for both Software 2 and Systems 1 and he was one of the best professors I have ever had. He made learning the content so fun and was very down to earth about everything. Tests were always hard but homework's never were; he really makes sure you know your stuff and is super passionate about what he does.",
        "course": "CSE2421"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great at teaching and is genuinely hilarious. We had a ton of content in this class so it got really hard at a certain point but the exams were very fair. They're worth a ton so you're screwed if you don't do well on em, but if you pay attention in class, go to office hours, do the labs and put some time outside of school, you'll do fine.",
        "course": "CSE2421"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Robert is a double edged sword. He's very good at explaining concepts, but often has large classes so your work is graded by a TA where you get no feedback. He's against the concept of Study Guides, so if you wish to rely on one for midterms, avoid him. He's very understand tho, so you can set up accommodations if you just talk to him.",
        "course": "CSE2231"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Robert is a young professor so he's very easy to get along with and relate to. To be fair, I haven't finished his class yet but he's one of the best instructors I've had already. He is very patient in his lectures and will stop to explain anything if necessary. He explains everything about computers VERY well even if someone has no knowledge.",
        "course": "CSE2421"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.4,
    "department": "Consumer Science",
    "firstName": "Robert",
    "id": "VGVhY2hlci0xNDYzNTE2",
    "lastName": "Scharff",
    "legacyId": 1463516,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Took CSCFFS 5130. Attendance mandatory and only ec is end of semester paper, and participation in class. Very exam heavy, 4 exams total, drops the lowest one. Exams are hard to prepare for, as he only releases the study guide a few days before. With study guide filled out, usually over 12 or more pages of content for just one exam. ",
        "course": "CFFS443"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Relatively easy. Attendance is only somewhat important but going to class definitely helps you understand as there is no textbook.",
        "course": "CS2910"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Gives great extra credit in exams. Does allow some classes to be missed for any reason but does take attendance. Lectures are interesting and in a format which is easy to understand. However, it can be easy to zone out during lectures.",
        "course": "CONSCI2910"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lots of real life examples made this interesting",
        "course": "3930"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "I was .46 away from receiving a B in the class and he would not round me up. 4 exams, drops the lowest one, final is cumulative.",
        "course": "CONSCI3930"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very helpful and a super nice guy.",
        "course": "CFFS443"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "No book needed. 3 exams. No homework. EC given at the end. SUPER CONFUSING GUY.",
        "course": "CFFS443"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "had to sign in at 10 lectures to receive all 50 participation points",
        "course": "CSCFM443"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 1.4,
    "department": "Consumer Science",
    "firstName": "Congrong",
    "id": "VGVhY2hlci0yMzU2OTY3",
    "lastName": "Ouyang",
    "legacyId": 2356967,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "HORRIBLE & TERRIBLE. How did she earn her Ph.D.? with that English and communication skills? No way. Guess everyone can get Ph.D.? ",
        "course": "CSCFFS4260"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Just dont. You cant understand her, she wont even look at your late work, she wont reply to you if you are emailing out of concern, there are at least 50 assignments all jumbled in canvas. Just do not do it.",
        "course": "CADS3700"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Can't understand what she says",
        "course": "CSCFFS4260"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "There are a lot of slides she goes through in each lecture. It is hard to differentiate what information is important. Quizzes are very difficult. Exams are curved.",
        "course": "CSCFFS4260"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "I believe this was her first time teaching this class. She post power points to the lectures after class, some of them won't really make sense to you if you miss class. Case studies are done in class with assigned groups. Quizzes are online. 1pg cheat sheet to midterm and 2pg to final but they won help if you don't understand material.",
        "course": "CSCFFS4260"
      }
    ],
    "SEI": []
  }
]