[
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Criminal Justice",
    "firstName": "Mary",
    "lastName": "Reiter",
    "legacyId": 2593158,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "I took Professor Reiter's SOCIOL 2380, but it was not an option on the dropdown. I love Mary! She is such a sweet and amazing person and teacher. She creates a welcoming classroom environment and is a great lecturer. I also took her Law and Society class at CSCC and loved it as well. I recommend taking any of her classes."
      },
      {
        "index": 1,
        "rating": "4.0",
        "comment": "She is very passionate about the subject matter and her students. Not only does she portray this though her passionate and well planned lectures, but her care for students. There is an air of mutual respect in the class room, making for a great learning environment."
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 2.3,
    "department": "Criminal Justice",
    "firstName": "Kevin",
    "id": "VGVhY2hlci0yNTI0MzY2",
    "lastName": "Freeman",
    "legacyId": 2524366,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Was not in a course with Mr. Freeman, however, did a pre-law advising appointment with him. He was 15 minutes late and then trashed me the entire time telling me I would not make it in any law school. I just made it into law school with a huge scholarship and have talked to others that were discouraged by Mr. Freeman. Should never be an advisor.",
        "course": "ARTSCI1120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not all the Kevin slander. Kevin's a great guy and his class is super easy.",
        "course": "ARTSCI1120"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Kevin managed to spend the whole semester lecturing and the only thing I actually learned from the class was the difference between disinformation and malformation. Almost nothing in the class is relevant in the real world and is taught in the least efficient, most boring way possible.",
        "course": "ARTSSCI1120"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Interesting person, he cares about his students but the class was honestly worthless. Group project that had little guidance and no one wanted to work on.",
        "course": "ARTSCI1120"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Kevin Freeman and his class gave me nothing worth using in the real world. he went on and on about the oxford comma and other meaningless anecdotes about his own personal experiences which don't ever include practicing law. organizes the class sloppily and the cohort project doesn't relate to the scholar group focus. waste of time and intellect.",
        "course": "ARTSSCI1120"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 2,
        "comment": "Kevin is an absolute pain to deal with. No matter what it is, he will always find the least efficient way to accomplish the task. His course content is completely irrelevant and a complete waste of time. He managed to somehow waste an entire class expressing his love for the Oxford comma. Really hard person to get along with overall. Stay away.",
        "course": "ARTSSCI1120"
      }
    ],
    "SEI": []
  }
]