[
  {
    "avgDifficulty": 2.8,
    "avgRating": 5,
    "department": "Cultural Studies",
    "firstName": "Raphael",
    "id": "VGVhY2hlci0yMjg3MzY0",
    "lastName": "Palermo",
    "legacyId": 2287364,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hands down one of the best professors I have ever had. He was very genuine and allowed the class to be open and honest about real topics. I enjoyed the movies we watched just be prepared to do some reading. 7 discussion posts, 1 screening report, 2 short essays (3-4 pgs) and his feedback is great! I would highly recommend any class with him! 10/10",
        "course": "SPANISH2380"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Raphael was a great professor academically and personally! He genuinely cared and always started class with a hilarious story. 10/10 recommend and would take another class with him!!!!",
        "course": "SPAN2380"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Raphael is the BEST professor I have had at OSU! He's super nice, funny, smart, and really cares for his students, and went wayyy above and beyond what can be expected of a professor just for us. Intro to Brazilian Culture was a blast, took for a GE knowing next to nothing, learned a ton, and now I can't wait until the day I get to visit Brazil!",
        "course": "PORTGSE2330"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Favorite class I have ever taken at OSU. 2 short papers, 1 long paper instead of a final exam. Simple readings for every class and a few online discussions. Hilarious dude who really knows his stuff. I took Intro to Brazilian culture and now I want to visit Brazil. This class counted as a global studies GE.",
        "course": "PORTGSE2330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 2,
    "department": "Cultural Studies",
    "firstName": "Kashif",
    "id": "VGVhY2hlci0yODg5NzU1",
    "lastName": "Dennis",
    "legacyId": 2889755,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "Took this class to fill a gen ed credit, now I have more reading and writing assignments per week than I have in my entire life. Must have camera on at all times (zoom class) and cannot be in bed. Calls on people randomly. Reading is very complex and you can succeed in this class if you can comprehend it, but does not actually teach the material.",
        "course": "2230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Cultural Studies",
    "firstName": "Keith",
    "id": "VGVhY2hlci0xODEwMzc4",
    "lastName": "Padgett",
    "legacyId": 1810378,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Keith is a really nice, cool teacher. He's very kind and cares a lot about his students. He teaches with a \"flipped classroom model,\" so all of the work (3 online question submissions per week and MINOR reading) is done outside of class and you just have discussions during class. There's a group project. I learned a lot from him and this class.",
        "course": "ESCFE3206"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good teacher. There's  a lot of reading in the class (3 books and many articles) but there is plenty of discussion so you understand everything. I recommend taking this professor. He also makes cake on the last day of class :)",
        "course": "HDFS3206"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Cultural Studies",
    "firstName": "Felisha",
    "id": "VGVhY2hlci0yMTA4OTg4",
    "lastName": "Younkin",
    "legacyId": 2108988,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not a fan of this professor. She assigns busy work, and expects us to write so much for something that could be summed up in a few sentences. Then there is a project that is only available to PC users, in my opinion this is very outdated considering most people now us a MAC. So where would we get this PC? She needs to update and get with the times.",
        "course": "HDFS2200"
      }
    ],
    "SEI": []
  }
]