[
  {
    "avgDifficulty": 3,
    "avgRating": 2.3,
    "department": "Design",
    "firstName": "Sapna",
    "lastName": "Singh",
    "legacyId": 2344692,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Tough class."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "shes the goat"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Sapna Singh is a Design Professor at The Ohio State University. To start, participation/attendance is mandatory and she is extremely difficult to understand and learn from. She is very rude when dealing with problems that occur inside or outside of the classroom. Her lectures are very boring and haven't been updated since 2007. Be cautious with her"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Design",
    "firstName": "Liz",
    "lastName": "Hejny",
    "legacyId": 3047146,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Very knowledgable and helpful! Provides great feedback and is generally accessible outside of class for any issues. If you're reading this the class is probably required for you anyway but you'll have a good time!"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Design",
    "firstName": "Camille",
    "id": "VGVhY2hlci0zMDg1MTkx",
    "lastName": "Snyder",
    "legacyId": 3085191,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Super great, gives helpful feedback, and is very clear about project expectations. The class can be heavy but she is very gracious with classwork time and extensions if needed. Overall, I would take it again. ",
        "course": "2330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.3,
    "department": "Design",
    "firstName": "Sapna",
    "id": "VGVhY2hlci0yMzQ0Njky",
    "lastName": "Singh",
    "legacyId": 2344692,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Tough class.",
        "course": "DESIGN3105"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "shes the goat ",
        "course": "DESIGN3105"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Sapna Singh is a Design Professor at The Ohio State University. To start, participation/attendance is mandatory and she is extremely difficult to understand and learn from. She is very rude when dealing with problems that occur inside or outside of the classroom. Her lectures are very boring and haven't been updated since 2007. Be cautious with her",
        "course": "DESIGN3105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.4,
    "department": "Design",
    "firstName": "Adam",
    "id": "VGVhY2hlci0yMzI2NzYy",
    "lastName": "Fromme",
    "legacyId": 2326762,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "This guy is GOATED. Very nice guy. Class is a little weird but it's a little fun.",
        "course": "DESIGN3505"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Fromme was good. His class is kinda homework heavy, especially doing the actual designs but you have so much time to get stuff done and the grading criteria is clear. He has structured it so all the homework you do is used in the final project so stay on top of the assignments. It's easy to get behind. ",
        "course": "DESIGN3505"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took 3105 this semester. Adam has great insight into the material he teaches and always seemed invested in describing it to us. His verbal feedback is very detailed, but there were times where posted material wouldn't cover some crucial details. Despite this, the class was very engaging without weighing in on my stress.",
        "course": "DESIGN3505"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Fromme is a bit disorganized with the content and sometimes posted it quite late, sometimes right before class. However, he is very flexible with deadlines if you email him and the content he teaches is engaging. If you take this class put effort into your designs and most of all go to his office hours! He gives great feedback and advice.",
        "course": "DESIGN3505"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was easy. You have to put in the work and he will give you an A. You must go to class. He is extremely unorganized and it is frustrating at times because you don't know what the grading criteria is for projects. Final exam is all short answer. Sometimes doesn't email back when you ask questions. But he brings donuts to class so...",
        "course": "DESIGN3505"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 3.2,
    "department": "Design",
    "firstName": "Madison",
    "id": "VGVhY2hlci0yNjY5NDY1",
    "lastName": "Sabatelli",
    "legacyId": 2669465,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "There is about a 45-minute lecture and little work otherwise.  Each week takes about 1-2 hours which is great for a fully online 3 credit class.  The class is easy and there is extra credit.  Some of the topics are interesting, so if you put the lectures at 1.5x speed, it'll be a good class either for the minor or GE.",
        "course": "DESIGN2700"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Inconsiderate and ignored emails  ",
        "course": "DESIGN2700"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "A very easy course, that doesn't contain much practical information. The lectures were pretty long for the messages they were trying to get across, and I usually would just go through the slides quickly on my own. Not very much work in the course, with weekly quizzes and only two essays, so I would recommend if you need easy credit. ",
        "course": "DESIGN2700"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Extremely manageable course. Madison is understanding and flexible. Coursework consists of a weekly quiz or discussion post and 2 larger assignments (essays around 1500-2000 words). Interesting and useful content.",
        "course": "DESIGN2700"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class as a part of the Entrepreneurship and Innovation minor, and found it surprisingly enjoyable despite not being my particular field of interest because the class also focuses on designing students future career paths. The class has 2 lectures, a mini quiz, and a discussion post per week, and two papers throughout the class.",
        "course": "DESIGN2700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Design",
    "firstName": "Liz",
    "id": "VGVhY2hlci0zMDQ3MTQ2",
    "lastName": "Hejny",
    "legacyId": 3047146,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very knowledgable and helpful! Provides great feedback and is generally accessible outside of class for any issues. If you're reading this the class is probably required for you anyway but you'll have a good time!",
        "course": "DESIGN3403"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "Design",
    "firstName": "Taylor",
    "id": "VGVhY2hlci0yOTUzNjIx",
    "lastName": "Olsen",
    "legacyId": 2953621,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Taylor is truly one of the best professors I've had so far. He cares about each one of his students and will take the time to sit down with you and give suggestions about how you could take your work up to the next level. I would definitely recommend taking his for foundations!!",
        "course": "DSGN2310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Taylor is truly the best professor I have had. He helped me significantly through projects and course work. It is definitely a relaxed studio environment, that allowed for a lot of personal work time. He is very kind and definitely helped me in working toward getting accepted to my major after design foundations.",
        "course": "DSGN2310"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Such a nice person and super funny, but unfortunately I didn't feel like I learned as much as I did from other design profs. He's so chill that it makes it difficult to take anything too seriously, which isn't a great mindset to have when getting ready for a foundations portfolio. I would still recommend him, just know it'll be insanely relaxed.",
        "course": "DSGN2310"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Taylor created a super relaxed but focused environment in his class. I really appreciated how much work time we got, and his instructions were very clear. The three projects were not super hard, and using Taylor's feedback you should be able to create a good project with a good grade. ",
        "course": "DSGN2310"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Taylor is a great instructor. He is very caring and understanding of each student's strong and weak points in design. The course itself is manageable for a major course. There are 3 \"Modules\" throughout the semester, which are all individual projects with design exercises incorporated. I always looked forward to his course.",
        "course": "DSGN2310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Design",
    "firstName": "Mary",
    "id": "VGVhY2hlci0yNzM3OTIw",
    "lastName": "Beecher",
    "legacyId": 2737920,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mary was great. I never really had to reach her outside of class. All the homework was given like 3 weeks in advance so you had plenty of time to complete it. It was just 5 quizzes per module and then one paper here and there. You know your workload and it really isn't a lot if you work on it once a week.",
        "course": "2750"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.4,
    "department": "Design",
    "firstName": "Emily",
    "id": "VGVhY2hlci0yNDYzNzU2",
    "lastName": "Valentine",
    "legacyId": 2463756,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Save yourself and try to get another design professor definitely the worst professor I've ever had!",
        "course": "DESIGN2310"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Confusing feedback. Grades fair if you are a 2nd or 3rd year student, I do NOT recommend her for foundations courses unless you already have design experience. Nice, but you HAVE to talk to her frequently and have extensive details on your process post to get a good grade( its not extensive, but for someone from a technical major it feels like it).",
        "course": "DESIGN2310"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Emily's grading is pretty tough but she is very helpful IF YOU ASK FOR IT. Feedback can sometimes be confusing from her but she has proven very caring and helpful if you ask to meet with her.",
        "course": "DES2130"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "I am a junior and she is definitely my least favorite professor I have had. She does not value creativity and grades very inaccurately. Her personal artwork is very poor so I think it is just a reflection of how she views others art. I would highly recommend taking Zach Winegard's design instead. He teaches the same course and totally ROCKS!!",
        "course": "DESIGN2310"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Emily can be unwavering, but she teaches design well and responds to emails quickly.",
        "course": "DES2130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 1,
    "department": "Design",
    "firstName": "Yvette",
    "id": "VGVhY2hlci0yNjU5Mjcz",
    "lastName": "Shen",
    "legacyId": 2659273,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Lectures are just reading slides and assignments have little instruction and no rubric, no reasoning behind grades. ",
        "course": "DESIGN5505"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "6 hours a week mandatory attendance for only 3 credits hours. Not very helpful feedback. Not a clear direction.",
        "course": "DESIGN5505"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "She doesnt give good directions on assignment descriptions so you wont know how to complete them without asking and she doesnt respond to emails. When she does respond, she is unhelpful and just tells you to read the assignment again. On projects when she grades you she brings up things that you never discussed when you met for feedback.",
        "course": "DESIGN5505"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Design",
    "firstName": "Kyoung",
    "id": "VGVhY2hlci0yNDI2MTQw",
    "lastName": "Swearingen",
    "legacyId": 2426140,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She really inspires students to be better and creative. She is humble even if she has an amazing profile. ",
        "course": "ACCAD5002"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's amazing!",
        "course": "ACCAD5002"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Prof. Swearingen has an impressive background in production animation, her experience is apparent. However, this does not always transfer to her ability as an instructor. In-class help is light, forcing students to teach themselves through tutorials or trial/error. The class is also one big project, so there are no grades. Fairly unorganized course",
        "course": "ACCAD5002"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 1.2,
    "department": "Design",
    "firstName": "Susana",
    "id": "VGVhY2hlci0yMzI0OTMy",
    "lastName": "La Luz Hawkins",
    "legacyId": 2324932,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "The worst professor I've ever had (and it's not even close). She refuses to actually answer questions. Split the class into 15-18-person groups and didn't follow up on if it was working. Unclear on directions and expectations. Very condescending both in person and over email. Other Professors were shocked at how poorly run this class was.",
        "course": "DESIGN3200"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "I've never had an instructor care less about her students. Susana was unclear on directions and when students. would ask for clarification she was very rude to them. I hope OSU finds someone else to teach this class",
        "course": "D3200"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Susana hasnt showed up to more than 6 classes this semester because she was on vacation. Telling you that you need to change your perspective if you are wanting an A in the class. She thinks that a C is a good grade cause you learned something. Its not like shes ever there to tell you otherwise and she doesnt give any rubrics. Gaslit always.",
        "course": "D3200"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Professor skipped class frequently. Harsh grader sometimes and absolutely terrible descriptions for assignments given. Expect constant confusion in Susannas class with a complete lack of help or explanation. She is never available outside of class for help either. Overall the worst professor Ive ever had, though passing the class is not difficult",
        "course": "DSN3200"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Inconsiderate. Does not put in the effort to teach. Any misunderstandings are your fault and she refuses to take blame for anything. Despite more than half of the class not understanding. Do not take any of her classes if you can. If you must, may God be with you and your sanity.",
        "course": "D3200"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "While she was knowledgable about research, class was cancelled constantly and the first half of the class was graded solely on completion while the second half was graded extremely meticulously. Assignment sheets and expectations weren't clear at all and all the grades except one are entirely dependent on what your group members do and don't do.",
        "course": "DESIGN3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.8,
    "department": "Design",
    "firstName": "Noel",
    "id": "VGVhY2hlci0xMzUzOTQ=",
    "lastName": "Mayo",
    "legacyId": 135394,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Legacy. Being the first Black Industrial Designer to receive a degree in the United States & his work w Lutron Co. are, as professional achievements goes, quite commendable. Unfortunately, the legacy of his teaching is of someone who used his position & status to willfully create ambiguous and unattainable expectations for his student so they fail.",
        "course": "DSGN656"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "without a doubt the worst professor i've ever had. he was stubborn, outdated, horribly unorganized, and would go on random conspiratorial tangents.",
        "course": "4750"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good teacher, but very set in his ways of thinking. Makes you really go the extra mile for an A, which is difficult at times but you will produce a lot more material because of it! A little too stubborn sometimes, though, doesn't like too much &quot;out of the box&quot; thinking.",
        "course": "DSGN252"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "He spends the entire class talking about himself and his company lutron, does not follow the syllabus, and is completely inconsistent at critiques.  He also gave me my first and only C in 4 years (and I graduated ****laude) and would not offer an explanation when I questioned him.",
        "course": "DSGN656"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Noel Mayo is the best instructor I have ever had. As people have stated before, he makes you work, he makes you think for yourself and I feel that I am a much better person because of his influence.",
        "course": "DESIGN"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "Tough professor but a great person. Have to work VERY hard for his classes.",
        "course": "199"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "STUDIOS"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "intermitten &quot;teacher&quot;. many valid points, and an intilectual man, but also very stubborn and stuck in his ways. has a factor of intimidation.",
        "course": "DESIGN"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very approachable and friendly however he isnt just going to hand it to you on a plate. You have to work for everything and not slack off. Very intelligent and loves to see you are doing more than the majority of students.",
        "course": "199"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "199"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Design",
    "firstName": "Zach",
    "id": "VGVhY2hlci0yNjg0MDgx",
    "lastName": "Winegardner",
    "legacyId": 2684081,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Zach is extremely personable and helpful in his feedback--perfect for students just starting in design. He's quirky but super fun to be in class with and explains everything clearly and thoroughly! Loved taking his class.",
        "course": "DESIGN3105"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "New and young professor. Sometimes he is unorganized and his presentations are long but he is a very good professor.",
        "course": "DESIGN3105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3,
    "department": "Design",
    "firstName": "Nancy",
    "id": "VGVhY2hlci02NzA3NTU=",
    "lastName": "Rudd",
    "legacyId": 670755,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "A very nice professor who gives clear, helpful feedback, and is usually not a tough grader as long as you are putting in obvious effort. Participation was a large part of this course. Gives interesting and interactional lectures. Also really caring. Not many complaints, if any at all. ",
        "course": "ARTSS137"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "I think her teachings in textiles and clothing field is outdated and it did not have edge of designs like design major, but not science oriented like real chemical engineering major and not business oriented like true business major. This makes this study under her very mediocre at best.",
        "course": "TXTL372"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "she is good. but her ppt are extremely bad. she always lets TA to teach but they seldom teach us something useful. They all just read the ppt and don't give us any explanation about the academic terms. I never recommend her class.",
        "course": "CSFRST2372"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "The TA's would get to lecture sometimes. Rudd was cool and provides many personal examples to help explain content. Participation is encouraged and we have some interesting discussions in class. Text book not needed just take notes in manual. Interesting class, make sure you go and assignments were easy. Final project not to hard. Open note exams.",
        "course": "CSFRST2372"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Midterm makes up most of your grade!!!",
        "course": "CSFRST2372"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was very interesting and was an easy A. All the tests are open-note and the projects and worksheets are by far manageable and almost fun to do. Professor seemed to care a lot about the subject and the TA's were very involved and helpful",
        "course": "CSFRST2372"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "She's alright, it's an easy class so if you show up and take notes on your manual there's no way you could fail. Open note midterms and quizzes. One major project but it's about personal identity so it's super easy. She is not very engaged as she is gone often times and has her TA's take over. They all come off as stuck up but they're alright",
        "course": "CSFRST2372"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is very intelligent but is also very pretentious. As long as you go to class, you should get an A, this was literally the easiest class I have ever taken. She also offers a lot of extra credit and her TAs are very gracious when grading.",
        "course": "CSFRST2372"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "All of her exams are open note (thank you Nancy) so if you can't pass you probably shouldn't be in college. Go to class and take notes on the lectures, she takes attendance but it's honestly pretty interesting. 1 easily graded project, 10/10 recommend taking as a GE course & GPA booster",
        "course": "CSFRST2372"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Honestly was kind of rude, and talked about herself a lot. I didn't have a very good impression of her. Wasn't a hard class. You are able to use your notes on the tests, but I would still look over them before because it's a lot of information to know.",
        "course": "CSFRST2372"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class material is super easy but something about Dr. Rudd rubbed me the wrong way. She always acted like she had somewhere better to be, and spends a lot of time bragging about her accomplishments. Tests are  easy though, and there are several extra credit opportunities. She has no personal style but is somehow the head of the design dep't",
        "course": "CSFRST2372"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "One of the worst classes I have taken at OSU. The course was extremely disorganized. Rudd also needs to get off her high horse. She is extremely rude and arrogant. ",
        "course": "CSFRST2372"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class at OSU. All tests are open note. You can use anything except a computer. Just take notes in class and you will get a 100% on tests. One easy solo project. One group project that they grade easy. Class is mandatory. Lots of Extra Credit",
        "course": "CFRS2372"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Open note mid-term and final, material covered in class is easy, but she puts detailed questions on the exams. She curved the whole class because she wants everyone to succeed! I love Nancy Rudd and am looking forward to taking more fashion classes with her.",
        "course": "CSFS372"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Likes to flaunt that she's in charge, is very blunt and sometimes harsh. However, she's very knowledgable. Helped me whenever I asked.",
        "course": "FPA590"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took her freshman seminar class, a look in the mirror. It was extremely boring, but it was a very easy A. Definite grade booster. It only meets once a week, so you're not wasting a lot of time. Rudd's really easy to please.",
        "course": "ARTSC137"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 2,
        "comment": "The class and all the material is so easy, just don't expect to connect with her. In fact, avoid her all together if you can. Turn in your work and run away. She seems to be on a power high and could use some public relations skills. Its surprising because she seems pleasant when she teaches. Expect her to play favorites as well",
        "course": "FRS372"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 1,
        "comment": "Freshman Seminar Class- A Look in the Mirror: Body Image and Wellness, was a great class. Very easy A if you attend class and do the assignments. Classes are two hours and extremely boring but attendence is mandatory so go but if you're tired, napping won't hurt!",
        "course": "ARTSS137"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is clearly NOT helpful at all, acts like a sourpuss, and seems to dislike everyone that doesn't suck up to her.",
        "course": "TC670"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 3,
        "comment": ":(",
        "course": "TCALL"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "TCALL"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class series (3 quarters) is the best program you can take to prepare yourself for a career in product design.  Dr. Rudd is an amazing representative of the textiles department and has proved to be a great professor.  This program is all based on your own effort and dedication therefore it requires your full attention....I loved it!",
        "course": "CADPROGRAM"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "A great professor with a huge heart!  :)",
        "course": "TC372"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "dr. rudd is an incredibly caring person (if you are on her good side).  /he has gone out of her way to help students by letting them work (in the real world) as well as do their class work on their spare time.  She is great if she likes you! KEEP ON HER GOOD SIDE",
        "course": "NETHINGCADETC"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 2,
        "comment": "Easy and interesting class, not sure about the Star Trek subculture...but nonetheless an easy A.",
        "course": "TC372"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "TXTL372"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "Identity of dress",
        "course": "TXTLCLO372"
      }
    ],
    "SEI": []
  }
]