[
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.7,
    "department": "East Asian Lang.  Literature",
    "firstName": "Donglin",
    "id": "VGVhY2hlci0yMTY5ODUw",
    "lastName": "Chai",
    "legacyId": 2169850,
    "numRatings": 3,
    "summary_comment": "Professor Chai is highly regarded for her clear, fair, and professional teaching approach, with well-planned lessons that focus on student growth. She provides valuable, concrete feedback and is known for her dedication and willingness to assist both inside and outside of class. Additionally, she inspires creativity in lesson planning and effectively guides student teachers.",
    "summary_comment_short": "Professor Chai is highly regarded for her clear, fair, and professional teaching approach, with well-structured lessons and a strong focus on student growth. She is also known for her willingness to provide additional support outside of class and for inspiring creativity in lesson planning.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Chai Laoshi is a fabulous Chinese teacher, assuming you like your language teachers to be clear, fair, attentive, firm, and extremely professional. No boundary issues and no surprises with Chai Laoshi. She has well-thought out, well-planned lessons, and she obviously cares a lot about student growth.",
        "course": "CHIN4101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Ms. Chai was a very helpful instructor. She was friendly and passionate about Chinese pedagogy. She gave concrete feedback on students' performance. She was also willing to give assistance outside of class.",
        "course": "EA411"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ms. Chai is an excellent Chinese Teaching educator. She always demonstrates clear teaching models to students. Her feedback to students written and oral gives students a push, and she spends extra time assisting student teachers when needed. She led and inspired us to design lesson plans creatively through guidance. It was great learning under her.",
        "course": "EA411"
      }
    ],
    "SEI": []
  }
]