[
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.5,
    "department": "Ecology & Evolutionary Biology",
    "firstName": "Suzanne",
    "id": "VGVhY2hlci03NTQ5MTk=",
    "lastName": "Bartholomae",
    "legacyId": 754919,
    "numRatings": 4,
    "summary_comment": "Professor Bartholomae offers a relatively low workload with only two papers and two presentations required. She provides engaging guest speakers but has received criticism for poor communication and issues with managing student submissions. Overall, her classes are praised for their educational value and the interest in the subject matter, though the balance of work can vary significantly among students.",
    "summary_comment_short": "Professor Bartholomae offers an easy class with minimal homework, including only two papers and two presentations, though some find the workload excessive for a three-credit-hour course. Her lectures are engaging with interesting guest speakers, but students note mixed feedback regarding her responsiveness and the handling of assignments and grades.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class. Only had to write 2 papers and do 2 presentations. Not much work at all. Class was over 2 hours long but she always let us go an hour early. Definitely recommended for a second writing class!!",
        "course": "HDFS367"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "Speakers were very interesting. Teacher not helpful, takes forever to email back and lost my final paper and told me about it a day before grades were due. So frustrating!!",
        "course": "HDFS466"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Good speakers, way too much work for a 3 cr hr class, grade is based on group work forcing you to entrust others too much",
        "course": "HDFS466"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great speakers brought in, helpful assignments, requires effort but not set up to overwhelm, very interested in what she teaches, learned a TON",
        "course": "HDFS466"
      }
    ],
    "SEI": []
  }
]