[
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.2,
    "department": "Education amp Human Ecology",
    "firstName": "Julie",
    "id": "VGVhY2hlci0yMzczMTU1",
    "lastName": "Hillery",
    "legacyId": 2373155,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "You have a Case study and quiz due each week. At first the quizzes were on honor lock but halfway through she removed the honor lock on the quizzes (THANKFULLY). The case studys are easy, I've gotten a 100% on all of them. They include like watching videos or doing an interview and answering a lot of questions. Time consuming but doable. ",
        "course": "CSFRST2372"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "BEST CLASS EVER! She is so caring, understanding, and passionate about the topic. She responds to emails fast, and when there are errors on Carmen with assignments she addresses them and fixes them. There is weekly work and I can finish it all in an hour and in one sitting. Exactly what I want from a GE I wish I could take more of her classes.",
        "course": "CSFRST2372"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "She wasn't very tech savy but she was definetly knowledgeable about the course content. She pushed due dates back and got rid of entire assignments a lot. She was an easy grader as long as you put in the effort, and was nice to have a conversation with. Overall a okay professor and a very easy class.",
        "course": "CSFRST2371"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "took this class online and it was a little unorganized but overall pretty easy",
        "course": "CSFRST2372"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "i actually thought this class was a breeze. you read every week and do a discussion and quiz. quizzes are incredibly easy and the discussion pretty much asks you for your opinion and then asks you to tie in vocab from book. film reviews are fun and easy and once again ask for your outlook. lectures are short and dr hillery is nice!",
        "course": "CSFRST2372"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really enjoyed this class and found it very interesting. You had to watch the lectures and read the textbook/article assigned every week, but the quizzes were pretty straight forward. I was surprised about so many of the ratings on here because I liked her lectures and felt like she was passionate about what she was teaching.",
        "course": "CSFRST2372"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class! It was very interesting and pretty easy. You do have to read the textbook and watch the lectures but they are interesting and not very time consuming. Dr. Hillery really cares about her students and is very passionate about what she is teaching.",
        "course": "CSFRST2372"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Super easy A class, no EXAMS. She also gave us a lot of breaks throughout the semester and really cares about her students mental health. Definitely would take again.",
        "course": "CSFRST2371"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was honestly so surprised to see that Dr. Hillery has a bad rep on this site. I had her in an online class this semester, and she was so kind and caring. She posted a lot of resources surrounding mental health awareness and was always extremely compassionate in her emails to the class, especially during these times! Thank you Dr.H!",
        "course": "CSFRST2372"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "I know that Dr. Hillery gets a bad rep on this website, but I did not think she was that bad. Her lectures can be boring sometimes, but she seemed very nice, caring, and willing to help as much as she could. The exams are not too bad, and expect a lot of group work.",
        "course": "CSHSPMG3330"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "Her lectures were very dull. Exams were challenging. Regular assignments were not difficult.",
        "course": "CSHSPMG3330"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Julie is very boring and dry. She lectures about things that interest her which is only fashion. Whatever is discussed in class is not on the exam and the exams are very difficult. She does not post the entire class online till about a week before it's due. Takes forever to grade assignments. Very sloppy, unorganized and boring lectures.",
        "course": "CSR3330"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "I honestly don't think Dr. Hillery is as bad as the other ratings say she is. I agree that her lectures can get boring and is often just reading off slides, but I didn't really find her rude or a tough grader. Her exams aren't super easy but it's all multiple choice and you're allowed 2 pages for a cheat sheet, which helps a lot.",
        "course": "CSFRST2371"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 1,
        "comment": "She's really sarcastic when you ask her questions but at the same time she wants you to ask her questions??? She's not the best professor to be teaching this course. There's always something wrong with any of her assignments. It's such a boring class to be having at 8am. Totally not worth it.",
        "course": "CSFRST2371"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "WORST PROFESSOR EVER. If you are a FRS major, I am so sorry she is your only option to take as a professor. She didn't even know the material she taught, was consistently wrong on grading, and never took accountability for being wrong.",
        "course": "CSFRST2371"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "The class itself is difficult but Dr. Hillery makes it harder. She does make a ton of mistakes during lecture and on her exams- make sure you go review your exam after bc she most likely got a few questions wrong on her key. On the bright side, she curves your grade so not that bad. Must attend class if you want to pass",
        "course": "CSFRST2371"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Julie doesnt even follow her syllabus, she also doesnt teach the material the way the online website does, associated with our swatch books. She constantly messes up in lecture, and I think theres much better options of professors to teach this.",
        "course": "CSFRST2371"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 1,
        "comment": "Worst professor Ive had yet. Isnt clear on lecture material. Her lecture slides dont match the websites definitions, nor what other professors at OSU teach about textiles. She thinks that she is knowledgeable because she worked for Kohls.",
        "course": "CSFRST2371"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "extremely rude, doesn't understand current technology, class corrected her multiple times on what she was doing wrong or forgetting. Unclear on what she's looking for on assignments.",
        "course": "CSFRST3330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.8,
    "department": "Education amp Human Ecology",
    "firstName": "Alana",
    "id": "VGVhY2hlci0yNDI3Njcx",
    "lastName": "Telesman",
    "legacyId": 2427671,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Alana is extremely sweet and very attentive when there is an issue with scheduling and/or placements. I always felt welcome to let her know when there was an issue.",
        "course": "ESCE2189S"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This teacher is great! She explains everything, her lectures are engaging. She graded always on time, answered emails in short time frame. I was scared at ethics at the begging, but she made it smooth. I would definitely have her as a teacher again.",
        "course": "EDF6557"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really helpful and she wants everyone to do well. Makes FEEP that much less to worry about when the prof cares about the success of everyone. I absolutely recommend Dr. T.",
        "course": "ESCE2189S"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Telesman herself is a great professor and I never had problems with her. The problem is with FEEP. It is a disorganized class that leaves students out to dry in the worst placement I have ever done. Students were put in danger in getting to some of their placements. FEEP itself is one of the worst classes I have ever taken.",
        "course": "ESCE2189S"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Alana is a grad student and is really caring and understanding. She has real world experience in sped that she brings to the class and its really interesting. You can tell she genuinely cares about her students and it makes going to class enjoyable. I wish I could take her for more classes, she has been the only enjoyable aspect to FEEP.",
        "course": "ESCE2189S"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3,
    "department": "Education amp Human Ecology",
    "firstName": "Sona",
    "id": "VGVhY2hlci0yNDc2MjMy",
    "lastName": "Kazemi-Hill",
    "legacyId": 2476232,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I took RGS at UW La Crosse with Professor Kazemi. It is not a hard class, but you can not have an opinion different from hers. There typically was one quiz a week and the exams are not too bad. ",
        "course": "ENG4597"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "DO NOT TAKE A CLASS WITH THIS WOMAN. I took The Disability Experience in the Contemporary World and it was nothing that I thought it would be. She constantly talks about how she is diagnosed as a mad woman and she was quite cruel for making us do a group project with confusing instructions, 10 pages of an essay, and only gave us 2 weeks to do it.",
        "course": "ENG4597"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Hill is a wonderful professor! She makes class very accessible and is willing to meet with you to help with projects or material. Her class may seem daunting with the amount of reading but she is understanding if you cannot read all of it... 3 projects - 1 paper, 1 group project, and 1 final. A lot of creative leniency for projects!",
        "course": "ENGLISH4554"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3,
    "department": "Education amp Human Ecology",
    "firstName": "Sedrick",
    "id": "VGVhY2hlci0yNzYyMDEw",
    "lastName": "Leslie",
    "legacyId": 2762010,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Leslie was able to teach with a level of excitement that you rarely see. The course was one that exposed prospective teachers to the k-12 experience, and Sedrick was not only knowledgeable, but very experienced. I do believe that he grades much more difficult than several other professors that I have had, but his input matches that. ",
        "course": "EDUTL2189S"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "Sedrick is a caring person but a horrible choice to teach this course. While he gives good feedback, he never tells you about assignments or due dates. His lectures were completely pointless and unorganized. I dreaded going to the mandatory lectures.",
        "course": "EDUTL2189S"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 2.5,
    "department": "Education amp Human Ecology",
    "firstName": "Blessy",
    "id": "VGVhY2hlci0yNDI3NjUx",
    "lastName": "Samjose",
    "legacyId": 2427651,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "AWFUL ",
        "course": "EDUTL2368"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Will not accept absences.  Makes mistakes on grading and takes it out on you.",
        "course": "EDUTL2368"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took the 3 hour version of EDUTL 2368 and if you get bored sitting in an hour lecture do not take this class in that version. The lectures are boring because doing anything for 3 hours is boring, but I still thought that she had clear topics for each class. Besides the format of the class, Ms. Samjose is an easy grader and super sweet!",
        "course": "EDUTL2368"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Samjose is very sweet and a great teacher. The only reason her ranking is so low is because people do not like the format of the class. Do not take a 3 hour class if you are going to get bored, it's not her fault that the class is long. Her grading criteria is very clear and you can only skip one class during the semester.",
        "course": "EDUTL2368"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not much of a fan. Not a hard class but it is 3 hours long which can be brutal for some. Take the class if you need a GPA booster but if not youre not missing much.",
        "course": "EDUTL2368"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "Absolute worst professor I have ever had. She cares more about attendance then caring for her students and what they are learning about. Class is almost 3 hours but could be summed up in 45 minutes. Overall would not take this class or recommend.",
        "course": "EDUTL2368"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Blessy is such a sweet person and very understanding however the class is very very long. Discussion based so the whole 3 hours is basically asking your opinion on the assigned book which is not hard at all but gets very repetitive and boring. Easy reads, 500 word weekly assignments, and one final project. Not too bad.",
        "course": "EDUTL2368"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "She doesn't plan her curriculum well so it is agony sitting in class for 3 hours while she is going along. Her grading is sloppy. We read a story and we all interpret it different but if we don't get the main idea SHE HAS we are wrong. And I hated that. She will give you 0's if she thinks you didn't answer it HER WAY.",
        "course": "EDUTL2368"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took the asynchronous version of this class, and it was very easy. Since we read Childrens books, the readings did not take very long, and the blog posts were usually pretty straightforward. The final project was kind of daunting, but after completing it, it was not that bad. I would recommend using a library card and checking out books early",
        "course": "EDUTL2368"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not kidding, if you are looking for a 2000 level writing class DO NOT take her class. Her grading is not clear, you can get 2 out of 5 just because she think you miss something important from the book. BUT! it's an after reading discussion, it meant to be open for every kind of thought. The task is heavy, you have to pay for the book sometime",
        "course": "EDUTL2368"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Blessy was a great instructor. Very forgiving when I would turn in assignments late. very clear grading criteria and offers guidance if there is confusion. There were weekly readings and roles to go along with that, very simple. Truth be told, I never once read a full book or the readings, just picked out parts that applied to the prompts!",
        "course": "EDUTL2368"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 2,
        "comment": "While the content of the class is easy the outside work is absolutely ridiculous. She does not offer any depth in lectures and sitting in them feels like torture. Her grading is all over the place and so is her feedback on things. I think she means well but expects too much when this is a GE class that only has a few assignments. Get ready to read",
        "course": "EDUTL2368"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "Blessy is the sweetest ever!!! She gave a lot of readings, but I never read them just skimmed and she goes over them in class. It is important to go to class. There was only one quiz and a final paper which I got As on both. People who complained about this class/professor were just lazy-- trust me. Ask questions when confused and she clears it up",
        "course": "EDUTL2368"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 2,
        "comment": "Blessy is very nice but gives way too much outside reading. Assigns at least 3 articles which are all very long, along with one book a week. Participation matters and for each class you dont attend your grade drops half a grade. There's only one test, a few group projects, and papers. The class itself is easy but there is a lot of extra work",
        "course": "EDUTL2368"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 2,
        "comment": "DONT take this class with her. She is a grad student, and she has improved but the class is pretty terrible. I will end the class with an A, but I have learned nothing. Her grading can sometimes be unclear and unpredictable. 1 test, 1 group project, weekly journals and a final 5-7 pg paper. dont buy books, you can get by with not doing the readings",
        "course": "EDUTL2368"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Education amp Human Ecology",
    "firstName": "Jamie",
    "id": "VGVhY2hlci0yNzk4ODM3",
    "lastName": "Herman",
    "legacyId": 2798837,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is really nice and will work well with you if anything is a problem or comes up during the course of her class",
        "course": "32485"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Education amp Human Ecology",
    "firstName": "Laurel",
    "id": "VGVhY2hlci0yNDA5Mzk5",
    "lastName": "Clarkson",
    "legacyId": 2409399,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had her for my transfer class and was easily one of my favorite professors. Both the class and her assignments were super easy and she was overall a really nice and caring person. Would Recommend!",
        "course": "EHE1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Laurel was so sweet. She really cared about us and did her best to have the information apply to us. She was a great professor to help with the transition of transferring to Ohio State.",
        "course": "EHE1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I definitely recommend taking this class online because it was SUPER easy, everything is very clearly laid out. However it might have been beneficial to take it in person to meet other transfer students. We had weekly homework assignments that never took more than 1 hour and were graded easy, I ended the class with 110%.",
        "course": "EHE1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.9,
    "department": "Education amp Human Ecology",
    "firstName": "Kate",
    "id": "VGVhY2hlci0yMzEyNTcw",
    "lastName": "Misar",
    "legacyId": 2312570,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Misar is a great professor, truly cares about her students and their mental well being. The workload is a lot for this class, but is manageable under a full load. Never felt under pressure or at risk for a poor grade, and learned a whole lot in her class.",
        "course": "EDUTL5442"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is the worst class and professor I have ever had. She is mean, disrespectful, and does not grade consistently. You read about 3, 20 page assignments each week with weekly videos you must watch or record. She does not discuss the readings, and she spends 3/4 of the class asking about your mental health. She does not spend her time wisely.",
        "course": "EDUTL5442"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is fantastic! The workload seemed like a lot at first but I truly referenced the work I did to complete other assignments for her class and almost all of my other education classes too! She creates assignments that will benefit us as teachers, she is thoughtful and caring! So supportive, the best professor I have had!",
        "course": "EDUTL5442"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is the best teacher I have ever had. First day: I was overwhelmed by the work, but it is entirely manageable and very important/ meaningful. Kate is really just an incredible human being who loves teaching and wants everyone to be the best teacher they can be. I LOVE HER. If you have her, cherish her! Had her during COVID19 too, and she rocked",
        "course": "EDUTL5442"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "An absolute gem, she assigns a decent amount of work but she explains how it will help later and she was right everything saved my life for the rest of the semester both in this class and others. I miss her already.",
        "course": "EDUTL5442"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is an amazing professor. The course has a lot of reading but she is very straightforward about why the reading is necessary and the work is never busy work. Everything Kate does is well planned and designed to make us be the best teachers we can be. Kate also is incredibly understanding and considerate of her students mental health.",
        "course": "EDUTL5442"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is honestly one of the most caring professors I've had. She genuinely cares about how her students are doing academically AND how they are doing outside the classroom. There's weekly reading and a weekly annotated bibliography , but this annotated bib is so helpful down the stretch of the semester. Kate's always available if you need any help.",
        "course": "EDUTL5442"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is AMAZING! Shes so kind and cares so much about her students. She always takes time out of class to apply what were learning to our future careers and provides countless resources and advice. Theres a lot of reading but its all pretty interesting and its super helpful for later projects. One of the sweetest professors Ive ever had!",
        "course": "EDUTL5442"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is an outstanding professor! This semester has been challenging and she is so helpful. Shes been super flexible and all of her assignments have been useful in and out of this class. She truly cares for her students and is always willing to help!!",
        "course": "EDUTL5442"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate is the first instructor I have had in my college experience that I can tell cares about her students. She explains her expectations well and will meet with you outside of class to look over assignments for feedback. She even provided cherished insights on what my first couple years of teaching will look like. Dont be scared by the syllabus! &#55357;",
        "course": "EDUTL5442"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Youre going to have to do the work in this class, but when it comes to your projects youll be glad that Kate had you do those assignments. Kate is super helpful and extremely understanding when life happens to you. Shes one of the most caring professors Ive ever had, and you know you actually matter to her when youre not in her class.",
        "course": "EDUTL5442"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Don't listen to any of the bad reviews. Kate is the most caring professor I have ever had in my entire college career. She is very understanding and flexible when it comes to personal life interfering with classes. While there was a lot of reading, the assignments all had purpose and were useful later. Made comprehensive and clear rubrics too",
        "course": "EDUTL5442"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "The amount of work seems overwhelming at first BUT its all for good reason. Every assignment serves a purpose and really helps further on in the course and even with other courses. Kate was ANGEL when it came to the end of the semester and we were all getting anxious. Shes extremely caring and will help out in whatever way she can!",
        "course": "EDUTL5442"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "Instructor Misar expected too much from her students. Make sure you are paying attention to ALL lectures and readings in class because you will get points off of your grade. A lot of the assignments were not explained well and if you asked her a question she tells you to look at the syllabus. I spent too much time for this class but received an A.",
        "course": "EDUTL5469"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you have this person as your professor, do yourself a favor and drop it. She is a tough grader, does not prepare you for the graded assignments, and spends most of the class doing group work. This is an important class for education majors and this woman did not prepare well.",
        "course": "EDUTL5469"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very tough grader. Grading is mostly focused on citations and formatting rather than course content.",
        "course": "EDUTL5469"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Takes a long time to grade work. Tough grader, grades you beyond what is listed in the rubrics. Don't take this course from her.",
        "course": "EDUTL5469"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 4,
        "comment": "She has very high expectations, gives you clear feedback, rubrics &amp; grades easy. She is very knowledgeable about the material. There are lots of assignments and readings. She is supportive but doesn't grade quickly. She does talk to fast and tries to cover a lot of information in one class.",
        "course": "EDUTL5869"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't challenge yourself to take Dr. Misar's class:)",
        "course": "EDUTL5468"
      }
    ],
    "SEI": []
  }
]