[
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Education  Human Ecology",
    "firstName": "Paul",
    "id": "VGVhY2hlci0yMDk4OTUy",
    "lastName": "Post",
    "legacyId": 2098952,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "So nice 100% great",
        "course": "EDUTL7731"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very knowledgeable on the course subject matter. \nTakes his time explaining, giving examples, and working with his students.\nGreat teacher!",
        "course": "EDUTL7731"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "The course was structured and communicated well. The lectures would continuously contain useful teaching tools and he would run through one about every 3 slides. You may want to have an apple computer as Dr. Post uses only that OS. Therefore, some programs or tools were not free or as easy to use on a Microsoft OS. Wants you to learn and b informed",
        "course": "EDUTL7731"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Education  Human Ecology",
    "firstName": "Zac",
    "id": "VGVhY2hlci0yMTI5ODgz",
    "lastName": "Foste",
    "legacyId": 2129883,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Awesome prof. He is TOTALLY immersed in his expertise. Definitely, a person who teaches well.",
        "course": "elps"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Education  Human Ecology",
    "firstName": "Anna",
    "id": "VGVhY2hlci0yMTU5MjA4",
    "lastName": "Brady",
    "legacyId": 2159208,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anna was great. Cared very much about each individual student and was there if you literally needed any help with anything. The class itself was easy. Assignments were very cut-and-dry and had specific instructions, which made it easy to complete. Some extra credit provided. I actually finished with higher than 100% in the course. Great teacher!",
        "course": "EPSY1259"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I adored Anna and so did everyone else in my class. Not only did her and I become close, but the whole class felt comfortable with each other. She recommended me for a job within the success center at OSU. She was very informative, passionate, and excited about her material and really, really cared about her students.",
        "course": "ESEPSY1259"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Anna! She is very quirky and has a lot to say about time management and organization and provides a lot of resources. The class is good if you have your mind open to change... you will learn a lot.",
        "course": "ESEPSY1259"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.3,
    "department": "Education  Human Ecology",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0xOTk5MjI3",
    "lastName": "Iler",
    "legacyId": 1999227,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Going into this class I assumed that I was going to hate it. But, Dr. Iler really does a good job at making the class interesting. You will have to read every week though. But, this is college so you should expect to read. She is very nice and she is not strict at all she was a very relaxed professor which I really liked. You should take her class!",
        "course": "ESPHE4280"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great class that really got me thinking and great teacher!",
        "course": "ESPHE4280"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I have really enjoyed being in Professor Ilers class this semester! Im hoping I get to take another course with her in the future.",
        "course": "ESPHE4280"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "A lot of work but I learned a lot.",
        "course": "ESPHE4280"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly just a rude person in general. She always makes me feel like an idiot. She also assumes you know everything there is to know about American History. Tons of weekly reading; WAY too much for a 3 credit hour class. Take this class with another professor if you can.",
        "course": "ESPHE4280"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "I would enjoy the class more if I was not worried about the weekly quizzes that are anywhere from 25-100 points (only essay questions btw). Very rarely do you receive feedback on these quizzes. Midterm exam was terrible 3 short answer and one essay question. Just never know what she is looking for in my answers",
        "course": "ESPHE4280"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "I am dying, although sometimes Dr Iler is kind.",
        "course": "ESEPHL4403"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "NO EXAMS AT ALL- one midterm paper, one final project, all group discussions in class",
        "course": "ESEPHL4403"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 5,
    "department": "Education  Human Ecology",
    "firstName": "Kyler",
    "id": "VGVhY2hlci0yMTkyMTY5",
    "lastName": "Cowgill",
    "legacyId": 2192169,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is a breeze. Kyler is so laid back and hilarious. The class is super chill and almost all discussion based. There are a lot of projects/papers back to back, but they are graded super easily. 10/10 recommend!",
        "course": "ESPHE3206"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Kyler and his class! Nice guy, and very fair when grading. If you have an emergency and miss class, just let him know and he won't take points off your attendance grade. Take him if you get the chance!",
        "course": "ESCFE3206"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kyler is a great guy. He is very quiet, but effective. Our class was discussion based, and I felt through these discussions that my classmates and I became very close. It was a comfortable atmosphere all because of him. He really puts things into perspective. The syllabus may seem scary, but trust me, he's very laid back. And grades really easy.",
        "course": "ESCFE3206"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Education  Human Ecology",
    "firstName": "Amy",
    "id": "VGVhY2hlci0yMjIxNDY5",
    "lastName": "Barnes",
    "legacyId": 2221469,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Fun easy class. You should do the reading otherwise it's kinda awkward everyone but you is talking. You have to go. No exams but lots of little assignments like a one pg paper every week and every other week like 2pg paper and little group projects like once a month that work together for the final proj thats super easy.",
        "course": "ESHESA2577"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2,
    "department": "Education  Human Ecology",
    "firstName": "Tiffany",
    "id": "VGVhY2hlci0yMDk3NTAw",
    "lastName": "Wild",
    "legacyId": 2097500,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I've had at Ohio State. She teaches inclusion, but on the first day of class threatened to fail me because I fidgeted too much. Hypocritical. She has poor communication skills, so if class changes, she won't let you know. Grading criteria was always pretty unclear. She is also very unresponsive to feedback. DO NOT RECOMMEND",
        "course": "EDUTL5501"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class isn't difficult, but it's not super helpful or useful either. She never really taught. Lots of work. If you do it, you'll get an A. She has a lot of knowledge, but the class was long and repetitive. Overall, easy, just not engaging or exciting.",
        "course": "EDUTL5501"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Education  Human Ecology",
    "firstName": "Jessica",
    "id": "VGVhY2hlci0yMTU5MjA3",
    "lastName": "Cutshall",
    "legacyId": 2159207,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy GPA booster class for 3 credit hours, I only spent like less than an hour completing the 2 weekly assignments. Other than the final project which did take some extra time it wasn't bad and easy since its a topic about yourself basically. I turned in my final project late a bit but I got full credit and I am just happy she takes all late work. ",
        "course": "ESEPSY1259"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jessica is a fantastic option to take for the online section of this class. Everything is outlined well ahead of time allowing you to work ahead if you wish to do so. There is a decent amount of projects to do, but she grades extremely easy on all of them. Only need the book to study for the midterm. Would definitely recommend this course.",
        "course": "ESEPSY1259"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jessica was an awesome instructor! We had really interesting discussions in her class and the assignments were interesting. I have recommended this class to all of my  friends. Through the course I gained confidence in myself & truly feel like my college skills were improved. Love her!",
        "course": "ESEPSY1259"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.7,
    "department": "Education  Human Ecology",
    "firstName": "Scott",
    "id": "VGVhY2hlci0yMjMwNjAx",
    "lastName": "Pealer",
    "legacyId": 2230601,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Made me fall in love with the game even more. Great knowledge and insight, if you have questions ask them. He is great with 1 on 1 coaching and cares if you do about improving your game. ",
        "course": "KNSFHP1157"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Scott is very knowledgeable about golf and I learned a lot from him. From the times I did have 1 on 1 time he helped my game a lot. The golf simulator was very cool, but unfortunately often a long line often was present, so I found my time was better spent continuing to hit in the bays. I do wish we hadnt spent as much time on the short game.",
        "course": "KNSFHP1157"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing instructor, took the class twice just cause I could, easily taken 10 strokes off my 9-hole rounds.",
        "course": "KNSFHP1157"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Education  Human Ecology",
    "firstName": "Brian",
    "id": "VGVhY2hlci0xOTkzNjEx",
    "lastName": "Edmiston",
    "legacyId": 1993611,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Dr. Edmiston is one of the worst professors that I have had during my time at Ohio State. He lacks empathy and will neglect to acknowledge you when challenges arise. Dr. Edmiston is extremely self-centered and seems to only be teaching the course for his personal benefit. I would not recommend due to his harsh beliefs and unwillingness to be kind.",
        "course": "EDUTL6101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Awesome professor. He cares deeply about education and about his students. I loved him so much I took him for another class.",
        "course": "EDUTL6050"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The pedagogy he advocates for is amazing. Professionally, Do not trust him. So, if you tell him about a weakness you have, it will come back and bite you and he will make remarks using the info you gave him against you.  Zero Understanding of other culutres. Never open up to him or trust him. His attitudes vary between racist, sexist and ablist",
        "course": "EDUTL6101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "You will love being in class!",
        "course": "EDUTL6050"
      }
    ],
    "SEI": []
  }
]