[
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.9,
    "department": "Engineering Graphics Tech.",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0xMzA0MTM0",
    "lastName": "Abrams",
    "legacyId": 1304134,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loved every second of this class. Amazing!",
        "course": "ENGR4891"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Abrams is by far one of my favorite professors. She makes the material extremely easy to digest, and is very considerate. Just be honest and communicate with her, and you will pass the class.",
        "course": "ENGR1180"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Abrams truly cares about you succeeding. She doesn't hesitate to spend one on one time with students in class until they understand a concept. The overall class is simple and straight forward and Dr. Abrams is really kind and funny and actually remembers her students and goes above and beyond for her classes. 10/10 professor!",
        "course": "ENGR1180"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lisa Abrams is an angel. She is such an amazing woman, and such a boss! This kick ass woman knows her worth and makes sure you know yours as well. She has endless resources and is happy to share them and help you. She makes everyone comfortable and is just absolutely fabulous. My favorite woman!",
        "course": "ENGR4891"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Abrams is a very caring professor, and I'm glad I was able to take this class. She creates a comfortable environment and seems likes she really wants the best for her students. There wasn't hardly any work in this class and it was mostly discussion based.",
        "course": "ENGR4891"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "She organized the weekend well. The moderators were very entertaining and helped me with my public speaking and teamwork skills. They also offer some food during the sessions. It was a sacrifice (waking up early on the weekend and missing the welcome week concert), but i think it was worth it! The class was also S/U, so no effect on GPA.",
        "course": "ENGR5695"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite professors I've had.",
        "course": "ENG1181"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very nice lady and excellent teacher. If you have any questions at all she answers them and more. She wants to see you succeed and gives you everything you need to do so. If you show up, kind of pay attention and do the (limited) homework, you're fine. Group projects are kind of tedious, but not awful. Overall she's a great teacher, def. reccommend",
        "course": "ENGR1181"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Expects too much energy early in the morning.  Treats everyone like a child.  Appears very interested in the generally lame parts of the course, and does not show a deep understanding of any material.  She is very helpful though, and if you like enthusiasm, there is plenty of it.",
        "course": "ME2900"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great prof - very engaging, nice, will bring Timbits to class if the class is nice.",
        "course": "ME2900"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "AMAZING!!! Professor Abrams is very engaging and enjoyable to listen to. She clearly explains everything, and most importantly, you can tell that she loves to teach. Can't wait to take her 5680 class!!!",
        "course": "ME2900"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Abrams is probably my favorite teacher I've had in my 3 years at OSU thus far. She is very helpful and understanding and really knows how to inspire her students. It is not terrible to keep up with the material as long as you stay ahead.",
        "course": "ENGRA410"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Abrams and Dr. Lilly were fantastic. They were honestly the best professors i have had here at OSU barring Dr. Clymer who was also phenomenal. Cant wait to take 621 with her.",
        "course": "ME694"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an awesome professor not only this class but I am sure for others.",
        "course": "EG410A"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lisa has been one of my all time favorite teachers in ME. She is very helpful & genuinely interested in helping you. Not mandatory attendance but she does take the time to get to know everyone and she will notice if you aren't there. Class is graded pretty easy overall as long as you complete all assignments. She is very knowledgeable at Solidworks",
        "course": "ME621"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class as long as you keep up.  Do well on the project and the midterm/final are easy.  Class can get boring after a while if you are familiar with SolidWorks.",
        "course": "ME621"
      }
    ],
    "SEI": [
      {
        "Subject": "ENGR",
        "Catalog": "1180",
        "Class Name": "Spatial Visualization Practice and Development",
        "Class Number": "28297",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.91"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1180",
        "Class Name": "Spatial Visualization Practice and Development",
        "Class Number": "28298",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ENGR",
        "Catalog": "1180",
        "Class Name": "Spatial Visualization Practice and Development",
        "Class Number": "28386",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.86"
      },
      {
        "Subject": "ENGR",
        "Catalog": "4375",
        "Class Name": "Inclusive Leadership Practice for Emerging Professionals",
        "Class Number": "37327",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.75"
      },
      {
        "Subject": "ENGR",
        "Catalog": "4375",
        "Class Name": "Inclusive Leadership Practice for Emerging Professionals",
        "Class Number": "37328",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.96"
      },
      {
        "Subject": "ENGR",
        "Catalog": "4375",
        "Class Name": "Inclusive Leadership Practice for Emerging Professionals",
        "Class Number": "34116",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.95"
      },
      {
        "Subject": "ENGR",
        "Catalog": "4375",
        "Class Name": "Inclusive Leadership Practice for Emerging Professionals",
        "Class Number": "37311",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.89"
      },
      {
        "Subject": "ENGR",
        "Catalog": "4375",
        "Class Name": "Inclusive Leadership Practice for Emerging Professionals",
        "Class Number": "12329",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.79"
      },
      {
        "Subject": "ENGR",
        "Catalog": "4375",
        "Class Name": "Inclusive Leadership Practice for Emerging Professionals",
        "Class Number": "12330",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.1,
    "department": "Engineering Graphics Tech.",
    "firstName": "Deb",
    "id": "VGVhY2hlci0xNjE0Njc2",
    "lastName": "Grzybowski",
    "legacyId": 1614676,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "1281.01H is a work-heavy class, but Dr. Grzybowski and her TA team made it an amazing class. An incredibly caring and focused person who puts in the effort to help her students in every way possible. Great professor.",
        "course": "128101H"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took her online during covid. She's pretty nice and very accessible outside of class. Whenever I emailed her, she responded instantly. Lectures are dry, but this is first year engineering so yeah. I would definitely recommend her, she was super flexible.",
        "course": "ENG1181"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Deb is the only professor this semester who seems to actually care about her students. She is very easy to talk to and is extremely understanding. I made sure to take her other class next semester as well. I will remember her for my whole life. It is also inspiring as a female engineering student to see someone do what you want to do one day!",
        "course": "ENG1181"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this in Au2017. Dr. Deb was knowledgeable about MATLAB. I enjoyed her instruction, but there were a lot of kinks to work out of the coursework because someone not in education created the material and disconnect with instructors not creating the instructions. She gave extra credit and pop quiz heads up if attendance was low so go to class",
        "course": "ENGR1221"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Deb really cares about her students. However, she did a poor job of explaining the Graphics content. Although she is a knowledgeable resource for the Microfluidics and Nanotechnology project, she wasn't accessible because she often absent from class (ironically busy with engineering education research) and slow to return emails.",
        "course": "ENGR1282H"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Deb is very nice. FEH was one of the worst classes I've ever taken, but that had little to do with her. She really cares about her students, and will certainly help you out if you seek her. She can be a bit unclear sometimes, but she is knowledgeable. That said, FEH is pretty self-taught and ran by the department, so the professor doesn't matter.",
        "course": "128101H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Deb is awesome. She really cares about her students and is always there to help- all you have to do is ask.",
        "course": "128101"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "She didn't always seem to know exactly what she was talking about. Not because she didn't know but because she knew too much. She needed the TA's help during lectures a lot and didn't always know how the APPs worked.",
        "course": "128101H"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "1282.02H was a very open-ended class and Nanotechnology is pretty confusing, but Dr. Deb was very helpful with questions and clearing up misconceptions. Very energetic and loves what she teaches.",
        "course": "ENG128202H"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "This was the FEH version; the class was very easy. A lot of the material was cumbersome, ridiculous, and unnecessary. Dr. Deb, though one of the nicest ladies I have ever met, was not all that helpful at all. My TA's were phenomenal, but Dr. Deb herself wasn't helpful at all and it came to the point where I avoided asking for her help.",
        "course": "ENGR1281"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Taught FEH programming. I love this lady! So helpful and energetic.  My favourite instructor by far.",
        "course": "ENG192H"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "VERY HELPFUL.  She genuinely cares about her students and wants everyone to succeed.  I?m not a huge programming fan, but she made it understandable.  Awesome professor.",
        "course": "ENG192"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 1,
        "comment": "Taught my FEH programming class. It was her first time teaching the class and she started out somewhat frazzled, but got much better by the end. Sometimes uses weird examples but explains everything very thoroughly one on one. Genuinely nice lady, really cares about her students and helping them succeed.",
        "course": "ENG192H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.3,
    "department": "Engineering Graphics Tech.",
    "firstName": "Phillip",
    "id": "VGVhY2hlci05NjY0NjE=",
    "lastName": "Schlosser",
    "legacyId": 966461,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great professor! Had him for ENGR 1281.01H( FEH). Is extremely caring and helpful and a cool guy! He knows most of the content and will try his best to help you!",
        "course": "ENGR1281"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very caring and understanding, something I dont see enough today in the college environment. He genuinely tries to make your life easier, he understands we have other classes besides his. He wants you to learn and goes through the steps at a good pace. Great guy.",
        "course": "ENG1181"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very laid back and nice man. One of the easiest Engineering professors for FE.",
        "course": "ENG1181"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Phil wasn't always the best at articulating himself, but it doesn't really matter as long as you can get yourself to understand Excel and MATLAB. However, he is a really great guy who cares about how his students do. Whenever there were bad averages for specific problems on our midterms, he would often offer a way to make up for it.",
        "course": "ENG1181"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Phil tries to learn every students name and really knows what he is doing. All you need to know is excel and MATLAB and you will pass the class easily. He is a very smart professor and always has good life advice to offer his students. Don't buy the book because you will never use it.",
        "course": "ENG1181"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class overall. Don't buy the textbook, you hardly use it except for the occasional online quiz. The solid works stuff can take a while (2 hours), but that's the worst of it. Dr. Phil is super upbeat and isn't boring!",
        "course": "ENGR1182"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Not hard at all. Do not buy the textbook, waste of money. Teaches the little content in 1182 nicely. Always positive and happy. Would strongly recommend.",
        "course": "ENG1182"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Phil is a good man, but not very good at teaching (at least in the flipped classroom format). His lectures were often long and difficult to follow. However he made a serious effort to ensure students enjoyed the course. This replaces any sort of negative experience I had during the course.",
        "course": "ENGR1182"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr.  Phil (as he asks us to call him) is enthusiastic about what he does and has a love of the material. He connects with students and is clearly happy when they succeed.  He sometimes gets off topic for long periods of time, meaning you'll either have to rush the in class assignments in as little as 3 minutes or work during the lecture.",
        "course": "1181.01"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Phil is a phenomenal professor. If you don't get something he's happy to help you understand. Overall a great professor and great guy. ",
        "course": "1182"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "He's a good teacher but this class is a ton of work. Be ready for a ton of group projects and harshly graded papers. This class is only two credit hours but you do the work of 5 credit hours. Work with other on the homework and buy a book with a friend and split the cost.",
        "course": "118101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very kind teacher, you can tell he knows what he is talking about.",
        "course": "1181"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Schlosser was very helpful. The class itself was a lot of work, but he was very passionate about it and always willing to help if you needed it!",
        "course": "ENG1181"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class in general was rather ambiguous, but the prof was great.",
        "course": "ENGR4891"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 2,
        "comment": "Went through powerpoints quickly, if something was unclear just ask. Didn't have to have book, put all the homeworks on Carmen. Make sure you have time for your group!",
        "course": "EN183"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "You'll get an A no matter what",
        "course": "FRESHSEM"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome professor. made everything extremely simple when questions were asked",
        "course": "ENG181"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "AWESOME!!",
        "course": "ENG180S"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wow. Amazing professor. Easy class, I thought, although it did require some work sometimes. Go to class, everything is learned there. Very friendly guy, I don't think there is one thing I can possibly complain about having him as a professor. TAKE HIM IF YOU CANNN!",
        "course": "ENG183"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Phil is still my favorite professor, I had him for 183.01 and artsci 137.11..he really loves teaching...you can see it in his smile...I really thinks he gets a kick out of helping kids..hes not in it for the money like some professors, he likes his job....hes a great guy..take him if you have the choice.",
        "course": "ENG183"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor!  Always helpful and tried to make lectures fun.  Dr. Phil is probably the best professor I've had so far.",
        "course": "ENG181"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "It was fun just to watch him teach. Of all the professors I have had, he is the one and only professor that actually seemed to care about his students. He is able to get down to business and have fun while doing so.",
        "course": "ENG181"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Phil is such a sweet guy. He has the voice of an angel. Very helpful. And, he invented the iPod.",
        "course": "ENG183"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 1,
        "comment": "nice guy.",
        "course": "ENGIN181"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher, pretty funny and will help you if you need it. Great guy, though might deviate from the topic a tiny bit every now and then. But he loves to teach. Midterm was easy, final was a little tricky in some areas.",
        "course": "ENGIN183"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "very helpful instructor.. he's clear and simple.. welling to help you any time .. just amazing. certainly Im gonna take 183 with him!",
        "course": "ENG181"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very very helpful. This class was at 7:30 in the morning, but was never hard to get to because of his passion in teaching.",
        "course": "ENG181"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "He has real world experience and genuinely enjoys teaching.",
        "course": "ENG181"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "ENG181"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "Highly recomemded. He is very helpful",
        "course": "ENG181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Engineering Graphics Tech.",
    "firstName": "Rodney",
    "id": "VGVhY2hlci0xNDM2MjE3",
    "lastName": "Jones",
    "legacyId": 1436217,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very approachable and helpful. If he can't answer your question immediately, he will get back to you about it. Graded homework and got it back to you quickly. Even kept up with putting grades in on carmen, which was nice. Overall a cool guy and a great TA!",
        "course": "ENGR1181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Engineering Graphics Tech.",
    "firstName": "Braeden",
    "id": "VGVhY2hlci0xNTI5MjUy",
    "lastName": "Kelly",
    "legacyId": 1529252,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Braeden Kelly was perhaps the single greatest super professor I have ever had on this storied  campus.If I could compare Braeden to a celebrity, I would compare him to Jesus.Like Jesus, Braeden saves lives.On one fateful day as his disciples watched him, Braeden constructed a mechanical heart, ripped open his own chest, placing the heart and saving",
        "course": "ENG183"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.5,
    "department": "Engineering Graphics Tech.",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xNTg5MzIy",
    "lastName": "Mason",
    "legacyId": 1589322,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Michael was a really fantastic teacher. If you have the chance to choose to take him, take him. He's great.",
        "course": "ENG100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Engineering Graphics Tech.",
    "firstName": "Yosef",
    "id": "VGVhY2hlci0xNDIzMjEz",
    "lastName": "Allam",
    "legacyId": 1423213,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good teacher. Was very clear when teaching and professional. The class itself wasn't difficult and Allam only made it easier.",
        "course": "ENG3"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very good with communication and also very, very good looking.",
        "course": "ENG181"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good teacher and clear.  Well prepared with slide shows.  Smart man that can relay the information quite simply to a class.  A lot of fun to work with.  I would definitely suggest this professor anytime!",
        "course": "ENGIN181"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very professional and extremely helpful professor. Classes are engaging and beneficial. You won't regret taking him!",
        "course": "ENG183"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.5,
    "department": "Engineering Graphics Tech.",
    "firstName": "Siddarth",
    "id": "VGVhY2hlci0xMjcxMTc0",
    "lastName": "Singh",
    "legacyId": 1271174,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful and humorous. Always ask if you need help or clarification! Sid is willing to help.",
        "course": "ENG181"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful and funny guy. He has an accent but he's always willing to clarify. Just ask. Very approachable and will help you till you understand. Highly recommended!",
        "course": "ENG181"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good TA. He thinks he's funny and cracks weird jokes! He knows the subject very well and is always available to help through email and office hours. take him if you can.",
        "course": "ENG183"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great TA. Very Helpful and understanding. Replies to emails quickly and will give you the attention you deserve. He's fun but once you overcome his accent he can be educational. loved his class",
        "course": "ENG181"
      }
    ],
    "SEI": []
  }
]