[
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.6,
    "department": "Entomology",
    "firstName": "Joseph",
    "id": "VGVhY2hlci0xMjYyNDYw",
    "lastName": "Raczkowski",
    "legacyId": 1262460,
    "numRatings": 25,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you're in honors and need a natural science question, take this class. It's easy, and you still learn so much about like sources and how trustable they are you know? There are barely any bugs in this class. The only reason why I say barely is because sometimes Joe will talk about his research or show a video about bugs if there's time left over.",
        "course": "ENTMLGY2400H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Dr. Joe. He is so sweet and really cares about his students. The class was very easy and as long as you did your work, you basically got an A. I also met some really great people in this class, honestly just a great experience all around.",
        "course": "ENTM2400H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is such an easy course and entirely online. You do have to pay to do packback, but that gives you easy points.",
        "course": "ENTMLGY4600"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is super easy! entirely online and weekly quizzes but if you watch the lectures, then all the quiz material comes right off of it and you get an easy A. The professor, whom I haven't ever seen in person, seems to be a very nice guy. Oh! and not to mention you get two chances to take quizzes and the professor takes the highest grade.",
        "course": "ENTMLGY4600"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "The class was entirely online, I never interacted with the professor or other students. Usually, each week it's required to watch two prerecorded lectures that typically last half an hour altogether. The only assignments were three papers that were only a page and a half and a few quizzes. For a 4000 level course, it's extremely easy.",
        "course": "ENTMLGY4000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was super chill and while we did have to do work, he gave us ample time in class for it. 9/10 would recommend",
        "course": "ENT2400H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "You learn a lot in this class, but it is also quite easy. If you come to every lecture, fill in the guided notes, and actually pay attention, you'll probably get a high B if not an A without studying. That said, Joe is a real great guy who obviously cares about both the subject and his students. Highly recommend!",
        "course": "ENTM4440H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've had Dr. Joe for three in-person classes. 4440H and 3000 are low-stress and you learn a lot. 3001, the intro lab, is difficult, but it also is the source of some of my favorite OSU memories. He's obviously passionate, he has a fun attitude, and he likes to know each student personally. Other things he likes: ants, youtube videos, and storytime.",
        "course": "ENTM4440H"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class was SO easy because literally everything is completion. He gave us 100% on ALL assignments. I still learned a lot in this class and the material is actually very interesting. I just wish he taught more since he only lectured twice throughout the semester. I learned mostly from the book, not in class.",
        "course": "ENTMLGY2400H"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is a super easy GPA booster. Quick quiz for 10 modules and a final exam. There is almost no interaction with the course outside of that. I finished the whole thing in about 6 hours. I would recommend! I also took 4607, which required more work (it is 3 credits), but it was equally interesting!",
        "course": "ENTMLGY4600"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 1,
        "comment": "So I took his online ENTMLGY4600 class this past summer term (2019) and he initially had the final exam due date set to 2017. I ended up emailing him 3 times in the span of 2 weeks (spaced out to give him time to see them) b/c he NEVER replied, even after he finally fixed the due date. It's hard to respect someone that seemingly ignores students.",
        "course": "ENTMLGY4600"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "this was the easiest class I've ever taken. He gave us all 100%'s on EVERYTHING besides the final. There were no bugs in this course, everything was straight and to the point, and we were done 30-60 minutes early quiet a few times. It was a weird course, but definitely worth taking.",
        "course": "ENT2400H"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Joe is amazing. You do have to show up to class and pay attention to do well (he gives partial notes that you fill out during class), but he doesn't waste your time and his quizzes/exams are straightforward. He's full of funny stories and takes time to get to know each of his students personally over the semester.",
        "course": "ENTM4440H"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's awesome. I was originally in the 2200H version and it was stupid (set up by the college, group midterms, nonsense) and I transferred into the one with actual bugs (3330) and highly recommend it. If you study for the midterms and quizzes, you'll get an A. The lectures are usually interesting and you get to watch a lot of cool documentaries.",
        "course": "ENT3330"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great cgpa booster.",
        "course": "ENTMLGY4600"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Despite the 4000 level status, it was a breeze. I found the focus to be on the basics of insects and an overall understanding of their orders, anatomy, & physiology. You take one quiz a week online that pertains to a powerpoint. The slides are well organized and come from various lecturers. The final includes similar quiz questions.",
        "course": "ENTMLGY4600"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a pretty easy first session class. There are helpful slides, and it's online.  The worst part is that you can't get ahead in the class.",
        "course": "4600"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher. Learned a lot from him, and liked how he put a lot of emphasis on the insect collection project. Compared to his Social Insects class (ENTMLGY 3330), this class is more intensive, but you can still do very well if you put the time and effort in.",
        "course": "ENTMLGY3000"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Honors social insects was super easy, and he made it pretty interactive too. You get to play with and observe bugs, and learn a lot of information that you probably would have never learned otherwise (if you aren't an entomology major). Really cool professor - take this.",
        "course": "ENTM4440H"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy A.  There is no textbook, all of his lectures are online.  It is only 1 credit and half of a semester, but if you need to have a class to keep you above full time status I would recommend this one.",
        "course": "ENTMLGY4600"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is awesome. Vey interested in insects. No textbook needed, yet the notes given are easy to understand. You need to come to class since he will provide only partial slides on Carmen. As long as you read the notes, quizzes, midterms and final are easy to score",
        "course": "ENT333"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "The lectures are clear and straight forward like everyone says. However, there are a lot of information that needs to be memorized to get a good grade in this class. So if you are good at memorization it's not a problem to get an a, otherwise, needs to put more effort than you think. Very interesting class, and worth while to take as a GEC",
        "course": "ENT333"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "Joe kept the class very interesting with the help of enthusiasm, pictures and videos. The quizzes and tests are very straight-forward and come from the notes in class. Learned a lot in his class",
        "course": "ENT333"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "This guy is the man.  He is very straightforward and tests and quizzes come straight from the notes.  Hardly any homework, you just need to show up and copy down from the projector word for word.  Sounds monotonous, but it is actually very interesting with pictures and some live insects and videos.  Great, fun, interesting, easy class",
        "course": "ENT333"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good professor.  He was very clear on what you needed to know and was well organized.  Kept the class interesting and is overall just a nice guy.  Highly recommend taking this class with this professor.",
        "course": "ENT333"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Entomology",
    "firstName": "Reed",
    "id": "VGVhY2hlci0yNzIxODg4",
    "lastName": "Johnson",
    "legacyId": 2721888,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Beekeeping is a wonderful course that presents the opportunity to actually get outside with some bees. However, do be prepared to actually listen to weekly online lectures and complete the subsequent weekly online quiz on the lecture material. Labs are only once a week and are the main highlight of the course.",
        "course": "ENTMLGY-2200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Entomology",
    "firstName": "Carol",
    "id": "VGVhY2hlci0yNjc4OTkx",
    "lastName": "Anelli",
    "legacyId": 2678991,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "If you put in work for the class, you will get an A. However, assignments are time consuming and are busy work. Assignments and exams are completed with a group. If you do not like working in groups, do not take this class. Overall, this class is too much work for a gen ed credit. Class has nothing to do with entomology.",
        "course": "ENTMLGY2400H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1.2,
    "department": "Entomology",
    "firstName": "Dominique",
    "id": "VGVhY2hlci0yNTkwMjQ1",
    "lastName": "Vacheresse",
    "legacyId": 2590245,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dominique is probably one of the toughest graders I've ever had. She was my TA for ENT1350 and was very critical of every assignment, nitpicking every single detail. Even if you work on a project for hours she'll find something wrong with it. Despite getting a good grade in this course I would not take it again with her as the TA.",
        "course": "ENT1350"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "DON'T TAKE THIS CLASS OR HAVE THIS PROFESSOR. She is truly ridiculous when it come to grading and thinks she can do no wrong (e.g. she would only give me partial credit for a typo that SHE made) despite an entire class giving her honest feedback about what can be done to improve the class. Instead of listening she wrote a passive aggressive message",
        "course": "ENT1350"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "I fully believe that she does not want students to do well in her class. She's a grader for entomology 1350 and grades so unfairly. She is very rude and unhelpful. She grades so slowly because she claims to get migraines from looking at the computer, but then assigns extra online work to students during the pandemic, so hypocritical.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is the rudest person I've ever encountered at Ohio State. She is so passive aggressive and arrogant when she responds to email, its so childish. She takes points off for things we never learned, like MLA work cited pages. She has no regard for the pandemic going on and assigns extra work. She is quite literally heartless. Don't take her class.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Think you know anything about grammar? No, you don't. Thought you put a lot of effort into that assignment that took you almost 3 hours? Not good enough. 150 students leave an honest review of you during midterms? Better send an announcement that they don't know what they're talking about and start grading harsher.",
        "course": "ENT1350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Entomology",
    "firstName": "Denisha",
    "id": "VGVhY2hlci0yNDgzNzU1",
    "lastName": "Parker",
    "legacyId": 2483755,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is very approachable and kind. If you are struggling with the material and/ or have a question about grades, material, lab, etc. she is happy to help.",
        "course": "ENTMLGY1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 2.6,
    "department": "Entomology",
    "firstName": "Megan",
    "id": "VGVhY2hlci0yNTc0MjU4",
    "lastName": "Meuti",
    "legacyId": 2574258,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "I see a lot of negative things on here about Prof. Meuti but I disagree with all of them! But, I don't take the class online. She is a wonderful professor! Lectures are interesting. Not hard at all and she offers a ton of options for extra credit. The unit exams require you to be creative, but I wouldn't call any of them hard. ",
        "course": "ENTMLGY1350"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "The unit assessments were enough for me to say that this is one of the worst classes i've taken. Dr. Meuti believes that these unit assessments are better than traditional exams, and they are absurd. Just a completely unnecessary amount of work and they feel like a waste of time. ",
        "course": "ENT1350"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "AWFUL professor who thinks she's an evolutionary biologist, psychologist, sociologist, and neurologist all in one, when she is none of the above. This course was HORRIBLY organized, and I learned nothing except that Meuti has a very favorable opinion of herself. It was also extremely biased, e.g teaching monogamy as a biological necessity. ",
        "course": "ENT1350"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "AVOID.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Save yourself the trouble. Main point of the class proven in a week so the rest is unrelated busy work. Multiple times I felt the class was unfair for students, especially being a 1000-level course. Meuti is fair, but this class wasn't a learning experience I enjoyed. Better off just reading about the evolution of religion if you're interested.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very stimulating class and very forgiving grading process. Average workload for the real world. Really kind and upbeat person, and handles subject matter that is touchy well. Best part is the class work is very interesting so all the work is smooth if you are interested in evolution or faith. ",
        "course": "ENTMLGY1350"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "So took her graduate level class, but there is no option to list that course. Meuti claims to care about work life balance but gives excessive amounts of work that could not be accomplished in the time-frame she expected. When students brought up their complaints, she said it was our fault that we couldn't read right. Horrible person, avoid. ",
        "course": "ENT2101"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Entomology 1350 (asynchronous) is definitely a difficult class. However, I found the material interesting, even if only surface-level topics were mandatory to learn for the exams. The 4 exams were projects that, honestly, made me put in an absurd amount of work. But it's rewarding, there's lots of EC, and the class kept my attention all semester. ",
        "course": "ENTMLGY1350"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Meuti was really nice and she seemed to care. Honestly this is a class I would recommend to anyone, I absolutely loved it. The material is so interesting and the textbook is an easy read.",
        "course": "ENT1350"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "I took Prof. Meuti's course as a graduating senior to fulfill a GE. The course itself was difficult and the grading was tough, but with that being said, Dr. Meuti is friendly and genuinely cares about what she's teaching. This course is by no means an easy A, especially for a GE, so you'll have to work hard to earn a good grade.",
        "course": "ENT1350"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolute joke. One of our quizzes had bible related questions.",
        "course": "ENT2101"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is seriously the worst class I've taken ever. Meuti &amp; Dominique are both SO rude and mean for no reason. There's been multiple times I've emailed to ask a simple question &amp; got the RUDEST response. The class is insanely hard, &amp; the &quot;final&quot; we had consisted of being graded on things we never learned, like how to do MLA citations. what a joke",
        "course": "ENTMLGY1350"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of people have been roasting this class but I took this as a graduating senior and I am here to say this is my favorite GE course I've taken at OSU. I would say I put in 4-5 hours a week, which is normal for an online class (consider that the lecture videos account for about two hours). The material is straightforward and SO interesting.",
        "course": "ENT1350"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Quizzes and exams are very difficult. There were 4 long essays for the final to do in 1 week, which is excessive considering people have other classes and projects this week. Her TA Dominique is the harshest grader and doesn't respond well to criticism as many people had complained during a midterm survey and she lashed out by grading much harsher.",
        "course": "ENT1350"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "DO NOT TAKE THIS CLASS. I came into this class for a GE requirement, it has nothing to do with my major. The work load was just ridiculous. Her TA Dominique Vacheresse is rude, no compassion for students during a pandemic. For the final she assigned four MAJOR essays, which was completely unnecessary given that I have 4 other exams to prepare for.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "This professor gives nothing but busy work, then makes exams that are excessively difficult. Although I got an okay grade in the class, I would highly discourage anyone from taking a class with her. This is the worst professor I have ever had. I truly regret taking this course.",
        "course": "ENTYMOLOGY1350"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is not an easy A and I struggled a lot in the beginning. However Dr. Meuti wants you to do well. There is extra credit &amp; she responds to emails very quickly. It is slow to get grades back but there are over 300 students in the class. This class is a lot of work but I learned a lot. Also the class never pushes religion to students.",
        "course": "ENT1350"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "This was the first online class that I took but it has been incredibly well-organized. Dr. Meuti is very nice and accessible, sometimes her lectures are a bit long and she can get a little off-topic. This class definitely has a manageable workload and they have realistic expectations for the work they receive, so they aren't terribly hard graders.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is incredibly too difficult. There is too much hypocrisy between the professor and her expectations. She claims she cannot grade quickly due to getting headaches from looking at a screen too long. However, she expects her students to watch up to 4 hours of lecture videos.",
        "course": "ENTMLGY1350"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Meuti is such a chipper professor and she always seems so sweet and happy in her lecture videos. Her online Biology of Hope and Belief course has the best setup Ive ever experienced in an online course. Its a lot of work, but absolutely manageable. I would most certainly take a course with her in person if the opportunity ever arose.",
        "course": "ENT1350"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "This is the most problematic class I have taken at OSU. &quot;Biology of hope and belief&quot; sounded really cool, but the textbook (&amp; the lectures we have to watch that just mirror the textbook) are so biased and surface level, its infuriating. They claim monogamy as a biological imperative and make you learn absurd, non-scientifically backed facts.",
        "course": "ENT1350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Entomology",
    "firstName": "Ellen",
    "id": "VGVhY2hlci0yNjk5NDU3",
    "lastName": "Klinger",
    "legacyId": 2699457,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She does an amazing job. I did not know anything about (did not like) the content, but she is so creative during class and so thoughtful of her students, she made me like the class. ",
        "course": "ENTMLGY2101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class with pretty enjoyable and interesting assignments. Definitely would recommend. ",
        "course": "ENTMLGY2101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I highly reccomend her class! She is a thougful, caring, and an amazing professor. She has good powerpoints and lectures. I struggle with a lot of mental health and illnesses, but she was really caring and gave me extensions until I was able to turn them in. I really enjoyed her class and would take a class that she teaches again. ",
        "course": "ENTMLGY2101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Klinger's class was asynchronous, but she was still interactive with the class and accessible. Really nice professor and great to chat with. She has lots of interesting anecdotes and clever fun-facts. Also, willing to write letters of rec!",
        "course": "ENTMLGY2101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Klinger is the best! She made lectures very interesting and I always was excited to show up to lab and see what we had in store for the day. As long as you show up and pay attention, you should do just fine in this class and the outside work is never too heavy.",
        "course": "ENTMLGY2101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Klinger gave super fun and informative lectures!! Her class was very well organized. It only took about an hour a week to do. There were a few group projects, but they weren't bad. It was mostly just responding to other group members posts. ",
        "course": "ENTMLGY2101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "She really cares about the material and her students. I am glad I took her class.",
        "course": "ENTMLGY2101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loved this class so much! Professor was a great teacher. Online lectures were broken into 3 parts to make material more organized. Assignments and discussions were reasonable and the grading structure was good. Given a week to complete each lecture and the materials. Very easy to receive a A or B in this class. Very knowledgeable professor",
        "course": "ENTMLGY2101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hands down the best online asynchronous class I've ever taken. I learned so well from the way she teaches to the point where I still have retained information several months later. Her pre-recorded lectures are amazing, and the homework is helpful. If I could take this class again, just as a fun refresher, I absolutely would.",
        "course": "ENTMLGY2101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Entomology",
    "firstName": "Benjamin",
    "id": "VGVhY2hlci0yNjA4NDAy",
    "lastName": "Philip",
    "legacyId": 2608402,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ben truly cares about all of his students. Throughout the semester he made every effort to make class as interesting as possible and you can tell he loves what he does. One of my favorite professors that i've had at OSU.",
        "course": "none"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Philip makes an otherwise uninteresting course, interesting. I have no interest in entomology, yet he still found ways to make the material easy to understand and engaging. The labs are incredibly easy, and so are the weekly quizzes. Takes attendance via tophat at the beginning of lectures. Easy A. ",
        "course": "none"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.7,
    "department": "Entomology",
    "firstName": "Peter",
    "id": "VGVhY2hlci0yMjQ5MDM1",
    "lastName": "Piermarini",
    "legacyId": 2249035,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Piermarini genuinely loves teaching Entomology and you can tell. He's very passionate about what he does. The class itself is super easy, and as someone who can't stand bugs, it was super interesting to learn more about them. If you want an easy class, this one is highly recommended! The work is super easy!",
        "course": "ENTMLGY4607"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Take notes on the module material and you'll get an A. The class is well organized and I appreciated the trigger warnings he put on images/videos that were particularly gross/bloody. There's also an opportunity for extra credit if you need it.",
        "course": "ENTMLGY4607"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Tons of reading, but quizzes are open-note. Take good notes and you'll do fine. Great class that will make you look at bugs totally differently. ",
        "course": "ENTMLGY4607"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good professor, easy to access outside class, very approachable",
        "course": "ENTMLGY4607"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "His class was mainly online the time I took it and it was more of him posting the notes and you study independently. Even with that, it was very easy to understand and grasps from the notes he posted. His quizzes are open notes and straight forward and not difficult. At the end of the semester he gave opportunity for extra credit which was dope.",
        "course": "ENTMLGY4607"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Piermarini did an excellent job with this class. The notes take a good bit of time, but everything on the tests are easy to find in the notes. Two easy discussion posts and two research assignments. The information is also super interesting regardless of major. Easy A. I'd recommend this class to anyone!",
        "course": "ENTMLGY4607"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy GE! I was worried about this class because I knew nothing about insects, but because of how organized Professor Piermarini was, entomology became my favorite class. Quiz questions come straight from the notes, you did not have to do any crazy studying for the quiz. I strongly recommend this class, easy A, and super interesting! No final.",
        "course": "ENTMLGY4607"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good at upping your science GPA and the professor and ta turner were helpful whenever i needed it. There's quizzes, discussion boards, and two research projects, all of which aren't very hard if you follow the directions.",
        "course": "ENTMLGY4607"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "This was an online class that I took for my major. You basically just listen to lectures once a week and take a quiz. Besides that there are 2 discussions and 2 &quot;research assignments&quot; that are all very easy if you read the directions. An easy science A, and actually an interesting class.",
        "course": "ENTMLGY4607"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "I got way more out of this class than I expected. Each week is a different species of bug that has impact on animal or human health, and the lectures cover the anatomy of bugs, diseases, and parasites. The quizzes are very easy if you refer to the lectures while taking them. There are no other assignments besides the quizzes. Easy A, and I learned.",
        "course": "ENTMLGY4607"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took an online entomology class for a major elective with Dr. Piermarini (7 quizzes, 2 discussion posts, 2 &quot;research activities). The class was very straightforward and manageable to take with hard science classes and labs! Dr. P seemed very approachable and was very helpful with his weekly announcements and reminders of due dates.",
        "course": "ENTOMOLOGY4607"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lectures were very boring and monotone but you really don't need to watch them in order to do well in the class. The work itself was not too bad... weekly quizzes and some occasional research assignments and discussion posts. Very reasonable",
        "course": "ENTMLGY4607"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "2 credit online entomology class, i would recommend this to anyone. The weekly posts are simple, and even though he says that you have to watch the lectures to do well on the quizzes, I just pull up the accompanying notes and take the quizzes and have yet to not get 100. Easy class, and science GPA. You need to take this class.",
        "course": "ENTMLGY4607"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.8,
    "department": "Entomology",
    "firstName": "David",
    "id": "VGVhY2hlci0xNDQ1ODQ5",
    "lastName": "Shetlar",
    "legacyId": 1445849,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Shetlar is hands down the best professor you will ever have. He breaks difficult material and makes it easy to understand. Lab is mandatory  but lecture is not. I cannot say enough good things about Dr. Shetalr",
        "course": "ENT1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "You would have to be simple not to get an A in this class. He literally gives you the answers to exam questions during the exams. Lab attendance is mandatory, lectures not. Notes are all online. Gives you test questions beforehand. He's an old upbeat  kind of goofy guy. Pretty funny too.",
        "course": "ENT1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is really nice!!!",
        "course": "ENTOM101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "he is awesome and hilarious. answers questions about the test during the test. Labs are interesting and he will have review sessions at any time as long as students are interested. Seriously, take him if you have the chance! No textbook- he puts all lectures on his website. He is tenure so he says and does what he wants. AWESOME",
        "course": "ENT101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very funny, worth going to lecture for humor alone. Lots of wheeling and dealing with tests and quizzes. You will learn alot.",
        "course": "ENT462"
      }
    ],
    "SEI": []
  }
]