[
  {
    "avgDifficulty": 2.8,
    "avgRating": 4,
    "department": "Environment",
    "firstName": "ED",
    "id": "VGVhY2hlci05OTY0Mzk=",
    "lastName": "McCoy",
    "legacyId": 996439,
    "numRatings": 17,
    "summary_comment": "Professor McCoy is known for providing comprehensive resources, including detailed lecture videos and a self-contained PDF textbook, making the class fairly easy to pass. His lectures, while thorough and organized, are often described as dry and monotonous, with some students finding them challenging to stay engaged with unless they are highly invested in the material. Despite this, Professor McCoy is praised for being friendly and helpful, and many students find the class structure clear and consistent, though they suggest enhancing engagement through more interactive teaching methods.",
    "summary_comment_short": "Professor McCoy offers a comprehensive and detailed curriculum, providing extensive lecture videos and supplementary materials such as a self-authored textbook in PDF format. His teaching approach is thorough and structured, though some find his lectures dry and monotonous, preferring to use speed-up features or rely on online resources for engagement.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class online was fairly simple. There are a lot of lecture videos, but I do like how he split them into small part. He was funny at the start of lectures, but if you are not too invested in the material it can be hard to get through lectures. The class is fairly easy. I never had to reach out to him for help.",
        "course": "ENR3000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor McCoy provides you everything you need to do well in Soil Science. The lectures were a bit dry at times, but I would often put them on 1.5x to make them go faster. The textbook is written and provided by Prof. McCoy in PDF form and is very succinct. Lecture slides were a bit wordy, so be sure to highlight/underline what's important.",
        "course": "ENR3000"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "This is a very dry class and the professor is very boring. He is nice and cares about teaching but the material is not exciting and he just reads off the lectures. Weekly online quizzes are a huge to your grade and should be taken seriously with a small group project and a final. Can pass without going to class but every now and then.",
        "course": "ENR3000"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor McCoy is very passionate about what he does, however, he does not bring a lot of energy to the classroom. It was hard to go to his lectures and pay full attention, especially when the content isn't that most fascinating, at least to me. However, I am not someone in a hard science field and I was able to pass and I missed a few lectures.",
        "course": "ENR3000"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lectures were dry because of content and by how he lectured. He has a very monotone voice which tended to drone on for and 1hr and 40 mins rather than including participation. Topics were organized and there was not textbook required but I feel that this class could have been more informative/memorable and exciting with a different teaching style.",
        "course": "ENR3000"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "I only went to the first couple lectures because they were so boring but he also had online video lectures.  Everything was online which was only weekly quizzes that were difficult and a final exam.  Class was cured fairly well.",
        "course": "ENR3000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class is clearly outlined and consistent. Prof is friendly and helpful; communicates well. Teaching strategy is not the most entertaining, but it is thorough. Class and blackboard material are reflective of weekly quizes. Quizes are difficult but not insurmountable. Prepare to read and take notes. Would take again.",
        "course": "ENR3000"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Attendance is not mandatory. There are weekly quizzes over the previous week's lectures/notes that are fairly tough and make up 70% of your grade. The rest is a 5% syllabus quiz (easy) and 25% final which is just over definitions and terms that he gives you a week in advance. All tests are multiple choice & True/False and are online",
        "course": "ENR3000"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "You do not have to go to class since all of the lectures are in a condensed version online. Weekly quizzes are fairly easy if you watch the lecture videos. Some questions are confusing, but he drops the lowest THREE quiz scores. There is only one exam, the final which is online. On top of that, the entire class is curved.",
        "course": "ENR3000"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class is really boring and the professor is even more boring, with his voice. Also there are online quizzes every week which are very difficult, the wording makes it hard to understand what is being asked and the time limit does not give you much time to think about each question. I would not recommend this class to anyone. ",
        "course": "ENR3000"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. McCoy is definitely interested in soil sciences, but his class is excruciatingly boring. His slide by slide lectures are so monotonous that most of the class ends up paying more attention to their phones than him. He knows his stuff and is a really nice guy don't get me wrong, just really un-stimulating.",
        "course": "ENR3000"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. McCoy was a very clear and easy to listen to lecturer. He clearly had a legitimate interest in what he was teaching and that made the incredibly boring subject matter slightly more bearable. Come to class and it should be very easy to leave with an A.",
        "course": "ENR3000"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "The subject matter is incredibly boring, but he is a very good teacher! Super friendly, and loves teaching. The only assignments are weekly quizzed which are on the easier side if you study before them and the final exam is word for word from the review packet.",
        "course": "ENR3000"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's a great lecturer, with a semi interesting class. The class is weighted so that the quizzes are 70% of your final grade. The quizzes are ten Q's online that have to be completed in 12 minutes. This is extremely hard. I've learned nothing. I feel like i'm on Jeopardy. I HATE THIS CLASS.",
        "course": "ENR3000"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professional. Crystal clear. Not the most excting topic, but he is pretty entertaining.",
        "course": "ENR300"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "300.01- Class is pretty boring and he can be rather monotonous.  However, his material is pretty easy to understand and the tests are straightforward.  He is very available to help if needed.",
        "course": "ENR300"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ed is a really good teacher. He tries to make the material as fun as he can. I think he really knows his information. He has been sited several times when it comes to soil mechanics. I would recommend anyone to take him. The class can be boring, but he really gives you a solid foundation If you talk to him and ask questions class is great. Recommen",
        "course": "ENR540"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.8,
    "department": "Environment",
    "firstName": "Stacey",
    "id": "VGVhY2hlci0xMDcwNTg4",
    "lastName": "Fineran",
    "legacyId": 1070588,
    "numRatings": 13,
    "summary_comment": "Professor Fineran is highly regarded for her exceptional teaching and supportive approach, with many students praising her consideration and accessibility. She is described as passionate, inspiring, and easy-going, and is noted for providing ample resources and clear expectations for her courses. However, some students find her lectures overwhelming due to the extensive amount of material covered, which can make note-taking challenging.",
    "summary_comment_short": "Professor Fineran is highly regarded for her exceptional teaching and supportive approach, often described as considerate, inspiring, and passionate about her subject matter. Students appreciate her clear expectations, extensive resources, and willingness to help, though some find her fast-paced lectures challenging without adequate note-taking assistance.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Fineran is one of the nicest professors I've ever had. She really tries to ensure students do well in her class i.e. provides a lot of resources, is accessible via email, is very understanding about deadline extensions. The assignments are pretty straight forward and she's not tough on grading. She's just very considerate and understanding!",
        "course": "ENR5210"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Fineran is the best professor I've ever had. She's truly inspirational and has guided my career path to where I'm at now. Definitely don't miss out on taking her classes and connecting with her outside of class. You'll miss out!",
        "course": "ENR602"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Fineran fits as much material into a lecture as she can. She posts the ppt so you can jot notes on the things she says rather than what is on the slides, and reading the book gives you most of the information on the ppt. She details most if not all of what she expects you to know for exams on study guides so its easy to prepare. Loves to help.",
        "course": "ENR2155"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Fineran is the best teacher I've ever had at OSU. This is the second class I've taken with her and will be taking a third next spring. She is extremely talented and will help her students learn anything they want. She was always helpful and gave me book suggestions to further my interests.",
        "course": "ENR5211"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Awful lecturer - worst I have had. Will fly through up to 60-70 slides in one lecture, all filled with writing. She basically copies the book and pastes it into her lecture slides. Impossible to take notes and does not summarize material. Super boring and hard to sit through.",
        "course": "EARTHSCI2155"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Fineran is an extremely talented lecturer. She has a way of invoking student's emotions but never in a way that overshadows the science of what is going on locally and globally. She is all about presenting both sides of arguments/criticisms & wants you to make judgments for yourself. Her 602 course should be required for ALL envt related majors",
        "course": "ENR601"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Fineran is very passionate about teaching; this passion makes it very easy for her to convey her points, and provide interesting lectures.  She is very easy going and happy to talk with students.  I wish there were more ENR proffs like her!",
        "course": "ENR602"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very passionate about the subject matter, but doesn't push you to agree with her beliefs. Class requires critical thinking. Easy tests.",
        "course": "ENR601"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 2,
        "comment": "seems like she thinks shes teaching middle school. Very, very boring. long homeworks, easy quizes and tests,grades on participation.",
        "course": "ENR155"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Pedantic and ought to be teaching middle school or something. Homework is ridiculously long and really time consuming. Tests are easy. Too bad, this class had potential.",
        "course": "ENR155"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 1,
        "comment": "Very annoying. Takes attendance and doesnt explain things well. Tries to comprehend things for you by stopping videos to explain whats going on. Doesnt realize we are college students who can do it ourselves. Slides are very hard to understand.",
        "course": "ENR155"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 1,
        "comment": "This is one of the most annoying teachers here. She talks to her students like they are idiots or children and will go on and on about totally unrelated things. She takes attendance every day because she knows there's no other way to get people to show up to her class. She basically ruined what could have been an interesting class.",
        "course": "ENR201"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great teacher.  She is extremely interested in what she is teaching.  I would recommend her to anyone.  Her final is comprehensive, but she gives a study guide.  Attendance isn't mandatory but it is helpful if you go.",
        "course": "ENR601"
      }
    ],
    "SEI": [
      {
        "Subject": "ENR",
        "Catalog": "5211",
        "Class Name": "International Environmental Impact Assessment",
        "Class Number": "32372",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "37",
        "Rating": "4.81"
      },
      {
        "Subject": "ENR",
        "Catalog": "5211",
        "Class Name": "International Environmental Impact Assessment",
        "Class Number": "32373",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "6",
        "Rating": "4.83"
      },
      {
        "Subject": "ENR",
        "Catalog": "5210",
        "Class Name": "US Environmental Impact Assessment",
        "Class Number": "27421",
        "Term": "AU 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "13",
        "Rating": "5"
      },
      {
        "Subject": "ENR",
        "Catalog": "5210",
        "Class Name": "US Environmental Impact Assessment",
        "Class Number": "27422",
        "Term": "AU 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "48",
        "Rating": "4.73"
      },
      {
        "Subject": "ENR",
        "Catalog": "5211",
        "Class Name": "International Environmental Impact Assessment",
        "Class Number": "9720",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "34",
        "Rating": "4.53"
      },
      {
        "Subject": "ENR",
        "Catalog": "5211",
        "Class Name": "International Environmental Impact Assessment",
        "Class Number": "9721",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "14",
        "Rating": "4.79"
      },
      {
        "Subject": "ENR",
        "Catalog": "5210",
        "Class Name": "US Environmental Impact Assessment",
        "Class Number": "35047",
        "Term": "AU 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.58"
      },
      {
        "Subject": "ENR",
        "Catalog": "5211",
        "Class Name": "International Environmental Impact Assessment",
        "Class Number": "32628",
        "Term": "SP 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "ENR",
        "Catalog": "5210",
        "Class Name": "US Environmental Impact Assessment",
        "Class Number": "34599",
        "Term": "AU 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "ENR",
        "Catalog": "5211",
        "Class Name": "International Environmental Impact Assessment",
        "Class Number": "33443",
        "Term": "SP 24",
        "College": "Food, Agric & Environ Science",
        "Department": "Sch of Enviro&Natural Res",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      }
    ]
  }
]