[
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.9,
    "department": "Environmental Science",
    "firstName": "Craig",
    "id": "VGVhY2hlci03NzIyNzQ=",
    "lastName": "Davis",
    "legacyId": 772274,
    "numRatings": 10,
    "summary_comment": "Professor Davis is known for being a passionate and engaging lecturer who provides extensive information through his detailed PowerPoint presentations. However, students find his exams challenging due to the vast amount of material covered and the complexity of multiple-choice questions, which often include numerous options. Despite the difficulty, many appreciate his enthusiasm and the wealth of information provided.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "very helpful but quizz is very hard",
        "course": "ENR201"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Interesting lectures, but he gives you a list of over 100 words over 3-4 chapters to study for come exam time and he doesn't stress important key info. It's all in the powerpoints, but there's WAY too much information for a 15 T/F & 15 MCQ exam! And some MCQ's range from a-h. Very easy to miss questions, no matter how much you study. Not worth it!",
        "course": "ENR201"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Love this guy! except for his midterms where the multiple choices range from a...b...c,d,e,f,g,h,i but he is great",
        "course": "ENR201"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Although he hits you with a lot of information right off the bat, Prof. Davis is sure to give you everything you need to study. Every lecture is saved in a powerpoint online and easy to access and study from. You can tell he loves science with a passion, although this sometimes causes him to go off on tangents. Overall a good guy and a great class.",
        "course": "ENR201"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Craig B. Davis is a ballin' old man with awesome stories. He says 'science' like 25-30 times/lecture. I used to keep tally in my notebook. Cool dude. Tests/Quizzes might seem a little tricky, but all of the information is in the powerpoint slides.  It's just A LOT of information.",
        "course": "ENR201"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interesting history has been all over the world and has some great stories.  Class is interesting but covers a TON of information which makes the exams pretty difficult but not hard to study for.",
        "course": "ENR201"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "he is a very interesting person and keeps the class lively.",
        "course": "ENR201"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is very good at giving a lot of information. So much to the point you don't know where to focus for studying. He doesn't stress on important details. He also gives you about 100 terms he wants you to know for the exam. The first couple of quizzes I have taken were fill in the blank. That was a little difficult. Although he is a nice professor.",
        "course": "ENR201"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "The tests and quizes are multiple choice and the material is covered in lecture.  Lecture attendance is not mandatory but it definitely helps.  He is a very interesting lecturer and will usually keep your attention until the lecture is over.",
        "course": "ENR201"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Let me start with the positive, his lectures are interesting.  When it comes to tests, he has multiple choice consisting of A,B,C,D,E,F,G,H, and somtimes I and J too.  He tests on things that he doesn't stress important in the lecture so take thorough notes.  The quizes are also hard so you have to study.  Would not recoomend.",
        "course": "NRE201"
      }
    ],
    "SEI": []
  }
]