[
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.5,
    "department": "Ethnic Studies",
    "firstName": "Adena",
    "id": "VGVhY2hlci0zMzgxNDY=",
    "lastName": "Tanenbaum",
    "legacyId": 338146,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was very kind but expected you to know what she was talking about when she said in the beginning we didn't need to. There are a LOT of readings but overall the coursework was easy. Had 1 paper, 3 in-class writing assignments, and a few film reactions. Not horrible. You can tell she is very enthusiastic about what she is teaching.",
        "course": "HEBREW2241"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Amazing woman, be prepared to read the assigned readings. Although the readings are mandatory if you don't read them once in awhile it's not life or death, but strongly advised bc it helps w the final and makes class more enjoyable. No tests or quizzes just some homework, oral presentation, participation, and final count towards your final grade",
        "course": "HEBREW2241"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Several hw assignments (250 words), a presentation, an oral reading summary, and a final. Readings are definitely encouraged, and attendance/participation is required. Enjoyed the material and I respected her. Does not have a grade button, emailed a letter grade for our pres., and didn't send a final grade (had to look it up on buckeyelink).",
        "course": "HEB241"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "This professor seemed to have a lot of interest and knowledge about the subject, but I just felt she wasn't ever well prepared for class and never showed up on time. I also felt a knowledge gap from most of the other students who were Jewish. I felt like they had prior knowledge that unfairly worked in their favor. I didn't like the class.",
        "course": "HEBREW2241H"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Tanenbaum is an amazing professor who really cares about her students. I didn't even really care about Israel or Jewish history but she makes the class very interesting and enjoyable. The readings can be really interesting but you don't really need to read them to get an A in the class. I highly recommend Professor Tanenbaum.",
        "course": "HEB254H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was a wonderful class, and Professor Tanenbaum made it very enjoyable. It's not a blow-off class, but if you keep up on the readings it definitely is not difficult.",
        "course": "HEBH241"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "I had Adena for two classes: Hebrew 241 and Hebrew 420 both classes were very interesting especially Hebrew 420. She is a very nice professor and a very good teacher. She can however be monotonous at times. Her grading can also be hard especially in regards to her upper levels classes.",
        "course": "HEB241"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was an extremely nice and forgiving professor, I highly recommend this as a humanity and world interest class for freshman looking to fulfill requirements. Not an academically demanding class but very intellectually involving and fun to learn about.",
        "course": "HUM241"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome professor. Daily homework of a 250 word response. 10 page term paper - if you do the work and it makes sense you'll get an A. Final with an indepth study guide. Don't bother doing the readings - the final study guide tells you exactly what you need to know. Amazing professor! She's very helpful. I didn't think I'd like the class, but I did!",
        "course": "HEBRH241"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor. She is clear, intelligent, and interested in the material. You watch lots of movies and she gives thorough study guides for both the midterm and final. She does take attendance so going to class is a must but it's also very helpful. Loves when students participate. If you do the work you can't not get an A- at the very least.",
        "course": "HEBRE245"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ms. Tanenbaum is a great prof. She give detailed notes on the readings, so you never have to read. Her tests are straight forward and well explained. You can't go wrong.",
        "course": "HEB245"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Tanenbaum is a great professor.  Although she is monotoned and monotonous at times, she has a true passion for the material she teaches.  Tanenbaum also helps students outside of their studies.  She will help her Jewish students with roommates and questions they have about their religion.  Her students should definitely get to know her.",
        "course": "HEB241"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very fair class. Term paper is a pain, but you can learn a lot from it. Don't bother reading the texts.",
        "course": "HEBREWH241"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy to understand, she really knows what she's talking about. The homework is very easy and if you participate in class, you really can't go wrong on the one project, the quizzes, or the exam. Very helpful and easy! Definitely reccomended.",
        "course": "HEBREW620"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very interesting class.  Had no prior knowledge of Israeli cutlure and learned a lot.  Ten page paper, in class power point presentation, and a final.  Daily homework (that was very easy).  This was a very worthwhile class, especially for those who know nothing on the topic.  I would highly recommend this class!",
        "course": "HEBREWH241"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was very interesting.  She was extremely intelligent.  I really enjoyed her teaching style.",
        "course": "HEBREW241"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "clear, articulate, likes classroom discussion.",
        "course": "HEB241"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.7,
    "department": "Ethnic Studies",
    "firstName": "Daniel",
    "id": "VGVhY2hlci01MzY2ODk=",
    "lastName": "Frank",
    "legacyId": 536689,
    "numRatings": 32,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Frank is very caring and extremely passionate about teaching. There is obviously a lot of reading and biweekly quizzes, but he gives you all of the questions beforehand. There is only one graded 10-page paper, but he grades very leniently. Expect a lot of pointless memorization, but otherwise a fairly easy and interesting class.",
        "course": "HEB2700H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Frank is extremely caring. I had emergencies come up and he worked with me through everything. All the assignments are easy b/c he provides a lot of help. Every question that he will possibly ask on an exam or quiz he gives to you before hand. Do the pre lecture questions and you will be fine. The class was very manageable. ",
        "course": "HEB2700H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Frank is very kind and cares about his students along with what he is teaching. I enjoy attending class and learning from him. Being in the Jewish History class i felt a little lost coming in due to my lack of knowledge but Dr. Frank helped me with everything. His content is easy to follow as well.",
        "course": "HISTORY2450"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I greatly enjoyed Dr. Frank. He is very passionate about what he was teaching about and tried to get his students involved. He had very few assignments and his lectures weren't vital to the assignments. He would take awhile to grade assignments, but nothing was too difficult anyways.",
        "course": "HEBREW2700"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "he is a good person and good professor",
        "course": "HEB2700"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very knowledgeable about Jewish history and the Bible but his lectures do get boring sometimes. There's usually a writing assignment every week, but they're pretty easy. Nice guy, old fashioned teaching. Super slow grader.",
        "course": "HISTORY2450"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Frank was so passionate about the Hebrew Bible and he made class as engaging as possible although it was online. I really appreciated how patient he was with everybody who could not simply read a syllabus even though I was so annoyed with them as I am sure he would be too. He will call on you so make sure you do the readings, the Bible is free.",
        "course": "HEB2700"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "The kindest professor I've ever had. He is super passionate about the material and is always willing to help. Classes were engaging. Not a very difficult class but you will learn a lot if you attend and do the readings.",
        "course": "HEB2700"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is such a friendly and caring professor! He is so passionate about what he teaches and creates a great learning environment for students. The class has a decent amount of writing involved, but as long as you go to class and pay attention, you will be fine. He gives practice questions before exams, so definitely study those.",
        "course": "JEWSHST2700H"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors at Ohio State! His class may have been the only one I actually looked forward to going to. He knows everything about the Bible and is so passionate about his work. Make sure you keep up with the guided questions and study for a few minutes before his weekly quiz and you won't miss a point. Tests are not difficult. 11/10 !",
        "course": "HEB2700"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Daniel Frank is amazing! He's easily one of the best profs I've had at OSU thus far. The content is really interesting and it's obvious that he's spent years studying the material. He literally has the entire Old Testament memorized in Hebrew and can recite it at the drop of a hat. I really wish he taught other courses about the Bible. 10/10 Dude.",
        "course": "HEB2700"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Frank is my favorite professor that I've had at Ohio State! He is so knowledgable about the Bible and genuinely cares about his students. I didn't skip any classes but I know people who barely showed up and will probably still get an A, but this is honestly a class that I didn't want to skip. If you need a GE credit filled take his class!",
        "course": "HEB2700"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very passionate about teaching and the subject.",
        "course": "HISTORY2450"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Frank is probably the best professor I've ever had at OSU. He's super knowledgeable. You can ask almost any question you can think of pertaining to Judaism and its history and he can give you the answer. He's friendly, funny, and honestly just a great person. If you have a serious interest in the subject material, you'll love his classes.",
        "course": "HEB2700H"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is not difficult but the content can be very boring by those not interested in it. It goes without saying but if you don't have any interest in Medieval Jewry this isn't the class for you. Prof. Frank is fantastic and will work with you. The quizzes and exams are not difficult and paying attention/some due diligence will get you an A.",
        "course": "MJE2516"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Frank is super knowledgeable - if you are sincerely interested in learning about what he's teaching, you'll love him and his lectures. If you're just taking his class for GEC credit, it'll be a struggle to sit through lecture. He dumps a lot of information on you, but he's really understanding and his class is deceptively easy.",
        "course": "HISTORY2450"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Nothing much to say. Must choose him for medieval history!",
        "course": "HEBREW2216"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Frank is the best teacher I have ever met in OSU. He knows the Jewish history very well and is obviously over qualified of his position. Usually he gives a study guide a week before exams. If you have any questions about the study guide he is willing to answer. Tests are just a way to let you know about the material well. It's easy to get A.",
        "course": "MJE2516"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Phenomenal professor. He is clearly overqualified for his position, and should be teaching graduate classes. However, it was one of the most enjoyable classes I have ever taken.",
        "course": "HEB2700"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 2,
        "comment": "Pretty easy class, but my lord, this man is more boring than watching paint dry. Recommendation- Bring your laptop to class. He gives you study guides for the exams so you know everything that is going to be on it. Gives the quiz questions before quizzes.",
        "course": "HIST330"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sometimes sitting through the lectures was brutal, but Professor Frank is one of the nicest professors in the university. His knowledge of Judaism, and its' history, is unreal. Attendance isn't mandatory as he usually provides a study sheet for examinations.",
        "course": "HIST330"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "Frank is such a great guy. Is passionate about his knowledge of Judaism and it's history. The exams are very fair and are really easy to prepare for. Lectures get lengthy but all in all not a bad class!",
        "course": "JEWST201"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took this class for an easy GEC, which it was. Professor Frank is really nice and his exams are very fair - if you prepare you will get an A. I took this class with no knowledge about Judaism and I learned a lot. Definitely take Jewish Studies 201 with Frank!",
        "course": "JSTD201"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took this class to fulfill a GEC and thought it might be interesting.  Lectures were a bit unorganized and not really necessary for exams.  Dr. Frank is a great teacher and a fair grader that learned everyone's names and fast but I found it difficult to pay attention but that may be because I wasn't interested in the subject.",
        "course": "HIST330"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best teacher i have ever had.He is very interested in teaching and wants his students to learn. He learned everybodys name by the third class. I highly recommend him and can't say enough nice things about him.",
        "course": "HIST330"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 1,
        "comment": "I really liked Dr. Frank.  He is one of the few proffs that has the students' best interest in mind.  His classes can get a little bit boring, but they are not difficult.  Take notes and read all the assignments and the class will be a breeze.",
        "course": "HEB216"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Frank learned our names right away and was very fair and understanding. He is very knowledgeable and really cared about the class. He was also very helpful if I needed. A lot of reading for this class!!!",
        "course": "HEB216"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Frank was an amazing professor.  It is true that he is 10 minutes late to every class but who really cares.  I still learned a tremendous amount of information.  He is very knowledgeable and has a deep passion for what he does.  He is also very funny but its a  more dry and sarcastic humor so you have to like that.Best teacher I've had at OSU.",
        "course": "HEB216"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Frank is the best. I learned so much from him and I found his knowledge and passion so fascinating. An absolute pleasure to be in his class, as he is a fair and funny man. I recommend him highly.",
        "course": "HIST330"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 3,
        "comment": "everytime i walk into class i wanna kill myself.  this guy speaks in monotone, shows up 10 minutes late everyday, has no personality, and in the middle of lectures chages the subject so many times that he is impossible to follow.  worst professor i have had in 3 years at ohio state.",
        "course": "HISTORY33001"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Frank is an extremely good teacher and his lectures were always very interesting. He knows a tremendous amount of information on the subject and was also very funny. Gets along with the students very well. He knew me by name alhtough I had never really talked to him.",
        "course": "JEWISHSTD201"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was the easiest class I've ever taken at OSU and Dr. Frank is a great guy- he even remembered my name even though I never went to class. Very easy class and extremely nice guy.",
        "course": "HEB370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.2,
    "department": "Ethnic Studies",
    "firstName": "Marjorie",
    "id": "VGVhY2hlci02MjQwMDI=",
    "lastName": "Chan",
    "legacyId": 624002,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "A few long papers and short presentations, but otherwise the assignments are just watching operas. As long as you put in effort you'll get an A. She's extremely nice and wants you to succeed! She says that students should uplift each other without competition, and her classroom definitely has that friendly vibe.",
        "course": "CHI5474"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "So many long papers. We have to submit an 8 pages paper every 2 to 3 weeks. She's nice and caring, replies to emails really fast. However, I don't want to take her course again. Grading too slow, when we're about to submit the third paper, she hasn't even graded the first one. This is awful because you don't know what you will get.",
        "course": "E5383"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "I don't think she is meant to be a professor. Expect to do all of the reading on your own because she doesn't teach the material. There are so many research papers in such a short amount of time. Don't take her class because you will be so bored and you will have to learn everything on our own.",
        "course": "CHI5474"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "So many readings and she doesn't teach the information. Read outside of class and discuss during class. Attendance is mandatory, but class is basically useless. So many papers with so little time. She thinks they are short, but they all at least 8 pages each. Hard to speak up or even ask Qs in class b/c she loves the sound of her own voice.",
        "course": "CHI231"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wonderful, so smart, so caring, truly gives you all the attention and help possible. Would definitely recommend this class to anyone - I didn't quite like the content but she made it interesting. if you work hard, you are guaranteed an A",
        "course": "CHI5474"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Extremely knowledgeable and very easy to get along with and work with.  She will help extensively with homework and final projects.  You do have to actually do work and show up to class.  Takes a personal interest in her students.",
        "course": "CHI680"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Her lecture notes and excessive videos are fun but not too informative.  Make sure you read all the assignments, attend ALL classes and take the final project seriously.  Even if you don't put forth a ton of effort outside of class, just make sure you think she's funny and act interested.  It got me an A that didn't add up by the point system lol.",
        "course": "CHI231"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Terrible. Lectures are course notes, but requires attendance. Laughs too much. Takes excessively long to hand back quizzes, assignments, etc. Gives you no time to do big assignments. Would not recommend to anyone.",
        "course": "CH231"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.6,
    "department": "Ethnic Studies",
    "firstName": "Rick",
    "id": "VGVhY2hlci02Mjc5NzQ=",
    "lastName": "Livingston",
    "legacyId": 627974,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Rick encourages and listens to constructive feedback, which is very hard to find in profs. There are a lot of readings, but you are not quizzed on them. I recommend at least skimming through the readings for you do not sit in awkward silence. He is personable, and sometimes passive aggressive, but understandable. ",
        "course": "COMPSTD2420"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "The General Education Launch curriculum leaves a lot to be desired, but I thought Dr. Livingston did an excellent job trying to connect with each of us and make us feel comfortable, welcomed, and heard. A lot of the assignments felt like filler, but again, that would be attributed to the curriculum. He offered good feedback and chances to improve.",
        "course": "GENED1201"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "Rick is a super nice guy but very hard to follow his long lectures. He is a tough grader who expects a lot out of students in a 1000 level class, and we were assigned lots of papers and readings throughout the semester that were near impossible to complete",
        "course": "COMPSTD1100H"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Livingston was very kind and was definitely very passionate about the topics and wanted to make us learn but the delivery was very poor. It was only graded on six annotations and three papers of which were very subjective and took forever to get a grade back on. He was very disorganized and didn't seem to know how to use Carmen well.",
        "course": "COMPSTD1100H"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Livingston is a great guy who loves his job, but he is very confusing and hard to learn from. He gives out a lot of reading but you don't have to do most of it since he doesn't test over it. Most of your grade is decided on big projects so if you mess up 1 your grade drops. He gives extra credit but it is a lot of work for only a few points",
        "course": "COMPSTD2420"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Did not expect to write 4-5 page papers. The lectures are very boring and hard to stay focused. Prof Livingston is nice, just very hard to follow.",
        "course": "COMPSTD2420"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Never take any of his classes. By far the worst professor I've ever had. He didn't grade over half of my assignments, dating as far back as the beginning of the semester (including the final). He then uploaded my final grade and when I sent him 5+ emails about grading my stuff, he replied with &quot;sorry you aren't pleased&quot; Save yourself the headache.",
        "course": "COMPSTD2300"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "He was terrible at explaining assignments and proceeded to grade VERY tough. No assignment exceeds 15 points, so if you mess up a paper, your grade is doomed. Grades for the semester are due tomorrow, and he has at least half a semester worth of grades to put in still. Ridiculous.",
        "course": "COMPSTD2301"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "All books are required, as well as a membership to GFC, although they are barely used for class. He was very unorganized and gave vague prompts for discussions. Regular readings for class posted on Carmen. 95% of the grades come from the copious amounts of papers you must write but he is an easy grader.",
        "course": "CMPST3607"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "All books are required, but barely discussed in class then reappear on the midtermfinal. Lectures usually are only tangentially related to the readings, so you need to do them to actually write the essays. 35 were no on sparknotes or other review websites so you can't rely on that to bail you out.",
        "course": "CMPSTD2301"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is extremely boring a vague during lecture. You should plan on bringing some coffee.",
        "course": "2301"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "not a bad choice for 597 GEC.lot of reading, but most assignments are interesting reads about globalization.lots of discussion in class.attendance a must. but overall not too difficult. GRADED: 2 papers 5pg ea and a final (choice of presentation or 12 pg paper). i strongly suggest the presentation.(FYI:his name is robert eric when registering)",
        "course": "COMST597"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 3,
        "comment": "Terrible class.  First, he requires that you buy 6 different books and read them all, however he hardly goes over them in class.  I read about 20 pages all quarter and still did fine.  He tends to jump around topics every class, so its hard to see what he's trying to get at.  Also, there's a lot of debate which I didn't like.  Don't take this class",
        "course": "CSTD306"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of reading, so be prepared for that. He is a competent teacher, knows what he's talking about and is interested in his field.",
        "course": "CS273"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 3,
        "comment": "a lot of reading in this class. six novels. doesn't grade too hard. only take this class if you like to read novels",
        "course": "CMPST267"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 3,
        "comment": "One of the most frustrating classes I've taken.",
        "course": "COMST651"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's passionate about what he teaches, although the readings are timely and a tad bit confusing.  Class is primarily lecture, but he does get students involved by asking questions and wanting our input.  He's really nice, so it's tough to say anything bad about the class.  It's lengthy, yet somewhat fun!",
        "course": "COMP274"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "Class will help you analyze literature, but it is frustrating in the process. He is passionate about what he teaches, but the class is boring as all get out.",
        "course": "COMPSTD273"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.4,
    "department": "Ethnic Studies",
    "firstName": "Ranya",
    "id": "VGVhY2hlci04MjQ0ODY=",
    "lastName": "Tabbah",
    "legacyId": 824486,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Easy Easy Easy.  Going to class is pointless except for attendence purposes.  She is respectful of all cultures, however Arab students in the class are not.  It makes it tough to stomach, but if you want an A, just put up with them hating America.",
        "course": "ARAB241"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. Tabbah is the VERY BEST...no joke!!! She's so helpful and doesn't want anyone to get offended...very respectful of all cultures. She gives out review sheets for every exam --- exam's based on only that material! You just watch arab films...LOVELY class..highly recommend it! plus late work is accepted & u learn a lot! A+++",
        "course": "ARABI241"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good professor.  Class is well organized and not that difficult as long as you get an A. You must be open minded as an American taking this class because some issues can be a little angering, 9/11, etc--but Tabbah does a good job with the class.  Movies are good, only problem w/ class is that the textbook is $80 and required... Take this prof!",
        "course": "ARB241"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "She said that she is ARAB but she dose not know anything about the Arabic cultures or customs.\r Easy to aggregate her in the class, cannot answer complete any question",
        "course": "ASECT"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "The Class has a midterm and an exam and a group presentation.  Most people do well on all three. we watched some interesting films. i reccomend this class, and take it with this professor. She's cool.",
        "course": "ARBIC241"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was great. this teacher was great. wish i could take it again.",
        "course": "ARABI241"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I TOOK THIS CLASS BECAUSE I SEE AND HEAR SO MUCH ABOUT THE ARAB WORLD THAT I THINK IT IS IMPORTANT TO UNDERSTAND ITS CULTURES. IT HELPED. I LEARNED A LOT. THE PROFESSOR, RANYA TABBAH, IS NICE, SMART, AND HELPFUL.",
        "course": "ARAB241"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I LOVED this class. I always hear about the Arab world on TV and see it in Movies.. so i wanted to Know the truth about its cultures. This class totally helped me understand just that.  Mrs. Tabbah Is a very kind and helpful..",
        "course": "ARAB241"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ranya Tabbah is the sweetest professor i've ever met. she is kind to all her students.. even the ones that are mean to her.. take the class if u want to learn a lot. because u will. don't take it if u want to just arguee the entire time.. overall, it's a really great class. i reccommend big time!",
        "course": "ARBIC241"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was my favorite class and teacher that I have had in a long time at Ohio State. Ranya is a truly wonderful woman and if you don’t have any idea of middle east or Arab countries culture then definitely take this class. She enlightens you on all aspects of the Arab world. There was one negative Nancy in our class but everyone just had great disc",
        "course": "ARABI240"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "RANYA IS TOTALLY THE BEST!!!! She is SOOO caring and sweet.. i wish i could take her class twice... if u want to learn about the arbic cultures, she is the best, most relieable source.. i totally reccommend her to anyone!!!!!",
        "course": "ARBIC241"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Tabbah was very helpful. I came into the class wanting to learn about Islam and the Arab World, something I didn't have much knowledge of.  Ranya was very kind to us all, she explains things and answers tough questions very well. Sometimes, people in the class are rude/insensitive, but Ranya handles it well.. She is a great teacher.",
        "course": "ARBIC241"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Tabbah is not a teacher you want. If you go with her views about arabs then you will get the A.  If you dont want to listen to the class lecture about how bad America sucks then do not take the class. the material is easy there is a midterm and final and there is a lot of work to be done but if you just kiss butt you will get the A.",
        "course": "ARABI241"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "loved this class! prof. tabbah really cares about the students and makes sure we really learn what she is teaching. class is long but tests are easy, readings are easy, presentations are fine, and the papers really are not bad at all! A+++ teacher",
        "course": "ARABI241"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy and fun class.  Class is a open discussion class and there are only 2-3 lectures the entire quarter.  No midterm, very easy final.  2 group presentations are required but nothing to sweat about because they are actually on interesting topics.  Definatly recommend this prof!",
        "course": "ARAB241"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "Its hard to rate this teacher because she is so easy.  Extra credit is given on every assignment.  The final is a joke; no midterms.",
        "course": "ARABIC241"
      }
    ],
    "SEI": []
  }
]