[
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Film",
    "firstName": "Hannah",
    "id": "VGVhY2hlci0yNzc0MDAw",
    "lastName": "Segrave",
    "legacyId": 2774000,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "She was a harsher grader than other Italian professors and graded you on your written homework even though the syllabus said that the written homework was graded on completion. \nHowever, she was kind and helped when I was confused, and as long as you put effort into the class you should be fine.",
        "course": "ITALIAN1102"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "The class itself is really straightforward but Hannah is a bit condescending, especially about pronunciation. She also grades much more harshly than other italian professors, which I dont think is fair considering the course should be standardized. Also did not ever answer emails in a timely manner. Not that bad that you should switch out though.",
        "course": "ITALIAN1102"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "WORST PROFESSOR I HAVE EVER HAD. She genuinely does not teach anything she just expects you to teach yourself the material using the textbook and come to class knowing it already. She doesnt use notes. Had over 3 hours of homework a night. Do not ever take her for anything or you will cry I promise. She should not be allowed to teach ever again.",
        "course": "ITALIAN1102"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "Mafia movies is a lot of work but the content can be very fun. However, this TA is hardcore. Very dismissive and distant to us students wish I had a TA that felt human. Attendance is a grade and if you do something she doesn't like you will hear about it.",
        "course": "ITALIAN2055"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 5,
    "department": "Film",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yMjQwODMx",
    "lastName": "Jeansonne",
    "legacyId": 2240831,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I have ever had. If you do all the classwork plus a couple of \"explorations\" as he calls them, it is an easy A. If you need to miss a class you can join a live stream on discord. There are no tests, just many short responses(200-400 words). ",
        "course": "IHSS1560"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. J is one of the nicest professors I've ever had. You can really tell how much he cares for his students, especially during the online semester. His class was fairly easy, and the content we covered in his course was super interesting as well. There is a textbook for the class that we used, but he posts pdfs of everything we need",
        "course": "IHSS1560"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great class and great professor. He clearly cared about what he was teaching, and made the class super interesting. He assigned a little more work than i expected for a criticizing tv class, but it was very do-able - he graded easily and allowed revisions on papers after he graded them.",
        "course": "ARTEDU2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He actually gets to know his students. He memorized all of our names by the third class. You do have to put in some effort for papers ect., but he gives you plenty of time and you actually learn something in his class.",
        "course": "ARTEDUC2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Christopher Jeansonne is honestly one of the best professors I have had. He is very caring for his students and will openly listen to anything whether it be related to the course or not. I used him as a resource for a project outside the class and he was very helpful",
        "course": "FILMSTD2271"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Film",
    "firstName": "David",
    "id": "VGVhY2hlci0yNzg2MzI5",
    "lastName": "Burkman",
    "legacyId": 2786329,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "A professor I will remember for the rest of my life! He is extremely knowledgeable in film production and will never shy away from helping and guiding students who seek his direction. He keeps it real at all times and is passionate about bringing out your best potential. David is one of the best Professor's OSU has to offer!",
        "course": "MVNGIMG2202"
      }
    ],
    "SEI": []
  }
]