[
  {
    "avgDifficulty": 4.2,
    "avgRating": 2.6,
    "department": "Food, Agriculture & Bio Eng",
    "firstName": "Michael",
    "id": "VGVhY2hlci01NzMwNDA=",
    "lastName": "Lichtensteiger",
    "legacyId": 573040,
    "numRatings": 36,
    "summary_comment": "Professor Lichtensteiger is widely regarded as a poor instructor, known for his disorganization, lack of clear explanations, and strict grading policies. Students find his classes extremely stressful due to the heavy workload, including extensive homework and lab reports, and the requirement for all work to be done on paper. The professor is criticized for being unresponsive to student feedback and using outdated teaching methods, such as charging $40 for non-helpful printed notes.",
    "summary_comment_short": "Professor Lichtensteiger is widely regarded as a poor instructor, known for being disorganized, unhelpful, and condescending. Students find his classes extremely stressful due to the excessive amount of homework and lab work, often spending multiple hours on assignments while receiving minimal guidance or feedback.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lich is a terrible professor. He sucks at explaining things and is constantly disorganized. You will spend hours on homework and lab reports. He provides very little explanation for assignments but will take off points for every little thing. All work and notes are on paper. You have to pay $40 for printed out notes that aren't even helpful. ",
        "course": "FABE3150"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "All of the bad reviews are accurate. Unclear what is happening at any given time. Unsure what I was supposed to have learned. Unfortunately you may have to take him for 3150, 5160, and now maybe Thermodynamics. The TA, Matt Herkins, is VERY rude and unhelpful. Do not take.",
        "course": "FABE3150"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lecture material, homework, labs and tests are all completely out of sync. Often, the material on the HW is never even brought up in class at all. 85% of the time is spent on HW and labs which makes up like 30% of the grade. The majority of the class is based on 3 exams. Overall, the class is really stressful.",
        "course": "FABE5160"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lich's classes suck... there's no other way to put it. He is so unorganized, all assignments are done on paper and turned in in person. Labs were written to do as partners and since COVID he insists that they can only be done individually. He's not open to suggestion. There's no reason most FABEs need to take this class. My advice is change majors.",
        "course": "FABE5160"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Lichtensteiger has gone yet another semester without reading his SEI's it seems. This man has not adapted since the early 90s and continues to make students do their work all on paper with no online submission available. His homeworks are still near impossible and incredibly long. His note packet that could have been added to carmen is $40.",
        "course": "FABE5160"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "This is the worst I've ever taken in my college career. The professor is absolutely terrible. His lecture videos are useless and extra long. He is horrible at explaining the subject matters. When asked a question he is very condescending and rude. He also assigns a ridiculous amount of homework.",
        "course": "FABE3150"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "The actual worst class and worst professor I have ever had. He makes us watch up to 8 hours of videos on top of scheduled class and each homework takes about 9-12 hours to complete well-and he gives 2-3 a week. He also can be very condescending and unhelpful overall. He also does not explain labs well at all and its all on your own for 3 hours.",
        "course": "FABE3150"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class literally gave me depression, would stay far away from it if I could. Poor explanation during lectures result in lab reports and homework to be close to impossible.",
        "course": "FABE5160"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst Class I have ever taken at OSU.",
        "course": "FABE3150"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 4,
        "comment": "Many people are intimidated by Lich, but he is approachable; cares about the students and the program. The material is useful and the labs are applicable. Copying HW will result in a poor exam score.",
        "course": "FABE5160"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "LOTS of HW and reports (not heavily weighted). 5160 requires less work compared to 3150. He's extremely boring during lecture. His notes are useless, and he spends SO much time explaining lab and it doesn't even help. He uses very useless old references (Doebelin). He curves his classes which is why I'm passing (&amp; I always did better than average).",
        "course": "FABE3150"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Probably the best professor in this department. The class could be challenging. But it's easy if you take good notes and do all the homework by yourself.",
        "course": "FABE5160"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Lichts a great guy, but he is getting a little old. Really cares about his students, and pushes them to do well. If you cheat and copy your way through the homework, you will have a difficult time, however, if you understand the homework, the exams are very similar. Pay attention and do the work, its an engineering course it should be difficult.",
        "course": "FABE5160"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "By far the worst professor I've had here at OSU.  He has no consideration for other peoples time.  He's constantly late to class/lab and has the most monotonous and boring lectures.  You'll spend hours on the homework and labs (which take about 13+ pages each to complete) for only 15% of your overall grade.  Make sure you have friends in the class.",
        "course": "FABE3150"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible class, terrible professor. Doesn't look up from papers when lecturing. Reads straight from the notes. Terrible at explaining concepts. Long assignments. Assignments one after another.",
        "course": "FABE3150"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lichtensteiger is by far the worst professor I've ever had at OSU.  He's not mean or aggressive like your stereotypical \"bad professor\"- he just does not care and is totally out of touch with the students.  He hands out mountains of homework, and his exams suck.  If you don't have good friends in this class, you will have one heck of a hard time.",
        "course": "FABE5160"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 5,
        "comment": "This class is so dry. He is a nice fellow, but assigns way too much homework and has unrealistic expectations of students. Exams and homework are very hard and time consuming to complete, 70% of the class is lost at any given time.",
        "course": "FABE3150"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "Get ready to work to pass this class! Lots of homework and lab reports (that's really the only mandatory attendance). Dr. Lichtensteiger will help if you reach out; however, he expects you to try first. He thinks the class is very manageable, so be prepared for his confusion at your ineptness.",
        "course": "FABE5160"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lots of Homework, 2-3 assignmetns a week, and of course they are 10 - 30 pages an assignment when complete! But he is always willing to help, though getting helpful answers out of him is like pulling teeth!",
        "course": "FABE3150"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "During this course, you will lose track of time as entire days pass by in the window-less prison cell known as the computer lab. Be sure to take your vitamins to compensate for depleted vitamin D levels, because you will never see the light of day. Your only hope is that his desire to break you dwindles with his toes. -1 last yr, things improved. ",
        "course": "FABE5160"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 3,
        "comment": "He gives WAYY too much homework. You seriously have no time for any other courses. If you  have questions, he can be pretty helpful, but he knows the material too well to teach it thoroughly in lecture. Overall, not a bad class and not too hard, just WAYYYYYYYYY too much homework and outside work.",
        "course": "FABE3150"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "Unorganized wihen it comes to labs but gives a lot a helpful examples for homeworks and quizzes.",
        "course": "ASM300"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 5,
        "comment": "nice fellow not a fun class at all !!!",
        "course": "FABE525"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "Prof had no clue about the subject matter and made it a pointless course.",
        "course": "ASM580"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "Great guy, really helpful if you ask. However, he knows material too well and will fly through it without stopping or explaining steps. You learn how to learn on your own in his classes. Go to his office hours, ask questions, don't wait until the day before HW is due to start it. If you do that, you will do fine.",
        "course": "FABE425"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent professor.  Actually cares how well the students understand the material.  Would definately take one of his classes again",
        "course": "ME410"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very nice guy. Quizzes are not tough as long as you UNDERSTAND the material, not just memorizing it. Has the most productive office hours of any prof. Not much of a curve though at the end.",
        "course": "ME410"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is very willing to help out the students. He is very understanding of the fact that you have other classes. Attend lectures because he gives occasional pop quizzes. Replaced midterms with the weekly quizzes which weren't bad if you did the homework, which was long at times, but by the end, you understand the concepts better. Recitation helpful.",
        "course": "ME410"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great teacher, just a hard class.",
        "course": "ME410"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "too much info for a 3 hr class, flies though examples, leaving you on you own for the homework and quizzes.",
        "course": "ASM300AND301"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 4,
        "comment": "Too much homework, but he solve several problems in class or recitation, if you ask. Furthermore, he is very nice and open to help students in any way he can. Quizes are not easy, but he will give extra credit if too many fail.",
        "course": "MECH410"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 3,
        "comment": "hes been eaching this stuff forever and knows the courses but doesnt necessarily know the material.... blows through everything and leaves pople stumped",
        "course": "FABE325"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 4,
        "comment": "Gives a very unreasonable amount of homework. Weekly quizzes usually difficult, although they replace midterms.  We were allowed to drop up to 3 of the quizzes and add more weight to the final if we chose.",
        "course": "ME410"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 3,
        "comment": "Lots of homework due every week.  But no midterms just a weekly quiz which was nice.  Good course but didn't explain topics well",
        "course": "ME410"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 4,
        "comment": "skips ahead, WAY too much homework. WAY too much time for a 4 hour class",
        "course": "MECHENG410"
      },
      {
        "index": 36,
        "rating": 1,
        "difficulty": 3,
        "comment": "He very obviously knows and understands the material and is a very nice man, but isn't very good at explaining the information.  He tends to skip ahead and assume that we already know whatever steps we had skipped.  Very time consuming class for only 3 credit hours.",
        "course": "ASM300"
      }
    ],
    "SEI": [
      {
        "Subject": "AGSYSMT",
        "Catalog": "2310",
        "Class Name": "Electrical Power for Agricultural and Residential Applications",
        "Class Number": "30822",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "1.77"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "3330",
        "Class Name": "Grain Handling, Drying, and Milling",
        "Class Number": "32279",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "2.75"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "2310",
        "Class Name": "Electrical Power for Agricultural and Residential Applications",
        "Class Number": "8182",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "2.7"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "3330",
        "Class Name": "Grain Handling, Drying, and Milling",
        "Class Number": "9628",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "2.71"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "2310",
        "Class Name": "Electrical Power for Agricultural and Residential Applications",
        "Class Number": "31207",
        "Term": "SP 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "2.86"
      },
      {
        "Subject": "CONSYSM",
        "Catalog": "2305",
        "Class Name": "Professional Development I",
        "Class Number": "25455",
        "Term": "AU 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3810",
        "Class Name": "Agricultural Structures",
        "Class Number": "6781",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "3.5"
      },
      {
        "Subject": "FABENG",
        "Catalog": "5160",
        "Class Name": "Electronics, Measurement and Instrumentation",
        "Class Number": "9332",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "45",
        "Rating": "3.29"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3150",
        "Class Name": "System Dynamics and Electricity",
        "Class Number": "6570",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "51",
        "Rating": "3.24"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3810",
        "Class Name": "Agricultural Structures",
        "Class Number": "32617",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "3.67"
      },
      {
        "Subject": "FABENG",
        "Catalog": "5160",
        "Class Name": "Electronics, Measurement and Instrumentation",
        "Class Number": "32685",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "52",
        "Rating": "2.92"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3150",
        "Class Name": "System Dynamics and Electricity",
        "Class Number": "29585",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "2.85"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3810",
        "Class Name": "Agricultural Structures",
        "Class Number": "10850",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "2.67"
      },
      {
        "Subject": "FABENG",
        "Catalog": "5160",
        "Class Name": "Electronics, Measurement and Instrumentation",
        "Class Number": "10918",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "2.41"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3150",
        "Class Name": "System Dynamics and Electricity",
        "Class Number": "10995",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "2.27"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3810",
        "Class Name": "Agricultural Structures",
        "Class Number": "10812",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "3.2"
      },
      {
        "Subject": "FABENG",
        "Catalog": "5160",
        "Class Name": "Electronics, Measurement and Instrumentation",
        "Class Number": "10880",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "1.94"
      },
      {
        "Subject": "FABENG",
        "Catalog": "3150",
        "Class Name": "System Dynamics and Electricity",
        "Class Number": "10897",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "3.48"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Food, Agriculture & Bio Eng",
    "firstName": "Monica",
    "id": "VGVhY2hlci0yNDA3NTIw",
    "lastName": "Giusti",
    "legacyId": 2407520,
    "numRatings": 2,
    "summary_comment": "Professor Giusti is highly regarded for her exceptional teaching quality, known for her deep knowledge of the subject, clear articulation of complex concepts, and engaging, enthusiastic approach that makes the class enjoyable. Students consistently praise her for providing all the necessary tools to excel and for her readiness to assist those in need.",
    "summary_comment_short": "Professor Giusti is highly regarded for her exceptional knowledge and clear articulation of complex concepts, making her one of the best teachers at Ohio State. She is known for her charisma, enthusiasm, and willingness to assist students, creating a fun and engaging learning environment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Giusti was one of the best professors and teachers I have had thus far at Ohio State and in general. She is very knowledgable about the subject, articulates the concepts extremely well, is charismatic and enthusiastic, and gives you all the tools necessary to exceed. Go to class and put effort into the group reports, and you will be fine.",
        "course": "FDSCTE5310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She made the class super fun and was always ready to help students who asked for help. I would recommend her to anyone!",
        "course": "FDSCTE5310"
      }
    ],
    "SEI": [
      {
        "Subject": "FDSCTE",
        "Catalog": "5310",
        "Class Name": "Food Quality Assurance",
        "Class Number": "31139",
        "Term": "AU 20",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "33",
        "Rating": "4.24"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "5310",
        "Class Name": "Food Quality Assurance",
        "Class Number": "25319",
        "Term": "AU 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.23"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "7630",
        "Class Name": "Food Colors and Pigments",
        "Class Number": "27388",
        "Term": "AU 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "5721",
        "Class Name": "Applied Food Product Development",
        "Class Number": "8506",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "5310",
        "Class Name": "Food Quality Assurance",
        "Class Number": "29282",
        "Term": "AU 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.39"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "5721",
        "Class Name": "Applied Food Product Development",
        "Class Number": "31517",
        "Term": "SP 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "5310",
        "Class Name": "Food Quality Assurance",
        "Class Number": "32169",
        "Term": "AU 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.81"
      },
      {
        "Subject": "FDSCTE",
        "Catalog": "7630",
        "Class Name": "Food Colors and Pigments",
        "Class Number": "36836",
        "Term": "AU 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Food Science & Technology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Food, Agriculture & Bio Eng",
    "firstName": "Scott",
    "id": "VGVhY2hlci0xODY1NzY5",
    "lastName": "Shearer",
    "legacyId": 1865769,
    "numRatings": 3,
    "summary_comment": "Professor Shearer is known for his comprehensive approach to teaching, providing extensive support through detailed homework solutions and helpful PowerPoint presentations. While some students find his lectures somewhat unengaging, many appreciate his thoroughness and the value of attending classes. He emphasizes preparation with regular quizzes and practice tests that closely mirror the actual assessments, and while attendance is not mandatory, it can lead to additional points.",
    "summary_comment_short": "Professor Shearer is known for his comprehensive approach to teaching, providing extensive support through detailed explanations of homework problems in class. While some find his lectures somewhat dry, students appreciate his thoroughness and the high value of attending class, especially for those who rely on practice quizzes that closely mirror actual assessments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "A lot of work for a one credit hour class, but he does a lot of it for you. It's helpful to go to class because he spends most of it working out the exact homework problems. I found him to be kind of corny and uninteresting, but he's a nice guy and wants you to do well. Do the practice quizzes/final - they're often exactly the same as the real ones",
        "course": "FABENG2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Shearer is an awesome teacher. He will pretty much do your homework for you. He doesn't have midterms just a final, but he gives quizzes every other week. He gives practices quizzes which are similar (or identical) to the quiz. Being at class isn't mandatory, but when attendance starts to get low he will give bonus points for people there.",
        "course": "FABENG2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He helps so much! Gives answers to homework often and posts good powerpoints on Carmen.",
        "course": "FABE2100"
      }
    ],
    "SEI": [
      {
        "Subject": "AGSYSMT",
        "Catalog": "4900",
        "Class Name": "Capstone in Agricultural Systems Management I",
        "Class Number": "33082",
        "Term": "AU 20",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.26"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "2580",
        "Class Name": "Introduction to Digital Agriculture",
        "Class Number": "35775",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "4910",
        "Class Name": "Capstone II - Project Implementation",
        "Class Number": "32150",
        "Term": "SP 21",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.61"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "2580",
        "Class Name": "Introduction to Digital Agriculture",
        "Class Number": "33708",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "3360",
        "Class Name": "Agricultural Machinery Management",
        "Class Number": "8186",
        "Term": "SP 22",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "3.64"
      },
      {
        "Subject": "AGSYSMT",
        "Catalog": "2580",
        "Class Name": "Introduction to Digital Agriculture",
        "Class Number": "32743",
        "Term": "SP 23",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "CONSYSM",
        "Catalog": "2240",
        "Class Name": "Construction Materials and Methods I",
        "Class Number": "31274",
        "Term": "AU 20",
        "College": "Food, Agric & Environ Science",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.06"
      },
      {
        "Subject": "FABENG",
        "Catalog": "5620",
        "Class Name": "Fluid Power Systems",
        "Class Number": "10826",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "FABENG",
        "Catalog": "5620",
        "Class Name": "Fluid Power Systems",
        "Class Number": "29698",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Food, Agric & Biological Eng",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      }
    ]
  }
]