[
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.7,
    "department": "Food Agriculture amp Bio Eng",
    "firstName": "Doug",
    "id": "VGVhY2hlci0yMzIwNDEz",
    "lastName": "Ritchie",
    "legacyId": 2320413,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class entirely online and I thought his prerecorded lectures were very helpful. He also posts videos explaining how to do the projects which were super helpful. He also responded to emails super quickly and thoroughly. I genuinely enjoyed his class and it was not a ton of work.",
        "course": "FABE3171"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "In any class he teaches he finds an easy way to make it simple. I toke (CONSYSM 2220 - Info Tech for CM). Even if the class was required for attendance he made it optional and self-paced. Every week I would do all the homework on Sunday and not worry about the course for the week. As long as you stay consistent you will get an A easily.",
        "course": "CE2405"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Doug does a great job of structuring the course to make learning AutoCad easy and accessible. He is always willing to help students and easily reached via email. I enjoyed his course and being able to learn a new skill!",
        "course": "FABE3171"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Doug is super responsive to student questions and wants you to do well. He gives detailed instructions and responds to emails quickly. He can take a long time to grade things, but is not an extremely strict grader and getting good grades is easy if you follow his directions!",
        "course": "FABE3171"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Explains things very well",
        "course": "CE2405"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Although this is an online class, the material he gives is very helpful. He also provides guidance video for most of the project. He also willing to help you if you have any problem with the project.",
        "course": "CE2405"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Doug is a down-to-earth and super-helpful guy. His instructions are typically straight-forward, although he can take a while to grade assignments sometimes.",
        "course": "ENGR4410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 2.5,
    "department": "Food Agriculture amp Bio Eng",
    "firstName": "Kristen",
    "id": "VGVhY2hlci0yNjU0NDA4",
    "lastName": "Conroy",
    "legacyId": 2654408,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class was not particularly enjoyable. The number of \"busy work\" assignments is astronomical.There was very little grading criteria or any form of rubric.  This made assignments very challenging and confusing. Unless you are 100% interested in the FABE engineering pathway I would 100% avoid this course. ",
        "course": "FABENG2100"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "There was not a SINGLE accessible rubric for any assignment posted by Dr. Conroy. The content is uninspiring and the assignment questions were nearly impossible to synthesize due to their vagueness. There were 4 different graders (one of which showed up to lecture once all semester), who I assume to all be working off of their own, hazy criteria. ",
        "course": "FABENG3210"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "There were basically no criteria or rubrics for any assignment.  All assignments were confusing and trivial. There were very few opportunities for critical thinking or any form of thought other than what was presented in the class. Would not take again! ",
        "course": "FABENG3210"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "\n\nDealing with her assignments is frustrating without rubrics, making it impossible to meet her expectations. Grades are given without feedback, hindering improvement. Her grading system seems like a popularity contest, neglecting the quality of our work. This lack of transparency is demoralizing.",
        "course": "FABENG3210"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kristen does a great job of being a resource to her students as well as introducing disciplines that are taught within FABE. She truly cares for her students and makes sure that the lecture content is always evolving and curated for her students. And she is always willing to help students!",
        "course": "FABENG2100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Explains all the topics well and gives ggood feedback on the assignments. Encourages participation and interaction in lecture and recitation.",
        "course": "FABENG2100"
      }
    ],
    "SEI": []
  }
]