[
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.9,
    "department": "French",
    "firstName": "Dionisio",
    "id": "VGVhY2hlci0xODQwOTIw",
    "lastName": "Mingallon",
    "legacyId": 1840920,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's the best French 3 teacher to have here at OSU. Dionisio really cares about his students and gives you everything you need to be successful for the course.",
        "course": "FRENCH110301"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolute gem of a professor, made my last semester of college french manageable. Super understanding and willing to work with the student. Way too much HW so be prepared. I am satisfied with this professor.",
        "course": "FRENCH1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I'm so glad I got to have him as a my professor! He's really funny, and creates a non-judgmental environment so that all of his students feel comfortable. He is very understanding and always lets you turn in assignments late for full credit. This class is an easy A as long as you participate, do the iLrn homework, and show up.",
        "course": "FRENCH110301"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best Teacher in OSU. Helps you when ever you need it.",
        "course": "FRENCH110304"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Denis was an amazing teacher! Funny and very patient.",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Denis was an amazing teacher. He is constantly telling jokes. Overall extremely easy class. I never studied and got an A. As long as you spend 15 minutes doing your HW every night and participate at least once every class you'll be fine. He really cares about the students and that they do well.",
        "course": "FRENCH110201"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Denis is SO funny!! I kid you not, I laughed so much every single class. He is so encouraging and a WONDERFUL instructor. Seriously, he's so amazing. I'm going to miss him. Learning french won't be the same without him :( Take his class!!! You'll have the time of your life. He treats everyone with respect and is so sweet and pure.",
        "course": "FRENCH1102"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "What an amazing teacher! If I liked french more, I would totally consider minoring to have him again. He's so understanding!",
        "course": "FRENCH110301"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors. An A is definitely possible just do the nightly homework and study a few hours before each test, attendance and participation is also important.  Denis is so funny and really cares about his students.  If taking French take it with him!",
        "course": "FRENCH115501"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wonderful teacher",
        "course": "FRENCH110304"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Denis is by far the best professor I've ever had at OSU. He's very kind, and is always finding ways to make class more fun. He tells us that when we come to french class, we're family, and makes us feel comfortable making mistakes. He really cares about his students and wants everyone to succeed. If you take french, take it with Denis!!",
        "course": "FRENCH110301"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "inspiring, friendly, helpful, easy grader, encouraging, hilarious. Best french teacher I've ever had.",
        "course": "FRENCH110301"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Easily one of the best professors I've had in college. Denis is extremely helpful, really cares about the student's understanding of the material, and always goes the extra mile to help his students succeed. Attendance and participation is mandatory to doing well. Overall, great professor. ",
        "course": "FRENCH115501"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Mingallon is amazing! He is so kind and helpful, he really goes the extra mile to help you understand French! He makes the classroom comfortable so you never feel embarrassed about getting something wrong, and on every test and quiz he looks for points to give instead of taking them away! Loved this class- I highly recommend him!",
        "course": "1155"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "awesome professor!  always willing to go the extra mile to help students understand",
        "course": "FRENCH110304"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.7,
    "department": "French",
    "firstName": "Douglas",
    "id": "VGVhY2hlci0xNjM3MTE0",
    "lastName": "Roberts",
    "legacyId": 1637114,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great guy. Went out of his way to give academic and life advice. Asks for student input on his lectures, even mid semester. A little tough on grading sometimes, but just his method. Engage and get to know him!",
        "course": "F1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved professor Roberts! He was super funny in 1103 and his way of teaching French was the best way I've ever had. I will say, he can be a tough grader and there are frequent miscommunications, but if you make an effort to come to class he will work with you on getting your grade where you want it to be. ",
        "course": "FRENCH1103"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "I think Prof Roberts is a good guy but a bad teacher. Point blank, take a different professor. I took French 1101 and 1102 at OSU, and he grades harder when compared to other professors. He also gives zero feedback on why you got a certain grade. Good luck doing better next time when he does not tell you what you did wrong in the first place!",
        "course": "FRENCH1103"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Prof. Roberts is a great person, but not so great a professor. There was hours of homework due at the beginning of every class and his Carmen page was very disorganized. It was hard to get in contact with him and this class cemented my dislike for the language.",
        "course": "FRENCH1155"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's not good at online classes. There's too much homework and it's really confusing to navigate; you have to swim an ocean of files to find what you're looking for. He made online lectures an 'option' but would expect us to attend. He wasn't aware of the conditions students were in bc of the pandemic; I don't think he's very considerate.",
        "course": "FRENCH1151"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "Doug is a nice guy, but sometimes isn't great on social cues but means well. If you pay attention in lecture you are set for the exams. He makes french very straightforward and it is not hard to do well. Lots of homework but that is from the french dept and not doug himself. Just show up and put in a little effort and youll be fine.",
        "course": "FRENCH1103"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really sweet guy. The subject itself is difficult but he makes it fun. He is really understanding if you need to miss class (you get 4 grace absences) and makes sure that you know what you missed. Lots of quizzes and homework to boost your grade so tests don't affect your grade that much. Do the homework and make sure you know when the quizzes are.",
        "course": "FRENCH1103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Funny guy, has reviews that tell you what is on the tests which are super helpful. He cares and everyone does well in the class he knows everyone has to take this level french and so he dosen't make it too hard.",
        "course": "F1103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Doug is the nicest, sweetest prof without a doubt. SO caring about his students and loves what he teaches. TAKE HIS CLASS if you can, and you'll look forward to it everyday and have fun while learning a lot. Tests aren't bad, just gotta study. Homework is nightly but manageable.",
        "course": "FRENCH1103"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really cares about his students, and is very willing to work with you.",
        "course": "FRENCH1103"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Doug is a lot of fun. He is very engaged and encourages participation which is also a good way to get to know your classmates. I definitely don't think he is a native speaker as many of his pronunciations are average but overall very nice and is in no way a harsh grader.",
        "course": "FRE1155"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 2,
        "comment": "He really doesn't know the French language well enough to be teaching students. Thank god I knew French before coming into 1155 or I would be lost as he truly does not know the language. Many times in a class meeting will students have to correct him as he uses incorrect phrases and often times can not answer student questions about the language.",
        "course": "FRENCH1155"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "Doug is very understanding. He goes out of his way to help students and is a lot friendlier than the average professor. Warning though: If you don't go to class on a regular basis, don't expect to do well on tests.",
        "course": "FRENCH1102"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 2,
        "comment": "Just all around not a good professor.  I would like to say that he just doesn't have any teaching ability, even though he knows his material well, but even that isn't true.  We've caught him making mistakes multiple times.  Too old to be teaching a class where all the HW is online.  Quite deaf, and never hears questions well enough to answer them.",
        "course": "FRENCH1102"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "Doug is an amazing professor! He truly cares about his students and wants them to succeed. Honestly I thought this class was very easy. As long as you are present, listen in class, do the homework online, and review through the study guide or textbook before an exam, then you're definitely going to do well. I would love to have him again :)",
        "course": "FRENCH1151"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Doug is a bit scatterbrained but he's an easy grader, absolutely hilarious, and everyone really respects him. He's a cool old dude.",
        "course": "110201"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 3,
        "comment": "He doesn't speak fluent French which is a little confusing, but he's a nice guy and wants you to love French as much as he does. He often makes class awkward by asking weirdly sexual questions, but it's pretty funny, and pretty much the whole class likes him. ",
        "course": "FRENCH1151"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 1,
        "comment": "Love this guy! Kooky but in a good way. He genuinely cares about every single student in the classroom. He is not the best at explaining things, however his enthusiasm makes up for it. Very understanding when it comes to grades. Easy and enjoyable class!",
        "course": "110201"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 2,
        "comment": "Wonderful prof. He is there 150 for everyone. Very inclusive class atmosphere. Really personable and kind, which make him approachable. Goes out of his way to help. He has some cool stories in class and it makes time go by fast. Love him",
        "course": "FRENCH1102"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Doug was a good teacher who is more than willing to give you the chance to earn a good grade in his class. He was one of the most helpful teachers I've run across in this regard. He takes time out of his schedule to host study sessions prior to big exams, which can be helpful.",
        "course": "FREN110201"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "Doug was definitely NOT an easy prof.He is very interested in French but for someone who did not learn in HS you're better off doing Indv. Study.",
        "course": "1102"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 1,
        "comment": "Doug is a really nice and funny guy. He tries to make the class fun and inclusive, and if you have a good class it will be! I never liked french but he made it a class worth going to. I highly recommend him. It is not hard to get an A. He does everything possible to get you there.",
        "course": "FRENC102"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful! He never opened Carmen though which I rely on. More pronunciation would have been nice, otherwise, I enjoyed Doug very much! He's a very nice guy!",
        "course": "FRENC102"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Hilarious professor who will explain what he is saying if you ask. Short, non-demanding quizzes. He even gives review sessions for midterms. He's a great guy :)",
        "course": "FRE102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "French",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0yNzk0ODEz",
    "lastName": "Willis",
    "legacyId": 2794813,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Willis is a great professor and really helps you to be the best at French. She gives great feedback and provides you with the resources you need to succeed to in French. ",
        "course": "French1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "French",
    "firstName": "Genevieve",
    "id": "VGVhY2hlci0yNjM2Mzcy",
    "lastName": "Berendt",
    "legacyId": 2636372,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Covid made the semester difficult for everyone and although online was tough to adjust to, she was responsive to all my questions and follow ups and clearly cared about her students and teaching the language",
        "course": "FRENCH1101"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "She is disorganized, rude, relies too much on online homework and generally a bad professor. She was overwhelmed all semester even though cengage will grade our homework for her. Her emails are very rude and condescending. She clearly isn't ready for this kind of thing. TAKE ANYONE ELSE.",
        "course": "FRENCH1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4.5,
    "department": "French",
    "firstName": "Benjamin",
    "id": "VGVhY2hlci0yMzY0MDEx",
    "lastName": "Hoffmann",
    "legacyId": 2364011,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is probably the most difficult French class I have ever taken, but I am happy I was finally challenged. He really cares about students and their learning experience with French. If you felt like you never were challenged in high school French, he's a great professor that truly makes you advance your language skills.",
        "course": "FRENCH2101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "By no means an easy class, but if you participate and do the readings it's not bad. Dr. Hoffmann makes a great effort to keep the class interesting and engaging, and if you keep up with the material you'll learn a lot.",
        "course": "FRENCH2101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Hoffmann is a great teacher, but he rarely gives a score above a 95% unless you really work for it. Participating in class will give you an excellent grade. He is passionate about teaching and cares about his students.",
        "course": "FRENCH2101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "I've had him for many classes and he is the best in the department. He treats students with respect and believes in their potential; however, that does mean he expects a lot in terms of participation and quality of work. Don't take him for a class you don't care about the topic.",
        "course": "FR45401"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of my favorite profs in FRIT Dept., this class was a LOT of work but I got so much better at French. Lots of reading, a ton of writing, the lectures are intense, but they're interesting. He's got a great sense of humor, and discussions are really thought provoking, they make you want to participate. I looked forward to this class every week.",
        "course": "FR5401"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Hoffmann is actually a really good professor. But if you were looking for an easy class to take, then please find another professor. You have to present for 5 minutes in French and take quizzes every class based on the vocabulary and the presentation shown. Lots of reading. Participation is required and graded. He's a tough grader. Good luck!",
        "course": "FR2101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "French",
    "firstName": "Thierno",
    "id": "VGVhY2hlci0yNTQwNTcx",
    "lastName": "Diallo",
    "legacyId": 2540571,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mr. Diallo was an absolute gentleman. You can tell he really cares about teaching and has a true passion for his craft. Attendance was mandatory, but I looked forward to his class every day. There is daily homework but it is easy and it prepares you very well for the exams. I highly recommend this professor.",
        "course": "FRENCH1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "bro I was a awful student to him. I barely did HW, barely in class, barely participated and he was so patient and kind and understanding. Definitely one of the best prof. I've had. 10/10. lots of homework but thats expected when u take a lang so ",
        "course": "FRENCH1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super awesome professor, my favorite one yet. He is really funny and entertaining too. Exams aren't too bad. Participate!!",
        "course": "FRENCH3101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "French",
    "firstName": "Mackenzie",
    "id": "VGVhY2hlci0yNDM4MDMz",
    "lastName": "Leadston",
    "legacyId": 2438033,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "FAVORITE CLASS EVER. Had professor Leadston first semster of my freshman year and her class is what made me decide on my major. Very friendly and and personable, makes classes enjoyable &amp; fun. She really cares about her classes and wants to work with the students to make it the best experience for everyone. Interesting books &amp; topics.",
        "course": "FR1801"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher. I would recommend French Masterpieces if you are looking for a lit GE. Its a really interesting class and fun to learn about.",
        "course": "FR1801"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "QUEEN. Theres not many teachers that make me want to come to class despite attendance not being mandatory. Super charismatic and funny, literally just show up and the likelihood of getting less than an A is slim to none. Reading material is pretty easy too. Pls teach my math courses so I can pass those too &#55357;&#56877;&#55357;&#56468;",
        "course": "FRENCH1801"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mack is an amazing professor! She is great at making difficult concepts interesting and easy to understand. I really enjoyed this course, and I recommend it to anyone who needs a lit GE.",
        "course": "FRENCH1801"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I spoke to Mack about something that was emotionally triggering for me to read. Mackwithout hesitationsaid not to worry, &amp; that I did not have to read it. I was excused from class while they were discussing it (free of penalty), &amp; it would not appear on the exam. She is truly an amazing &amp; kind professor, &amp; this is one of my favorite classes.",
        "course": "FRENCH1801"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Seriously one of the best teachers I've ever had.",
        "course": "1103FRENCH"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "French",
    "firstName": "Walissa",
    "id": "VGVhY2hlci0yODYzODAw",
    "lastName": "Picard",
    "legacyId": 2863800,
    "numRatings": 1,
    "Ratings": [],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 5,
    "department": "French",
    "firstName": "Kellie",
    "id": "VGVhY2hlci0yNzIwMzQ0",
    "lastName": "Giordano",
    "legacyId": 2720344,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kellie made learning French so easy! I was wary to take another language class after a less than perfect experience at a different school, but Kellie quickly eliminated those fears. She breaks down the language as much as possible and is also just an amazing person to be around and cares about her students. Thank you Kellie!",
        "course": "FREN1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kellie has been one of the best instructors I've had so far during my time at OSU. I had a very difficult time in French 1 and struggle learning languages generally. However, immediately Kellie made me love French. Her ability to connect with the class made me excited to come to French everyday. I would 100% recommend taking French with Kellie.",
        "course": "FREN1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I want to be Kellie when I grow up. So funny, smart, and nice. Best professor at OSU and she has only been teaching for a year. You would never guess. I fully expected to struggle with the foreign language requirement but she made it enjoyable. Hoping to take her for FREN 1102 as well.",
        "course": "FREN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kellie is quite honestly the best professor I have ever had. She truly wants you to learn French and is really great at explaining complex topics in easy-to-grasp ways. She has a great sense of humour that will keep you engaged. I truly looked forward to coming to class everyday, even though it was early in the morning. Take her!",
        "course": "FREN1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "A wonderful person inside and out. My favorite professor at OSU thus far. If you do what is assigned you will do great, and probably have fun learning French!",
        "course": "FREN1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite course this semester. Kellie's class is rather intense because of the online homework and little assignments (though every OSU lang class is like that), but if you participate when she asks questions you will learn and do well. She is nice and wants everybody to do well. Do the homework, come to class. Courage!",
        "course": "FREN1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Madame Kellie is amazing! At first I was scared to start a second language, but she makes learning French so fun that you will want to get good! She is so kind and encouraging and always willing to help if you need it. She also has a great sense of humor which makes class engaging. Take her, you won't regret it! Merci Kellie!",
        "course": "FREN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "French",
    "firstName": "Tracey",
    "id": "VGVhY2hlci0yODU0OTI4",
    "lastName": "Adams",
    "legacyId": 2854928,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I was not excited to have to take a foreign language class. However, Tracey made the content accessible and understandable. She was also very down-to-earth and caring. The class can be challenging, but if you make an effort you should be fine. She is a forgiving and reasonable grader. I genuinely appreciate her and have nothing bad to say",
        "course": "1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.7,
    "department": "French",
    "firstName": "Patrick",
    "id": "VGVhY2hlci0xNzk4NDMy",
    "lastName": "Bray",
    "legacyId": 1798432,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved him! If you can take this class for a GE, I would highly recommend it. He was extremely nice and made me feel like I understood the material very well",
        "course": "FRENCH1801"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "He speaks French very well. Also, he's a nice guy don't get me wrong, but he was very dull in class. That could possible be an understatement. My friend caught me once checking my pulse to make sure I was still alive and not in purgatory.",
        "course": "FRENCH2101H"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "I found his lectures to be incredibly dull and the abolishment of electronics in a general education course made the torture worse. Also didn't read any of the required material and only watched one movie and still got an A-. That being said, he knows what he is talking about but if you're not a French lit major you'll want to pull your eyes out.",
        "course": "1801"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is an amazing person and a true intellectual. If you don't like intelligent people who challenge you, you won't like his class. I don't know how anyone could dislike his class.",
        "course": "5403"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Yes, you have to show up to class. No, you're not supposed to be distracting yourself on electronic devices. For most people who are respectful of an expert and serious about class, this is basic courteous behavior. He is brilliant and  I loved this class.",
        "course": "FRENCH1801"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "French existential literature. Lots of reading. He expects and encourages lots of feedback of materials read. Attendance is mandatory and is taken each class. Offers some extra credit but as replacement credit. Also utilizes French existentialist film. Helpful TAs that are fair graders. Prof is very knowledgable and well connected in field.",
        "course": "FRENCH1801"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "This was his first time teaching the course, but the experience was rough. He's a tough grader but the stuff we do in class is easy. Doesn't encourage participation from students. Attendence is mandatory.",
        "course": "FRENCH120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 3.8,
    "department": "French",
    "firstName": "Garrett",
    "id": "VGVhY2hlci0xMDY3NjM2",
    "lastName": "Heysel",
    "legacyId": 1067636,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof Heysel is the most pleasant professor. The class was fairly disorganized, but even as someone who is usually extremely picky about this, the &quot;messiness&quot; of the course was very tolerable. The content is practical and important, and professor heysel did a good job conveying the info overall. Prof Heysel is very enjoyable to have!",
        "course": "FRENCH3102"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Gives good feedback. very approachable",
        "course": "FR404"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very helpful when I had questions, but the class was too easy. Sometimes our sessions would feel agonizingly slow.",
        "course": "FRENCH3100"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "I thought he was great! Knew his stuff really well and was very helpful with pronunciation. Really nice guy, too. Midterm was really straight forward and there wasn't a final...it was a take-home record-and-upload assignment. Oh, and he's cute, but totally gay so it would never work out since I'm a girl :)",
        "course": "FR404"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Ok, He was usually in a bad mood, unorganized, and thre curve balls on the final exam!",
        "course": "FR404"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "French",
    "firstName": "Michael",
    "id": "VGVhY2hlci0yNDEzMzAz",
    "lastName": "Moshman",
    "legacyId": 2413303,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr. Moshman is by far one of the most energetic and fun-loving teachers I've ever had! He is very knowledgeable about French, and always finds ways to make learning fun and enjoyable. His enthusiasm inspired me to double major in French, I really recommend his class!",
        "course": "FR2101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr. Moshman is an amazing teacher! He is still a grad student but seems very experienced. Cares a lot about his students and is always helpful when questions are asked. He isnt a native speaker but that really doesnt take away from the class. I would definitely take his class again. Highly recommend!",
        "course": "FRENCH1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mike is still a grad student as of right now but this is his second year teaching French and he is fantastic. The only downside is that he is not a native speaker. However, he is still excellent and helps you master french. Participation, occasional vocab quizzes (extra credit offered), and mini-tests every 2 weeks on the chapters. Easiest A ever.",
        "course": "FREN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.7,
    "department": "French",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0xMTU0NzQw",
    "lastName": "Bishop",
    "legacyId": 1154740,
    "numRatings": 37,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Bishop is wonderful! She explains French very well and is an easy grader for exams. She will explain topics in English if students are confused. Not much talking in French done in class, so make sure to practice pronunciation if you can. Daily MindTap homework like usual. Chapter exams & speaking quizzes. Fairly similar to 1101.",
        "course": "FRENCH110201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Bishop is an exceptional professor. She is very kind and makes difficult French grammar rules easy to understand. Like 1101, there is daily Mindtap homework, but it prepares you well for exams.",
        "course": "FRENCH110201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the most kind and accommodating professors I have had at OSU. I struggle a lot with French, and she helped me a lot with course content and went above and beyond to help me succeed and be confident in my abilities. She has high standards, but helps you meet them. One of the best professors in an already wonderful French department.",
        "course": "FRENCH1103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was really nice and made the material super clear. Really understanding with late assignments.",
        "course": "110301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's absolutely amazing! She's charismatic, funny, and very approachable. French 1155 was one of the most enjoyable classes ever. Class participation is actually so much fun and homework isn't that bad. There's a syllabus for the projects and exams and she explains them really well so there's no problem there. 10/10 would take again. ",
        "course": "FRENC1155"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lots of time in class but pretty easy and super nice professor",
        "course": "FRENCH110301"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Madame Bishop is amazing. In the beginning of the semester I forgot to do an assignment. I talked to her after class and she was more than understanding-- just talk to her and show interest in her class. She's super fun and I enjoyed her class a lot!",
        "course": "FRENC103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Bishop is very caring and helpful. While French grammar definitely isn't the most interesting topic, she does a good job at explaining grammatical rules and presenting content in an organized way.",
        "course": "FRENCH3101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "She really cares about her students and the workload is very light and easy. Shes understanding and very generous with grading.",
        "course": "FRENCH110301"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Madame Bishop is a great person and amazing at explaining all of the content. Always clearly answers questions and is very up front about all the material. There is a quite a bit of homework, but nothing too heavy. Would definitely recommend!",
        "course": "FRENCH110301"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took french in high school for 4 years and got really close to my french teacher so it was kind of weird for me to have a new teacher after having the same one for 4 years. That being said, I honestly can't think of a better person to teach this class, prof is really nice and open, answers any questions you may have, and is really understanding.",
        "course": "FRENCH110301"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "For a French culture class, we focused on politics, the economy, social security, and other boring topics. However, the reading and assignments were manageable. The exams followed the study guides completely, so no surprises. Beth is pretty enjoyable and tries to make lecture worthwhile.",
        "course": "FRENCH3401"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I dreaded having to take a language this year and Prof. Bishop made the experience amazing. I really enjoyed the class and learned a lot. Shes very approachable and understanding and easy to talk to. My whole class has been asking her what shes teaching next semester in hopes of having her again. 10/10 would recommend. Shes a great professor.",
        "course": "FRENCH11011"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Beth was amazing! She is such a sweet person and genuinely wants her students to understand the material. She makes things fun, class always flies by. There is a ton of homework but it really does help you prepare for the next day so youre ready to review the material and ask questions. She also offers extra credit every week.",
        "course": "FRENCH11011"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Bishop is such a great professor. Made French 1 very understandable and learned a lot but was never stressed. If you miss a few homeworks shell accept them late and clearly tells you whats on each exam. If you put a moderate amount of effort in and show up to class, its an easy A while also clearly learning French.",
        "course": "FRENCH11011"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Beth makes French grammar entertaining and she explains concepts clearly. The class seems like it's just a lot of details about the French language, but Beth makes it as cohesive as possible. There are 2 easy essays, 5 verb quizzes, and 3 midterms + 1 final. After taking this course, I know much more about French grammar. Very beneficial class.",
        "course": "FRENCH3101"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Beth was the best French professor I've ever had. She's extremely nice, very funny, and super pretty. Her class isn't too tough and she doesn't go out of her way to make you participate if you don't wish to. I would definitely take her if possible.",
        "course": "FRENCH110301"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "I really struggles with french in the past but she was such a great teacher. Her class is very straightforward and as long as you show up, you should be fine. Her tests aren't hard and there is a lot of participation credit.",
        "course": "FRENCH1155"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "As someone who's not very motivated to learn foreign languages I found the large amount of grading opportunities allowed me to do better than expected. That said, learning a language is still hard and Prof. Bishop wasn't the best ally. She was extremely nice/pleasant and went over everything quickly, but was very stiff to the course guidelines.",
        "course": "FRENCH11011"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is super awesome. She is very easy to understand and she speaks in English often for clarity. It is important to show up to class and talk, but you don't have to worry about speaking well. The tests are easy As and there aren't quizzes. She is really willing to help if you struggle, but if you did fine in past French courses, you won't struggle",
        "course": "110301"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good and informative instructor. Her class always flew by. Tests were exactly formatted to the information on the study guide without any surprises. Always willing to help and answer any question. Great personality and desire to help students. I would take any class with her again! ",
        "course": "FRENCH3401"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "My Favorite Professor by far, I wish that I was in her class next semester!",
        "course": "1155"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent instructor. Great at answering questions. Class and exams were very easy and straightforward. Definitely recommend her class!",
        "course": "FRENCH110301"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome teacher, loves her job and really wants to help. Go to class and you will do well! She's hot tooo!",
        "course": "FRENCH11011"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Helpful, knows her stuff",
        "course": "FRENCH1155"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 1,
        "comment": "shes so nice and makes the material easy to understand. Definitely helpful when you ask questions. you will use the book everyday",
        "course": "FRENC1152"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Had her my for 1155 French - so easy to understand and so sweet! Makes learning French easy; great at communicating. Attendance is mandatory with her so don't ever think you'll skip and get away with it. Very helpful if you email and talk with her - she genuinely wants you to learn too!",
        "course": "FRENC1155"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Didn't really show interest in helping me",
        "course": "FREN102"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher! She made French fun, and is super helpful. Attending class is a MUST. Tests and quizzes are easy as long as you pay attention in class. My favorite teacher at OSU",
        "course": "FRENC102"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful! She's great :)",
        "course": "FR102"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a great prof. Always helpful and always friendly.",
        "course": "FRENC102"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great professor and cool class!",
        "course": "FR201"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic prof. Speaks so clearly which is really helpful.  Loved her class",
        "course": "FRENC103"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good professor, and nice.  Helpful, but maybe needs to be a little more dynamic/enthusiastic in class.",
        "course": "FRE403"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 4,
        "comment": "Beth is one of my favorite instructors.  She teaches clearly and tries to make class as fun as possible.",
        "course": "FRENC403"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "FNCH403"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is very helpful, easy to understand, and a good teacher. Seems a little strict in class, but she is nice.",
        "course": "FRENC1026"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "French",
    "firstName": "Julie",
    "id": "VGVhY2hlci0yOTc2MjE2",
    "lastName": "Tanve",
    "legacyId": 2976216,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Julie was a great teacher for French, especially since its her first semester teaching at OSU. She requires attendance though, so make sure to show up. The textbook is a lot work because you have multiple assignments everyday on Cengage Mindtap.",
        "course": "30808"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 3.7,
    "department": "French",
    "firstName": "Adela",
    "id": "VGVhY2hlci0yMzI2ODMz",
    "lastName": "Lechintan-Siefer",
    "legacyId": 2326833,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I really loved this class! 2101 is taught exclusively in French, and she is a native speaker who speaks slowly and understandably during class. Participation and attendance are graded each week. She is a generous grader of essays and exams.  ",
        "course": "FRENCH2101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took 3502- not an option to select. She was a really sweet and caring professor! I enjoyed her class. I feel like I didn't learn a ton, just because there was so much broad information to cover. Very easy assignments and exams, though. Participate a bit, and you'll be fine.",
        "course": "FRENCH3202"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lechintan-Siefer is one of the sweetest profs in the French department. She's clearly passionate about the material, and I found her lectures very interesting despite being online with the pandemic. If you do the readings and put in the effort, it isn't too hard to do well. She was really kind and understanding when I had some health issues.",
        "course": "FRENCH3202"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Shes very sweet professor and understands that were in a pandemic and nobody wants to take French. I didnt feel like i learned much but the work and material was manageable. Final oral exam and written exam was very fair. Lots of Mindtap be prepared.",
        "course": "FRENCH1102"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Shes very sweet &amp; cares about when students had troubles; however, her lessons were literally read from the book. I dont feel that I learned anything due to her tendency to make us discuss with peers as the lesson. I dont learn from speaking words I dont know. She doesnt teach but participation and attendance will make or break you. Simple class",
        "course": "FRN1155"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Mme Lechintan-Siefer was really nice and a fairly easy grader; the problem was that all the lessons came straight out of the text book and there was not a lot of speaking assignments so I didn't feel like I learned a ton of French.",
        "course": "FRENCH1155"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "French",
    "firstName": "Matteo",
    "id": "VGVhY2hlci0yOTIzNjAx",
    "lastName": "Jung",
    "legacyId": 2923601,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lectures are super fun and engaging! Professor Jung always puts fourth his best effort to make lectures exciting and informational, he is very passionate about his job and genuinely cares for all his students. I am so grateful I had the opportunity to have him as a professor, I loved his class!",
        "course": "1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor! Very understanding if you just explain your circumstances to him. Makes lectures very funny and engaging. Even when he doesn't have energy in the morning, he still manages to make class fun! Tries very hard to connect with the students on a personal level, and is good at it! Would rate him 10/5 if i could. ",
        "course": "1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.3,
    "department": "French",
    "firstName": "Margaret",
    "id": "VGVhY2hlci0yNDU3MjU4",
    "lastName": "Flinn",
    "legacyId": 2457258,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "The course topic and presentation of material was very interesting and unique (visual representations of ecology through French documentaries, comic books, movies, and TV shows)!  Prof Flinn is very caring and flexible with students.  Attendance and participation is important, but she grades pretty easily and clearly outlines expectations.",
        "course": "FRENCH4401"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "The course I took with Maggie was in the Film Studies department. Maggie expects you to work for a good grade and likes to make you think. With that being said, she is very willing to work with you and is flexible! Just don't expect to take this course and get an easy A if you're not willing to put in some work.",
        "course": "FILMSTD4895"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Maggie is insightful and discusses current issues through both text and film. She speaks French so well that she sounds like a native speaker so sometimes it's difficult to follow her, but the course is interesting and she makes class enjoyable. She's very dynamic as well. You'll write a few essays, read a few novels, and watch films.",
        "course": "FRENCH2101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.1,
    "department": "French",
    "firstName": "Kate",
    "id": "VGVhY2hlci0yNjQ3MzA1",
    "lastName": "Schlosser",
    "legacyId": 2647305,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kate was an amazing teacher and was always trying to help you improve your French. She did a great job teaching and helping you feel included.",
        "course": "FRENCH1103"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Kate is a good teacher, tests were fairly easy. There is a lot of daily homework on MindTap and attendance is mandatory for learning. Learning and getting used to French is fairly difficult, but she helps.",
        "course": "FRENCH1103"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "Well she sure does care a lot! ... ma'am this is a required GenEd. I dont want to be here and I feel that she doesn't either in how she presents herself. So what's with the intense grading? I think we all could relax a bit with the grading in a course like this... some of us are just trying to get through the day",
        "course": "FRENCH1103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Schlosser is genuinely interested in teaching, and she's good at it! Her class is almost entirely in French, but she makes it a lot less intimidating. She grades for participation and attendance (and isn't very forgiving about it), and there's still daily homework. My biggest issue is how slowly she grades assignments.",
        "course": "FRENCH1103"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Schlosser was nice, but she graded rather strictly and was not very lenient regarding attendance. She would take off participation points if I were one minute late to class! She also speaks almost exclusively in French, so be ready for that. There is also daily MindTap homework like 1101 and 1102.",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kate is a nice and caring professor! I really enjoyed her class. It was a pronunciation class- obviously, you have to participate. Quizzes and exams weren't too bad. My only complaint is that she is definitely a slow grader. Other than that, I really enjoyed taking her class! It wasn't terribly difficult- pay attention in class and you'll be fine.",
        "course": "FRENCH3102"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Schlosser does teach mostly in French, but she is very willing to rephrase things and answer questions. Participation is important, but she creates a very positive learning environment for people who struggle with speaking. Lots of homework, but it is not very difficult or time-consuming most of the time. Lenient with speaking exam grades",
        "course": "FRENCH1103"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "She teaches like we all grew up in France. Doesn't speak any English in class, even if students are confused. Doesn't like to answer questions. Many exams/quiz, compositions, speaking exams, projects, Mindtap, Conversations Unbound, this was an extreme amount of homework. Exams were not too difficult. Participation can kill your grade. Slow grader.",
        "course": "FRENCH1103"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "Schlosser teaches pretty much exclusively in French, with minimal English. She is kind and willing to help students. Participation is taken very seriously in this class, expect to speak at least twice during class, voluntarily or not. Not an easy A, you'll get out of this class what you put in. ",
        "course": "FRENCH1103"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "She took attendance and participation very heavily. She was nice but does not respond to emails. She doesn't tell you why you missed points on tests and is a very slow grader. I don't recommend her as a French professor. She thinks we can all speak and understand as fast as her. ",
        "course": "FRENCH1103"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Schlosser was an amazing professor. I had her at eight in the morning four days a week. Honestly, my participation was mostly online the last few weeks of the semester and I stopped completing all my assignments. She let me complete everything for partial credit and was extremely helpful. She taught my class (1103) all in french.",
        "course": "FRENCH1103"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "Don't take if you don't have an interest in French- it's a hard language, but Schlosser was a good prof imo if you're willing to work. Participation was very anxiety inducing but I can understand why she makes us do it, so be prepared to speak up in front of the class. Exams were somewhat hard &amp; there's a ton of online homework- not an easy A.",
        "course": "FRENCH1101"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had never taken french before and I thought she was a really good teacher. Makes you participate in class, but it is a good environment. Reasonable amount of homework for a language class four days a week.",
        "course": "FR1101"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Kate is disorganized. She expects a certain amount of flexibility from her students with grading and emails, which is fine, but is not flexible with students. She berated a student in front of the whole class for having their camera off during a panic attack, post grades late, and docks 30% off assignments submitted ten minutes after the deadline",
        "course": "FRENCH3102"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not Good",
        "course": "FRENCH1101"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 4,
        "comment": "There is daily homework's some are very simple some take a bit longer. Prof Kate is really nice and accommodating but the class is difficult if you do not keep up. There is a quite a bit of work but it is manageable and participation is big. Manageable class but not if you do not love french.",
        "course": "FRENCH1101"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely dreadful Kate is good at speaking French however in terms of being a professor she is awful. Kate is not helpful what so ever emailing her is pointless, she is disorganized, and late when it comes to grading. She basically only has lectures just to hear herself speak French because she is not helpful at all during class.",
        "course": "FRENCH3102"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 3,
        "comment": "Kate is the most disorganized teacher I have ever had. In the last week of the semester, she is just now grading our homework from September. We just took our final and our FIRST MIDTERM from EARLY OCTOBER is not graded yet. I was confused about expectations and guidelines the whole semester. A generally frustrating class. Get it together, Kate!",
        "course": "FRENCH3102"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 3,
        "comment": "She is really smart but her class was horribly organized. I definitely learned a lot from this class but I don't think it was worth all of the confusion I went through. Syllabus is not clear about critical dates and she would say announcements in french and not make any sense. The structure of this class needs work. Also she gives exams on weekends",
        "course": "FRENCH3102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "French",
    "firstName": "Ryan",
    "id": "VGVhY2hlci0yODg2MzM5",
    "lastName": "Joyce",
    "legacyId": 2886339,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nice guy who is passionate about what he teaches. I thought the Paris class would have some more interesting material but he seemed a little biased in what he taught. I could be wrong, though, and that could be at the fault of OSU instead of him. Still though, the class was relatively easy and it was obvious how to succeed in the class.",
        "course": "FRENCH2803"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took FRENCH 2804 with professor Joyce. Was my fav class at OSU so far, he is a very passionate and educated teacher. He explains everything in a way that is easily understood, even if you have never heard of the topic. Lots of out of class reading is expected but not rly needed; I read the material about 5 times the whole semester",
        "course": "FREN1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr.Joyce is a phenomenal professor. The best part about his class is his dedication to making materials engaging and understandable no matter how complex it is. The success of his students is very important to him and he has everyones best interest in mind. He is very passionate about his work. Would definitely take again!",
        "course": "FREN1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Helpful,  knowledgeable and kind.  Take french with him!",
        "course": "FREN1102"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Too hard for a GE. I had a B all semester in a class that was supposed to be easy to get an A in. I also felt like I only learned about the gay/queer parts of Paris' history. While it was interesting, I expected more history on the forming of Paris and the reconstruction. Probably wouldn't take again.",
        "course": "FREN1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I've ever had. Very easy to get along with and willing to work with you when it comes to due dates. He offers extra credit if you start falling behind and tests are very fair. As long as you complete the assigned homework before the class session, you will be able to keep up with the new words used. ",
        "course": "FREN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "French",
    "firstName": "Cazzolla ",
    "id": "VGVhY2hlci0zMDI2MzU4",
    "lastName": "Mauro ",
    "legacyId": 3026358,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chill professor, encourages participation and genuinely cares about his students. Very accommodating to some of the heavy workload in this class which is appreciated. Try to take it with him!",
        "course": "ITALIAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved this professor so much! He truly made class so much fun and valuable. His slides are always updated and the activities are always helpful in learning the content. The mindtap is really the only thing that can be a little too long, depending on the assignments for that night, but overall pretty simple. Be ready to participate!!",
        "course": "1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was one of my favorite professors! He really cares about his students and is incredible accommodating to anything that might come up during the semester! Would definitely recommend him to anyone taking french!",
        "course": "1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was an amazing professor who truly cared and interacted with us students. He also made sure we were aware of assignments and tests. We participated in group/partner discussions during class speaking out was encouraged for participation credit.",
        "course": "1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "French",
    "firstName": "Brian",
    "id": "VGVhY2hlci0xOTM1OTY3",
    "lastName": "Troth",
    "legacyId": 1935967,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Brian taught me basic French.  I had already studied Italian and Spanish, so French was interesting.  Brian is very inspirational and will go far in his field. ",
        "course": "FRENCH1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Brian was wonderful. I had studied other languages, but French was new and Brian was excellent. He is a fun professor who really cares about the students.",
        "course": "FRENCH1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was a lot of fun. Brian is very engaging in explaining grammar and culture points. As long as you show up &amp; attempt to speak only in French, do the online homework and look over the vocab you should do fine.",
        "course": "FRENCH1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cool guy Brian deserves a raise. Havent had a french class this good since high school. Dont care what hes getting paid now, give him more money OSU.",
        "course": "FRENCH3401"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Brian was super sweet and engaging during class. He always had us pair up for discussions and projects. I genuinely looked forward to going to his class. Tests were very reasonable and the homework was super easy.",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took Prof. Troth for 1103, a version of the class called french cinema. Brian, he's the sweetest and funniest dude ever! Talks solely in french in class, but slow enough that everyone in the class can still follow along with what he's saying. Grades easy, I got 9s and 10s on all my papers. Very flexible about tests etc, just show up and engage!",
        "course": "FRENCH1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "After two absolutely grueling semesters of dealing with the wrenched French Department at Ohio State, I can say that Prof. Troth has made my third semester a good one. He really cares, and he's the first French professor I've had that clearly explains anything. I only wish I could've had him sooner, maybe I wouldn't be so awful at the language.",
        "course": "FRENCH1103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Brian was absolutely an amazing professor. He is incredibly engaging and never boring. I would take his class twice if I could!",
        "course": "FRENCH1101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is by far the best professor you can get for French! I am loving it so far thanks to him. If you can, take him!! He is so awesome!",
        "course": "FRENCH1101"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Brian is a good professor.  Super understanding and an easy grader. He doesn't make a big deal about messing up small grammatical errors like some beginning language teachers do. He knows it's just French 1 and everyone can chill out.  Would take him again for French 2 if he taught it.",
        "course": "FRENCH1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.3,
    "department": "French",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci0zMDQ5NDky",
    "lastName": "Wetzel",
    "legacyId": 3049492,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Wetzel is such an easy professor to learn from. Autumn 2024 was her first semester at OSU, but she did a great job. She was a very lenient grader, almost too much so (my opinion). I don't love the way that French is taught at OSU, but she made time to give lessons and answer questions when we had them. Really funny and approachable!",
        "course": "FRE1102"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "do not take French at OSU. It's not taught in a way that you will not retain anything as there is a new lesson everyday. Very test heavy and you do not receive any feedback over what was right or wrong. If you didn't take a French class your senior year do yourself a favor and take another language or start at French 1101.",
        "course": "FRE1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took French 1102 with professor Wetzel and loved it. Wish I could take more French classes with her, would absolutely recommend. Great class, easy to communicate with which makes learning not only easy but fun. Does class participation and speaking activities, but they're not intimidating. The rest of the work is totally doable, just try!",
        "course": "FRE1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.6,
    "department": "French",
    "firstName": "Julie",
    "id": "VGVhY2hlci0xMzI1OTQy",
    "lastName": "Parson",
    "legacyId": 1325942,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Parson helped me feel at ease with my first course in French. She's engaging and shows interest in her students.",
        "course": "French1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Dr Parson, she is super approachable and very lighthearted and understanding of the student perspective, she is very lenient and understanding with grading, and there is plenty of homework to makeup for test grades. There is a fair amount of homework but none of it is due until each midterm so it is not very stressful, definitely recommend",
        "course": "FR3101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Parson has a way of making French grammar fun and interesting to learn. Even though the concepts were sometimes tough, I always looked forward to coming to class. She genuinely cares about teaching and is always willing to help students in whatever way she can. ",
        "course": "FR3101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Parson makes French grammar fun. I always enjoyed going to her class, she makes learning interesting and productive.",
        "course": "FRENCH3101"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr Parson was very caring and kind. She cares very much for her students and makes the class easy. I found that for a French Grammar class, she did not speak in French as much as I would have liked, which I felt hindered my speaking and comprehension. She was a fairly easy grader, however there was a significant amount of homework. ",
        "course": "FR3101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Parson slays. She is kind and flexible in her lessons and answers any and all questions posed. She is extremely willing to have extra office hours, easily contacted through email, and flexible with due dates. Overall, slay. ",
        "course": "FR3101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "The best instructor I've ever had. She is so genuinely passionate about French grammar and teaching it to us. I learned so much in this class and was truly excited to come to class everyday. I wish Dr. Parson taught more classes so that I could take her again. It's rare to have a class that's both challenging and extremely fun, but this class was.",
        "course": "FRENCH3101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Shes a really nice professor and was helpful especially when taking this class online. Exams arent too bad if you study. Most of your grade comes from easy homework assignments. I would recommend this class online to anyone that has to take it.",
        "course": "FRENCH103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's awesome. She's great at explaining grammar concepts, so much so that I probably understand French grammar rules better than I do English. The class was cookie-cutter, if you show up, study the grammar, and do the homework, you'll get an A. For reference, I studied for 2-3 hours to get an A on the final.",
        "course": "FRENCH3101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Parson is great at her job. She's very passionate about the concepts, and is great at communicating them.",
        "course": "FRENCH3101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "She was the hardest teacher for me this semester. Her class was up there with my chem 1220. The content is ridiculous, but she's such a great person. I never left a midterm upset with her, just myself.",
        "course": "FRENCH3101"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "A lot of her explanations were \"because French,\" but she did care about helping individual students. Her tests are fair.",
        "course": "FRENCH3101"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Parson was an amazing 3101 (grammar) instructor. She always made sure that everyone understood each topic before moving on, and her powerpoints highlighted tough grammatical concepts well. Her tests were VERY fair: if you read the book and did the practice problems, you were guaranteed an A.",
        "course": "FR3101"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Julie was a wonderful professor and she helped me understand and learn so much about the French New Wave. I really appreciated her style of teaching, take any class with her if you can!",
        "course": "FRENCH5702"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "One of my least favorite classes I have taken. The syllabus says the class is about conversation but she made the class an in depth look at french cinematography. SO MUCH WORK. and your effort is hardly rewarded - not recommended",
        "course": "FRENC104"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "i cant believe she doesnt have more ratings!!! BEST FRENCH TEACHER EVER, if you are lucky enough to have a class offered with her teaching it, hurry up and sign up for it EASIEST A EVER, FUN down to earth person!",
        "course": "FRENC102"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was my adviser for my study abroad during 2009. She single handedly made the study abroad experience the best summer of my life.",
        "course": "FR444"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had her for 103.66. Great teacher. So helpful. I would definitely recommend her to anyone!",
        "course": "FRNCH103"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome and extremely nice teacher. Workbook is a bit tedious but a very good grader. Very funny as well. Never in a bad mood",
        "course": "FRENC104"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had her for French 103.66 and 104.03.  I hadn't taken French since my sophomore year in high school but got placed into 103.66 my sophomore year.  She made French so easy for me and made me feel like I hadn't been gone from it at all.  Fantastic professor, one of the best I've ever had, it's hard to believe she is still just a TA.  Great.",
        "course": "FREN103"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "WONDERFUL, GREAT, FABULOUS.  Could not have passed French without her, she is super helpful, fun, and really tries her best to take the fear out of foreign language!",
        "course": "FRN103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "French",
    "firstName": "Mauro",
    "id": "VGVhY2hlci0zMDQ4MDIx",
    "lastName": "Cazzolla",
    "legacyId": 3048021,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "A great professor who tries his best to make students laugh and makes everyone feel comfortable to participate. Lots of class is answering questions on the board with a partner sitting next to you, but he is very chill about it. Would 100% recommend him to anybody who has to take French. ",
        "course": "FRENCH1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved this professor so much! He truly made class so much fun and valuable. His slides are always updated and the activities are always helpful in learning the content. The mindtap is really the only thing that can be a little too long, depending on the assignments for that night, but overall pretty simple. Be ready to participate!!",
        "course": "FRENCH1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Overall lovely professor! Created a great environment in my class and was very funny, though I will say the content at the beginning of the semester drags a little. Besides the nightly mind-tap homework, would take again!!",
        "course": "FRENCH1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely wonderful professor! Learning a language is difficult, but he made it fun. Lots of laughs were had during class discussions. I always enjoyed coming to class. Would 100% recommend to anyone taking French. MindTap homework is the only bad thing about the class.",
        "course": "FRENCH1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor, truly cares about seeing his students progress in learning french. Encourages speaking up in class and participating in small group conversations to help literacy. Would 100% take this class again.",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really a great professor. He's very funny, and very helpful. Would definitely recommend to anyone who wants a fun French experience ",
        "course": "FRENCH1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor, really funny, kind, and caring. He really cares and wants everyone to feel welcome and have a great time in his class.",
        "course": "FRENCH1103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Truly a great professor who cares about his student's success and made the class enjoyable despite it being a requirement for most majors. If I had to take French again I would definitely choose him as a professor.",
        "course": "FRENCH1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Darrell",
    "id": "VGVhY2hlci0yMzYxNzQx",
    "lastName": "Estes",
    "legacyId": 2361741,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Estes is an amazing professor that cares greatly about his students. He wants you to succeed!",
        "course": "FRENCH3100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Estes is a great professor. He is always telling anecdotes about his life and makes the class very casual and low-key. Attendance and participation are essential for your grade. There is a ton of homework on Mindtap, but that is not Dr. Estes' fault. You may not learn a ton of French in his class, but it's an easy A if you do the work.",
        "course": "FRENCH1115"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Estes is a fantastic professor. He cares about his students, truly looking out for their best interests. One thing to note about this course is that you will have to do additional studying outside of class. He tends to deviate into personal (and funny) anecdotes, but it is not as French-intensive or immersive as one might expect.",
        "course": "FRENCH1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I would definitely recommend for the class experience, but if you are looking for a class rigid to the curriculum and all in French, this might not be for you. He wants everyone to pass, and is very understanding. ",
        "course": "FRENCH1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor. If you have previous experience in French, this class won't be hard. Majority of the class is in French. He is a fair grader and wants all of his students to pass. Homework everyday, but it can be spaced out how you like. Tests are online and open note but timed. He is a great guy and has funny stories.",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Dr. Estes so much, he really engaged with each and every student and made sure that they knew the material, he's also a hilarious slay mamas and girly pop if that helps anyone. ",
        "course": "FRENCH1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Estes is very funny and caring. The class was very easy. There was maybe 20 min of hw before every class, and you'd just spend the entire class discussing it. He could be a bit disorganized at times, but his students never suffered for it. He's a super great guy, I'd really recommend taking classes with him if you can",
        "course": "FRENCH3100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was a very funny and understanding professor. The only downside was the MindTap homework we had due before class that was very long and sometimes took hours. Attendance and participation were optional in order to get an A in the class.",
        "course": "FRENCH1155"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Estes is such an awesome prof. He knows his material and he is so excellent at teaching it. He can get off topic, but its always interesting. Super funny and has a great sense of humor.",
        "course": "FRENCH1115"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "You can tell Dr. Estes cares about his students and wants them to succeed. There are a lot of participation opportunities in his class to improve your French, but not required. He can get a bit off topic sometimes, but it's nothing crazy. Dr. Estes knows exactly what he is doing when teaching this class.",
        "course": "FRENCH1155"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. E is amazing! I loved listening to his stories and always looked forward to his class! As long as you show up to class and do your homework, you learn a lot and enjoy the class. He was so helpful and by far the most understanding professor that I have ever had.",
        "course": "FRENCH1102"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Super understanding professor. Great personality and he cares. Attend classes for extra credit at the end of the year! I learned lots of French tho I do wish we would have had more interactions between students. But of course we are in a pandemic so it was harder. Take this class with him!!!!",
        "course": "FRENCH3100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Most understanding professor I have ever had",
        "course": "FRENCH1102"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Estes is a really fun character and you can see his love for the French language in the way that he teaches. There are a lot of daily assignments to keep up with but they're never overwhelming. I definitely recommend attending class every day not only to keep up but to enjoy some of the off-topic rants that Estes does every once in a while :)",
        "course": "FRENCH1103"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "He often told personal stories and interacted with students on unrelated topics but overall was very fun and fairly helpful. I think that French itself is just harder at this point and takes more effort to learn and thats why any difficult parts were difficult, but he gives tons of extra credit opportunities to make up for it.",
        "course": "FRENCH1102"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Estes an amazing professor. He is very personable and makes class an interesting experience. He does get off topic a lot and loves to tell stories, but we still cover all the necessary material so that's just a bonus. The only downsides to this class are the mandatory attendance and the large (very large) amount of homework (Cengage is awful).",
        "course": "FRENCH1155"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "Darrell Estes is a character I never expected to encounter in the French department. He is very knowledgable about the language and has a strong passion for teaching. He gets off topic (often) in the class but no one seems to mind. I love listening to what he has to say everyday, it is always something new. Tests can be hard but not impossible.",
        "course": "FRENCH1155"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2,
    "department": "French",
    "firstName": "Marie-Claire",
    "id": "VGVhY2hlci0xMjA5NTc4",
    "lastName": "Menard-Hall",
    "legacyId": 1209578,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "i hate her",
        "course": "FREN102"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "THICK accent with very little concern that about 1/2 of the class was unable to understand her most of the time.  Adherence to the syllabus was choppy.  Oral tests bordered on impossible to pass (I was studying 15-20 hours a week) no curve grading and as a result 2/3 of my class received a grade below a C.  I had a high &quot;A&quot; in 101, Low &quot;D&quot; in 102.!",
        "course": "FREN102"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Marie-Claire is a native speaker, which is a good resource to have when learning another language.  She is very friendly and has a fun sense of humor.  She is more than happy to help if you ask for it.",
        "course": "FRENC104"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her dialect was awful. Plus she really did not help clarify things. She spoke way to fast. I could not understand her French or English.",
        "course": "FRENC104"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "FRENC103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Karlis",
    "id": "VGVhY2hlci0xMTI4NjQ3",
    "lastName": "Racevskis",
    "legacyId": 1128647,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is not a typical older professor. He is young at heart and really open and receptive to students. He's nice and funny. You're supposed to read alot but can get away without doing any of it, just research the topics online. The textbook was expensive. There are only two tests, one paper and participation so they all count!",
        "course": "FRENCH5402"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "He expects a lot from students, but is willing to help when asked. As long as you understand the main ideas of each author, you will do decently on his exams. The essays are only graded on grammar, on which he is a stickler, but he edits the first draft and grades the second. He didn't take attendance, but go to class to get all of the information.",
        "course": "FRNCH426"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Native French speaker, expert on his subject, prefers lecture-style classes and is a really nice guy.",
        "course": "FR825"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Racevskis is an old school style professor. He's obviously interested in what he teaches, and he has lots of interesting stories to add to the material. He seems to prefer lecture to class discussion. He's a very clear teacher, but he seems to look for very exact answers on exams, which can be a little tough. Show up to class and you'll do fine.",
        "course": "FRENC425"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Racevskis is a terrific professor.  He is my favorite professor in the department.  He is very knowledgeable, and explains all the topics very clearly.  On top of that he is full of interesting stories and facts.  I looked forward to going to his class, and it is not too difficult to earn a good grade.",
        "course": "FRNCH652"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Jaleh",
    "id": "VGVhY2hlci0xNzg2NDc0",
    "lastName": "Sharif",
    "legacyId": 1786474,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Madame Sharif is wonderful, and I highly recommend! Her French accent seems flawless to me, and she speaks with authenticity. Her english isn't 100% fluent, but she understands if you write it down. She will try SO hard to help if you don't understand something in class. She's very passionate about French and culture. She's also adorable.",
        "course": "FRENCH1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is the best professor that I have ever had.",
        "course": "103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher. Shes iranian so its cute because shes learning english words as you learn french. Attendance is mandatory and she relies heavily on class participations. (20% of your grade in which attendance is a factor). Tests are reasonable and if you do the daily homework and participation you will get an A.",
        "course": "FR1103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Best teacher I've had at OSU. Very helpful, understanding, and kind. Had a lot of fun going to class, she is a very fun and happy person! Very easy to talk to and was very helpful!",
        "course": "FRNCH1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0xMDAwMzAz",
    "lastName": "Anderson",
    "legacyId": 1000303,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is definitely one of the coolest and understanding professors. He knows the French culture really well, so you can learn a lot from his stories. If you pay attention and attend most of the lectures, you'll do well in class.",
        "course": "FREN102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "He made it interesting because he lived in France and knows the culture all around.",
        "course": "FREN102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr. Andy is one of the best professors I've come in contact with at Ohio State. He is so helpful and understanding with French language, and one can tell that he genuinely cares about his students. He is always willing to help if one doesn't understand something, and his quirky personality adds to the fun learning environment of his class. ",
        "course": "FR2101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "At first, Andy did not seem like a TA I would appreciate, but I gave him a chance, and everything turned out great! Andy is very eager to help all students. As my individualized instruction TA, he was excited to help me with French. He is an excellent TA as well as a very nice person. It's quite unfortunate he'll be graduating this quarter.",
        "course": "FRENC103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "He loves French, and it shows when he teaches. His projects are pretty easy, his quizzes are a breeze, and he really prepares you for the exams. He has a very quirky sense of humor that really makes class interesting. Highly recommended!",
        "course": "FRE103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He really knows how to teach - he speaks in French, but he always goes back and explains it in English. His sense of humor is quirky and definitely amusing, and all his stories are interesting and pertain to the class.",
        "course": "FRNCH103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great prof, very keen to help students, explains things in English if needed. Funny guy and easy to get along with. Easy class.",
        "course": "FR103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "great guy!",
        "course": "FRE104"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "He teaches the ideal french class, english translation for stuff one doesn't get, interesting material,lets you do a presentation on whatever (i did absinthe), will clarify anything, tell hilarious stories, and best part, the class is not hard in the least, just read before exams but most quizzes are opinion-essay based, take this instead of 104.01",
        "course": "FRE1043"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "Andrew's great! Odd sense of humor, but I found him very entertaining. The material is very easy and manageable, and Andrew is very flexible. I definitely recommend him for 104",
        "course": "FRENC104"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Hilarious stories, easy to understand, easy tests (if you try), and an all around willingness to help. Take him if you can!",
        "course": "FRENC104"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was very helpful and helped you learn the material if you were having trouble.",
        "course": "FRNCH102"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "really good guy.. very nice and helpful. often had entertaining stories. if you have to take 104 as a GEC, definitely go with andrew",
        "course": "FRENC104"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher! Makes class easy to go to, funny guy. Tests are easy if you pay attenton to what he goes over in class. Highly reccommend him!!",
        "course": "FRENC104"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good guy, bad at passing back papers, i'm in my ninth week of class and he hasnt given any of our homework back...therefore i have no idea what my grade is!!!!!!!!!!!!!!!",
        "course": "FRENC104"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "he really tried to help the students...and explained things in english which was very helpful. the quizzes were really easy and fair. overall, he was a good prof, but towards the middle of the class, he stopped returning papers so you had no idea what your grade was.",
        "course": "FREN102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.6,
    "department": "French",
    "firstName": "Guyomar",
    "id": "VGVhY2hlci0xNjcyMDAw",
    "lastName": "Pillai",
    "legacyId": 1672000,
    "numRatings": 25,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I've had many French teachers in high school & college, and Miss Pillai has been the best! For someone who struggles with speaking & understanding spoken French, she's very patient and helped me improve my accent. She's willing to work with students one-on-one and as long as you put in effort,  you will learn a lot about French language & culture.",
        "course": "FREN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Guyomar was amazing - she thoroughly  explained all details and was available for help at anytime you needed it. There are plenty of opportunities for extra credit as well. You have to come to class & participate in order to pass and also STUDY. She's reasonable & fair and will work w/ you if you need it! She's great!",
        "course": "FRENCH1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hands down Madame Pillai is one of my favorite professors. This class definitely requires class participation. She makes you work for an A as a great prof should. She is extremely passionate about teaching. She is very approachable and you can see how passionate she is for teaching. Just come prepared, because that's all she asks. It's that simple!",
        "course": "FREN1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "It's amazing Madam Pillai wasn't more frustrated by the disrespectful borderline hostile attitude some students had. Before and during class, ignorant backward comments could be heard from some people. She was always prepared and tried to teach, but unfortunately some students were openly rude and disruptive. Grading is clear and straightforward.",
        "course": "FRENCH1155"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "She doesn't grade easy but I actually understand the language now. She doesn't slow down and it was hard at the start of class but i feel like I understand how real French sounds. ALWAYS  be ready to talk because she randomly calls on people. She can be kind of tough but she is helpful outside class and gave me tons of advice about study abroad.",
        "course": "FRENCH1155"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "She was a fine professor, she really knows what she's talking about. The only problem with that is sometimes she kinda forget we're students and are trying to learn. She can get frustrated really easily with students if they don't understand something. Participation is SUPER important also.",
        "course": "FREN1155"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was made a LOT more difficult than it needed to be. Participation points in her class were 10000x more difficult to get than in any other of the French classes.  She also was very impatient with her students and got frustrated very easily. This class should have been an easy A but unfortunately this wasn't the case",
        "course": "FRENCH1155"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Passionate about the material but she expects a lot and I think she doesn't get French is hard for some,especially talking.  Class was way too big. She really likes the subject but she could be more patient with the class when readings are long and difficult without a list of vocab words. Study guides were helpful sometimes but stressful too.",
        "course": "FRENCH2101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Always be prepared to speak in class- participation is huge! Tests are clear cut- if you paid attention in class and read the material you'll do well. Keep up on homework- there's not too much of it! ",
        "course": "110304"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lots of work but ok, it's language after all, just show up and listen and pass. ",
        "course": "1103"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "There is a standard but it doesn't exceed students level. Her expectations are practical and plausible. For those who's says she's tough should go to Wong's(head of dep) class, then you'll know what \"tough\" really is. I took 1102 with another instructor and it was a disaster. I would definitely take her class again if I could. ",
        "course": "1101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Miss Pillai is very responsible and passionate about teaching. The grading is strict I do admit, but that does for the whole French department, no points were taken out of personal favor or so, the rubric was clear. But most importantly, her class is not dull at all, so personally I wouldn't even want to skip this class because it was just SO fun.",
        "course": "FRENCH1101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Insanely demanding. Miss Pillai is really strict and she will call you out if you're not doing the activities or look distracted. She has very helpful Powerpoint and her knowledge of French culture is impressive but she could be friendlier to make class less stressful.",
        "course": "FRENCH110301"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is a good and thorough teacher but this class is so much WORK!! All the reading and homework and participation we need to do is too much for summer. She has too high expectations for a GEC, she needs to be more relaxed in classroom discussion. Not everyone has time to read everything and give answers! She helps outside class but intimidating.",
        "course": "FRENCH1103"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "This was a pretty advanced class and she expected us to be there...and participate. Which is understandable. She's a harsh grader but also gives excellent feedback and I left the class really feeling like I knew what I was doing. Best french class I've taken so far!",
        "course": "FREN1103"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "It's true that she is a tough grader, but tough in a good way. She is clear about what she expects and gives you the tools to do well. The movies were actually interesting and I learned a lot about how to analyze them. She can be a little intimidating because she talks in French all the time and wants you to participate but my French got better.",
        "course": "1103"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "Pillai is a great professor who is very intelligent about French and French culture. I think if you understand the language she likes you, but she easily gets annoyed with her students and expects people to speak fluently. It seems she forgets we are students learning the language. Homework wasn't too bad, but she is a very critical grader.",
        "course": "110302"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "I would definitely recommend her as a prof. She is very clear about HOW you are being graded as well as your progress (unlike my last teacher). She clarifies things very well! Really enjoyed this class despite taking it in the 7 week summer session!",
        "course": "FRENCH1102"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "I enjoyed this class a lot. It was challenging without being overwhelming. The instructor has great presentations to help learn the vocab words. Some of the activities in the book can get boring but the ones she makes herself are great! She is really picky about following instructions and calls on people to speak. But she is fair in her grading.",
        "course": "1102"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Native speaker. Upbeat personality. Very engaging. Uses Harry Potter and fashion shows to teach.",
        "course": "FRENCH1102"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Guyomar is an excellent teacher. She knows how to incorporate pop culture and make the lesson interactive. You have to participate and I like that she gets everyone involved. Her French is beautiful too and she is clearly really passionate about the culture. And yes, she is pretty easy on the eyes. I will miss having her as a teacher!",
        "course": "1102"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Incredibly sweet, speaks perfect French (native speaker), willing to help in class... and, not that it has anything to do with her quality as a teacher...but really, really easy on the eyes.",
        "course": "FRENCH"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a wonderful professor and a sweet person. She made the class fun and her powerpoints are so detailed and helpful. Class is challenging in a good way. would love to have her again!",
        "course": "FRENC1102"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "It was a fun class and interesting because she really knew the culture as she is a native speaker. she gave good study guides and had helpful review before the exam. She was very personable.",
        "course": "FR102"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 1,
        "comment": "Guyomar is fair and helpful. she really does want to teach her students to speak French well. As with all French classes I recommend that you do as much extra credit as possible even if you don't think you need it, to build up your defenses against a bad grade you may get.",
        "course": "FRENC102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 5,
    "department": "French",
    "firstName": "Brittany",
    "id": "VGVhY2hlci0xODcyMTk2",
    "lastName": "Murray",
    "legacyId": 1872196,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such a fun professor. Fairly easy and straightforward class. Do very little reading in a literature-based class, a lot of movies and TV shows instead. Such a nice professor who cares about her students and the subject.",
        "course": "COMPSTD2104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Murray is a terrific teacher! She made the class enjoyable and easy to learn. She also has a genuine interest in her students success. I would certainly take another course with her.",
        "course": "FRENCH1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an amazing teacher! I love her and would love to take her for French 2 and 3. The homework looks like a lot but it actually doesn't take that long to do. There is one group projecr towards the end of the semester that is actually really fun! I recommend her to anyone who wants to take French 1101.01! ",
        "course": "FRENC1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Brittany is amazing. She genuinely cares about all her students and wants all students to succeed as long as they put in the effort. Attendance is required and you must participate, but going to class was never a drag. I learned a lot in this class! Definitely recommend.",
        "course": "FRENCH110301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Brittany was awesome. She is young and is understands the students. She requires a lot of participation but it is so worth it because by the end of the semester you will be speaking full french.",
        "course": "FRN11031"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.4,
    "department": "French",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0xOTEzNTQw",
    "lastName": "Roesch",
    "legacyId": 1913540,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Roesch was very organized and always on time for class. He made every powerpoint from scratch and they were super helpful and I think that in one semester I was able to really improve my French and he also helped me for the study abroad program. THE BEST, EVER. Please, keep rocking it, Prof. R!",
        "course": "FR2101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "He was great, but every once in a while he was a bit unorganized.  He made class fun and interesting.",
        "course": "FRENCH2104"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "He helps and does his best to make sure all his students understand the material. ",
        "course": "1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Roesch was great.",
        "course": "FRENCH110101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Laurene",
    "id": "VGVhY2hlci0yMDA1NTI2",
    "lastName": "Glimois",
    "legacyId": 2005526,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is probably the cutest human I have ever met. Such a joy to learn from. She is so helpful, genuinely wants to help you succeed, and she brings cookies and treats to class like at least once a month. She knows every student by first name and takes the time to ask us questions before class starts. Read all the readings and engage in discussions!",
        "course": "FRENCH2101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Laurenne really has passion for the class she teaches. She genuinely cares for her students and wants them to succeed. Having her as a professor made me completely sure that I wanted to tack on an optional French major",
        "course": "FRENCH110301"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's an amazing teacher! She's really kind and will make sure that you understand everything!",
        "course": "FRENCH110301"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Laurene Glimois is a native Francophone. She speaks rapidly, but always slows down and repeats in English if you are lost. Her classes rely heavily on participation. If you don't speak up (in French) at least a few times a week, you'll miss a lot of points. Homework is straightforward. Extra credit in the form of visiting Cafe +. ",
        "course": "FRENCH110301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mme Glimois personifies what a teacher should be.  She is always well prepared, explains concepts well, and cares intensely that her students learn and succeed.  Her notable characteristics are an  always pleasant disposition and unflagging energy.  She captivates the class.   She does not play favorites, always treating each student with respect",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Laurene is one of the best teachers I have ever had in my life.   She's basically flawless.   Very real expectations.   Very easy to talk to.   Great energy in the classroom.   I was really worried about this class with how much I didn't learn in 1101 and 1102, but she made it all alright.   She also brings a lot of treats too.    ",
        "course": "110301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.3,
    "department": "French",
    "firstName": "Caroline",
    "id": "VGVhY2hlci0yMDU5MjQw",
    "lastName": "Noble",
    "legacyId": 2059240,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "I like her as a person but she is a tough grader. She doesn't grade on your french language skills, but rather on your writing skills. This is a problem because it is difficult to write in another language and make a one page paper good, and although I never had grammar mistakes I always got 7/10 on my papers, she also didn't round up my 92.9%",
        "course": "FRENCH2101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fun teacher, very engaging",
        "course": "FRENCH1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Noble is really nice and helpful!! She presents the material in a really interactive manner and is a fair grader! Definitely recommend!",
        "course": "FRENCH1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Caroline is the best teacher  I ever had. She made the class fun. Her french is amazing and she gives good feedback. And she is cute!",
        "course": "FR1102"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's pretty funny, but a tough grader. I'm amazing at french so I didn't have a problem. You peasants might not pass with flying colors like Queen B over here, ",
        "course": "FRENCH1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.6,
    "department": "French",
    "firstName": "Heidi",
    "id": "VGVhY2hlci0xMjU5MzUy",
    "lastName": "Brown",
    "legacyId": 1259352,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "The comments below seem kind of suspicious - Heidi didn't teach any classes this fall at osu because she is a professor at another college. I took her when I was just starting out with French and she is an excellent teacher. If you like pushover easy-A instructors, she's not for you, she makes sure you learn and earn your grade.  I'm a French major",
        "course": "1102"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Heidi is a terrible professor. Her classes are boring and her tests are basically novels. If you have her for 2101, I would suggest taking it with someone else, such as Gloria Torrini-Roblin. Like others have said on here she is more than will to turn on her students for no reason. Gloria however doesn't have this aspect and is extremely helpful. ",
        "course": "FRENCH2101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was an excellent and caring professor. Easy to access and even met outside of class for extra credit sessions. As for her \"pretentiousness\" she knows what she's talking about, and will correct you if you don't.  Her grading is straightforward and it's easy to succeed (if you do the work). I learned a lot too!",
        "course": "FR2101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "I disagree with the previous two comments about Heidi. She is a very dedicated teacher and she wants her students to do well. Heidi is well-organized and she really cares. I find her to be professional and classy, not rude at all. Perhaps someone had a different experience, but I think she is a good teacher.",
        "course": "FRENCH"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Precocious and rude at times. If you ask something she can be a little rude when responding. Her classes drag on, and they are mainly review such a bore. If classes weren't mandatory you wouldn't have to go.",
        "course": "FRENCH"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Is a nice person and a understanding to a point. Very particular with grading, but lets you argue your point.The books for class aere very expensive and not at all interesting. But watch out you may be turned on.",
        "course": "FR210101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took the bridge course with Heidi. She was an awesome professor. She really loves teaching French. If you go to every class, participate and do all your work you will get a good grade. But if your a slacker, who does not go to class-don't bother taking a class with her. She was a great French teacher.",
        "course": "A3"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "This is coming from someone who finds Heidi Brown a bit stuck up and pretentious - She is an excellent French teacher. I learned so much from her course!! I recommend her. As long as you come to class,participate a bit, and do your homework, you will do well.",
        "course": "FRENC1102"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Heidi was a great teacher. The most important thing about her is that she truly speaks French like a native, even though she's just a grad student. When you know the words she knew on the spot, you know you're good. Highly recommended.",
        "course": "FRENCFREN"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Heidi is a grad student and is awesome! She goes out of her way to make sure that students comprehend the material and learn french. She provides good exam study guides and is a very fair grader. She is extremely enthusiastic and I highly reccommend her.",
        "course": "FRENC1026"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Steve",
    "id": "VGVhY2hlci0xMjA4NDIw",
    "lastName": "Hedge",
    "legacyId": 1208420,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Was an outstanding teacher. Learned a lot, but he was funny the whole time. Very straightforward about what would be on the exams. My favorite professor I've ever had to this point.",
        "course": "FRENCH1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Love him! He is absolutely hilarious. Take him if you have the chance!",
        "course": "FRNCH104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Steve was a great prof!  He's easy going and he loves teaching French.  He's also funny and tells good stories.  This was my absolute favorite class this quarter.  Try to take his class if you can.",
        "course": "FRENC104"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Mr. Hedge teaches French 104N01 once a year during autumn quarter.  He is also a teacher at Grandview Heights HS.  There is a lot of testing in the night class curriculum for French 104N01, but he a lenient test grader.  I highly recommend this professor.  He is easy going, but is also a knowledgeable teacher.",
        "course": "FRENC104N"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "French",
    "firstName": "Jarrett",
    "id": "VGVhY2hlci0xNTAyNzU4",
    "lastName": "Anderson",
    "legacyId": 1502758,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's my favorite professor I've had since being at OSU. He's really funny & nice. Also he is extremely helpful. I recommend taking this class even if you've never taken a French class before, You'll have a great time. It was actually the only class I didn't mind going to.",
        "course": "FRNCH101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "He has so many funny, but helpful, examples and really works with the whole class to make sure everyone understands (as the course is conducted mostly in French). He is a great instructor, I highly recommend him!",
        "course": "FRENC103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best professors I've ever had. You'll love him! He makes learning so fun. He has hilarious ways to teach you certain words. And he's very attractive. Definitely take French and hope you get him. It'll make your whole quarter worthwhile.",
        "course": "FRNCH101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "French",
    "firstName": "Romain",
    "id": "VGVhY2hlci0xNDIwMzY0",
    "lastName": "Poumard",
    "legacyId": 1420364,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Knows more about American culture than most Americans, not to mention French culture. Pretty easy to understand. He was just really cool. :)",
        "course": "FRENC104"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "He spoke in mostly french, but his class was easy overall",
        "course": "FRENC104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.6,
    "department": "French",
    "firstName": "Romain",
    "id": "VGVhY2hlci0xNTQ1NTk4",
    "lastName": "Paumard",
    "legacyId": 1545598,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Romain is pretty cool, but class could get a little dull at times. It's easy to do well as long as you know the material and participate in class (participation is graded so you have to talk, and a lot of people in my class didn't). Grammar was never a focus, so if that's not your strong point, take this class. French culture is also interesting.",
        "course": "FRENCH110304"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "He's an alright teacher. Your have to study for his tests to do well on them. His class gets boring sometimes. All we do is take notes, do activities from the book, go over them, and then take notes again. We don't have any fun projects or watch french movies. He'll show french music videos on Youtube once in a while, but that's about all.",
        "course": "FREN1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Romain understands because he is from France. When people do not understand, he will explain it in English to help. He is very helpful. I am not wonderful at speaking French, and he worked with me. He shows cool youtube videos at the beginning of class as well. I would highly recommend this class!",
        "course": "FRENFREN"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super nice and super funny. Makes the class interesting.",
        "course": "FRENC104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "French 104.03 is a great alternative to the regular 104.01 required for students who need their final language credit. The class is focused on French culture and society, and because Romain is from France, he's super knowledgeable. He's young and funny--communicates material in a way that is easily understood by American students.",
        "course": "FREN104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "French",
    "firstName": "Philip",
    "id": "VGVhY2hlci0xNzMwMDEz",
    "lastName": "Nelson",
    "legacyId": 1730013,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "He always came to class prepared but he was ... awkward--in a nerdy kind of way. His grading was fair and he was always available during his office hours. However, he doesn't post grades online and doesn't know how the department structures the class but he isn't a bad professor. You just have to ask for things",
        "course": "FRENCH110301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 0,
    "avgRating": 0,
    "department": "French",
    "firstName": "Jeffrey",
    "id": "VGVhY2hlci0xNTA2NTk3",
    "lastName": "Harris",
    "legacyId": 1506597,
    "numRatings": 0,
    "Ratings": [],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.8,
    "department": "French",
    "firstName": "Diane",
    "id": "VGVhY2hlci0xMjA3NDQ0",
    "lastName": "Birckbichler",
    "legacyId": 1207444,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Good teacher, but extremely repetitive, specially with activities. Assistance not so important, but participation is determinant to get a good grade.",
        "course": "FREN6571"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "best french prof. yet",
        "course": "FR402"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "French",
    "firstName": "Emma",
    "id": "VGVhY2hlci0yMTk4NTA5",
    "lastName": "Guzowski",
    "legacyId": 2198509,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I absolutely loved Emma's class! She is so fun and you can really tell that she enjoys teaching her students. Make sure you go to class, attendance is taken and there is a lot of participation, but like I said, she makes it fun. I would highly recommend her!",
        "course": "FRENCH1155"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Emma Guzowski is a one of the kindest professors I have had at OSU. She really cares about her students and wants to gets to know them. Since she is so caring, she understands her students and really works to help them get a good grade in her class. There is a lot of HW, but it is essentially a guaranteed A (HW wise). I highly recommend Emma.",
        "course": "FRENCH1155"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "French",
    "firstName": "Emma",
    "id": "VGVhY2hlci0xOTc0MDM0",
    "lastName": "Bartlett",
    "legacyId": 1974034,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Can tell she has a real passion for the material. Decently knowledgeable and very cute.",
        "course": "FRENCH1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the sweetest teachers I have ever had! The class is by no means difficult,  but there is a decent amount of homework. She grades very fairly and she is more than happy to help you out if you do not understand a concept.  She is also a hilarious person, and also really knows her french! Definitely take her if you have the chance!",
        "course": "FRENCH1155"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "She's really sweet. Possibly less engaged in the material because these are obviously very menial classes. If you have an okay understanding of french then the class is incredibly easy.",
        "course": "FR1103"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a genuinely nice person and not a bad professor at all, and is available for help if you ask for it. Grading can be tough and rather sporadic, but isn't horrible. In-class activities are repetitive and require lots of participation. Homework is online and simple. ",
        "course": "1103"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "I'd rate her a 5 out of 10. I really like French so I think that made the class a bit easier to me but I think the powerpoints were a bit unorganized. She made the class fun but sometimes I think a lot of the in-class work was repetitive. The homework was the same things. It wasn't a bad class just very unnecessary to me.",
        "course": "1102"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Tough grader. MUST be at class and on time. Must participate and get up out of your seat to do activities. Lots of assignments. Tests are medium difficulty but she is a hard grader. She's kind of annoying",
        "course": "1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.8,
    "department": "French",
    "firstName": "Bryan",
    "id": "VGVhY2hlci0xNDUyMTQ3",
    "lastName": "Pickens",
    "legacyId": 1452147,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've purposely taken Bryan's classes for two of my French requirements. He's such an easygoing guy and is willing to help with any issue you have in the class. His classes are more laid back than my other french classes, making it much easier to get a decent grade.",
        "course": "FRENC104"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Bryan is a fun teacher.  He uses activities that make learning the language more fun and relevant to the students.  He does use very little English, but I've found this common with higher level languages.  Overall, I would recommend him.",
        "course": "FR103"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "I wonderful guy however, he waste a lot of time talking about other things. Speaks very little english, and barely goes over VSB play or grammar. Funny guy but not a real good teacher! He does grade on the kind of easy side on midterms and presentation.",
        "course": "FRENC103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.3,
    "department": "French",
    "firstName": "Vincent",
    "id": "VGVhY2hlci0xODczNDEy",
    "lastName": "Bernard",
    "legacyId": 1873412,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Vincent was probably the nicest teacher ever. He was extremely patient and very very helpful with his students (he emailed us a lot to remind us of all the assignments). I highly recommend taking his class! It's not hard if you do your homework.",
        "course": "FRENCH110303"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Vincent is very nice guy, but his class is difficult. He is from France and speaks very quickly. For a level 3 French class, students are expected to be very advanced in the subject. Participation accounts for 20% of your grade, and at times it seemed he would only call on a select few students, which made it difficult to receive high marks.",
        "course": "FRENCH110303"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "For some reason, students feel entitled to a grade despite not putting in any effort. Then, they blame the instructor when they can't keep their GPA up. I know that Vincent is always willing to do whatever it takes to help his students succeed. He has a great rapport with his students and always has a beautiful smile. Thanks, Vincent!?",
        "course": "FR1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Vincent is adorable! He is a very dedicated instructor, is always well prepared, and he is very helpful. The comment that suggested he was a terrible professor is from someone who withdrew, so didn't attend most of the class, and isn't a reliable source. I felt lucky to hear French from a native speaker. If you do your work, you will benefit!",
        "course": "1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Vincent is an extremely kind, intelligent, and caring person who is always willing to help. It is clear that he goes the extra mile for his students. He is also very handsome! The course material is difficult if you don't study, but anyone who makes an effort will succeed with Vincent. He is by far the best professor I have ever had at OSU.",
        "course": "FRENCH1103"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Vincent Bernard means well. However, he was an incredibly hard teacher. He is a tough grader, fast speaker, and his lack of experience is very apparent. I don't recommend him unless you are very advanced in French. Personally, I thought he was the worst teacher I have had at OSU.",
        "course": "FRENCH1103O1"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "French",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0xNjc1MDY3",
    "lastName": "Leese",
    "legacyId": 1675067,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very helpful teacher. Workbook, which is relatively easy but time consuming, was only homework due every 3 classes or so. Exams and tests are manageable, especially with the reviews she does beforehand. Speaks only French in class unless it's something extremely important that we HAVE to understand. Overall a well above average teacher.",
        "course": "FREN1026"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.6,
    "department": "French",
    "firstName": "Anais",
    "id": "VGVhY2hlci0xMTU1NjQy",
    "lastName": "Wise",
    "legacyId": 1155642,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Mme Wise is a very energetic teacher but sometimes she can be very strict and intimidating.",
        "course": "FR104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anais is adorable and energetic. She's a native speaker and super helpful",
        "course": "FRENC104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved this Modern French class. Mme Wise was an exceptional teacher and she was so nice when grading and making quizzes. I did like the fact that she was a native speaker and cold tell us things that wouldn't otherwise be taught. This was definitely one of my favorite classes thus far.",
        "course": "FR104"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "she's so cool and makes the",
        "course": "FR104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best teachers I have ever had! She is energetic, clear, and a native speaker, so she has a better (I feel) grasp of the nuances and exceptions. Always helpful and mindful of a student's ability, but also pushes you to improve yourself at the same time. I enjoyed French coming in, and I still enjoy it coming out!",
        "course": "FRENC104"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best French teacher I have every had. I would def. recommend it.. if you study you will come out with an A and a better understanding of the French Language!",
        "course": "FRNCH104"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Native french speaker, energetic, helpful, you will lean alot in her class. By far the best of the 4 french teachers I have had. I would definately recommend her!",
        "course": "FR104"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "FRENC103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "French",
    "firstName": "Melanie",
    "id": "VGVhY2hlci0xMDAzNDk1",
    "lastName": "Myers",
    "legacyId": 1003495,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Melanie is very helpful if you don't understand stuff.  Learning a language is hard in general, but she tries really hard to make it easy for you.  Going to class is mandatory and you get points for class participation, quizzes and homework due every week, but they are not hard at all.  She makes quizzes easy points.",
        "course": "FREN102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Melanie is excellent. I just finished 104 with her and she couldnt have been any nicer or more helpful. Like others have said, she is very impartial and is calm. She expects a lot, but one can expect a lot in return if they try and participate",
        "course": "FRENC104"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Melanie is super nice! Very fair which is annoying for weekly participation points, but thats how it goes! Exams are real fair, make sure you know your culture stuff because its like 25% of the test. Compositions nor the oral test were bad- very fair on everything and always helpful! :)",
        "course": "FRENC104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher! very easy to understand and very helpful.",
        "course": "FRNCH103"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "FR103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.5,
    "department": "French",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0xMjM4MDE3",
    "lastName": "Bevevino",
    "legacyId": 1238017,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a great teacher. Her french is beautiful. It was one of the first classes I took at OSU, so I was intimidated by the only speaking French in class, but it really helps you learn! Easy A!",
        "course": "FRENC1026"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "great teacher and not bad to look at either",
        "course": "FRCH103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "J'aimais Lisa. She communicates in clear French and teaches well. The tests are fair and she is very approachable. Definitely  take her.",
        "course": "FRENC103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lisa was great! She is so adorable and trys extremely hard. She speaks beautiful French, which is nice to listen to but is sometimes hard to comprehend if you don't speak French well. If you go to class, participate, and read the required play, you will do just fine!! Just make sure to use your accent marks :)",
        "course": "FRENC103"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "FRENC103"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a good teacher. Very helpful!",
        "course": "FRENC101"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lisa is very helpful. She is a grad. student so she understands that we have a heavy workload because hers is probably heavier. Be aware though that if you haven't taken French in a while, everything is spoken in French most of the time.",
        "course": "FREN103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "French",
    "firstName": "Jarmilla",
    "id": "VGVhY2hlci0xNDIwMzM4",
    "lastName": "Kavekanska",
    "legacyId": 1420338,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great professor.  Really got me interested in French studies.  So much so that I have now changed my major to French.  Take her class if you have the chance!",
        "course": "FR101"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "This professor was very friendly.  She is younger and was able to have fun while teaching the material.",
        "course": "FREN101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1.5,
    "department": "French",
    "firstName": "Michelle",
    "id": "VGVhY2hlci0xMzA0ODgw",
    "lastName": "Gherring",
    "legacyId": 1304880,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "You cannot understand a word she says or writes and is an extremely harsh grader.",
        "course": "FREN102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.2,
    "department": "French",
    "firstName": "Jacob",
    "id": "VGVhY2hlci0xMjY4MTA2",
    "lastName": "Schott",
    "legacyId": 1268106,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "He comes across as bored, angry, arrogant and supercilious. He makes little attempt to explain material and when he does ask if his explanation is clear, his demeanor is so offputting no one asks for further clarification. The worst language instructor I've ever had. What a waste.",
        "course": "FREN104"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Every class period you are expected to have read material from the text, completed homework, and be prepared to take a quiz on the material. The quizzes are easy and he just checks for completion on hw, but you have to do hw and show up to his class. Like any foreign language class, you have to participate. Overall I learned alot and enjoyed it.",
        "course": "FREN104"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "difficult material, but he gives a pretty good explanation of it. very knowledgeable and enjoys what he's teaching about, making it interesting for students, even if it's hard to comprehend. class is very speaking oriented. material is interesting. professor is nice, helpful. i'd take this class again.",
        "course": "FR104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 3.8,
    "department": "French",
    "firstName": "Edward",
    "id": "VGVhY2hlci0xMDk4MzM1",
    "lastName": "Lasseigne",
    "legacyId": 1098335,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Oh Lasseigne. He is super nice, his clothing is adorably ridiculous, and he has the worst french accent I have ever heard. But he is a nice guy.",
        "course": "FR104"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good professor, nice and considerate, really takes the time to make sure students understand the lesson. always had extra review sessions.",
        "course": "FR103"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Nice guy and dedicated to making sure his students know the material. is very open to extra review sessions. however, class is very boring and he is often disorganized.",
        "course": "FRE103"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "WORST ACCENT I HAVE EVER EVER HEARD. DOESN'T EVEN PRONOUNCE LIASONS; TERRIBLE. IF YOU ARE A FRANCOPHONE, YOU WILL BE APPALLED.",
        "course": "FRNC104"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "He was a very good teacher and very leinent!  I recommend him as a professor!",
        "course": "FRNCH103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "FRENC103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is the best French teacher in the department. He is very knowledgeable and is devoted to helping his students out. He prepares his students well for the midterms and the final. He's also a lenient grader sometimes too.",
        "course": "FRNCH103"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 2,
        "comment": "He is sometimes hard to understang and tends to confuse students but he is an easy grader and is a decent guy.",
        "course": "FR104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.6,
    "department": "French",
    "firstName": "Bruce",
    "id": "VGVhY2hlci0xMjI2ODgx",
    "lastName": "Kalb",
    "legacyId": 1226881,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Bruce is a great guy with some hilarious stories... definitely makes coming in for an 8:30 class worth your time and zzzz's. Absolutely terrible in returning assignments and you never have any idea what your grade is... but the class is so easy that it doesn't make a difference anyway. Take him... and ask him about his Kenny Chesney concert. Do it.",
        "course": "FRE104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is very late at returning assignments and you never find out what your grade is. Although if you read the chapter the night before his power points are basically a refresher. Also he expects you to know all the material before you see it in class because the quizzes are at the beginning of class. Mostly English speaking.",
        "course": "FR103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "He does take his time returning assignments because he is a 'laid back' teacher. But he's also 'laid back' about everything else too, like turning assignments in on time. He's a cool teacher.",
        "course": "FR103"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Late in returning homework, quizzes and exams. Don't expect to know what your grade is.",
        "course": "FREN103"
      }
    ],
    "SEI": []
  }
]