[
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Geology",
    "firstName": "Derek",
    "id": "VGVhY2hlci0yMjQ4NjQ0",
    "lastName": "Sawyer",
    "legacyId": 2248644,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Sawyer is genuinely one of the kindest profs I've met not only in the Geology program, but across the university as a whole. He's not afraid to joke in his lectures, and he makes them genuinely engaging. His tests are creative and thought-provoking without being unnecessarily difficult. If he's teaching your GE class you should be excited!",
        "course": "EARTHSCI4502"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Not really a science a person but I learned a lot in his class. He had a great sense of humor and was very knowledgable. There were 5 exercises, 5 quizzes (lowest dropped), and 3 homework assignments. Attendance wasn't mandatory but it helped, and he posted his lectures after each class. Need a science gen ed, I encourage this class!",
        "course": "EARTHSCI2210"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really really awesome guy. Definitely cares about his students, easy exams, posts ALL of the lectures online but I still went to class anyway because he was cool and made the material interesting. I recommend EarthSci 2210 with him for sure",
        "course": "EARTHSCI2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4.2,
    "department": "Geology",
    "firstName": "Peter Noel",
    "id": "VGVhY2hlci0zNjA0ODM=",
    "lastName": "Webb",
    "legacyId": 360483,
    "numRatings": 33,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "it was a privilege and a pleasure to be his student. He is a geologist who will be in the history books.",
        "course": "GEO550"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "A terrific professor!",
        "course": "ES100"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Good guy, tough tests but goes out of his way to help you.",
        "course": "ES100"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "i feel like he had such good intentions but just, ugh. the lectures are super boring, and the midterms are on material that is not found in the book, powerpoints, or lecture. so awful.",
        "course": "ES100"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "The exams are pretty tough, so make sure you get a good lab grade. I really enjoyed the class, Professor Webb has a lot of experience in his field and he has amazing stories to tell.",
        "course": "GEOSC100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is a really nice guy.  His tests are hard though.  There are only two midterms, a final, and lab grade.",
        "course": "EARTH100"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Webb was a great teacher who really does care about his students. I had him for Earth Science 100 and then Oceanography. I enjoyed both classes because Webb has so much knowledge about our environment and it 's very fun to pick his brain. He has so many good stories about his travels all over the world.",
        "course": "GEO100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great accent; he's from New Zealand if I remember correctly.  Somewhat difficult to follow at first, but he's a very interesting lecturer.  Speaks with subtle humor that he may not even notice.  Attendance is not mandatory, but it's worth it to go.  Never spoke to him one-on-one, but he seemly quite friendly and approachable.  Exams were fair.",
        "course": "ES206"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Webb is preplexing. He is a nice guy, has great intentions, but is a very poor communictor.  I like to listen to him talk, but I would not take any more classes from him. BTW - he has a peak in Antarctica named after him!",
        "course": "GEO550"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "Tests are hard and cover material you will probably never learn. Studying the lectures, labs, and notes will not help you much at all. He gives extra credit at the end of some classes but almost no one can ever make it through an entire lecture. He seems like a nice person, just not a great teacher. Just guess on tests and hope for the best.",
        "course": "GEO100"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "Webb is a nice guy, but his exams test things he never taught. He likes to keep students interested so he lectures on interesting things but then tests on detailed topics not explained in class. Difficult to know what to study for. Labs are easy. I know there are better professors to take Earth Science with.",
        "course": "GEOSC100"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "Extremely boring teacher.  The way he presented his notes were very confusing. Asked very unfair questions on the exams which ended up being very hard.  Best thing that happened was he left towards the end of the quarter for Antartica (very unprofessional) and Christine O'Malley taught the rest of the class. She was pretty helpful.",
        "course": "GEOSC206"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such a great guy! Has great stories and a New Zealand accent.  Lectures are somewhat boring but he tries to make them interesting.  Study his practice tests online for tests.  They seem hard but there's usually a huge curve.  TAKE HIM!!",
        "course": "GEOL100"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "make sure you get 100% on the labs!  The tests are hard unless you study his old exams which he gives out online.  Reading the book helps but studying his in class notes will give you a better idea of what to focus on.",
        "course": "GEO100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a funny guy and very energetic but the lectures consist of LOTS of boring movies and he tends to put up diagrams and talk on them forever. The exams are fairly easy as long as you study the questions he gives you in class. For a GEC, it's a decent class to take.",
        "course": "GEOSCI100"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "he is fun teacher in the classroom and very enthusiastic.  his tests are hard and at many times irrelivant but gives a VERY nice curve... great teacher",
        "course": "GEO100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "The exams were really hard, a lot of obscure questions that you really had to study the book a lot to know.  But I believe there will be a huge curve so It won't be that bad.  Webb is an awesome guy and teacher.  He is very accomidating and willing to go the extra mile to help a person out.  He moved my final so I wouldn't have 3 in one day.",
        "course": "GEOSCI100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Probably THE best prof I've ever had.  The lectures can be boring- but hey your learning about rocks and the earth.  Get to know him well and he'll go out of his way to make sure you understand.  Great class and awesome prof.  I would definately take it!",
        "course": "100"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "I wasn't interested in the class at all, but Dr. Webb was very helpful in encouraging me to do well after bombing both the midterms.  He's the best professor I've ever had and I'm glad I took the class just to get to know him. Study online, read and don't fall asleep in class and you'll do fine. ;)",
        "course": "GEO206"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "TO PASS THIS CLASS YOU MUST STUDY FROM HIS ONLINE PRACTICE TESTS!!! This is something that I didn't know until the very end and it could have made my grade MUCH higher! Once I finally did realize he had practice tests I saw his exams are word for word.",
        "course": "GEOLOGY100"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 3,
        "comment": "He really didn't care about teaching and put the most detailed questions on the exams.  Go to class if you want to be able to understand the notes at all.  I think he wanted people to do badly.",
        "course": "GEOLOGY100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Webb was excellent. He showed a video nearly every week to go with the notes. All his notes are online. The tests and final are all MC and fairly easy and half the final is exactly from the first two midterms. He curves the course as well. Definitely looks like Michael Caine",
        "course": "GEO100"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Looks just like Michael Caine (Austin Powers's dad)...but seriously he knows his stuff and presents a lot of material in lecture. He is pretty funny at times as well. However, his exams are tricky if you aren't a geologist. He is available outside of class for help though. Tough GEC, but not too bad",
        "course": "GS100"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "This prof. really knows his stuff.  Lots of lectures and lots of films on the various things we cover.",
        "course": "GEOLOGY100"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "Wow.  I am a senior and I am so glad that I had a chance to learn from him before I graduate.  He is a rare species. He is what I went to college for.  To learn from someone who has seen and done.",
        "course": "GEO206"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "Organized classroom presentation, I was a visiting student that sat in on a lecture to help me decide if OSU was for me. His lecture on plate techtonics was great, I think that I would like to attend more of Dr. Webb's courses. Good movie on NZ birds.",
        "course": "100"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Helpful, realistic, caring, knowledgable beyond belief.  Highly reccommended.",
        "course": "206"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class.  Really knows his stuff.  Most helpful professor I've had.  This is a good GEC to fulfill your lab requirement.",
        "course": "GEOL100"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 5,
        "comment": "A very interesting class, however it is pretty tough.  Professor Webb is very helpful and whenever I e-mailed him with questions he usually got back to me that same day.  he has a charming personality and is really intelligent.  The labs were fun.",
        "course": "GEO206"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "very knowledgeable, tests can be strange, but he's a fair grader, and he is extremely helpful and always willing to meet with or email students who have questions",
        "course": "101206"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 3,
        "comment": "never went to class cuz it was SO boring. notes are confusing &  there are too many diagrams. labs are pointless & a waste of my time. he did know what he was talking about though, when i actually went to class.",
        "course": "GEOL100"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved him. He's a GREAT teacher. I think he's the best teacher I've had at OSU. he made the class fun and really worthwhile.",
        "course": "GEO100"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "Oceanography.  Great professor.  Has all kinds of real world experience, i.e. Discovery Channel documentaries, etc.  Very smart, knows his stuff, been around for a long time. He's a Kiwi. HIGHLY recommend.",
        "course": "GEOSCI206"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.4,
    "department": "Geology",
    "firstName": "Dale",
    "id": "VGVhY2hlci0xNDE5Mzk5",
    "lastName": "Gnidovec",
    "legacyId": 1419399,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Gnidovec is a nice guy and gives great on topic and interesting lectures. This guy is old school though, YOU NEED TO GO TO LECTURE. The labs were super easy and the exams were just as easy if you knew your shit. I'm a Geology major so it came easy for me but some people may have a harder time.",
        "course": "EARTHSC2122"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is definitely knowledgeable and passionate about his lectures. If you go to the lectures you will definitely pass the tests. The downside is that he uses pack back, but its not that hard to come up with stuff for it- just annoying. The study guides are your lifeline in this class. Lab is 20%, 4 exams are 70%, and pack back is 10%.",
        "course": "EARTHSC2122"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "Best of luck!",
        "course": "EARTHSC2122"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is such a sweet man! So knowledgeable and has so much experience in this field, yet he is humble and approachable. I would definitely take him!!",
        "course": "EARTHSC1121"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dale is almost as passionate about the subject as he is about torturing GenEd students. Unless you want a C+ avoid at all costs. I type this as I sit in his lecture and he is currently rambling about bacon or something. His lectures are disorganized and hard to follow, and he provides no online notes or review sheets. Garbage class.",
        "course": "ESC122"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Poor lecturing overall. He seems enthusiastic, but in fact he is just being loud and noisy. He does not give any notes, quizzes, practices, review sheets. All the tests is based on his lecturing. So you need to go to class every lecture. And he did a bad job on clarifying the definition. Exams are super hard. TA is nice. Worst experience in OSU.",
        "course": "EARTHSC1122"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "I was a fan of this guy at first. He is enthusiastic and makes a somewhat boring subject more interesting. Then we had our first mid term yesterday. What just happened? He claims for weeks that the exams will be over ONLY the vocab lists he puts on the board each day, but then 1/4 of the test is random crap unrelated to said lists. Not cool.",
        "course": "EARTHSC1122"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's enthusiastic and really loves earth science. His powerpoints are all pictures, his handwriting on the chalk board is scattered and can barely be read, and he puts nothing on Carmen. Exams are very difficult all short answer or fill in the blank. I'm a good student and thought this was a challenge. Do not take if you want a semi easy GE",
        "course": "EARTHSC1122"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the most passionate professors I've ever had at Ohio State. Powerpoint slides do not help prepare for exams so take good notes. Exams are fill in the blank, short answer, and extended response so they are more difficult than you would expect. As long as you go to class and take good notes, you'll get a good grade on exams.",
        "course": "1122"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "4 test all semester  not cumulative  only off of power points  avg on test 80% - GO TO CLASS  only way to get the things that will be tested. - Labs  easy - Im EARTHSC major, and class was super interesting to me - he passes around fossils almost every Class - I help a dinosaur fossil in my hand one day!  - He's an old guy who loves geology ",
        "course": "EARTHSC1121"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the most enthusiastic professors I've ever had. You can definitely tell that he is passionate about what he teaches. Lectures were always well prepared, and he never seemed to have an issue keeping my attention. A very charismatic lecturer.\r \r Go to class; go over the lectures a few times; memorize the terms and you'll do well on his exams.",
        "course": "EARTHSC1122"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 3,
        "comment": "Slideshows are all pictures of dinosaurs and drawings. Exams are harder than you expect; not multiple choice and no word bank. The middle of the quarter he steps on everyone's beliefs with the evolution lecture.  Makes fun of Christian's beliefs relentlessly. Don't take if you're a strong Christian you'll be distracted the whole time.",
        "course": "ES122"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Really had to pay attention in lectures, his power points were of all pictures so you had to listen to what he says and write notes from it, makes the class very difficult because he talked so fast. The exams were incredibly difficult. All short answer problems, usually 40-50 per exam",
        "course": "ES122"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Ok honestly super interesting man. He is definetly interested in the material, but his testing is ridiculous. He claims to not be a mind reader, well neither are students.His test consist of 50 vocab words to use for short answer essay and fill in the blank...no vocab box. Whatever I passed could of taken online though.",
        "course": "GEO122"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors that I have ever had. He is very enthusiastic and is always willing to help. If you memorize the terms you will do well.",
        "course": "ESC122"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is so cute! he is OBSESSED with dinosaurs fossils and this class. He is super cool and knowledgable. one midterm average was a low B so he gave an optional 20 pt extra credit paper! If you don't do well in this class then you must have NEVER gone to class and were lazy. memorize stuff and you will get over 100%",
        "course": "ESC122"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.3,
    "department": "Geology",
    "firstName": "Joel",
    "id": "VGVhY2hlci0xMzY4OTEw",
    "lastName": "Barker",
    "legacyId": 1368910,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "nice class labs takes time but pretty easy if you try",
        "course": "ESCI1006"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Easy class if you attend and take good notes. He saves his students money by not making the book necessary, you only need it if you are bad at science. His exam reviews are exactly what is on the exam. Easy class to pass. The labs are super easy.",
        "course": "EARTHSC1100"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Harder than expected. Recommend going to class because he tells you what is on test and gives pop quizzes. Labs are easy A. Tests are difficult. Not an easy A",
        "course": "ES1100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "So friendly, willing to work with u, makes material clear. Gives a curve in the class (77% was a B). Attendance isnt mandatory but id defiantly recommend it because he give u the questions to exams sometimes during lectures. Labs super easy. Exams multiple choice, has 4 pop quizzes only worth 5% of ur grade and he reuses the quiz questions on exams",
        "course": "EARTHSC1100"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Barker's tests are harder than you would expect for a 100 level GEC. He does curve, however, in a fair way. The class average (was around a 77 for us) turns into a B. He's passionate about earth science. Overall, he was a good prof but not an easy A... Took some work to get one.",
        "course": "ES100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Boring subject, but he's a great teacher. Has a lot of passion for the subject and makes it easy to understand. Be ready that the tests are harder than you'd expect for a 100 level class.",
        "course": "ES100"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had him for EarthSci 100. He is Canadian which is kind of fun. Attendance are not mandatory but he had 3 random quizes during the quarter (5% of grade) he posts powerpoint lectures online, but exams are strangely hard (avg = 39/60) but he does curve at the end.",
        "course": "EARTH100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Understands that most people are taking this for a GEC--is super understanding and tries to make it as easy as possible. Grades in a way that is favorable to students, e.g.: Best exam=25%, middle exam=20%, worst exam=15%. Recommended for those taking a GEC class.",
        "course": "ES100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very easy and straight forward. He knows its a GEC and doesn't make you work too hard for it. He's super cute as well!",
        "course": "ES100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy. Exams are straight forward. If you go to lectures, he'll tell you what would be on exams. And he's not bad looking for a teacher :)",
        "course": "EARTH100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very adept at using characters from the Simpsons to explain geology concepts. Make sure you go to lectures, he gives very good examples and outlines what you need to study for exams. Canadian.",
        "course": "GEO101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Geology",
    "firstName": "Loren Edward",
    "id": "VGVhY2hlci00MDA3NDc=",
    "lastName": "Babcock",
    "legacyId": 400747,
    "numRatings": 51,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Babcock is a nice guy, but the structure of this class is awful. 75% of your grade is based on seven 25 question multiple choice midterms. Therefore each question you miss is around 0.5% off your final grade. The questions are somewhat vague with multiple \"correct\" answers but only one truly correct one. Textbook helped on tests, lectures did not.",
        "course": "EARTH2122"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is clearly very knowledgeable in his field. I liked the class a lot, the material was very interesting. My problem was the grading was split 75% quiz grades 25% lab grades. It skews it so labs mean nothing and if you don't do so hot on a quiz or two it's almost impossible to pull it back up to an A. The quizzes also got very hard near the end. ",
        "course": "EARTH2122"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a really interesting and engaging lecturer. Class isn't too difficult, but you need to go to lecture and labs will take some time. Totally worth it.",
        "course": "EARTH501"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Babcock really knows what he's talking about and is excited to share it. Midterms were easy, final is hard. Very nice curve + extra credit at the end. Very accessible outside of class and no homework outside of lab. Lenient grader. That said, lectures tended to drag and the pace of the class is very slow. Some background in geology is helpful.",
        "course": "EARTHSC1122"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 5,
        "comment": "Take this class if you'd like to understand the material, not to get an A. Dr. Babcock is a great lecturer. However, there aren't many grades entered and the exams are all writing so you must truly know all the content presented in the class. Expect to memorize/study a lot, he even had stuff on the final that was not mentioned in his power points.",
        "course": "EARTHSC1122"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "Too much to review for exam",
        "course": "EARTHSC1122"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "A lot of reviews on here complain abt Babcock's tests, but they're not hard at all. He posts all lecture slides to Carmen so attendance isn't mandatory, and he literally wrote the textbook for this class so u can easily access it for xtra help. As long as you take a bare minimum few days to study the definitions you'll pass. he also gives hints",
        "course": "EARTHSCI1122"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "babcock is an odd guy, but in a good way. Tests are tough, but definitely possible to get an A on if you actually read over the lecture material the night before and ask him what to expect. They are all short answer questions, no multiple choice or fill in the blank, but he leaves room for error. If you are looking for an easy class maybe not his.",
        "course": "EARTHSC1122"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "No homework, no quiz, no attendance check. Then guess what? You FAIL YOUR EXAMS while EXAMS are 75% of your total grades. If you don't want to experience a dark semester, DROP IT NOW!",
        "course": "EARTH1122"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Alright, so first off, don't buy the book for this class because it is a complete waste. Second, Babcock is a pretty nice guy and he is willing to work with you. Many people think this class is hard, when in reality its not really that hard. The class is one midterm that is strictly memorizing 4 powerpoint.... thats it. Final is also memorization.",
        "course": "EARTHSC1108"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "FOR GEMSTONES: Basically, if you consider yourself to be a good student, such as having good attendance, and can study well and connect certain materials and lessons together then you will be just fine. For those of you who are looking for a easy drive by, this is not the class. Couple pop quizzes, and his tests can have specific questions.",
        "course": "EARTHSC1108"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really knowledgeable in his field. Tons of corny jokes. Not that bad if you get used to them. The lectures and labs are easy and fun, but the exams are pretty hard. You need to remember trivial details on the slides. There's NO MULTI-CHOICE. He's willing to help students. You can find him in his office on the third floor of the Mendenhall Lab.",
        "course": "EARTH4501"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor along with most of my Earth sciences courses did not use Carmen for grades. A matter of fact he not use Carmen/Canvas at all. He never used any online resources whatsoever! His lectures are long and he tends to drag on so it gets more difficult to focus in my opinion. Beware of exams! They are all written no multi-choice!",
        "course": "ES4501"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "This is not a GE that you're going to be able to skate through, you have to actually go to class, take the pop quizzes &amp; study. Babcock is a GOOD GUY. He wants all of his students to do well, and if you show him that you have studied &amp; put in your best effort you will. As far as the book, I never bought it &amp; was fine because I took good notes",
        "course": "EARTHSC1108"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you ever find yourself in a class taught by Babcock immediately drop it. Immediately. Grades are completely arbitrary and nothing makes any sense.",
        "course": "EARTHSC1108"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "I would not recommend this if you're just trying to get a general science out of the way. I thought this would be a fun, easy, GE but it turns out it was my worst grade of the semester- even after studying my butt off for both the final and midterm. He tests on trivial, unimportant details and those are pretty much your only grades.",
        "course": "EARTHSC1108"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dont take this class this guys a grade a nut job. Horrible jokes super hard test for no reason  and 4 pop quizzes all semester worth 25 percent",
        "course": "EARTHSC1108"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "Look here, I've always been really, really into gemstones, but this is the worst class I have ever taken in college. Everything he teaches is straight out of the textbook--- BUT, the 2 exam aren't! So there's 60% of your grade right there gone from something completely out of your control. PLEASE take a different Earth Science class !",
        "course": "EARTHSC1108"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 3,
        "comment": "If I were you, I'd do a quick google search of him and allegations against him. If you miss a pop quiz, your grade is tanked. His humor is unbearable. He changed the term project to be worth a measly 5%, so don't bother with anything too fancy. Lectures have the same material as the book--which is in the library reserve. Don't waste money on it.",
        "course": "EARTHSC1108"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 4,
        "comment": "Gemstones was an annoying GE to take. Loren Babcock didn't use Carmen & this class grade is basically weighted on a midterm & a final. The lectures are not mandatory but there were open note pop quizzes worth 5% of the final grade. The final was multiple choice but very specified. I was very surprised I didn't flunk the course after the final.",
        "course": "EARTHSC1108"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Started this class and thought Dr. Babcock was a cool and man was I wrong. He counts off for very petty things on exams and is totally not accessible to students. He doesn't even have an OSU email address. What should have been an easy A is now a solid C if I'm lucky. Material is easy, professor is terrible.",
        "course": "EARTHSCI1122"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "NEVER EVER TAKE GEMSTONES. Unless you want to memorize the whole textbook, save yourself from your own personal hell. I've never failed a class in my life until now. Find another science G.E. Nothing is on Carmen. There are no grades except the exams. Just save yourself.",
        "course": "EARTHSC1108"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 4,
        "comment": "You don't do anything in this class except for the pop-quizzes, midterm and final (which are your only grades so you have to ace). He shows up to class 10 minutes late everyday and then flies through the notes. He doesn't use carmen and doesn't use an email, so he's pretty much impossible to get a hold of. Don't know grade until final posting.",
        "course": "EARTHSC1108"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Babcock seems to be knowledgeable in his field, yet this fails to translate to his teaching. Doesn't put course info/grades on Carmen and doesn't respond to emails so it is hard to know your grade/get help/etc. Exams are very specific and do not come from the in-class notes, like he claims. Worst teacher I've had -- do not take.",
        "course": "EARTHSC1108"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "Doesn't clarify of what's on the exams. And the exams are tough and very specific",
        "course": "EARTH108"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "I'm sure he's a fine researcher, but he is a poor instructor. He does not put the class on Carmen. He wrote and priced his own textbook, and copyrights the slides so we can't use them. He tells us to study the information that is formatted on the slides, but doesn't provide them to us. Even then, the tests are more about trivial, specific examples.",
        "course": "EARTHSC1108"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "Really nice guy. I feel like I learned a lot from this class, and I never found lecture too boring. The labs were actually usually pretty fun. His jokes are pretty terrible but you get used to them and they will eventually grow on you.",
        "course": "EARTHSC1108H"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "I liked Babcock. His bad jokes get old sometimes, but I believe he actually cares about his students. The class was not that hard and I actually learned a lot about interesting material.",
        "course": "HONORSGEMTSONES"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is a very horrible professor. You really cant understand what he most of the time because of the way he speaks",
        "course": "ES108"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 4,
        "comment": "Prof. Babcock has horrible jokes. He is vague about what will be on exams. He often skips over open book quizzes designed to boost your grade. He mumbles alot.He rambles about pointless things. It's hard to stay engaged in class. My experience with Loren was not a happy one.",
        "course": "SCI1108"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "Excellent professor!!",
        "course": "ES501"
      },
      {
        "index": 32,
        "rating": 2,
        "difficulty": 5,
        "comment": "Terrible. Horrible teacher. No help at all, huge jerk. Gives you little explanation of what will be on midterm and final. Avoid at all costs. No idea what everyone else is talking about- must be rating himself.",
        "course": "ES108H"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent professor!!! Some of the material was a bit dense, but he made it interesting and fun.  Very knowledgeable in all areas of earth science, specifically geology. I highly recommend taking any class he offers. Funny jokes and great adventure stories too!!!",
        "course": "EARTH501"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 3,
        "comment": "Probably the best Geology professors or any professor I ever had.  Everything was outlined and detailed in a very clear manner, which made review of material very easy.  I do recommend attending all of the classes, because there are helpful and interesting things that he adds that will help you remember the information. A++ instructor.",
        "course": "EARTH108"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 3,
        "comment": "Horrible professor...horrible jokes...     Exams weren't extremely difficult but he would put information on them that he had never introduced in class and maintained that he had when asked about it.   Would only recommend this class to someone who can stand a barage of horrible 'Leno'-like jokes all qtr.",
        "course": "ES108"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 3,
        "comment": "Is everyone joking&#63; Only take this class if you have extreme patience. I couldn't stand his constant horrible jokes! He put something on the midterm he had never taught, and when 5 people asked him about it, he blew us off. Steer clear of this one, he is so obnoxious.",
        "course": "EARTH108"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Babcock absolutely loves this class which makes it better in general. He is incredibly enthusiastic about everything. The midterm was easy if you studied, but I don't know about the final yet.  The best thing to do is go to every class and get all of his notes, that way you don't have to read the book. Definitely recommend this class for a GEC!",
        "course": "ESH108"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 2,
        "comment": "I enjoyed this class. Subject material was interesting compared to the average science class. Midterm and final were difficult, but there was a high curve. Definitely recommend this class for a GEC.",
        "course": "EARTHH108"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 3,
        "comment": "The labs for this class were great! Dr. Babcock is very passionate about his field and it shows in the classroom! I recommend this class for any GEC science.",
        "course": "GEOH108"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lectures are pretty interesting, his corny jokes help alot.  Class was easy, NO homework, and he basically told us what was on the midterm and final",
        "course": "GEOLOH122"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 2,
        "comment": "made gemstones surprisingly interesting. science class for the not-scientifically-inclined. attendance not required except for labs. corny sense of humor, but in a good way. quite proud of his accomplishments in the field...",
        "course": "GEOLH108"
      },
      {
        "index": 42,
        "rating": 2,
        "difficulty": 1,
        "comment": "Good in class, keep away when not in class.",
        "course": "GEOLO121"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy, knows everything you could want to know about gems and really enjoys teaching. Highly recomend the class.",
        "course": "GEOLSCIH108"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 3,
        "comment": "Nice guy, knows a TON about the the whole field, Pretty easy to talk to, straight-forward exams, pretty interesting lectures if you're into the stuff.",
        "course": "GEOH122201"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good teacher and a nice guy. He actually wants to help you learn. His jokes help you get through lecture and he is overall fair with grades. If you can, take a class from him--it's worth it.",
        "course": "PALEO201"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 2,
        "comment": "Interesting class (gemstones). Got a bit boring at times, but his goofy jokes kept things amusing. He's a really nice guy and I would recommend him to anyone.",
        "course": "GEOSCI108"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 2,
        "comment": "Corny jokes to help you remember things.  Always willing to help if needed.",
        "course": "GEOLOGY"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GEOSCI122"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great class with creative and exciting labs.  Lectures clear and amusing.",
        "course": "H122"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GEO122"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher, helpful, clear. The labs are fun, and the lectures are engaging.",
        "course": "GSH122"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.8,
    "department": "Geology",
    "firstName": "Yu-Ping",
    "id": "VGVhY2hlci0zNTA3OTA=",
    "lastName": "Chin",
    "legacyId": 350790,
    "numRatings": 46,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "This professor is now a professor at the University of Delaware. He is a great guy, but his class is very disorganized. The semester is about to end and our grades have not been posted yet, our original syllabus was very vague and he claimed he would change it but has not changed it yet. Very few resources to study from.",
        "course": "CIEG233"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "Really nice and funny guy but easily the hardest GE I've ever taken. Didn't learn much either",
        "course": "ES1121"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "I took this class for a GE. I would NOT recommend this class if you are looking for an easy GE. He is a great professor, but I think he is meant to teacher way higher level courses. He knows so much and the test ask specific questions when we have 80 slides per chapter. He is funny and really tries to help do what is best for the class.",
        "course": "EARTHSC1121"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really enjoyed this professor, he really has a passion for inspiring students. Go to class because he will give pop quizzes and sometimes they are just an attendance check.",
        "course": "EARTHSC1121"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "I did not enjoy Professor Chin's class. He is not funny, but he finds himself hilarious. He has this \"I'm better than you and you better know it\" attitude, and he is relentlessly offensive and persistent in engaging students in his lame tangents. He makes people feel stupid with his relentless random questioning. Not the hardest class,but not fun",
        "course": "EARTHSC1121"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "He's a super nice guy. Really enjoyed lectures. Labs are somewhat boring.",
        "course": "ES1121"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Yu-Ping Chin is a good guy, but not a good professor. He moves so quickly through the powerpoints (which aren't even his, mind you) that it's nearly impossible to take notes. He covers a ridiculous amount of information for a 1000-level class and many of the classmates that I spoke with failed his midterm. Also gets distracted and runs on tangents",
        "course": "ES1121"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Chin is a funny dude. He tries really hard to get the class engaged and excited about science, which I enjoyed. Exams are tough with tricky wording, but look very similar to the study guide he provides. He quickly lectures power points that he posts on Carmen after class. Oh, and I never even bought the book.",
        "course": "EARTHSC1121"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "Although he is passionate about what he does, I would not suggest yu-ping or this class for GE credit. He will tell you how great he is and how great of a professor he is trying to be, but he flies through notes and alienates students with questions. Not a bad guy and tries to get class engaged. Just a terrible subject and misplaced confidence",
        "course": "EARTHSC1121"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interested in teaching and encourages students to think for themselves. He's hilarious and his lectures are always entertaining. A little tougher than the other professors for this class, but overall worth taking his section. Gives good reviews and practice problems similar to those on the actual exams.",
        "course": "EARTHSC1121"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Super detailed exam questions. He goes way too fast in lectures and you basically cant even take notes. He does care about what hes teaching and wants you to learn, but as a GE it is unreasonably hard for someone who is taking this because they have to. Stay away from this class with him.",
        "course": "EARTHSC1121"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Chin is a great teacher. He is good at lecturing and makes this class interesting.",
        "course": "EARTHSC1121"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Can skip many classes and still pass as long as you get lucky with the pop quiz days. Reads straight off the slides and posts the annotated slides online after class.",
        "course": "EARTHSC1121"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Out of the 832 jokes he tries to make each lecture around 4 are funny. Is constantly badgering students for answers when they clearly don't want to talk. If you sit away from the isles you'll be fine. Only one midterm which had VERY specific questions. Labs are a breeze, but it's Not a guaranteed.",
        "course": "ES1121"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Travels everywhere known to man",
        "course": "EARTHSC1121"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Chin is hilarious and makes sure that you can apply the things you learn in class to real life.",
        "course": "ES1121"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "tests are really easy, if u fail its definitely not prof chins fault your dumb. literally can coast thru class study 2-3 days before midterm and get a B or above",
        "course": "ES1121"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Yu Ping is a very entertaining professor, but I wouldn't recommend his class if you're trying to take an easy A GenEd. This course may be easy for Geology majors, but being a business major this was a hard class. He asks very specific ?s and the lecture slides are 100 slides long. Labs are easy. Take professor Douglas Alsdorf for the A.",
        "course": "ES1121"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "I can't say enough great things about Yo. He's a great and fair professor, and he's hilarious. There is no reason not to take his section if you have the chance. He really cares about his students and their lives in and outside of the classroom.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "he is hilarious, one of my favorite teachers i have had",
        "course": "ES1121"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Chin really cares about students and has a high level of respect for his class. He has a genuine interest in student success in and out of the classroom and does what he can to encourage students to think for themselves and make the class applicable to real life.",
        "course": "EARTHSC1121"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Yo Chin rules!! Such an entertaining professor for basic material. Explains everything clearly. His was my favorite class of the semester.",
        "course": "ES1121"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Chin is great! This class could get really boring, but Dr. Chin kept it as interesting as possible and threw in lots of jokes. He's very pro student and gives you a lot of opportunities for easy points. If you have take this class, take it with Dr. Chin.",
        "course": "ES1121"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easily my favorite professor of all time. A truly infectious personality that is a joy to learn from. I highly recommend taking his class.",
        "course": "EARTHSC1121"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "Yo was a good teacher.  Class consists of labs, 2 exams, and pop quizzes.  There is a curve in the class and I did way better than I thought I was going to.  Go to class and do well on your labs and you'll be fine. Not a difficult class just do the work!",
        "course": "EARTH121"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Chin is a very good teacher and is very interested in helping his students learn what he is teaching.  He keeps a good balance between his research and his teaching, and is genuinely interested in teaching.  He relates current events in with the class which helps to make things more relevant.  I would recommend him to anyone!",
        "course": "EARTH121"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "he's really funny. go to class",
        "course": "EARTH121"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 4,
        "comment": "The comments left bashing this guy come from ignorant pessimists. I would take a teacher with his enthusiasm over some boring monotone genius any day. College is about what you put into it. If you haven't figured that out you will never graduate. Go to lecture, do the assignments, study, get an A. simple, Do work kid",
        "course": "GOE121"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 1,
        "comment": "I did most of the labs wrong, didn't show up for a quiz, didn't do a homework, never stayed for a whole lecture, and never studied for more than two hours, and i STILL got an A!! just stay long enough to make sure there's no quiz, and make sure you read the textbook.",
        "course": "ES121"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is one of the best prof I have ever had. He is the man.",
        "course": "GEO121"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "He wasn't so bad.  He's genuinely interested in Geology.  He likes to rant and rave about how science funding has gone down the toilet in America, and fair enough, he's right.  I got a B in the class and I'm not sure exactly how, because I didn't do well on the first midterm.  Go to the review sessions and do every lab, you'll do fine.",
        "course": "GEOL121"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "awesome professor, he has a great sense of humor and interesting stories! the TA Chunjiang Yu is also great. I highly recommend taking a class with yo!!!  Yo is the man!",
        "course": "GEOSC121"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "extremely nice and fair, always willing to help and answer questions.  Attendance isn't mandatory, but there are pop quizes.",
        "course": "GEOL121"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 4,
        "comment": "Yo is the Man!",
        "course": "GEO121"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 3,
        "comment": "He cracks a lot of lame (sometimes funny) jokes and the course material kinda sucks, i mean the whole class is about rocks. But Chin gives you every chance to succeed. All the notes, lectures(podcasts), and 2 homework assignments are online and he helps you if you need it. His tests are challenging but not impossible. Overall good teacher.",
        "course": "GEOSC121"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 1,
        "comment": "makes the class interesting",
        "course": "GEO121"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 4,
        "comment": "will explain anything, always answers questions, very fair tests, as long as you go to class even though he podcasts his lectures",
        "course": "GEOLOGY"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 1,
        "comment": "For as boring as the class COULD be I dont think this guy did a bad job Some of his jokes werent funny but he's a teacher not a comedian I believe that he WANTS you to succeed in this class I didnt buy the book never took notes studied the test reviews and got an A Pay attention to what is emphasized and youll do fine Going to class helps a ton",
        "course": "GEOLOGY121"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 4,
        "comment": "I wouldn't recommend this class, in general. I'm not sure if it was the material or Chin, but I wouldn't suggest taking this class. He's a nice guy, and pro-student, but I think his forte is research, not teaching. Makes lots of bad jokes, tests have obscure questions, grades are given last minute.",
        "course": "GEOLOGY121"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 4,
        "comment": "This man is a ****ing joke.  His jokes arent funny, he shouldn't be a teacher.  And he does nothing to make this boring as material interesting.  He often finds himself (only) laughing at his lame as jokes.  It is a shame that this man receives money to do what little teaching he does.  All he does is read slide after slide after slide.  The Worst!",
        "course": "GEOSCI121"
      },
      {
        "index": 41,
        "rating": 1,
        "difficulty": 4,
        "comment": "are you kidding&#63;&#63; this guy sucks!!!!!!!! SUCKS i tell ya.. why did osu let him even think about teaching&#63;&#63;&#63; horrible.",
        "course": "GEOL121"
      },
      {
        "index": 42,
        "rating": 2,
        "difficulty": 5,
        "comment": "Chem of Natural Waters, did not learn much about them. Just some overrated computational method. Tells you at first only basic chem is needed and he grades easy, THIS IS NOT TRUE. Only interested in helping those he advises; always too busy for others.  This class took ALL my time--do not waste your time unless you're a chem major.",
        "course": "GEOCHEM712"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 4,
        "comment": "Pretentious",
        "course": "ENVIROCHEM710"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Chin made his lectures very interesting and fun! The class got very involved, and his power-points were awesome! He'd include Simpson's cartoons, etc. He gave extra credit about a cartoon character! Don't let name fool you, English is first lang",
        "course": "GEOLOGY121"
      },
      {
        "index": 45,
        "rating": 1,
        "difficulty": 5,
        "comment": "not funny at all, please stop the jokes, no one laughs at them! Plus stuff taught in class isn't on exam and stuff on exam isn't in class.  Dont take this class what ever you do!",
        "course": "GS121"
      },
      {
        "index": 46,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GS151"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.4,
    "department": "Geology",
    "firstName": "Matt",
    "id": "VGVhY2hlci0zMjc3ODQ=",
    "lastName": "Saltzman",
    "legacyId": 327784,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures are not very heavy and as long as you spend a bit extra time to study after class, you will get high grades on exam.",
        "course": "EARTHSC1911"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Saltzman is a very knowledgeable and established professor within the Earth Science industry. There are 3 midterms that make up 75% of the grade, and the lab makes up 25%. Go to class, write down exactly what he writes, and read your notes before the exams a few times over and you will pass. Also, top hat is extra credit.",
        "course": "1122H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Awesome professor. He is passionate about teaching and his field. He has a dry sense of humor that grows on you throughout the semester. You dont need the book but going to class is important",
        "course": "ES1122"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "GREAT CLASS! He wants you to learn and goes out of his way to help you. Makes the subject easy to understand with his teaching style. He is also very easy going, and gives ample amounts of extra credit with clickers. Attendance is not 'mandatory' but you need to attend class to get clicker points. Powerpoints are not posted before or after class.",
        "course": "ES1122"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good class.  Can't just download the notes, but you actually learn something if you show up.",
        "course": "GEOL122"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "how to get an A in dr. saltzman's class: 1) show up to class ON TIME so you can get the clicker points, 2) write down what he writes down word for word, 3) read through your notes a couple times before the midterms and final, 4) get chrissy as your lab TA",
        "course": "GEOL122"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "very easy if you go to class and take notes, interesting, i recommend!",
        "course": "GEOL100"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 1,
        "comment": "Textbook was totally useless, but if you took notes the class was cake!",
        "course": "GEO122"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "Overall, the material was still boring, but at least it was easy to understand and memorize for the exams. As long as you read through the book, you really don't have to go to the lectures.",
        "course": "GEOL100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. Saltzman's class is very easy if you go to class.  He only puts things on the exam that he writes down in class.",
        "course": "GEOLOGY122"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very clear and precise about what you need to know and what you don't.  He says it is class, then it is on the test...I love when it works out like that!!",
        "course": "GEOSCI122"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class could be interesting but Saltzman really makes the material dry. The tests are pretty easy but a lot of information is covered. No book needed, just study, go to class (if you can stand it) and you'll be fine.",
        "course": "GEO100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "just go to class and pay attention, u dont even need to buy the text book for his class. i never went to class and got a c, without a text.",
        "course": "100"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "My favourite class, great professor, very helpful I love the fact he doesn't use power point, he takes notes with you and is very avaliable. I'm actually considering majoring in Geo because of this guy. Totally recommend the class and the professor.",
        "course": "GEOSCI100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "GREAT prof.  He is boring, but as long as you show up, and take notes, it's an extremely easy class!  He will help out in any way possible too.",
        "course": "GEO100"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "SO boring...prof needs to get a life other than science. he wants details, not basics. sucks for a GEC.",
        "course": "100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Did not have to buy book.  Missed one lecture and just studied notes for tests.  A in the class.  Very clear, very organized.  Good GEC.  I felt like I learned something after the final.  Turned out to be interesting information.",
        "course": "GEO100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "great guy, clear class...easy GEC if you show up and do the work",
        "course": "100"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "Class was extremely boring.  The tests pulled in information that I never could find in my notes.  Do not need to buy the book.",
        "course": "GEO100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "i agree, great teacher...go to class take notes and you will get a good grade. he is also really nice which is rare these days",
        "course": "ANTHRO"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good teacher. Understands class is only a GEC and tries to keep it basic/interesting. Super nice guy.",
        "course": "GEOL100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Geology",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yMzA4OTIx",
    "lastName": "Conwell",
    "legacyId": 2308921,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chris is the best GA I have ever had. He very thoroughly explained labs and was very willing to help everyone if they had trouble with anything. A cool guy in general, easy to be around and even played quiet, non-distracting, but pleasant music for us while we worked which was nice.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr. Conwell has been a fantastic lab instructor. He took the time at the start of every lab to explain the concepts of the lab quite thoroughly, and he understood when people were having trouble. Often I didn't even have to ask him for help, he just knew that I was struggling. Also very relatable, which makes him delightful to work with.",
        "course": "EARTHSC1121L"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3,
    "department": "Geology",
    "firstName": "Anne",
    "id": "VGVhY2hlci0yODU1NzQ=",
    "lastName": "Carey",
    "legacyId": 285574,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "You will not find any other professor like Dr. Carey. Although most of my class was business majors, she really cared about us, and her passion for the subject was very contagious! With that being said, it is a very lecture-heavy class due to the content, but if you show up and participate, you should be golden. Do homework and review slides.",
        "course": "ERTH1121H"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dry lecture, had a hard time paying attention(part of it was my disinterest in the material). This was a problem because the class was very lecture heavy. However, she's one of the nicest professors I've had and was very willing to help students outside of class. Always had review chats on Carmen before exams. Not the worst professor you could pick",
        "course": "EARTHSC1121H"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "She's very nice, but her powerpoints are a bit disorganized and sometimes she seems to lose her train of thought while speaking. Both her lectures and labs tend to be pretty pressed for time. I found that reading over the assigned chapters can fill in a lot when I missed something, but otherwise she assigns a ton of reading to keep up with.",
        "course": "ERTH1121H"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Her lectures consisted of PowerPoints that mostly showed pictures from places she's traveled and her talking about random things and was generally slow to, if ever, get to the point. Lots of pauses. She seemed disorganized and had slides in her PowerPoint that she clearly hasn't reviewed for years as they were outdated. She's nice though at least. ",
        "course": "EARTHSC5550"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Firstly, she is SUPER dry and unorganized. Her laptop is cluttered and ancient, and I sometimes wondered if she was ok because she struggles so badly with speech during lecture. She jumps from topic to topic without much explanation, and LOVES minute details. You can't study for her exams for that reason. Her lectures are loaded and ambiguous. ",
        "course": "ERTH1121H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I don't see why everyone had a problem with her. She was really nice and if you actually pay attention in class and take notes (rather than just play on your laptop like most of the class), you'll know what's going on and do well. Attendance matters for your grade.",
        "course": "ESI121H"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "She's really bad. Doesn't teach at all. You can pretty much skip class whenever you want. No matter how much you study you're not going to get an A on the exams so don't bother, basically everyone gets a B. Labs are unclear, useless, and frustrating. Avoid if possible. If you want a B with almost no work then take it, I guess.",
        "course": "ESCI121H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cons: Her lectures consist of her reading from power points, so class can be a bit dull at times. Doesn't seem to like guys very much, very disorganized Pros: She puts her powerpoints online, very dry sense of humor",
        "course": "GEOL550"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "I am a major and it was the honors class, but Anne knows her content very well. She presents it well but expects you to do work on your own to learn it after she has introduced and discussed it. Her classes teach what is on her exams, though she is specific on exams.",
        "course": "ES121H"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible class. Don't take. Not worth it for a GEC. She makes the class way more difficult than it needs to be and at the same time treats you like children. Also she is very difficult to listen to because she it will take her minutes to get through a single sentence. Her slideshows are literally slideshows of her vacations and not useful at all.",
        "course": "EARTH151"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Carey tests and teaches WAYY too hard for a general ed. class. Earth Sci100 is supposed to be a simple course that will raise your GPA. No.gives 30+ slides a class, does not put them up online,&you have to read the book as well.& puts material on the tests that were not covered in class. She is the worst teacher and I would advise you to stay away.",
        "course": "SCI100"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "her class is a little on the boring side. she knows what she is talking about, but for a 100 level class gives a lot of information. she does fall off topic a lot and rambles. take someone else if possible, if not i don't think she's unbearable. nice lady!",
        "course": "ES100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Everyone who says Dr. Carey's tests are unrelated to class material clearly didn't understand the class material. The tests ask you to APPLY your knowledge, not just to regurgitate it. It's tough, but so much more informative and interesting. The material has stuck with me for a long time, too. Dr. Carey was great.",
        "course": "GEOL100"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "average prof at big school, tests are a little out there but overall go to class and pay attention and you'll do decent",
        "course": "GEO100"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "This **** cant teach. Jumps from one thing to anohter in lecture, and lectures about stupid****. Still not sure where she got the test questions from, b/c they werent from the lectures or reading.  Shes not organized, and unhelpful if asked questions. If you have her, pull out, shoot yourself, or get ready 2 kiss her ass 4 an A. Lab is so easy.",
        "course": "GEOL100"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "GEOLO100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you read the chapters, go to class, and pay decent attention (none of which are too hard to do), you will get an A in this class.  Dr. Carey is an extremely nice and knowledgeable professor who is more than willing to help students in any way she can.",
        "course": "GEOL100"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "shes unorganized and impossible to listen to. she rambles about nothing and then throws extensive tests based on nothing covered in class. it might just be because im not interested but shes no help",
        "course": "GEOL100"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "While Dr. Carey was an amazingly enthusiastic and helpful teacher in the classroom, the midterms and finals didn't really reflect the book/lecture material.  Expect some real left-field questions.  Also, it's honestly a lot of work for a 100 level class, with the homework, lab work, and intense tests. But still, she's a good teacher. Thumbs up.",
        "course": "GEOSCI100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Carey is a really great teacher who makes a class I dreaded interesting and engaging.  If you're actually interested in learning, you'll enjoy her class.  She manages to tie the material to contemporary developments in the field, current events, and practical application.  A lot of work, but worth the effort!",
        "course": "GEO100"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "Energetic, made class somewhat interesting.  Didn't really teach you what was going to be on the midterms though, and I thought it was much more difficult than what it should have been.",
        "course": "GEOSCI100"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not great but not bad.",
        "course": "GEOSCI100"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 4,
        "comment": "She jumped around a lot during lecture and the tests were impossible to study for.  She'd give you a study guide but hardly anything was actually on the test.  I definately do not recommend Carey!",
        "course": "GEOLOGY"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "just go to class and u will pass",
        "course": "GS100"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a bit boring, but she is willing to help you if you seek her out.  She does take the time to get to know you in large classes as well.",
        "course": "GEOL100"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst class I have ever taken.  No help at all with anything.  Exams were hard to study for she did not go by the book and the notes were not clear. Do not take Carey!!!",
        "course": "GEO100"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 4,
        "comment": "She was very boring and not helpful. If you were an athlete, she would jump to offer help, otherwise, you were a nobody to her. Half the time she would act like your best friend, the other, she would completely ignore you.",
        "course": "GEOSC100"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "super helpful very nice...",
        "course": "GEO100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Geology",
    "firstName": "Thomas",
    "id": "VGVhY2hlci0yMjkxMjc1",
    "lastName": "Darrah",
    "legacyId": 2291275,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "BEST PROFESSOR EVER! Dr. Darrah is a literal angel and is so understanding, caring, and super sweet! He wants you to genuinely do well and succeed and designs the class so it is very easy for you to do well. I took EARTHSC2203 and I have no regrets and literally ended with a 100 and the average on all of the tests and quizzes are an A+",
        "course": "EARTHSC2203"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.8,
    "department": "Geology",
    "firstName": "Wendy",
    "id": "VGVhY2hlci05NTg0ODg=",
    "lastName": "Panero",
    "legacyId": 958488,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "During a COVID semester, Professor Panero changed her class scheme in order your you to master content. Every week we had mastery assignments, in which you had multiple attempts to re-submit in order to master the content, thus maximizing you grade. It's a lot of work, but the idea works, and helps out a lot!",
        "course": "ES4421"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "While the class itself is kind of boring and lecture heavy, she is an amazing professor. I struggle with multiple choice tests and was able to take a different format for the final which saved my grade.",
        "course": "EARTHSC1121"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "For some reason I couldnt click that I would recommend, but definitely would. The fact that everyone says this teacher is bad sucks... shes really great. Idk what everyone else is looking for like teachers cant fly and shes awesome in office hours. I would recommend. Also, Im not a front-rower weirdo... i sit in middle and pay attention.",
        "course": "EARTHSC1121"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lectures are boring, but they're not that difficult to understand. It says to buy a textbook, but you never use it once. Attendance is taken through tophat questions so you have to go to lecture, but she does post lecture videos. The lab is also easy. No homework except studying for the two midterms.",
        "course": "EARTHSC1121"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "LECTURES ARE SO BORING IT HURTS. She does not treat it like a 1100 class and assumes we have so much background knowledge when we dont.",
        "course": "EARTHSC1121"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "Pretty good lecturer. Attendance is taken through TopHat in form of questions that are pretty easy.",
        "course": "EARTHSC1121"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Panero is one of those professors who obviously knows her stuff really well, but shouldn't be teaching a GE class. The lectures weren't engaging, but you have to go if you want Top Hat points. You'll have to study outside of class to prepare for the midterms and finals. The only reason I had a good grade were the labs. Just take another GE.",
        "course": "EARTHSC1121"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "AVOID AVOID AVOID. The material of this class should be easy, but Dr. Panero is not cut out to be a professor. She does not teach in any way like this is a GE, 1100 level class. Lectures are insanely boring, and honestly don't help at all. I passed the class by teaching myself from the book the night before a test. Expect to struggle.",
        "course": "EARTHSC1121"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Panero is an absolutely amazing professor. If you show up to class and pay attention in lecture, you're going to pass. You do have to work for an A, but it's by no means unmanageable. Her lectures, while they don't follow the book, are clear and helpful. She actually spends time deriving and explaining the physics behind concepts. ",
        "course": "ES4560"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Wendy Panero is terrible! By far the worst professor at Ohio State. AVOID at all costs. I would take a different class if it meant not having her. Tests are crazy hard (even if you study) lectures are just plain awful (you will literally cry its so boring, and probably won't go), labs are dumb (busy work, terrible TAs, hard grades), final...F. ",
        "course": "EARTHSCI1121"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "I like how she teaches... No powerpoints!  If you participate and try she will pass you but you have to work for an A. ",
        "course": "4421"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Panero is passionate about the subject matter, to the point of getting excited when students ask good thoughtful questions. She seems to actually care about making sure you understand what's being taught. Pay attention in lectures and take notes and you'll do just fine.",
        "course": "EARTHSC1121"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "She does not use a textbook, and she tends to go off on a tangent during lecture, which makes it difficult to know what will actually be on the exams. Whenever I asked her for help on the in-class assignments, she only confused me more.",
        "course": "EARTHSC2205"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class is a joke. It's awesome. The assignments are simple graphs and lectures are powerpoints that she puts online. Material is interesting and she presents it well. Just glance over the notes and exams are a breeze. No final, just three midterms. Def recommend for an easy A!",
        "course": "EARTHSCI2205"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 5,
        "comment": "The class seems like it would be interesting but she makes it so confusing. She doesn't use a textbook and does lab exercises during class which are graded very hard. I do not recommend this class!",
        "course": "EAS205"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Panero has a lot of expectations for her students, but none of them are unrealistic. Personally, I felt that I learned easier from her chalkboard lectures than other professor's powerpoints. She was very willing to stop class and go on tangents if anyone had questions. If you are willing to work hard, you will get a good grade and learn a lot.",
        "course": "ES4421"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "this call made me change my major out of geology. she is actually mean to students that ask for help and TAs were also horrible",
        "course": "GEO421"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "All of the bad ratings seen here are from lazy students who expect an easy grade. This is a professor who actually makes you work and study to pass the class. These are students with almost no work ethic and a general apathetic approach towards school. The students who do well in this class are self motivated and possess the ability to work hard.",
        "course": "ES121"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "Wendy is a very nice professor but she cant get information across that is important.",
        "course": "GEO421"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "THIS CLASS IS NOT HARD. It does not matter who teaches it, it is easy. If you know anything about science (which you do if you passed 7th grade) then you will be fine. Just study the notes, she has great powerpoint slides that tell you everything you need to know. Pay attention to little side notes because she makes that extra credit. Easy stuff.",
        "course": "ES121"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS FOR EASY A, she is horrible, my labs were ok to say the best, my TA wasn't very nice and panero was the most boring teacher ever, she was also very hard to understand. I once missed a lab due to a medical problem from medication i was taking at the time, she REFUSED to let me make it up, bottom line, AVOID HER",
        "course": "EARTH121"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 5,
        "comment": "Hardest teacher that i have ever had!! Makes u take alot of notes and the exams didnt have a lot to do with them. i took this class for a gec credit thinking it would be an easy A, and she makes it really hard. DONT TAKE THIS CLASS!!",
        "course": "ES205"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Wendy Panero is a terrible teacher.  Stay Away from her if you are looking for an easy A in a GEC.  Final average was a %59.  That should speak for itself.",
        "course": "ES121"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 4,
        "comment": "terrible professor, never went to class because she would put me to sleep.  stay away from her at all costs if possible.",
        "course": "ES121"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 5,
        "comment": "The class average for the final was a 59%. Nuff said.",
        "course": "ERSCI121"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is hands down the worst teacher ive had at Ohio State. ts not helpful at all, the fact I've never commented on a professor and came on here to warn people should tell you something. Tests are impossible, and the class average for them are in the 70's, for an earth science GEC. STAY AWAY.",
        "course": "ES121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.3,
    "department": "Geology",
    "firstName": "Brent",
    "id": "VGVhY2hlci0yNzYzNTUy",
    "lastName": "Lary",
    "legacyId": 2763552,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you need this class for a GE I would recommend taking it right away. It's a very simple and straightforward easy A class.",
        "course": "EARTHSC1105"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Quizzes that you can take twice for every chapter. Chapter material is primarily through lectures. The final is a project in the form of a video. Pretty lenient on grading and very responsive and flexible, would recommend for GE.",
        "course": "EARTHSC1105"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am not a geology person, but I enjoyed this class. This class was fairly easy and the professor was lenient when it came to grading. The class consists of quizzes and discussion posts. The final was just a 6-minute video presentation. ",
        "course": "EARTHSC1105"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Lary was great to take a geology course with. The history of the national parks was a really fun way to learn. He was flexible with the midterm allowing me to still take it when I got sick. Highly recommend taking any course with him! ",
        "course": "EARTHSC1105"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Brent was amazing and very passionate about geology. The assignments were very clear and the class was pretty easy. If you do the assignments you should do great!",
        "course": "EARTHSC1105"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "This is an easy A class. You do weekly discussions and quizzes that are typically easy to do. The lecture content can be heavy at times and hard to understand. Overall, id take this class if you need a science credit.",
        "course": "EARTHSC1105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.6,
    "department": "Geology",
    "firstName": "Audrey",
    "id": "VGVhY2hlci0yMDg1OTkz",
    "lastName": "Sawyer",
    "legacyId": 2085993,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I absolutely LOVE Professor Sawyer. Cannot say enough good things about her! She made 2204 fun and engaging, and provided a manageable workload. She always valued her students' feedback and was flexible with deadlines if needed. I went into her office hours a few times to ask a question, and she was SO kind, friendly and I love her as a person! ",
        "course": "2204"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor who really values student feedback. Lots of lectures and assignments in quantity but not too much work overall. Flexible with deadlines and understanding. ",
        "course": "2204"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love Prof Sawyer. You can tell she loves what she does and cares about each one of her students. The bulk of your grade are weekly quizzes that are easy if you attend lecture and pay attention, which at least for me she gave multiple chances at. You will not regret having a class with her, she makes sure everyone is on track and loves discussion.",
        "course": "EARTHSC1121"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I can't believe Dr. Sawyer has such a bad reputation on this site. From the class I had with her she was very reasonable and overtly passionate about teaching and earth science. She was also very accommodating, and allows for multiple tries on the quizzes and labs. To me this was the ideal intro class. Most of the quiz info is from lectures.",
        "course": "EARTHSC1121"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Prof loves geology too much but, expects students to drop majors into geology. Exams are very difficult. Exam averages are D+ into C's. 50% of grade is free if you complete all pop quizzes(she gives students the answers) and if your Lab TA is good enough to explain concepts. Textbook is trash just one big data dump! I would not recommend her class.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Prof. Sawyer is clearly very passionate about what she does, but she seemed very convinced that all students in attendance were ready to drop their major and study geology. It's an intro-level course... stahp. When you go to study for exams, you'll find her lecture slides could quite possibly be the worst at this school. No text, all pictures.",
        "course": "EARTHSC1121"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lectures are boring and exams are HARD!!!! Not an easy A class.",
        "course": "EARTHSC1121"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 1,
        "comment": "This is the worst professor I met. The lecture is boring and she barely answered questions during the class. For the test, the powerpoints she used in class are not helpful.",
        "course": "EARTHSC1121"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "She explains many concepts and sometimes gets off topic (in a good way). Would highly recommend.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lectures are dull and her slides on carmen aren't helpful w/ few words and confusing pictures. most people in this class are taking it for a GE (including me), but she treats the course as though it is for people going into the field. i studied for 15 hrs per exam and did not do well and I am a good student. the lab saved my grade in the class.",
        "course": "EARTHSC1121"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "She's a passionate professor with great knowledge about Earthscience, but that's the thing about gen ed professors, they forget that not all their students are majoring in that subject. Her tests are very detailed and difficult. Grading isn't bad, could still get a B if you just show up to labs and lectures but gotta work really hard for an A",
        "course": "ES1121"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "She pretty much sets you up to fail. She doesnt post answer to exams. She is really focused on convincing everyone in the Gen Ed to be a geologist. She doesnt make anything easy her lecture slides dont follow the text book and are mostly pictures that you have to figure out how theyr related. The lab is easy cause she has nothing to do with it.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Sawyer is very knowledgable and passionate about what she teaches; however, this class is NOT an easy A. I have never missed a lecture, I attended her office hours, altered my study methods and got a &quot;D&quot; on both midterms (and I'm not an idiot). Labs and quizzes are easy, but exams are TOUGH.",
        "course": "ESC1121"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "The most uninteresting course I have taken here. Felt like HS geology, but without any wonder or purpose. Sawyer is an enthusiastic scientist, but her material focus wasn't there. Her lectures are just a nonstop bombardment of concepts and meaningless facts that often have no place on the exam. Exam averages were C &amp; D, harder than you'd think.",
        "course": "EARTHSC1121"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "She never told us what will be on the exam, after two midterms I still don't know what she really expects from us. I am 200% sure that I attend all lectures, pay attention to what she said, and review carefully, then her midterm makes me feel like a fool who knows nothing :) Interesting hummm?",
        "course": "ES1121"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "I've noticed many people complain about this lecturer in class and on this website. I also noticed that only about 50% of the class was ever in attendance AT THE MOST. Literally all you need to do is show up for lectures and lab, take a few notes about the slides, and pay attention and you will get an A. NO HOMEWORK, JUST SHOW UP.  No Show  NO A",
        "course": "ES1121"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 5,
        "comment": "Lectures are extremely difficult to pay attention in due to boring material, but there are easy pop quizzes so go. She does a pretty good job of setting up the class so exams are only 50% of your grade, but they are TOUGH! Her slides are horrible and she doesn't really tell you whats on the exam. Do NOT go in thinking it will be an easy A.",
        "course": "ES1121"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "This was her first year teaching earth science. There were good and bad aspects. She's great at explaining the concepts, but is very inconsistent about telling us what we needed to know for tests. The material itself is fairly simple, but with no study guide and insufficient notes, the tests were incredibly difficult to study for with so much info.",
        "course": "ES1121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.1,
    "department": "Geology",
    "firstName": "Douglas E.",
    "id": "VGVhY2hlci00MjAxOTU=",
    "lastName": "Pride",
    "legacyId": 420195,
    "numRatings": 39,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "He is good mainly a tough grader.",
        "course": "EARTHSC1105"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor is a sweat heart. It was his first time teaching Geology of National Parks. However, the structure of this class was TERRIBLE. The power points were pages of very small and dense text. He didn't give any kind of guidance on what would be on the quizzes, and they were EXTREMElY hard. Most people fail. This is not an easy pass class...",
        "course": "EARTHSC1105"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lectures were dry and drawn out. He is a good guy and can be funny, but is not helpful when asking for clarification of material or when attempting to prepare for the bi-weekly quizzes. There was a curve, but he would not use Carmen or inform us of our grades throughout the semester, so it was basically a big guessing game.",
        "course": "GEO1105"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "took this to boost my GPA, hardest class i've ever taken, in addition to being incredibly boring. he's a nice guy though...?",
        "course": "GEOG105"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Let's just say I'm a sophomore and this class ruined my 4.0 average. I took Calc 1151 last year (which is a notoriously hard class) and ended up with a worse grade in this stupid GE. I went to every class, took diligent notes, studied thoroughly for the class and still didn't do well. There is a curve, but it's not nearly as much as it should be.",
        "course": "EASCI105"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was the worst decision of my undergraduate career. The material itself would be perfectly reasonable if given in an ordered manner. Unfortunately, the overarching theme of this class is randomness and triviality. We would have to study for ages to capture even some of the potential \"information\" on the quizzes. It makes my soul sad.",
        "course": "EARTHSC1105"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lectures are boring and hard to pay attention to even when you do attend class. He is not specific as to what will be on the quizzes, and the quiz questions are random and do not really pertain to the slides. The class average for the quizzes is a 60%.. this class is unnecessarily hard for a GEC",
        "course": "ES1105"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Boring lectures, extremely hard quizzes with material not covered. Too hard for a 1000 level class. I would not recommend this at all.",
        "course": "EARTHSC1105"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 5,
        "comment": "He is a nice guy; however, the lectures are BORING, his quizzes and tests are extremely HARD. A 105 class should not be this hard. He doesn't tell you or even teach you some of the things on the quiz and exam. I wouldn't recommend taking a class with him.",
        "course": "ES105"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is an easy A provided you go to lecture, pay attention, and spend some time preparing for quizzes. You may not feel like you're learning something at first but if you go to lecture regularly you will be surprised with what you learn from dr pride, highly recommend as a gec",
        "course": "ES105"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "I did barely anything for this class. Took a few notes, attended most of the classes but not all. I got an A. Don't need book. Quizzes and tests are not too bad if you look at the slides prior for a bit. Not much work other than that.",
        "course": "EASCI105"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "if you go to class you will get an a.",
        "course": "EARTH210"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "He iss all kind of awesome make sure attend class and take good note .take him",
        "course": "GEOLO210T"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 4,
        "comment": "Class is boring...If your looking for a class in which you can get a mid day snooze than this is the one for you. He never says what's in the quizzes which makes it hard to study.",
        "course": "GEO105"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "We looked at his vacation photos. Absolutely useless and it is not good for your GPA. DO NOT TAKE!!!",
        "course": "ESCI105"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 5,
        "comment": "The clss was horribly boring. His quizzes were stupid. I have never had to work so hard for a C in a 105 class.",
        "course": "GEO105"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Interesting and pretty easy class.",
        "course": "ESCI105"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really enjoyed this class. His sense of humor was great and as long as you lookd over the slide show the quizzes were easy",
        "course": "ES105"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "THE worst class I've taken at OSU. He just rambles, there is no telling what will be on the quizzes. The class average was around a 62% and he never told us how he was going to curve. Took forever to get our (meaningless) scores back.  Avoid this class at all costs, it is boring and a huge waste of time and money!",
        "course": "ES105"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Would be a sweet old guy to do field excursions with,or be related 2,but so bored with class.had to fight to stay awake.Not conducive for taking notes;I'm a big note-taker.Don't know why that kid said it's an easy A, since most of the time,the class was barely breaking a C.Don't need textbook.Ended with C+.have senioritis tho so maybe it's just me.",
        "course": "GEOL105"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really just a funny, chill dude with a great passion for life and well... rocks. He's traveled all over and has some great pictures to show for it. I developed a renewed interest in the natural world because of him. Don't stress this class that much... just show up and you'll be fine.",
        "course": "GEOL105"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is soooo random! He will talk about a specific topic and then tell a random story. The worst part is that he keeps rambling until you don't know what he was talking about anymore!",
        "course": "GEOL105"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "My favorite college professor.  He is really just a cool guy.  During class he shows slides of pictures he has taken out in the field (all sorts of places) and talks about how things are done in the real world.  Tells jokes during class and is a hoot.  I wish I could have this guy as my professor for all of my classes.",
        "course": "GEO210"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 4,
        "comment": "nice guy, but his class sucks.",
        "course": "GEOG105"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 2,
        "comment": "Is this education&#63;  Walking into class and sitting through lecture is just downright degrading!  I'm no genius but this class is an insult to the entire history academia.  Wow, and to think I just dedicated precious moments of my life just so I can &quot;check the box&quot; on my way to graduation. Don't take this class, watch Sesame Street instead.",
        "course": "GEOG105"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 4,
        "comment": "This professor is a nightmare! Very nice man, good sense of humor, but does not keep a good pace, crams material before quizes and tests, says &quot;I am on your side,&quot; but makes the quizes difficult and includes questions he cannot answer himself. He needs to retire, or structure his exams around the material he ACTUALLY covers.",
        "course": "GEO105"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Pride is an amazing teacher.  I'm a business major, and have no interest in rocks, but he made it interesting and fun to learn about.  I highly recommend.  The class can be difficult, but that can be taken care of by attending class regularly.  Overall, great guy that genuinely cares about his students.",
        "course": "GEO210"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. D.E. Pride is outstanding. Great personality and sense of humor. The quizzes were very difficult, but taking notes and reviewing the powerpoint lectures that he posts online are an efficient method of receiving an A in the class.",
        "course": "GEO105"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was a tough class! He was very funny and did a good job of keeping my attention during the lectures, but the quizzes were insanely difficult. He made them slightly easier after everyone started complaining. The final wasn't too bad, and if you came to class you didn't really need to read the book, except for clarification. He is a great guy!!",
        "course": "GEOLSCI105"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Pride is great! If I could take more classes from him I would. He has the kind of personality you hoped for in a prof when you first came to college. OSU needs more like him.",
        "course": "GEOL105210"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 3,
        "comment": "if you go to class you will do fine, if you don;'t you're fukked.",
        "course": "GEO105"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "this class rocked!  haha!  seriously though, he tried hard to make lectures worthwhile and interesting (and succeeded).  he only gave quizes, every other week, so it was nice not to have midterms.  some questions were hard, but he curved the overall class.  all in all, he was a GREAT professor!",
        "course": "GEOLOGY121"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 4,
        "comment": "he doesnt have definite office hours which made it hard to get in touch with him. the quizzes are super hard i spent way too much time studying for this class than should have been necessary. he's a really nice guy, very personable, but i wouldn't want him as a prof again.",
        "course": "GEOLOGY121"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great guy, gives quizes not exams, cept a final.  The quizes kinda suck, but he is really helpful and lab is easy as can be.  Not a lot of work involved.",
        "course": "GEOG121"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very nice guy, can get off topic during lecture but the class itself is quite easy and the testing is almost exclusively lecture material.",
        "course": "GEOLSCI121"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "Exceedingly clear about what he expects, and an absolutely wonderful disposition. Tests primarily from lecture. You could conceivably attend every lecture, never read the text, and do very well. With good reason, I have taken more than one of his classes!",
        "course": "105210"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very easy-going, friendly, and willing to help.  Lectures can be a bit disorganized and confusing, but not to the point of frustration.  I would recommend Dr. Pride.",
        "course": "GEOL105"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 2,
        "comment": "I agree",
        "course": "GEOL105"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 2,
        "comment": "good teacher, funny, very kind",
        "course": "GEO105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.3,
    "department": "Geology",
    "firstName": "Cristina",
    "id": "VGVhY2hlci0xNTkxMzcz",
    "lastName": "Millan",
    "legacyId": 1591373,
    "numRatings": 38,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Millan is very kind and caring towards her students. She is very passionate about her subject and this was evident in the high quality and informative lectures. Her grading criteria was very clear and fair. The Natural Disasters class is a 10/10.",
        "course": "EARTHSCI3530"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "She's super sweet but wouldn't recommend if you're looking for something laid back. It's pretty time consuming and very lecture heavy, and the lectures aren't super engaging so it's difficult to follow as someone with ADHD. It's not super difficult content, but very time consuming (and the lectures are hard to follow just because there's so many.) ",
        "course": "EARTHSC1108"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "There were weekly assignments and quizzes and occasionally the assignments would take me a while, but it was never anything unreasonable. Watching all the lectures were more time consuming than the assignments. There were a lot of lecture videos to watch every week and it was a but much, but everything on the quizzes was mentioned in the lecture.",
        "course": "EARTHSC1108"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "took this class online and there was usually multiple lectures a week that were time consuming. the time on the quizzes was very short so you must watch the lectures to do well",
        "course": "EARTH1108"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Millan is one of the sweetest professors I've had and is truly an amazing person. The class started easy but got harder. No exams but the weekly quizzes sometimes have obscure questions that were only mentioned briefly in the lectures. Work load is totally manageable. Somewhat easy A as long as you watch lectures and do extra credit which. ",
        "course": "EARTH1108"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Millan is genuinely super sweet but this class was a lot harder than it should have been for an intro class. The format would change weekly and sometimes the quiz questions didn't match what we learned which bring down your grade a lot since they were based on a few questions. She does give a lot of extra credit and is very sweet though!",
        "course": "EARTH1108"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is a very sweet woman and her lectures are very clear. If someone is saying that this class is hard then they are simply not watching all the lectures. Overall, very easy class and would take again!.... After another couple weeks in the class I still think that she is a great woman, but her lectures will not have all the info for the quizzes :(",
        "course": "EARTH1108"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this class as a GE. Her grading and this class is ridiculously hard. She makes up random reasons for why she graded things a certain way. She gave me a 0 on an Extra Credit. I spent 4-5+ hours a week on content, and her lectures sometimes don't align with the quizzes, that are also very hard. Her grading is not consistent either. ",
        "course": "EARTHSC1108"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed this class. The lectures were very entertaining and easy to follow. She gave blank powerpoint that you could use to take notes and there were many extra credit opportunities. The weekly quizzes are all very straightforward, and not difficult as long as you do the reading and watch the lectures. She is very helpful as well.",
        "course": "EARTH1108"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "I thought this would be an easy GE class, but it was definitely hard. She posts so many lecture videos and the quizzes each week are actually hard. Thankfully I had a friend in the class or I would have not gotten an A. I wouldn't recommend if you are looking for an easy A gen ed class.",
        "course": "EARTHSC1108"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Honestly one of the best science classes I've taken. It's interesting and she is clearly passionate. If you actually watch the lectures, take notes using her handouts, and do the assignments, you'll be completely fine and will get a good grade. Didn't spend more than 4-5 hrs a week on this class, but learned A LOT. Really glad I took this class.",
        "course": "EARTHSC1108"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 1,
        "comment": "The class itself is pretty easy and shes a decent lecturer. The class has way too much content that is covered. Easily 2+ hours of lectures weekly plus lengthy assignments and quizzes every week. Never got a break during fall or Thanksgiving. I Spent more time on this class than any of my major classes. No tests. Not sure Id recommend if busy",
        "course": "EARTHSC1108"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Really well-organized asynchronous class that's a great GE choice. Lots of lectures and quizzes every week but as long as you fill out the powerpoints you will be fine. She is really interested in the content and it's apparent! Multiple extra credit opportunities. As long as you put in some effort it isn't too bad.",
        "course": "EARTHSCI1108"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "Gave homework on breaks. It seemed like she didn't care about giving us breaks when Ohio State said that homework was not to be given on week-long breaks like Thanksgiving. Her extra credit was also formatted differently. They were like assignments that affected our grade",
        "course": "EARTHSC1108"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Six-week online summer class so it was very condensed and there were a lot of lectures each week, but in return no assignments, only quizzes based on the lectures and reading. Sometimes the lectures took a while but are key for quizzes. She is very knowledgeable, and really cares about the topic and making sure students succeed.",
        "course": "EARTHSC1108"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "I bought the textbook, but never really used it. Some of the quizzes are open book, however. She was very interested in her material which is certainly a good thing.",
        "course": "EARTHSC1108"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best online class I've taken, she keeps lectures short and clear, breaks the weekly modules into pieces to make it easier to stay on track, and offers a lot of extra credit. She does everything she can to ensure her students succeed!",
        "course": "EARTHSC1108"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lots of chances for extra credit so you shouldn't have an issue getting an A in this class, but there are tons of video lectures and little quizzes and you have to complete them ALL to finish the assignment and big quiz each week. No papers or exams though. Watch her lectures in 2x speed, trust me. Also kinda rude in her emails and doesn't care",
        "course": "EARTHSC1108"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "AWESOME! Really cares about you and your grades. lots of extra credit. Keeps lectures short like 20 mins. Lots of assignments and quizzes, but they're easy for the most part. She's very kind and a fun person to listen to. She really cares and her class is really easy as long as you do the work. No midterm or final exam or papers.",
        "course": "EARTHSC1108"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 5,
        "comment": "Cristina was great! Her lectures were exciting and informational. Her quizzes are a bit hard, so make sure you take good notes with lectures and readings. I took this online and I didnt have any Finals or midterms. Loved the class",
        "course": "GEMSTONES1108"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Overall, a pretty average class. The tests are maybe slightly harder than average, but not terrible. The class is very laid-back and Cristina is really nice. You can switch the average of your quiz grades for one of the exams, if it is a higher score. Not too many grades, just the exams, attendance, and labs. Exams come from lectures",
        "course": "EARTHSC1100"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "Took gemstones expecting it would be an easy, fun GE and it was the hardest class ever. Studied for the final for over 40 hours and still ended up getting a B- on it.  Test questions are impossible, only way anyone would know all of them is if they're really lucky or a geology major.  Millan was never any help and didnt care when averages were low",
        "course": "EARTHSC1108"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "if you want an easy A for a GE credit this isn't really for you. takes attendance every day, the material is pretty easy but the test are tough. one of those teachers that has multiple possibilities for each question so you have to pay attention to the little stuff. as a GE class, this was too much.",
        "course": "EARTH1108"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is definitely passionate about what she does. Her accent can make it a little hard to understand a few words here and there, but for the most part she is clear. You take quizzes on an app after every unit and at the end of the semester you can replace one of your midterm grades with your average quiz grade. Pretty cool and not very hard.",
        "course": "EARTHSC1100"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "I wish I loved anything as much as Cristina loves gem stones. You had to show up for participation grade. But if you skipped half of the classes it didn't really matter. All of her test came directly from the slides and were super easy. I paid attention in class and took notes. I only studied for an hour before each test , Super Easy class!",
        "course": "EARTH1108"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took this class as a GE and after everyone having done fairly well on the first exam, she made the second one extremely difficult and worth more points. She goes on long tangents and expects you to remember minute details and problem solve complex situations that are often subjective. If you want an easy GE, don't take this course with her.",
        "course": "1100"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is very passionate and well-informed about her subject. However, she goes through her contents at full speed; can be extremely confusing if you are falling behind.  Grade is solely based on tests.  Test questions are super specific; you need to pay attention to every word that came out of her mouth. A lot of extra credit opportunities.",
        "course": "EARTHSC1108"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 5,
        "comment": "Her class was a joke. I was told that this course was a interesting course for non majors in geology and that was a LIE! She was unorganized, when I tried to schedule appts with her she was never there or on time or forgot she had a meeting. NO HOMEWORK to weight out any exam grades. Class is based off EXAMS! Not good for ppl with test anxiety!",
        "course": "ES1108"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is not helpful at all. She does not understand where students are coming from when they have an issue in the class. She thinks everyone loves gemstones and acts like we should spend all of our time devoted to her class. I thought this would be an interesting semi easy class. I WAS WRONG. DO NOT TAKE THIS CLASS!!!!",
        "course": "EARTHSC1108"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not as bad as the comments lead you to believe... Don't waste your money on the book. I never opened mine. She gave \"recoup\" points after each exam. Quizzes are random but they are group work. One midterm can be replaced be the quiz average. I hate science so it was a decent GEC for my science section.",
        "course": "EARTH1108"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an amazing teacher, She is very passionate about her study and helps the students very well. She doesn't care about grades, she cares about the students learning. If you pay attention and come to class instead of JUST reading the book its a garuntee good grade.. For our midterms she lets us retake the most missed questions.",
        "course": "EARTHSC1108"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 3,
        "comment": "I liked Prof. Millan and I loved her class.  She is passionate about teaching and I learned alot.  She was very helpful and I felt she responded to everyone's questions with much knowledge.  Her class is not easy but she makes us think and I think people here are just cry babies that want everything given to them like we are in elementary school!",
        "course": "EARTHSCI1108"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 4,
        "comment": "Cristina Millan is terrble teacher. she has nothing to say when you ask her specific questions. goes to fast you have to \"keep up\". she was NOT available by email before a FINAL, but she never responds anyway. she was unorganized, and it was hard to know what to study for the quizzes in her class... which we we only took half of them anyway.",
        "course": "ES1108"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 3,
        "comment": "Wow. what a horrible teacher. Tests were over material we've never learned and she posts a study guide that says \"in no particular order\" -_- makes it extremely difficult to do well on any exams, and even when the averages are bad she has nothing to say about it.",
        "course": "EARTHSCI1108"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 4,
        "comment": "The class was interesting, and she seemed to be a decent teacher during the lectures, but her tests were ridiculously hard, often featuring material we had never learned.  The group quizzes we had every week or so were nice though.",
        "course": "ES108"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 4,
        "comment": "Millan seemed interested in teaching and the subject, but the lectures and material were unorganized. The quizzes and tests were way too specific for a 100 level course. The lack of organization definitely makes studying for the exams difficult.",
        "course": "ES108"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 4,
        "comment": "Hated her with a passion. A horrible lecturer. She wasted so much time yapping about topics that we weren't to be tested on. Quite difficult for a 100 level GEC course. I wouldn't suggest taking it...",
        "course": "ES108"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 2,
        "comment": "Good lecturer, but didn't seem prepared for any questions of substance. She was interesting, but soft-spoken. Tests ad quizzes seemed a bit too specific for a 100 course.",
        "course": "ES108"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.7,
    "department": "Geology",
    "firstName": "Eric",
    "id": "VGVhY2hlci0yMjI0MjIy",
    "lastName": "Mumper",
    "legacyId": 2224222,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Was a great professor and would definitely take a class with him again. Made it super easy and fun with a few demonstations throughout the class. Honestly felt like he enjoyed teaching and helping others.",
        "course": "EARTHSC2206"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Mumper was one of the few teachers I had that had really amazing lectures and is clearly very passionate about what he does. A few papers but they aren't too bad. His class was great. Only thing that could get annoying is I don't like politics and he brought up a bit politics a bit but overall I think that he was a great teacher.",
        "course": "EARTHSC2206"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the most passionate professors I've had. There is quite a bit of homework but most of it is pretty easy, mostly discussion posts, you just have to keep track of it. A couple of papers which weren't too bad. Let us use a note sheet on the final which was very helpful.",
        "course": "EARTHSC2206"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Mumper is very passionate about his teaching and makes you really think about your actions and care about what you're learning. He is a bit disorganized with dates and such, but overall he is really good. His class is pretty easy if you do the assignments and go to the lectures. ",
        "course": "EARTHSC2206"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mumper was by far one of the best professors I have ever had. He cares about the subject, is passionate about his work, and is very funny. The assignments were simple & allowed you to take what you learn and apply it to other material. He truly wants the best for his students & for them to understand the material not just know it. 13/10",
        "course": "EARTHSC2206"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Genuinely one of the best professors I have every experienced. Mumper teachers what he loves and that is so clear in his lectures. He is hilarious and keeps you listening even when it can be a mundane topic. The assignments are simple, although can be a little hard to read(thats science though.) An amazing person who makes an even better teacher.",
        "course": "EARTHSC1105"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very fun teacher and I learned a lot from him. His class is very well structured and as long as you pay attention to the lectures you should have no problem on any of the tests. ",
        "course": "EARTHSC1105"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Mumper is very passionate about what he teaches. He does his best at making sure that his students understand the material that is taught in class. He does tend to talk a bit fast when he is lecturing and I personally felt that his tests were a bit difficult. But overall, I felt that Dr. Mumper was very good.",
        "course": "EARTHSC2206"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I am by no means a Science mind and Professor Mumper made me enjoy this science course and really made the material easy to grasp and understand. Great sense of humor and very honest. 10/10 recommend",
        "course": "EARTHSC2206"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Such a great teacher. Exams are easy and he truly cares about all his students. Definitely take him if you can!",
        "course": "EARTHSC1105"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "You can tell that Eric cares about the subject a lot, and his passion made otherwise repetitive topics interesting! Told lots of self-depricating jokes, really wanted to give him a hug most days. The class should be an easy A if you attend lecture, do the weekly quizzes, and go to review sessions for the exam. Exams are super straight forward.",
        "course": "EARTHSCI1105"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Interesting and makes you want to travel. Material is usually simple + repeats; I've zoned out on occasion. A big highlight is Eric's personality and humor- he's really lovable, friendly and relatable. Passionate and one of my favorite professors- even did demonstrations. Only wish he would have done that outdoor lecture that he was thinking about!",
        "course": "EARTHSC1105"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Eric is very reasonable and the class is definitely manageable. The overall class Is filled with Interesting content. Random attendance points.",
        "course": "EARTHSC1105"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Was not in this class, however, I went to half of his lectures because I just showed up for my friend who was actually enrolled in the class. He is an amazing instructor with a very dry sense of humor and he makes jokes about his sad life and I want to give him big ol' hug because I love him; he is very passionate about the course. 10/10 recommend",
        "course": "EARTHSC1105"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Mumper is great. He is hilarious and relatable with a self-deprecating sense of humor. You can tell he puts in a lot of effort and he is very knowledgeable about his subject matter. He also is willing to answer any questions, and if he doesn't know the answer, he looks it up and gets back to you. Definitely had a low-key crush on him :)",
        "course": "EARTHSC1105"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Funny guy. Easy A if you give any effort. Weekly quizzes/homework that are easy. Exams are straight forward and easy if you attend lecture (attendance is graded randomly). Definitely recommend taking his class!",
        "course": "EARTHSCI2206"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "Quirky guy, but could be funny.  Random attendance throughout the semester so be sure to show up.  Exams weren't tough as long as you studied what he told you to in the study guide.  Extremely passionate about what he teaches, even though it could get pretty dry.",
        "course": "EARTHSC1105"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "Insecure and funny. Allowed for extra credit and was suuuuper repetitive",
        "course": "EARTHSC1105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.4,
    "department": "Geology",
    "firstName": "Michael",
    "id": "VGVhY2hlci04NTYxMTE=",
    "lastName": "Bevis",
    "legacyId": 856111,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Class had three professors who split the work, I'm just posting it under Bevis as he's listed first. One of the easiest four credit hour classes you could take, and it's also one of the worst organized college classes I've taken. You'll do one assignment a week at most, but be prepared for badly made exams and lectures that don't have a purpose.",
        "course": "EARTHSC2911"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Bevis himself was pretty good and knows a lot about what he teaches. He is very lecture heavy with slideshows though and not much else. The ES1911 class is odd with having 3 different profs, and I was not a fan of the quizzes as not many people I talked to really knew what was going to be on them. But Bevis is the best out of the 3 though for sure.",
        "course": "ES1911"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "1911 has 3 professors and can be taken as a bio/physical science/history GE. He covers the physical science portion of 1911. No tests just quizzes after every lecture (easy if you pay attention). Gets boring sometimes. Bulk of the grade comes from a group poster project and individual history essay. He has an accent and does research in Greenland.",
        "course": "ERSCI1911"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was a climate change class and it was incredibly boring material but he liked to add some dry humor in as well. This class was taught by 3 professors (each for one third of the semester) and though i struggled to stay awake during his class, as long as i showed up and paid a little bit of attention, i was fine!",
        "course": "EARSCI1911"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very dry sense of humor, really funny if you get him. The book is useful if you miss class, read the chapter that lecture is over and your good. BEWARE OF OBSCURE FACTS! Test always had random facts like the temp. of magma, the kind of thing you would skip over if you read it. His teaching partner is kind of boring.",
        "course": "ERSCI151"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great sense of humor, cool accent, and super great teacher.  Would take another class from him anytime.  He was wonderful at explaining things.  Natural Hazards 151 is an easy A.  Just pay attention in lecture, you don't need the book. He lets you take tests, discuss them with classmates, and take them again for the average! Overall: Good guy!",
        "course": "EARTH151"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "This guy is a great person.  He teaches you how to think about concepts.  The class was very informative, however you need to understand a bid of math to be comfortable with what he teaches.  I seriously recommend him as a graduate advisor.  Has a great sense of humor.  The school need more professors like him.",
        "course": "GEODSCI781"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "Geology",
    "firstName": "Lonie",
    "id": "VGVhY2hlci0yOTQ4NTQ3",
    "lastName": "Thompson",
    "legacyId": 2948547,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Dr. Thompson is clearly not a scientist but an explorer that has used many knowledgeable colleagues and people to reach targets that he would never have fulfilled by himself because of his deep technical and scientific incompetence. He became a millionaire teaching a class every other year thanks to the support of unethical administrators at OSU.",
        "course": "6750Paleoclimat"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "Despite his fame Prof. Lonnie Thompson is a real incompetent. For instance he does not know the difference between statistical indexes such as average and median. His ethic is low at best. Prof. Thompson is only apparently an humble person. He is used to say: \"It is important to appear humble as people like humble persons\".",
        "course": "6750Paleoclimat"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.2,
    "department": "Geology",
    "firstName": "Steven",
    "id": "VGVhY2hlci02MjIxNTM=",
    "lastName": "Lower",
    "legacyId": 622153,
    "numRatings": 68,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Very weak professor with no personality and no ethics. ",
        "course": "EARTHSC1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lower is absolutely wonderful. He was nothing but kind to his students and his lectures honestly weren't that boring. He made it interactive and talked in a way that made the material come off as interesting. Attendance wasn't mandatory, but he scatters attendance quizzes in throughout the course to insure you're still coming to most classes.",
        "course": "EARTHSC1121"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very caring and funny guy. Super helpful. Did attendance quizzes that related to his lectures, but attendance was not mandatory. He is awesome, just study the notes and go to class when you can. He definitely wants to help his students succeed, and cares about you and your retention of knowledge rather than just a grade.",
        "course": "EARTHSC1121"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lower is a great prof and genuinely cares about students. Exams were only tough b/c of the time limit, and lectures sometimes drug on, but he often lets us out early. Stay engaged and you'll do perfectly fine. He genuinely cares about students and goes out of his way to prove it--you can tell he really wants his students to learn and succeed!",
        "course": "EARTHSC1121"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Lectures can be a slog sometimes, I fought to stay awake frequently during the hour long sessions, but the content is interesting enough. Professor Lower is a great guy, and if you take this class you should try to attend as much as you can, because I found the tests to be pretty difficult. He offers recorded lectures that he hosts live on zoom.",
        "course": "EARTHSC1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fantastic professor. 0 complaints. Chill, simple, easy follow, no tough at all. Never get a sense that this professor needs to prove something. Would take again 100 times.",
        "course": "EARTHSC1121"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Lower is the most understanding professor and loves his students.",
        "course": "EARTHSC1121"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor to start college with. He really cares about students and their grade.",
        "course": "ENR2100"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "It's a boring class, professor is nice though.",
        "course": "EARTHSC1121"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Extremely informative class that doesn't require much work. We did weekly quizzes and then two open note exams that are straightforward. The class usually requires a small research paper or poster (depends on the semester). It effects your grade a lot, so don't put it off. I found his lectures easy and he says what will be on the exam every lecture",
        "course": "ENR2100"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty boring class, especially if you've taken enviro classes in high school. It was easy though and a good introduction. If you're taking this class as a GE, definitely recommend Prof. Lower since it's an easy A and attendance isn't mandatory. However, if you want to be engaged in the topic I would maybe go elsewhere.",
        "course": "ENR2100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great guy. Interesting class too. Go to class because some of the slides he posts online, he removes some information so that the people who go to class have the advantage. Would definitely take again. Dont underestimate the exams. Theyre not a cake walk despite being online and open note.",
        "course": "ENR2100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "In terms of a science GE lab class, I highly recommend. He really wants to see you succeed and it's relatively an easy class. Labs are easy-ish, just time consuming. Lectures aren't mandatory and on Carmen but sometimes he has &quot;attendance quizzes&quot; that will be used in your final grade. The tests are open book/note and taken on carmen. Not too bad.",
        "course": "EARTHSC1100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Earth Science is a great GenEd class. Super easy and interesting. Professor Lower gives out tons of extra credit if you go to lecture. There are attendance quizzes but he gives the answers in lecture, sometimes even takes the quiz during lecture. Exams are super easy, online, and open note. Lab is also extremely easy.",
        "course": "EARTHSC1100"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Lower is really charismatic, but his lectures can still get dry. Going to class is important because he puts things from lecture on the exams that aren't in the powerpoint notes. He gives extra credit for participating in class, so do that! I would recommend him, he's a nice and intelligent guy.",
        "course": "EARTHSC1100"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Hes not a bad lecturer, its just a boring class (to me at least). His exams were harder than I thought, so prepare a bit for them (dont just look up the answers in his powerpoints). He does attendance quizzes but doesnt tell you when. Gives a lot of extra credit during class for participation. The lab portion is an easy A",
        "course": "EARTHSC1100"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great Professor, and gives extra credit throughout the class for answering questions he throws out during lecture. The exams are online but were harder than expected, you are allowed to have your notes but I would recommend studying as if you don't have notes to be prepared. Attendance is not mandatory but he gives quiz answers in lecture sometimes",
        "course": "ENR2100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Lower's class is a fantastic option for a GE. He is hilarious, engaging, and the info is interesting and simple. Just don't forget to go, pay attention and do the quizzes, as they will help your grade. I didn't find the test to be hard at all as long as you have the info in front of you, which is allowed. Labs are simple if a bit boring .",
        "course": "EARTHSC1100"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty cool guy, had a great sense of humor. Classes aren't mandatory, but he will sometimes do attendance quizzes. Exams we're harder than expected, but he posts his slides on Carmen. Labs are super easy, you're allowed to miss one. He gives out extra credit in lectures for easy questions &amp; if you get the question wrong he still gives it to you",
        "course": "ES1100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Lower made this otherwise irrelevant GenEd required course interesting and engaging. He gives extra credit points counted towards your midterm or final often during lecture for answering questions ranging from somewhat difficult to ridiculously obvious. Great teacher, very approachable and down to earth.",
        "course": "ENR2100"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lower is difficult to follow. He jumps back and forth through slides. Offers bonus points in class if you participate, but rewards wrong answers more than correct answers. He dumbs down the material, but the open note, online exams are much more completed, random and over things not even discussed in class.  Exams pretty much determine grades.",
        "course": "ES1100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a really easy GE! As someone who is not a fan of science,  Lower made this class endurable. GO TO LECTURES. He gives a lot of extra credit just for being there. Exams are online, but make sure to review material prior.  He's a super nice guy and was extremely helpful if you ever needed it! Easy A with extra credit and minimal studying.",
        "course": "ENR2100"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "TAKE THIS CLASS! You won't be sorry. Dr. Lower is funny and provides an interesting lecture for the content this class covers. No textbook, and open-note exams. Go to class, pay attention and you will do fine. The lab is pretty easy, and only meets once a week, usually finished before the scheduled end time. Study for exams and you'll get an A.",
        "course": "EARTHSC1100"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Lower is great. The class consists of an easy lab, attendance quizzes (answers given, reading quizzes, midterm, and a final. The reading quizzes are tremendously easy. The exams are not bad if you somewhat study. They are open note so you should get good grades on both. The lectures are awesome and he gives out participation extra credit.",
        "course": "EARTHSC1100"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "The lecture material is super easy and the examples done during class are very simple. However, the exams are almost impossible. He doesn't give you enough time to give each question the necessary thought and most of the questions aren't covered in class. He also misdirects you to what kind of questions will be on the exams.",
        "course": "EARTHSC1100"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "The assigned reading quizzes and exams were so so hard. Class was so much simpler than the exams were. He makes this class so hard for no reason, it is a GE. I would never take this again.",
        "course": "EARTHSC1100"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Lower is by far the funniest teacher I've had. He makes the class more interesting than it actually is. Labs are extremely easy. He gives out easy extra credit points for participation in class. RAISE YOUR HAND FOR THE EXTRA CREDIT because there is a very good chance you will not do as well as you would like on the midterm/final.",
        "course": "EARTHSC1100"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a great professor! 10/10 would recommend his class. I hate science classes, but actually made my class very enjoyable. He is super funny and gives out easy extra credit points.",
        "course": "EARTHSC1100"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 3,
        "comment": "Exams are extremely difficult!!!",
        "course": "ENR2100"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 4,
        "comment": "He went incredibly fast and jumped around on his slides a lot.  Then would delete certain info from them before he posted them online.  So if you didn't get very specific info down fast good look on the test, because he test questions are very specific.  Tests mainly graphs that were difficult to read than any vocal or concepts.  wouldn't recommend",
        "course": "ENR2100"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 4,
        "comment": "Don't be like me. Go to class even though class is boring and way too long. Also this class has way too much math and just because the exam is open note and online doesn't mean this class wont rail you. I have no further advice other than take an easier lab class. Good day!",
        "course": "ES1100"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 3,
        "comment": "I felt he was difficult to follow in lecture-he would jump around the slides in the powerpoint which made it kind of difficult to take notes. His exams are online, but  are pretty difficult  for the content of the class and some questions are very detailed. Lab and lecture aren't really related.",
        "course": "ES1100"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great professor, super nice and gives out easy extra credit points each lecture. Labs are easy, and he relates the lecture to what we learn in lab which I really liked. His online quizzes and tests are super hard but they are open book so it's manageable. Would recommend, he brought humor to the class and made learning enjoyable.",
        "course": "EARTHSC1100"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "He was a pretty great professor. He's very motivated with his research too and will mention it in class from time to time. ",
        "course": "ENR2100"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 3,
        "comment": "I missed one online quiz and it brought me from an A- to a B+, it was stupid because I simply forgot about it. The reading tests are hard. But if you go to class he will give you answers to his online quizes. Nice guy to not let the final be cumulative. Labs are easy but useless and do not do the same things classes do.",
        "course": "1100"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Lower is a very knowledgeable and straightforward guy who takes a textbook-free approach to the course. All content is learned in lecture through powerpoints and all quizzes and exams are online (open-note); he pulls most exam questions from powerpoint slides. Lab is a joke, but an easy A. Overall great professor and interesting class.",
        "course": "EARTHSC1100"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very easy class to take. Has super easy quizzes, no homework and no papers. The labs are not harshly graded. You shouldn't skip the lectures because he goes over a lot of stuff but you can pass  even if you do. Pay attention to every detail and readlisten to all the supplemental material. Tests are open note, open book.",
        "course": "EARTHSC1100"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 4,
        "comment": "Honestly, a good teacher with an interesting class. But it just isnt worth taking because the tests are just too difficult. A- but I needed an A",
        "course": "ENR2100"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good professor. I don't know why test averages were a B. I had no trouble getting A's on the exams. I only got a B + on the final and that is because I did not study at all. All lectures are posted online. Labs easy boost to everyones grade. Only reason to go to class is pop quizzes. Lots of extra credit if go to class also.",
        "course": "ES1100"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great guy. Funny, very intelligent. Very helpful & open to questions. Loves when you speak up, may give you random extra credit. Lectures are dry, but Dr. Lower is entertaining! Exams...I always expected to do much better but for some reason couldn't get above a B! But pretty straight forward class, all notes on carmen.",
        "course": "ES1100"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Lower is a nice guy. The class is super easy, but his tests are harder than they have too be. He doesn't care about teaching this class and will talk about his research of bacteria a lot. He puts all of his slides on Carmen. You have to do a research project at the end, not worth it if its just a GE credit.",
        "course": "ENR2100"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor. Repeats himself numerous times to make sure you comprehend. Gives out lots of extra credit. Go to lecture and take notes and you will get an A.",
        "course": "ES1100"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 3,
        "comment": "I took this class because I heard that it is super easy. I went to lectures, took notes, studied, and when the tests came around they were impossible. It is a 100 level class but he makes it so hard. He was so cocky. The labs were a joke and saved my grade.",
        "course": "ES100"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 3,
        "comment": "All was fine except the way he wrote his tests.  Example of a bogus question from an exam: &quot;We tested a hypothesis related horoscopes during lecture. Suppose we conduct the test again using 13 signs and 13 horoscopes.  Professor Lower would predict that ______% of students will select the correct horoscope in the new test with 13 signs&#63;&quot;.",
        "course": "ES100"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome prof, direct and straight to the point.  Exams are all multiple choice, and final is composed of many of the exact same questions on first two midterms.",
        "course": "ESCI100"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class was not really difficult, most people average a B. But Professor Lower made it clear that he did not really care about teaching. He repeatedly said &quot;I know you all have better things to do with your time than come to class and so do I.&quot; Extremely focused on research; class seemed like an afterthought to him.",
        "course": "ES100"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 2,
        "comment": "Hes great. Is really clear about what you need to know. most people avg a B on his exams, lab and pop quizzes boost your grade",
        "course": "ES100"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 1,
        "comment": "he makes this class so easy, everything on the test is exactly what is in class, especially the overhead slides he does. i loved the class and it was a nice break in comparison to my other classes... take this class if you want A",
        "course": "GEO100"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 1,
        "comment": "The easiest class ive taken at OSU thus far and its my 3rd yr. You must go to class though cuz the test are exactly from what he says in class. If you cant at least get a B in this class i dont know how you got into OSU",
        "course": "GEO100"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's legit. Most people (avg.) get a B in this class. Labs are ridiculously easy but are 25% of your grade. The material on Planet Earth is really not that interesting but he actually tries to teach and gives out bonus points for participating. Really real and down to earth -- he doesn't seem to care about teaching but is actually not bad at it.",
        "course": "ES100"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 1,
        "comment": "Do you need an A&#63; with as little work as possible. then this is the class.....you must attend this lectures because everything is going to come from the slides (I mean everything 100%) plus you get 10 free points when you attend the class. Final had similar questions from MT-1 and 2...he let us bring note card to the 2nd one...Must take... 10/10",
        "course": "ES100"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 4,
        "comment": "Im not sure what class everyone else took, but his exams are ridiculous.  NOthing to do with the lecture note, tons of calculations he never tells you how to do.  I have a 3.86 and im pretty sure I will do really poorly in his class",
        "course": "GEO100"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 2,
        "comment": "Fair. You don't need to buy the book. His exams can be extremely difficult if you don't study. Class is pretty boring, but he tries.",
        "course": "ES100"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Lower is an amazing professor all around. He has a very laid back type of teaching style, but you learn an incredible amount in just one quarter. His exams can be tricky, so read carefully! Make sure to go to lecture because his exams are based on lecture notes, not reading in the book. As long as you study your notes, you will love this class!",
        "course": "GEOLS100"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Teacher. Explains things well and he makes sure you know the material. Exams are based entirely on Lecture so you have to go to class (doesn't post notes on Carmen). Test are easy if you have the notes. He looks like John Mayer. haha",
        "course": "ES100"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a great professor and makes the material really easy to learn.  His tests for the most part are easy but he throws in questions that he knows 98% of the class will miss.  He's arrogant and doesn't seem like he cares too much about teaching...he just happens to be good at it.",
        "course": "ES100"
      },
      {
        "index": 57,
        "rating": 3,
        "difficulty": 3,
        "comment": "Easy class, but I don't feel like I learned anything at all really. Lectures were not as exciting as everyone says.",
        "course": "GEO100"
      },
      {
        "index": 58,
        "rating": 4,
        "difficulty": 1,
        "comment": "I have no interest in geology, but I found Dr. Lower's lectures pretty interesting. He spells out everything for you! On the exams there are some questions where he tries to trick you, so just read carefully. I never opened my book, so don't bother buying it. Labs are stupid, but easy. A great professor for an easy A in a physical science course.",
        "course": "GS100"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher!  The class was very easy.  He makes his tests right from class notes and there was no need to buy the book.  Labs were really boring though.",
        "course": "GS100"
      },
      {
        "index": 60,
        "rating": 4,
        "difficulty": 2,
        "comment": "Take this man! He really is easy and he cleary states what he wants on every exam. He gives you 10% by just going to class. His exams are extremely easy esp if you go to class.  He was really interesting and i would take anything that he is teaching. So, take him and you wont regret it",
        "course": "GS100"
      },
      {
        "index": 61,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lower is probably one of the best professors I have ever had. He made the material seem less boring and kept the students engaged. He gives ec for participating, hints to exams in lecture, and easy attendance quizzes- so GO TO CLASS. The final is 90% of the midterms and he posts those answers before hand. Def. take his class!",
        "course": "GEO100"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 1,
        "comment": "I thought that geology was going to be a drag but he makes it so interesting.Its not just looking at rocks, its how the earth works and stuff.lecture is actually interesting, tests are easy cause he gives you hints in class, go to class and its an easy A, doesn't use the book, usually lets out early, REALLY easy! some extra credit if u participate",
        "course": "GEOL100"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 1,
        "comment": "hes soo easy and awesome",
        "course": "GEO100"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 3,
        "comment": "Superb professor.  Really interested in teaching students.",
        "course": "GS100"
      },
      {
        "index": 65,
        "rating": 5,
        "difficulty": 3,
        "comment": "Exceptional professor!  Best I've ever had.",
        "course": "100"
      },
      {
        "index": 66,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher, actually kept me awake. No tricks, just straight forward.",
        "course": "GEOLOGY100"
      },
      {
        "index": 67,
        "rating": 5,
        "difficulty": 3,
        "comment": "Your grade just depends on whether or not you go to class. He doesnt use the textbook so dont buy it. His notes for the tests come straight from his lectures so you have to go in order to get these notes. 2 midterms and a final. Tests consist of about 35 multiple choice and an essay. He'll tell you what the essay will be before the test.",
        "course": "GEOLOGY100"
      },
      {
        "index": 68,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "GS100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.3,
    "department": "Geology",
    "firstName": "Ian",
    "id": "VGVhY2hlci0xMTgzMDM4",
    "lastName": "Howat",
    "legacyId": 1183038,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Very weak professor with lack of ethic.",
        "course": "EARTH121"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "This is the easiest Physical Science GE (with a lab) to take at OSU! Lecture is not mandatory, however it is nice to go so you're not completely lost. All quizzes and midterms/finals are online and are open web/note which makes this class an EASY A!!! Would recommend to anyone looking to knock a science credit out that is not a science major.",
        "course": "ESCI1121"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "This, I swear, was the most easiest class I have ever taken. Honestly, such an easy class with no work except show up to the labs. All exams and quizzes online with MULTIPLE attempts. You can literally google all the questions and BAM! u have an easy A. Great class to take if you are trying to balance a bad grade from another class.",
        "course": "EARTHSC1121"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really easy class. All tests are online, and we were allowed to take them three times. Make flashcards. He's pretty easy on the students. Lecture isn't mandatory, but he does give pop quizzes every once in a while for attendance. Prof. Howat is funny and nice, but the class is pretty boring. Good GE class.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is an easy A. The labs are easy and I got an A on all of them. There are three midterms and a final. All of them are online, and each one you get three attempts on. This class is more about how fast you can Google the answers for the test, than it is memorizing anything. Everyone should take this as an easy GE.",
        "course": "ES1121"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I mean this sincerely, if you cannot at least pull a B in this class, you're doing something wrong. Hands down the easiest class I've taken at OSU. Ian knows you're not wanting to be a geologist. If you need a science course with a lab, this is the one.",
        "course": "EARTHSC1121"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "OK so he tries hard to be interesting. But its pretty boring stuff! He's a good teacher though and will answer your questions. He gives a huge exam packet - do it! your questions come straight from that. I didn't do it (lazy) and got a B. Labs are really easy too and you can drop two.",
        "course": "EARTHSC"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Several questions are posted that could be possible exam questions, answer and memorize those because the exam questions come straight from that. Fairly easy class, that's somewhat interesting.",
        "course": "ES121"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Test questions are mostly online, do them weekly then study them! all resources on Carmen and very organized.  Kind of an ass in lectures, but as long as you don't need personal assistance, he's a great professor.  If you have a personal problem in class, talk to your TA.  Labs are interesting and the majority of your grade.  Good GEC choice.",
        "course": "ES121"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class requires good memorization skills. Test questions are put online.  You are responsible for finding the answers to many possible test questions.  Labs are very easy and kind of fun.  Not a bad GEC if you are looking for an A or a B",
        "course": "ES121"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very interesting, knows what he's talking about, all the questions that he uses for his exams he puts online and they are all multiple choice, easy class",
        "course": "ESI121"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ian is one of the best teachers I've had at OSU. He makes some really boring stuff interesting. I just took this class because I needed the GEC, but I ended up really getting into it and wish I majored in geology. Ian's the man. Take this class.",
        "course": "ES121"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Only study the past exam questions. Go to lecture, pop quizzes are worth a good chunk of your grade and the answers are given to you. Textbook use is good for the questions. If you're good at memorizing, you'll do fine.",
        "course": "ES121"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ian is a super cool guy who makes the not-so-interesting information of the course as interesting as possible. He tries to make it fun and makes everyone feel comfortable with his easy-going nature. LOTS of material but the pop quizzes are just completion and he gives you the questions to exams beforehand.",
        "course": "HIST121"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher, come to class and study for 5 hours before each test and you will do fine. Attendance isn't mandatory, however he gives in class pop quizzes that aren't worth much. I highly suggest this class/ professor.",
        "course": "EARTH121"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher!!!!!!!",
        "course": "SES121"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "I was in Ian's first class in his first year teaching at OSU. He is a really nice guy and the class was really cool. He is really interested in helping students, and makes the information really accessible. (all his powerpoints that he uses in class are incredibly detailed and are posted online prior to class.) labs were really cool too!",
        "course": "EARTH120"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ian is a cool teacher. His exams are really easy, as long as you pay attention in class and read a little bit outside of class. He gives you all the questions to the exams and you are responsible for the answers, he will not give them to you- until after the exam. Overall, very very good teacher that knows what he is talking about!",
        "course": "EARTH121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.3,
    "department": "Geology",
    "firstName": "Andrea",
    "id": "VGVhY2hlci04NDUwMzY=",
    "lastName": "Grottoli",
    "legacyId": 845036,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Although Dr. G is a great lecturer, beware of this class's difficulty. The first exam's average was a 56%, and was said by her to be the 'easiest'. The questions were so ridiculously particular and unfair, given a straightforward class material. It absolutely is NOT worth the GE credit, there is much easier options.",
        "course": "EASC2206"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Grottoli was a very good professor and I can see why a lot of people liked her. I thought taking this class would be an easy GE class as she drops many assignments from your grades, but people did not mention that there are 4 exams in this class. I dropped after the first exam in week 3, as the average score on the exam was a 56%. ",
        "course": "EARTHSCI2206"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "The content covered is really interesting and Grottoli is truly passionate about teaching. She does go into depth over some of the material but it's overall pretty easy. She drops a test, 5 quizzes/reflections, and 1 paper. She's also super caring for her students. Recommend for an easy GE.",
        "course": "EARTHSCI2206"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Grottoli is a really cool professor and she's super passionate about what she teaches. That being said, she does expect a lot from you for an intro class. Lectures are fast and thorough and she can be impatient if you ask questions she thinks you should already know the answer too. Don't take this class if you tend to struggle with science.",
        "course": "EARTHSCI2206"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "This professor was so-so I can see why people liked her. Tests are mostly written essay questions but I believe she still does an open book portion which helps. Some questions are up to you to answer like answer &quot;3/4 of the following questions&quot; type of exam, which is nice so you can focus on what you know more",
        "course": "ES5206"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Grottoli was incredibly knowledgeable and passionate about this subject which made the class interesting. However, she made the exams incredibly difficult. It was hard to do well on her exams because they were really specific for a gen ed course. I would not recommend this class.",
        "course": "ES1100"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 5,
        "comment": "Fair grader, made you go to the lectures to fill in info on the slides, were pretty interesting lectures.   Tests were hard but all multiple choice, be ready to study everything on the power points.",
        "course": "EASC100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. G is a very intelligent professor. Her class was interesting and I normally don't enjoy science classes being a business major. Although it was challenging it was worth it. She gives some extra credit but as long as you go to lectures you should be fine. She really enjoys teaching the class and makes an effort to get to know everyone.",
        "course": "EARTHSCI2206"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "I took intro to oceanography & found it challenging. If you don't go to class, you have to get notes from someone who did which is hard to do. Dr G is very smart but a little condescending when you ask questions. I thought her lectures were fast paced so I got the book and it helped a lot. I thought she was too in depth. I wouldn't take it again.",
        "course": "EASC2206"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Grottoli's lectures are pretty interesting even though they can be long. She says flat out what is going to be part of the short answer/ fill in the blank while lecturing. Her exams are not bad either half closed and half open book. A She gives the class a five minute mind break where you can stand up, talk.",
        "course": "EARTHSCI2206"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Way too in depth for an intro class. Expects you to know ridiculous things and amounts of material",
        "course": "17724"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took her for both EarthSci 1100 and Oceanography. Favorite Teacher at OSU. Extremely engaging to the class and loves to talk about her research with Coral Reefs. Definitely would take her class again! Tests are from the concepts she goes over in lecture and not on anything in the book, so as long as you attend lecture and listen you will do well.",
        "course": "EARTHSCI2206"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Snooty at first. A lot of information to put out, and not easy to figure out what was on the test. Very hard to reach during office hours. I would not recommend.AVOID!",
        "course": "EASC100"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 1,
        "comment": "For a science GEC, material was rather in depth, but with bonus points and other extra credit, very easy to get an A (56% of class got A- or above). Prof was sometimes rather snooty and rude; not my cup of tea.",
        "course": "ESCI206"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Not the most helpful. Make sure you go to every class b/c she puts the notes on carmen but leaves some parts blank and you will miss info and getting the notes from others was a pain.",
        "course": "ES100"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Take this class! She is GREAT professor. I learned a lot. The lecture is interestin/fun, and she always give chance to raise your grade. The lab is pretty easy too. Just take it!",
        "course": "OCEAN206"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely interesting!",
        "course": "GEO100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "A very good teacher, she takes her time to explain all the slides and uses a lot of graphs which helps with the material. All test material comes from her slides so buying the text book is not necessary. The tests aren't easy but the grading scale is fair and the top 1/3 of the class receives an A. I highly recommend her for this class.",
        "course": "GEO100"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "the lecutres were extremely boring but she was very nice. tests are hard but the grading scheme for oceanography works to your favor. lab accounts for much of your grade and is not difficult at all!",
        "course": "GEO206"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "She LOVES to call on people when she thinks they're not paying attention. She will randomly ask you obscure questions that she knows you do not know the answer.",
        "course": "GEOL206"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "Ugh... she really irritated me! She made a not-very-difficult subject seem VERY difficult. She crams as much information as possible into her two hour lectures and acts very obscure questions on the exams. The class averages were low and lectures were extremely boring.",
        "course": "GS100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was super nice, a good lecturer.",
        "course": "OCEANS206"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.8,
    "department": "Geology",
    "firstName": "Michael",
    "id": "VGVhY2hlci00MzA2OTE=",
    "lastName": "Barton",
    "legacyId": 430691,
    "numRatings": 55,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "his lectures are pretty boring but the exams are easy. exams are online and he gives out test answers if attendance is bad. there is a five page paper due towards the end of the semester but you can write about anything weather related so it is not hard. ",
        "course": "EARTHSC1151"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class lectures are very boring, but the class is very easy. Open note midterms and final, and lowest midterm is dropped. Attendance isn't mandatory, but when attendance is low he will give out midterm or final answers. There is a final paper but you get to pick the topic and truly doesn't require that much work. ",
        "course": "EARTHSC1151"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very boring lectures. Midterms are open notes so it requires very little work. I didn't learn anything but it could be an easy GE for those who just want an easy grade.",
        "course": "EARTHSC1151"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "Not the most demanding class ever but just super boring. His lectures put me to sleep more than once. The midterm and the final were 50% which is annoying. He grades leniently and has a grading scale that ensures you pass the class. The labs were pretty straightforward, but I think that was due to the TA. ",
        "course": "EARTHSC4421"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "As with most science professors Ive experienced here at OSU, Dr. Barton has a lot of interesting stories to tell. I enjoyed his class a lot, and it was not difficult at all. Labs were leniently graded. Attend lectures because he drops exams hints frequently and sometimes takes attendance for EC. There is a term paper, but you can pick the topic.",
        "course": "EARTHSCI1121H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy class, just make sure you stay on top of it. Also the labs were fun as well.",
        "course": "EARTHSC1121"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Has a good sense of humor! Lectures are definitely interesting and you're always learning something new. The final essay is an easy A!",
        "course": "EARTHSC1151"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class has of 3 midterms (the lowest dropped) and a final. The class takes the test once and then we take it again after talking about it with the people next to us. You also write a short paper about a natural hazard. He is a very kind professor who is passionate about earthsci, lectures sometimes get boring but he can give out test answers.",
        "course": "EARTHSC1151"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "Lectures are very boring but are posted online to view later if you fall asleep. Take an exam by yourself and then take a group exam, he averages the score between the two. Went to class maybe 4 times and ended with a high B, but be aware he gives out test answers if nobody shows up to class. 4 midterms, one paper",
        "course": "EARTHSC1151"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Barton is a helpful professor and he is really friendly. The exams are easy to get a nice grade if you study for that. You can talk with your group and professor about the answers during the exam. Overall it is easy to get an A.",
        "course": "EARTHSCI1121H"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Not an easy ge class, but easy science class. A lot of memorization.",
        "course": "EARTHSCI1121"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Perfect GE class, really enjoyed the class. Easy to get an A",
        "course": "EARTHSCI1121H"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took this for a GE, while it's not the easiest A ever, it's still an easy class. Boring lectures. He doesn't give A-'s so anything 90%+ is an A. I never read the book, skipped fairly often and just studied the lecture slides before exams. One simple paper. Noncumulative exams, lowest dropped, and you get to discuss answers and then retake the exam.",
        "course": "EARTHSC1151"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Took this class for an easy GE, was not easy. He allows you to retake exams as a group, but they are pure memorization and no learning involved. The exam questions are very specific, about small, insignificant things on the slides. He will lecture for over an hour and just read slides, it is extremely boring. Will drop one exam grade.",
        "course": "EARTHSC1151"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "He lets you retake the exact exam after talking to a group for 30 min, and then averages the scores. However, because of this, he makes the exam extremely difficult. So you fail the first exam and do well on the second. He asks nit-picky questions that no one would think to study. It's basically straight memorization, not actual learning.",
        "course": "EARTHSC1151"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took this for a GE and am not a science person - highly recommend if you are in my shoes. Four tests based on lectures he posts online. He let's you take it a second time with a group and averages the two, and drops your lowest average test at the end of the semester. You also get lots of points from easy labs and one short research paper.",
        "course": "ES1121H"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took this class to fulfill a GEC thinking it would be fairly easy as an intro level class, but I thought wrong. He stands at the front of class reading from slides for the entire lecture and the slides include so much information it's difficult to know what to study. One of those professors that expects a lot given the course is introductory.",
        "course": "EARTHSC1151"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this as a GE in a 4 week session. He is a very interesting and cool person the UK (yes a British accent) that for some reason kept my attention in a class that has some boring material to learn. Labs were graded very easy and you take exams twice one normal and the next after you discussed the questions and answers with peers. Would take again",
        "course": "ES1122"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Barton does indeed have a cool accent. His test questions can be very specific, but if you attend lectures and look at the PowerPoints, you should be fine. He does have you take each exam twice, lets you discuss the answers & averages the 2 scores. When over half the class doesn't attend a lecture he gives out test answers. Labs are quite easy.",
        "course": "EARTHSCI1121H"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "I never went to this class and passed. He's a nice guy, but VERY boring to listen to in class. Lectures seem long because of this. Everything is on power point slides and he posts them on Carmen. 3 exams including a final. No homework. Tests aren't too bad if you study the slides. You take the tests twice and converse with your peers. Easy A!",
        "course": "EARTHSC1151"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was beyond easy. Group tests, everything straight from the powerpoint. Labs are easy. Anyone who didn't get an A in this class probably didn't try. Dr. Barton is a nice guy too.",
        "course": "ES1121H"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Barton really knows his stuff. Lectures are long but full of info. Let's you take the exam, discuss it, and retake then averages the two. Pretty lenient grader, always a great curve. Never gotten below an A with him. Just make sure you put in the effort and time to study or you won't do well. And pick your lab partners carefully.",
        "course": "ES1122"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "I take the class for may session. The professor is a really good person and he is interesting. There is no attendance for lecture. The labs are really interesting. Just review all power point would help you to get A.  I learn a lot from that class. I strongly recommend this class! ",
        "course": "ES1122"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love this guy. I find his class interesting, but I'm an environmental major so that's why. He does everything he can to get his students the best grade. I recommend going to class. If you mildly pay attention and go over the power points before exams you will do fine. Definitely one of the finest OSU has. ",
        "course": "ES1151"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "Doesn't use the book... The material is pretty intense and the tests are pretty hard, drops the lowest score and you take the test once, discuss it, then take it again. He averages the two scores together. The tests being so hard made me nervous about my grade, but, I ended with an A. He's an awesome guy too with a sweet accent.",
        "course": "ES1122"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 2,
        "comment": "Seems like this professor loves the subject he teaches. To the rest of us, the subject can be extremely boring and dull. But if you just show up to class and review the slides, you should be fine on the midterms. Midterms are easy- you get to take them twice and can discuss with those around you in between the two tries.",
        "course": "EARTHSC1151"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class. Barton grades fairly and has an incredible [British] accent. Don't buy the book; pretty much everything you need to know is on the slides. And show up to class: if attendance is poor, you might get answers for the next exam.",
        "course": "EARTHSCI1121H"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class was super easy if you went every time and mildly paid attention. Plus he has a boss accent.",
        "course": "EARTHSCI1121H"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 3,
        "comment": "So funny. Love the accent!",
        "course": "ES4423"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great prof. Passionate. Curves grades in favor of class majority. Would recommend summer course. All right labs but awesome TA and fun group of partners to work with. Very laid back camaraderie in lecture and lab. Uses real life comparisons in lecture, and it helps keep you awake. Fun extra credit, though no one probably needs it. Would recommend!!",
        "course": "1100"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome guy. Take the test once, discuss it, and take it again and average out the scores. If you can take him over the summer or maymester then DO IT! I barely did any work and he is very chill about grades. No way I deserved an A but I got it. Take this guy. Labs are easy too and drops the worst midterm. Barely uses the book",
        "course": "ES1122"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a very good teacher No doubt one of the best at The Ohio State. If you have a chance to take him take him",
        "course": "ES1122"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 3,
        "comment": "I just took Earth Science 151: natural hazards with Professor Barton, and I really enjoyed the class. Even though it can get pretty boring, he lets you take the exam once, then discuss the exam in groups, then take the exam again, then averages the scores. Go to class, because he gives out exam answers in class! He is a good professor.",
        "course": "ES151"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 5,
        "comment": "While his accent is endearing, and he seems to have a good sense of humor, he is clearly not interested in teaching or helping his students succeed at all. His tests have almost nothing to do with the material he teaches, and are poorly worded. Everything highlighted in red on the powerpoints have no significance. This class was so frustrating.",
        "course": "ES151"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very charming, clear about the course material. He let us take exams twice and got to discuss answers in groups before the second time and averaged the two scores. The material is quite boring, but his humor makes up for it.",
        "course": "ES121H"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 2,
        "comment": "I just took ES151 (Natural Disasters) thinking it would be semi-interesting... I was wrong. It was very dry material and I often found myself falling asleep during lecture (which he gives out answers in) His tests were kind of tricky, I had a 3.9 going into this class and got a B+. SO if you're looking for an easy A, I wouldn't really suggest it.",
        "course": "ES151"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 3,
        "comment": "I enjoyed Mr. Barton. He is very witty and very knowledgable about earth sciences, what used to be called geology. I had him for a summer class and that is when I recommend students to take it if they are completing a sequence or just want to take it for fun.",
        "course": "EASCI100"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Barton is the most laid-back professor I've ever had.  He is extremely nice, and although not a thrilling lecturer, he has a sense of humor that keeps things interesting a lot of the time.  I enjoyed his class much more than I anticipated.  His tests are hard but his grading policies are lax, and while the labs aren't that fun they're easy A's.",
        "course": "GEOL121"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took his Natural Hazards 151 class, easy.  I went to every class to listen to lecture so I wouldn't have to read the book.  You don't need it. Plus they put it in the library. He was funny sometimes, which made lecture less boring. Tests were easy because you could take it, discuss it with the class, then take it again and you get the average.",
        "course": "ESCI151"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 4,
        "comment": "His exams are extremely hard, but labs will salvage your grade. He's funny but picks out the most random things for the exams. Also, he has patterns to his exam answers sometimes (ABCDE for five straight)... Make sure you do all the labs, busy work, and you wont have to worry if you do bad on exams.",
        "course": "GEOL121"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Barton is a great teacher.  His tests can be hard but as long as you attend lectures you are fine.  He gives lots of test answers during lectures when attendance is low.  Homework and papers he grades by pretty much saying if its done you get an A and labs are super easy.",
        "course": "GEOL121"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 3,
        "comment": "horrible teaching style.  Tests are way too hard for the material covered.",
        "course": "GEOSC121"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Barton is one of the good ones. Passionate about teaching, friendly, and f-ing hilarious. No, the class isn't easy, but WE'RE IN COLLEGE for christ's sake. Getting a B only involves minor reading and attendence.",
        "course": "100"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 1,
        "comment": "Barton is awesome!  I thought he taught the class very well and I really learned some interesting things.  I feel like I actually got a lot out of this class (even though it is about rocks, so can be boring at times).  It's not one of those classes where you just memorize things for the exam and then forget them 2 minutes later.  Def. Recommended!",
        "course": "100N"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class wasn't all that interesting, but the labs were usually really easy.  The tests weren't easy, but lowest score was dropped.  Overall not a bad course, just not &quot;easy.&quot;",
        "course": "GEO121"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Barton is a nice guy with good intentions.  Yes, lectures are boring and the exams can be difficult if you don't go to lecture.  GO TO LECTURE.  He sometimes gave out free answers for the exams if the attendance was low.  Labs are easy.",
        "course": "GEO121"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's a REALLY nice guy. The tests are hard, but there's a huge curve at the end.",
        "course": "GEOG100"
      },
      {
        "index": 48,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GEOLOGY"
      },
      {
        "index": 49,
        "rating": 3,
        "difficulty": 3,
        "comment": "YES THE CLASS IS BORING, BUT UNLESS YOU ARE GUN HO ABOUT ROCKS ECT , IT WOULD BE BORING NO MATTER WHO TAUGHT IT! HE HAS A CUTE ENGLISH ACCENT AND YOU GET TO DROP YOUR WORST TEST GRADE, WHCIH IS ALWAYS NICE. YOU WATCH A LOT OF INTRESTING MOVIES IN LAB AND THEY DONT GIVE YOU BUSY WORK.AS LONG AS YOU TAKE NOTES AND SKIM THE CHAPTERS YOU'LL BE FINE!!!!",
        "course": "GEO100"
      },
      {
        "index": 50,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is the most boring professor I've ever had. At least I could count on some naptime during his class every day.  His midterms and finals were too hard considering everyone only takes this class for a GEC... he needs to realize we aren't trying to major in geology, just want a passing grade... lol",
        "course": "GEO121"
      },
      {
        "index": 51,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "GEO121"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 1,
        "comment": "It's not Barton's fault that geology is boring.  I ended up enjoying the class a lot, thanks to him.  His jokes, his accent, his rapport with students--it all makes class interesting.  And his grading was not hard, especially since he gave free answers for midterms and the final.",
        "course": "GEOLOGY121"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures boring, and repetitive sometimes. When attendence slacked, gave answers to both midterms and on final gave first 10 out of 60 questions. Lab's were easy as hell and on top of all this gave extra credit paper that was rumored to be worth extra 10% added to your grade! i don't know exact %%",
        "course": "GEOLOGY121"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 2,
        "comment": "Who is the fool that wrote the last comment. My roommate and I are maybe two of the dumbest kids at OSU and we got a straight B. He has a thick accent which keeps class intresting. I fell asleep everyday and still passed. Labs are cake and learning is memorization. This class was cash.",
        "course": "ROCKS101"
      },
      {
        "index": 55,
        "rating": 2,
        "difficulty": 5,
        "comment": "Absolutely impossible;the worst and the nastiest professor I've had in four years at OSU;had ridiculously difficult midterms and finals, and only let you use half of the class time to take them;labs were hard,too-had to memorize rocks afterseeingthem once",
        "course": "GEOLOGY101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.2,
    "department": "Geology",
    "firstName": "Motomu",
    "id": "VGVhY2hlci01NzU2MDQ=",
    "lastName": "Ibaraki",
    "legacyId": 575604,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "The class itself isn't bad at all. Just weekly discussion posts and practice quizzes, and a 2 page paper to write every few weeks. Most of the things that are taught are either common sense or can be easily researched. A very simple GE to take if you need one. ",
        "course": "EARTHSC2204"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "The teacher was horrible. He was an extremely tough grader on the very few assignments we did have and assigned a major group project with no notice nor was it on the syllabus. He was rude to students, discussed other students grades when they will not in class to other students, and laughed at students answered or interrupted ",
        "course": "EARTH3411"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Course content was interesting. He was not clear, professional, or respectful. Would call on individuals to suggest answers then interrupt students or laugh when they answered.  Assigned project that was not on syllabus. Asked for the students opinions on if he should notify absent people of an exam redo. Exams were extremely bias. no curve. MEAN!",
        "course": "EARTH3411"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor is absolutely HORRIBLE. Although I received an A- in the course, he is rude, talks about students while they aren't there about their grade, and is condemning. He reads off all of his lecture slides, gets his information directly from Wikipedia, and manages to ask outrageous questions on the exams. Exam averages were 60%, no curve. ",
        "course": "EARTH3411"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Had this man for a study abroad program he hosts. He made racist comments about my ethnicity and started to laugh about it. Honestly, it is surprising how the school allows this to happen but this professor needs to be removed. AVOID at all costs!",
        "course": "EARTH204"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "You would think a professor teaching an online course would be required to have a basic understanding of the internet, but this is not the case. ",
        "course": "ES2204"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": " I did not appreciate being graded on grammar and spelling when the slides and quizzes were filled with grammar and spelling mistakes. Due dates varied, were usually due on Tuesday which meant the material had to be rushed through. I regurgitated information more than I comprehended it. This class was a waste of time + energy",
        "course": "EARTH204"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "This is a very discussion-heavy class, meaning you'll be posting responses for weekly discussions, which is fine, but the way the due dates are set up in this class isn't conducive to learning the material. Your weekly post is due the Tuesday after the module opens which gives you little time to look over material. Also quizzes aren't graded.",
        "course": "EARTH204"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Avoid at all costs and save yourself the trouble. He does not care for his students and completely irrelevant test questions. Save yourself the trouble. ",
        "course": "EARTH3411"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Does not care about you succeeding, just a number on a spread sheet. ",
        "course": "EARTH204"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class I have ever taken at Ohio State. I cannot believe someone in higher education teaches this way. I would avoid at all costs. ",
        "course": "EARTH3411"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 2,
        "comment": "This class must be some elaborate joke. Each week you are given a set of slides to read that are obviously reused from pre-pandemic times when there was a lecture associated with them. Only now there are no lectures whatsoever, making the slides mostly incomprehensible. Grading makes no sense and you are never given any feedback. Avoid this class.",
        "course": "EARTH204"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible teacher who I do not think has a proper concept of teaching. Copies material from wikipedia which I am surprised is not plagiarism. Asks way too general fill in the blank questions and will not take another answer.",
        "course": "EARTH204"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class is such a joke and is some how hard in the worst way possible. He literally copies and pastes passages from Wikipedia on exams and wants us to fill in blanks with no notes or any materials. I am surprised he is able to teach given his class structure and overall teaching style. Worst professor I have ever had at OSU.",
        "course": "ES2204"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 3,
        "comment": "He gives a 91 question test and expects us to complete it in 80 minutes. He takes off for proper spelling yet half his questions are not even spelled correctly. You know its a bad course when the only things underlined and highlighted in the syllabus are NO EXTRA CREDIT, NO ACCEPTANCE OF LATE WORK, and NO ROUNDING WILL BE APPLIED. Such a joke",
        "course": "EARTH204"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Ibaraki is such a nice guy and he really wants his students to do well. But his tests often don't make any sense! He tests on things he doesn't mention and neglects information he stresses during lectures. Lovely guy, ridiculous testing style. He does offer extra credit after everyone fails the tests (literally Organic Chem all over again)",
        "course": "EARTHSC5651"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Ibaraki is one of my favorite professors at Ohio State. I have had him for multiple courses and at first his accent and teaching style took some time to adjust to, but he really wants everyone to learn and succeed. A lot of his lectures consist of exercises done with groups and as long as you do the work and try, he will round you to an A.",
        "course": "EARTHSCI3203"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "AVOID AT ALL COST. Exams are SUPER specific. He doesn't provide rubrics or clear grading criteria. He makes this class hard for no reason and is rude. Hard to understand because he spits everywhere and has a thick accent. He uses the textbooks stock slides. I am an A student and am very challenged by this class. Also  no allow electronics n class.",
        "course": "EARTHSC3203"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "Although it may be tough to clearly understand Dr. Ibaraki from the start of the semester, you begin to catch onto the flow of the class pretty quickly. The pop quizzes can be tough and specific, but it was never unreasonable and they greatly prepared you for his exams. He is very helpful when you meet with him and is happy to help anytime he can.",
        "course": "EARTH3411"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Ibaraki is not the greatest professor in terms of clarity. For assignments, especially group and individual projects, you really have no idea what he expects from you. Be prepared for alot of group work and very specific exams. The bright spot of this course is that it is curved so you'll get a higher final grade than expected!",
        "course": "EARTH3411"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "Earth Science 3411 was easily the worst decision I have ever made picking classes at Ohio State.  He is not clear WHATSOEVER, and his exams were probably the hardest tests any professor at Ohio State could offer.  DO NOT TAKE THIS CLASS!  It is 100% a GPA destroyer.",
        "course": "EARTH3411"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is actually helpful & it is obvious what is going to be on his quizzes and exams.  He doesn't lie about them...  This class is only math heavy if you think that one or two problems where you convert units is difficult when he even gives you the conversion factors.... Not the most interesting class but easy with the curve.",
        "course": "EARTH3411"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 5,
        "comment": "Does not use textbooks :(",
        "course": "EARTH204"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is difficult for me to understand, but a nice guy. A little weird for sure. Very knowledgeable, but speeds through things too quickly for non-geology/science majors. I would recommend taking another course if you aren't strong in math/science....",
        "course": "EARTH204"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "ERSCI204"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy, interested in teaching and helping students.  I would take any class with him.  Interesting discussions and open to ideas.",
        "course": "GEO411"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Ibaraki's class was very effective at generating independent thoughts about the future of natural resources.  The work in the class was split between group projects and independent projects.  Individual homework assignments were relatively easy but don't tell him that....",
        "course": "GEO204"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.5,
    "department": "Geology",
    "firstName": "Utku",
    "id": "VGVhY2hlci0xMTQ0Nzk0",
    "lastName": "Solpuker",
    "legacyId": 1144794,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was a terrible experience. I thought it would be an easy A, considering I have a 4.0 in my final semester. I WAS WRONG! He claims his test are from his lecture notes, but this is not true. I literally memorized ALL of my notes for the final and achieved a C on the exam! Class average was 48%. I barely got an A (90.46%) and I worked hard.",
        "course": "GEOL1101"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "class is fairly easy - he gives bonus/extra credit opportunities  on exams. labs are easy a's. i got a b+ in the class without putting much effort at all. lectures are boring and so long but going to class isn't really necessary to do well at all. overall he was a nice prof and this was a very easy gec.",
        "course": "ES121"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "nice guy.  lectures are too long though. he makes it easy to get a B.  If you want an A you might want to look elsewhere.",
        "course": "EARTH121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.2,
    "department": "Geology",
    "firstName": "Terry",
    "id": "VGVhY2hlci05NTkwMzc=",
    "lastName": "Wilson",
    "legacyId": 959037,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wilson blows my mind. She's so cool. The class is hard but she makes it interesting. She is very passionate about geology and works hard to make sure you understand the material.",
        "course": "ES4430"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Drags out her words, not a good public speaker.  Mandatory lecture because of in-class quizzes.  Labs are unorganized.  Class is very boring! Easy A if you do all labs and come to lecture to do quizzes.  I suggest taking 110 after this to finish off the series with william ausich..He wass a great prof!!",
        "course": "GEO100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love this professor!  Her class is fine, overall, but sometimes we get confused during her activities.  The movies are great, and they turn out to be a really valuable learning experience.  Go figure!  I love her flowing calcite vein-like hair.",
        "course": "GS100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 3,
    "department": "Geology",
    "firstName": "Brandon",
    "id": "VGVhY2hlci0xMTMyOTY1",
    "lastName": "Bartkowiak",
    "legacyId": 1132965,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "It was a while back, but I totally remember Brandon. He was really tough, but would spend time helping you if you asked. I liked him. Kinda hot.",
        "course": "GEO100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 5,
        "comment": "he's a nice guy who loves the subject and would do anything to help you.  however, he is such a hard grader it makes it impossible to want to work in his class b/c he just kills you on your labs. i can't describe how bad of a grader he is. i think he just graduated, so anyone who is taking an ES class is safe from this ridiculously hard TA",
        "course": "ES203"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is the WORST TA you will ever have. His labs are impossible and takes off for the smallest things. DO NOT TAKE ES 203 with McKenzie b/c he will be your TA and you will be MISERABLE.",
        "course": "ES203"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "This lab TA was by far the worst TA ive ever had! This was an earth science GEC. In no way shape or form should this class be as hard as he made it. You get .5 off of every lab for grammer and mispellings. We are not in english get outta town. I checked the time on my phone in class and a had a piece of chalk thrown at me. If you value class, dont.",
        "course": "EARTS203"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 5,
        "comment": "Brandon is by far the most enthusiastic TA I have ever had. He is tough, and definitely requires a lot, but really, really makes an effort to help students who put in an effort themselves. My only complaint is that he puts a lot of emphasis on things like grammar-which isn't a problem, except that it's an EARTH SCIENCE class.",
        "course": "GEO100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Brandon is tough; however, he is the friendliest and by far the most enthusiastic TA I have ever had at OSU.  He wants everyone to succeed and definitely puts students first.  If you are willing to put the time in, he will help you.  Do not take this course for an easy A, but take it if you want an intro course you will actually learn from.",
        "course": "GEOL100"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "This lab TA takes class far too seriously. He takes off a ton of points for things such as not showing all mathematical calculations and including units. Avoid his lab section if possible.",
        "course": "EARTH100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Geology",
    "firstName": "Mike ",
    "id": "VGVhY2hlci0yMDAyNDgx",
    "lastName": "Wilkins",
    "legacyId": 2002481,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mike is incredibly good looking with an awesome British accent. He's so cute and he cares about you actually learning the material. Tests are surprisingly tricky but study for them and you'll be fine.",
        "course": "EARTHSC2203"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof Wilkins is awesome! He is knowledgable, kind and good looking. Best class all semester!  ",
        "course": "GEOLOGY"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "EASY class. As an Environmental Public Health major that is on a Pre-Med track it was a relief that this class fit the interdisciplinary requirement, because it was SOOO easy. I went to two lectures the entire semester and pulled off an A because all of the quizzesexams are on Carmen and come straight from the Powerpoints. CTRL + F is your bff.",
        "course": "EARTHSC2203"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Wilkins is a fantastic professor at Ohio State! He is very passionate about the material. His lectures are certainly long and he simply reads off of the powerpoint while explaining it in his own way. Attendance is certainly not mandatory but it helps to go to lecture. Overall, this class was not bad. ",
        "course": "EARTHSC2203"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "Geology",
    "firstName": "Lawrence",
    "id": "VGVhY2hlci0xMTk1NDA=",
    "lastName": "Krissek",
    "legacyId": 119540,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Krissek is a great guy.  I definitely reccomend taking this for a GE if you are willing to show up to class (because his tests are based almost entirely off of his lectures).  Exams aren't bad because you are allowed one page note sheet. Just come to class and you will be good.",
        "course": "EARTHSC2206"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Krissek is great. While the content of the lectures can be a bit boring due to the long class time, he really loves what he's talking about. I didn't buy the book, just borrowed it from the library right before the exams. No homework but the labs took time outside of class but Earth Science majors should already expect that. Best teacher in geo",
        "course": "EARTHSC4502"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Krissek is a great guy! I took this class at Stone Lab and he remembered my name TWO YEARS LATER! Very knowledgeable and fun to be with out in the field. Highly recommended.",
        "course": "EARTHSC1107"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Krissek is a nice guy.  He tells good stories and cheesy science jokes. Content is boring, so it's worth showing up. He claimed \"show up and take good notes and you'll do fine.\" This was not the case for me (non-sci major)-D on the first midterm. Get a used text online ($20). This will help. I got As on the other tests, and extra credit helped",
        "course": "EARTHSCI2206"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Krissek is very interested in teaching. He knows the material so well and is one of the best lecturers I've had. Makes the material interesting and genuinely cares about his students. Attendance isn't required but showing up is really important because you understand the material better. Also, the field trips are fun and you learn a lot. ",
        "course": "4502"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's really nice and tries to make class engaging. I took this as a GE and I wouldn't recommend it unless you're interested in science. He assumes people in the class have a background knowledge of stuff he talks about! Very frustrating. The tests are kinda hard (and I studied) and by the way, there's three tests and that's your grade.",
        "course": "EARTHSC2206"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 5,
        "comment": "Class attendance is key. He will drop by the lab once or twice. Tries to make boring material interesting, and he has some interesting stories he sometimes mentions while he was doing ANDRILL in Antartica.",
        "course": "GEOSCI"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "krissek is a renown oceanographer and a pretty straight dude...he makes the material as interesting as it can be...theres some extra credit...labs are easy...but the tests are no joke. they dont seem that bad when u take them then you wonder why you got a 76. study hard before tests. study the book. could prob skip every class and just read hard",
        "course": "ESCI206"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Krissek is an interesting and clear lecturer, and just an all-around cool guy.  Whether you're a geology major or just need a science GEC, you should definitely take a class from him.",
        "course": "GEOL122"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "The tests were challenging but Dr. Krissek really made an effort to make the material make sense.  Gave lots of extra credit and a large curve, overall nice guy.",
        "course": "GEOSCI100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "cool",
        "course": "GS206"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Krissek is the man. Interested in the subject, takes the time to get to know the students, and even takes you on field trips to Lake Erie. Also gives an opportunity for extra credit. Labs were easy but tests were pretty darn tricky!",
        "course": "GS206"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a good guy that is really interested in teaching.  I enjoyed him a lot as my teacher..he made boring topics into interesting subjects.",
        "course": "GEO210"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Krissek is an excellent lecturer.  He is clearly very interested in the subject and in teaching.  He balances very reasonable expectations of students at this level with much enthusiasm to share with those who want to explore the subject more deeply.",
        "course": "GEOL122"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Go to class, go to lab, and DEF do the x-tra credit.....i should have failed but i got a C for the final.......he is a cool dude",
        "course": "GS210"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Krissek is great!!  He is helpful and loves the subject. However, go to all the lectures and take good notes because his test are usaully from the lectures and any handouts given in class.",
        "course": "GEOLOGY12"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "GEOL121"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "He told us to not read the text book.. he was right, all of his questions came from class/lab",
        "course": "121"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "My all-time favorite professor, hands down",
        "course": "GS122"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GEOLSCI1"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Geology",
    "firstName": "Kerri",
    "id": "VGVhY2hlci0yMzExMTQ0",
    "lastName": "Dobson",
    "legacyId": 2311144,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Kerri! She helps you when you need it and she is very personable and approachable. She is a source of positive energy in class and overall a cool person.",
        "course": "GEO1121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.7,
    "department": "Geology",
    "firstName": "Harunur",
    "id": "VGVhY2hlci0xMjUzNTcy",
    "lastName": "Rashid",
    "legacyId": 1253572,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "By far one of the worst people I have met in my life, let alone prof. He is arrogant and rude and in incessantly telling his students they are stupid. He is at Grenfell Campus Memorial University now. I love Earth Science courses and was going to do a minor until he started teaching all the classes. I refuse to take anything he teaches. 177",
        "course": "EASC"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Too bad he's not teaching this quarter. Could have gotten an A! Oh shish!",
        "course": "ES100"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "He was a good prof. Most of my friends got A's in his class.",
        "course": "ES100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I got 92% which made me happy. Then I found out 50-60% got A's and B's. Bummer!",
        "course": "ES100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I used to sit in the front row to see him smile!",
        "course": "ES100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "WORST TEACHER EVER. He clearly knows a lot, but is incapable of teaching it. Arrogant and rude, not helpful at all. I'm going to echo what everyone else said here...AVOID AT ALL COSTS.",
        "course": "ES100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Rashid was the worst teacher I think i've ever had.  He taught this class like it was a masters class at MIT rather than a 100 level class at OSU.  He was arrogant, rude, and didn't help any student that needed it.  His tests and slides cover completely different material and he doesn't curve.  AVOID AT ALL COSTS!",
        "course": "ES100"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "I agree, he was very stubborn and when students asked questions he had that &quot;You're wrong&quot; air about him. Definately avoid him if you can, he is definately knowledgeable but does NOT do a good job conveying that knowledge to students, nor does he give a strong idea of what topics will be stressed heavily on the tests and which wont! AVOID",
        "course": "ES100"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "AVOID AT ALL COSTS! WORST professor I have EVER had (and I'm a senior).  Does not specify what is on the test, just says read, then when we all failed the test, he refused to curve it.  Very rude, not helpful, stubborn, has no problem failing the whole class, doesn't use carmen, not cooperative, even his TAs have issues with him. AVOID AVOID AVOID!",
        "course": "GEOLO101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Geology",
    "firstName": "Nathan Derek",
    "id": "VGVhY2hlci0xNTA2MzQx",
    "lastName": "Stansell",
    "legacyId": 1506341,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Posts all reading for course on Carmen. I did study abroad while taking his course and he was fantastic about working with me. Gives study guides for tests and as long as you actually do them and study, you will do fine on the exams. Attendance is important though because the material he presents is incredibly complex.",
        "course": "GEO3900"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Attendance isn't mandatory but he gives pop quizzes and attendance checks worth 5 points (5% of your grade,too).  Exams aren't impossible. He gives a practice test that is almost identical to actual exams. He throws a few random/nitpicky &#63;s on the actual exams so that not everyone gets 100s. Didnt even buy the book but lab manual is a necessity.",
        "course": "EARSC100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Geology",
    "firstName": "Terrilynn",
    "id": "VGVhY2hlci0yMDkyMjkz",
    "lastName": "Easter",
    "legacyId": 2092293,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "She assigns a lot of group work doing it all on google docs and she doesn't really seem to know what is going on. It's frustrating and leaves you confused. We didn't find out when or what the final was comprised of until a month before classes were over.",
        "course": "EARTHSC2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.4,
    "department": "Geology",
    "firstName": "Brandon",
    "id": "VGVhY2hlci0yMTExMjM3",
    "lastName": "McAdams",
    "legacyId": 2111237,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Brandon was cool, definitely get him off topic because then he's hilarious. Very cynical",
        "course": "ES1911"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's great, funny, and willing to help you out.",
        "course": "EARTHSCI1911"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "a savior in a class with multiple TA'a and Profs, literally the best TA I've had in a long time",
        "course": "ES1911"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He was my TA for this class and i loved him! He was so funny and he really tried to help when someone didn't understand something. He is really easily distracted though!",
        "course": "EARSCI1911"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly a terrible teacher. All over the place in lecture, his powerpoint slides don't even make sense. Not approachable or polite when you ask for help.",
        "course": "EARTHSCI1100"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Cool guy- tries to make it interesting. But half the time I dont know what he's talking about.",
        "course": "EARTHSC1100"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "His lectures are crazy confusing and unorganized. He often \"makes up\" answers to student questions. His lectures are entertaining, but he talks a lot and his powerpoints also have a lot to write down. The material is simple, but its delivery is confusing. Fun professor, cool guy, but material is all over the place. First year lecturer.",
        "course": "EARTHSC1100"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Odd professor. He does try to make the class funny and interesting- he swears a lot and makes college jokes. However, his lectures are extremely confusing and he does not make coherent sense when talking. His quizzes read like a kid wrote them. The class would be better if he put forth more effort. Fun lectures, but not worth the confusion.",
        "course": "EARTHSC1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.5,
    "department": "Geology",
    "firstName": "Jeff",
    "id": "VGVhY2hlci0xNzQ3NDAw",
    "lastName": "Thompson",
    "legacyId": 1747400,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's an undergrad, so since he's also a TA he 1) knows what he's talking about, and 2) can relate to us as undergrads. He's helpful and cute to look at.",
        "course": "ES39"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.7,
    "department": "Geology",
    "firstName": "Kenneth",
    "id": "VGVhY2hlci0xMjQ0NTA=",
    "lastName": "Foland",
    "legacyId": 124450,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "You have to go over the textbook urself! The tests are kind of difficult, but fortunately he gave of 10% of bonus problems. I got an A but the course is really time consuming.",
        "course": "EARTH100"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "By far the worst professor I have ever had at OSU. He is fine with students consistently failing the class. He does in class reviews and if a lot of people get the answer correct he says he will need to change the test and make it harder.  His excuse is that he wants to make the class worth our money. Save yourself the stress, don't take this class",
        "course": "EASC100"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "He says that his average is a 62 and you should be happy with that grade. His questions have nothing to do with what we went over in class and he is not very clear on what he is trying to say. It is much harder than a 100 level class is ment to be. I found it was more helpful not to go to class and get confused, and to study the text book.",
        "course": "EARTH100"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not the most difficult class, but pretty boring lectures at times.  Foland was reasonable about assignments and tests, but studying is still needed.  He is pretty friendly and would probably be helpful outside of class.",
        "course": "ESH121"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "People aren't kidding when they say this is the hardest class they've ever taken. Insane amounts of work and studying to do. Professor Foland is the nicest guy in the world, but is nearly incomprehensible in his lectures. There is a curve, but even that may not save you.",
        "course": "GEOH121"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "Foland is so boring, nearly impossible to follow lecture, and it hardly helps anyway.  Tests are very difficult for a 100 level class.  Not an easy A at all.  Averages on all tests were about 67 and he was happy with that.  Stay away from him if at all possible.",
        "course": "ES101"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "The tests are extremely detailed and over tons of information. We read almost the entire textbook during the class. Labs are easy and a grade buffer for the tests. He also has about 10 bonus questions on every test, and curves. Not the easiest GEC, but not awful either.",
        "course": "EARTH100"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "Seemed like a really nice guy but he acted like he was teaching a 600 level class when it was a 100 GEC. Tests are next to impossible and staying awake in lecture is a challenge. Stay away from him if possible.",
        "course": "ES100"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take a class with Professor Foland! He thinks he is teaching a 600 level class when he is teaching a 100 level class. He makes the tests so ungodly hard. Worst class I have taken in four years at OSU!",
        "course": "ES100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "The Lecture are boring but not mandatory, he puts it all online.  Goes indepth about topics, but questions can really be thought through.  Nice man overall, likes students to interact.  Lab never takes the full time.",
        "course": "GEO100"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 5,
        "comment": "Hardest class I've ever taken!  This is definitely not an easy GEC.  I got an A in the course, but it was a TON of work.  Weekly labs, prelabs, homeworks, 3 field trips, 3 exams, 2 finals... just be prepared to be busy.",
        "course": "GSH121"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "WARNING: DO NOT TAKE THIS CLASS! Foland is extremely boring and extremely hard.  Even going to lecture everyday and studying for tests I still struggled to just pass the class! Tests are next to impossible. Plain and simple, DO NOT TAKE!",
        "course": "GEO100"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "I think He Ask Phd level questions for 100 level class hardest class ever had",
        "course": "GEO100"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Nicest man ever, really cares about his students. Know what he's talking about.    I enjoyed the class but it was very difficult and time consuming.  Not an easy GEC blow off class.",
        "course": "GEOLH121"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "Class was difficult, but in the end I got a decent grade depsite the odds. Go to class and labs. Prof.Foland is VERY Passionate about his field and is very knowledgeable. Nicest teacher. Stay on top of work and ask questions. Show some interest and you should be fine",
        "course": "GEOH121"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "Nice guy, gives out candy like everyday is halloween BUT... there were three mandatory field trips (one of which was on a sunday&#63;!) and the exams were pretty difficult",
        "course": "GEOH121"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 5,
        "comment": "Foland is a very sweet man, but even all his candy can't make up for the fact that his class is painfully boring - he lectures straight fromt the book and rambles off on random tangents.  He seems very interested and passionate about geo, but he doesn't realize this is a GEC - we're not geo majors!",
        "course": "H121"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "Hmm. Loves to help students but gives scattered lectures (use his notes!). Not sure if that's good thing&#63; Regardless he has a heart of gold! Like GEO 628 said, don't you dare believe him when he says you don't need to memorize something. That's the best advice I can give-otherwise a good guy.",
        "course": "H121"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's a very sweet man who cares a lot about his area of study and his students but the class was a ton of work and not so much fun.",
        "course": "GEOLOGYH121"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 4,
        "comment": "A nice guy, but the class is really tough!  Three hour labs...I'm just sayin'...",
        "course": "GEOLH121"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 5,
        "comment": "Yes, the class was difficult... but it was the honors section. Dr. Foland worked very hard to provide a challenging learning environment that really delivered. He was understanding if a student had a valid problem and why I changed my major to Geology!",
        "course": "H121"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 4,
        "comment": "A very nice person, but a very boring and teacher with confusing tests.",
        "course": "GEOH121"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 4,
        "comment": "I loved the trip to Hocking Hills. Also, rocks and stuff are cool. Dr. Foland likes to ride bikes. He da man!",
        "course": "GEOH121"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 4,
        "comment": "Every test question is a trick question and eventually you just run out of time",
        "course": "H121"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "His exams are impossible!! I think he expects you to be an expert on his topic of choice.  Don't believe him when he tells you you don't have to memorize anything.  DO NOT TAKE THIS CLASS!!!!",
        "course": "GEOL628"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GEOH121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.6,
    "department": "Geology",
    "firstName": "Julia",
    "id": "VGVhY2hlci05OTc4NzQ=",
    "lastName": "Sheets",
    "legacyId": 997874,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "This class was interesting, yet very difficult for a GEC course. There were 9 quizzes, 3 midterms and 1 final. There was some math and chemistry involved in this course. Study EVERYTHING from all angles, as she will test you down to the smallest detail. She was very helpful and answered emails or questions with sincere kindness. Amazing teacher.",
        "course": "GEO108"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "This is a 5 day a week class and you have to show up on a regular basis. I skipped about once a week and still managed an A. Dr. Sheets is very willing to help you as she is very interested in her subject matter, always inviting students to her office hours. Don't bother with the books or readings focus on the powerpoints she posts.",
        "course": "GEO108"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "DO NOT SKIP CLASS! A little bit too difficult for a GEC. Be prepared to do a lot of memorizing- ALL of the little details. You can do well in here if you go and put in the time.",
        "course": "GEOL108"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "WAY too hard for a GEC.  Did worst in this 100 level class than my 500 level courses for my major.  I thought it would be interesting but it was way too hard, I wouldn't take this class",
        "course": "GEOL108"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Sheets is very helpful and easy to understand. This class counted for my physical science, and I am very happy i chose to take it. She really loves what she does. If I had to take another geology class, I'd try to find one that she was teaching. Class attendance is important, but the textbook is not. Quizzes & exams are easy if you go to class.",
        "course": "GEOL108"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "I was interested in gems before this class. I learned a lot-but this was crazy hard for a GEC. You have to go to EVERY lecture & read the book THOROUGHLY to pass the exams. Even with prior knowledge I thought some of the material was tough. Nice lady, but her class isn't like going to a natural history museum. If you take this class, don't  skip.",
        "course": "GEO108"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof sheets is awesome. She is very helpful and very driven. She knows what she is talking about and she really cares. She will not dumb herself down just because she teaches an intro class. She is also hot",
        "course": "GEOSC108"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "It's nice that there's no lab in the class, but she is pretty hard for a 100-level course.  She is always saying her quizzes are &quot;easy&quot;...but maybe that's just because SHE writes them.  Then she says she won't try to stump you on exams &quot;to be fair,&quot; but she still puts tricky questions on them. Be prepared to do work for this GEC...",
        "course": "GEOSC108"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "This professor taught to the lowest common denominator. The lessons were below the high school level.",
        "course": "GEOSC108"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 5,
        "comment": "Tries way too hard for an entry level course. Even advised in Exams today, &quot;I took the exam prior to this class and its straight forward... please try not to approach me for clarification for a question... I will get a little frustrated&quot;. No teacher should advise her students NOT to ask questions because SHE feels the test is easy.",
        "course": "GEOL108"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "GEO108"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Sheets is very nice, and obviously interested in what she does.  The class is definitely harder than i expected for 100 level.",
        "course": "GEOL108"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Geology",
    "firstName": "Rob",
    "id": "VGVhY2hlci0xMzUwNDA4",
    "lastName": "Swift",
    "legacyId": 1350408,
    "numRatings": 1,
    "Ratings": [],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Geology",
    "firstName": "Jamey",
    "id": "VGVhY2hlci0xMjk0MTcw",
    "lastName": "Stutz",
    "legacyId": 1294170,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "he was my ta for this class and he made the class enjoyable. he is great at explaining everything. i would highly recommend him",
        "course": "ES100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "If you could describe Mr. Stutz with one would it would be passionate.As this was his first quarter teaching(GTA) he took on a major challenge in structural geology and made us all more proficient by allowing us to think for ourselves. Favorite Quote:&quot;I am not going to hold your hand through this...&quot; Overall the best TA at OSU...get some",
        "course": "ES530"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 3.5,
    "department": "Geology",
    "firstName": "Michael",
    "id": "VGVhY2hlci00MDI3NTU=",
    "lastName": "Hansen",
    "legacyId": 402755,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I would definitely recommend Dr. Hansen as he is just a great Professor.  His lectures are informative and his mid-terms are fair.",
        "course": "ES100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Despite the fact that the class is sort of boring, I really liked Dr. Hansen.  He's one of the nicest teachers I've had.  The tests were pretty easy and straightforward, and the labs even easier.",
        "course": "ES122"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Holy crap this class was boring.  I went to every class and slept for two hours straight.  Study the powerpoints he puts on Carmen.  I got an A- and a cure for my insomnia.",
        "course": "GLG122"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was one of the easiest classes I've ever taken.  The tests were multiple choice and were so easy the final only took me half an hour to do!  He knows a ton of stuff and is very informative.  Great class!",
        "course": "GEO122"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "if you enjoyed this class at all, then you must be on crack. he does not find it necessary to put the ten pages of notes that he gives you in any type of order, and proceeds to ramble on about earthquakes.",
        "course": "GEO100"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 1,
        "comment": "Gives way too many notes!  Not very helpful and always unavailable.  Does not give any kind of outline for cumulative test that covers tons of notes.",
        "course": "GEOL100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Does a good job explaining everything. Gives a TON of notes. Tests are easy, labs are easy. Geol 100 is pretty interesting and he does a good job. Good guy if you get a chance to talk to him. It's a fun class.",
        "course": "GEOL100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Geology",
    "firstName": "Lawrence",
    "id": "VGVhY2hlci0xMTMyOTY3",
    "lastName": "Kissick",
    "legacyId": 1132967,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "GEOLO100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Overall, pretty good.  Had lecture slides for you to follow.  The tests were pretty hard but most of the information came from the notes in class.  Every test he would put extra questions on there that weren't covered.   The thing I hated was that I got a 93% and didn't get an A, 95% was an A... SUCKED so bad and this is suppose to be a 100 level",
        "course": "GEOL100"
      }
    ],
    "SEI": []
  }
]