[
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.5,
    "department": "German",
    "firstName": "Meaghann",
    "id": "VGVhY2hlci0yNjY2MjEz",
    "lastName": "Dynes",
    "legacyId": 2666213,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "I signed up for her online class a week late because I was in another class that I had to drop and swap with hers. She gave me 0s on all the assignments that I wasn't even there for, gave absolutely no grace when I was struggling to learn the online programs she was using, and was very unhelpful over email. I'm pretty sure she got fired from NKU.",
        "course": "GER101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "As a TA, Meaghann was great. Very understanding, cares about her students, and is funny. If you do the work and show up to class you will pass. Exams weren't too hard and were flexible and homework is reasonable. Be aware: lots of group work, working out of book, and talk abroad. Also, it's hard to reach her by email. Otherwise, take her!",
        "course": "GERMAN1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 4.3,
    "department": "German",
    "firstName": "Jorge",
    "id": "VGVhY2hlci0yNTkyNzkz",
    "lastName": "Clavo Abbass",
    "legacyId": 2592793,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Eloquent but quite poor in his understanding of the subject",
        "course": "GERM1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Jorge is a great guy, funny and cares about his students. But you have to work for this class, the class is taught in German and he called on students randomly every class to answer questions. Grammar heavy class but he offers help outside of class if you reach out. Definitely not an easy A but worth it in my opinion.",
        "course": "GERMAN1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jorge is a phenomenal teacher. The entire course is taught in German and Jorge really pushes you outside of your comfort zone. Despite this, he is really lenient with due dates and really cares about his students. You really have to try hard to fail.",
        "course": "GERMAN1102"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 5,
        "comment": "It pains me to write this, but if you are not a German major, or didn't do very well in German 1101, do not take German with Jorge. Don't get me wrong, he is a great guy, cares about his students, and is passionate about the material. The only problem is he teaches about 80% in German, so if you aren't already good you will fall behind quickly.",
        "course": "GERMAN1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing German teacher. He cares a ton about his students and their understanding. He speaks very clearly and wants his students to participate. Just don't get on your phone during class and he will like you. I had an A- and he rounded it up to an A for me without even having to ask. 10/10",
        "course": "GERM1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great professor, great guy overall. Cares tremendously about his students (words can't do justice about how much he cares about his students and their success) and is so passionate about teaching. This class is intense though - tons of assignments, participation required in nearly every class, mandatory lectures, etc.",
        "course": "GER1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "There's really too much to say about Jorge. He's just a great teacher: fun, helpful, serious when it's needed. He's a 4 difficulty in class because he pushes you out of your comfort zone, but the actual tests are fair and not there to get you. He's a cool guy and really makes learning the language fun. If he teaches 1103, I hope to take it with him",
        "course": "GERMAN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.9,
    "department": "German",
    "firstName": "Kassi",
    "id": "VGVhY2hlci0yMjAyMjU2",
    "lastName": "Burnett",
    "legacyId": 2202256,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kassi truly cares about her students and wants them to do well. There's homework most nights but it's short, around 10 minutes. She holds reviews days for every test/quiz. ",
        "course": "GERMAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome German teacher!! There's homework most nights but it's usually only 10 min. Tests &amp; quizzes are really straightforward. Kassi really pushes you to use German in-class and it helps a lot to get over the mental block of making mistakes while speaking",
        "course": "GERMAN1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Could not possibly ask for a better German professor! She is so accessible and is always ready to lend a helping hand! If I'm being honest, the only real way you could fail this class is by not showing up/intentionally trying to fail thanks to the way she teaches. Wish I could have her again!",
        "course": "GERMAN1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fantastic instructor and the best I've had so far at OSU! Connected with the students and helped everyone throughout the whole semester. If you get the chance, pick her section!",
        "course": "GERMAN1103"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Kassi was a good teacher. Plus her dog is amazing!",
        "course": "GER1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kassi is one of my favorite instructors I have had at Ohio State. She is really nice, makes it seem easier to learn and remember German, and will even hold reviews before the test. Going to those reviews got me an A, and her dog is really cute too!",
        "course": "GERMAN1102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kassi was a great instructor! Greatly enjoyed the class and her insights of German culture. Wish she was teaching German 1103....",
        "course": "GER1102"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kassi is one of my most favorite instructors that I've had at osu. She is really nice, and tries to make sure you do as well as you can on the tests. I wish I could have her next semester, try to take her if you can, you won't regret it!",
        "course": "GERMAN1102"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kassi was great, by far my best professor here at OSU. She really takes the time to explain things to everyone and cares about your success. Also, she is hilarious and is extremely approachable. I would take her class again in a heartbeat.",
        "course": "GERMAN1102"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kassi was my instructor for German 1102. She was awesome! I think this was the first time I ever got 100% attendance in a class because I liked it that much. She also has really pretty hair.",
        "course": "GERMAN1102"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "I never really liked German until I had Kassi as an instructor. She always had time to explain things to me after class when I was struggling and her lessons were always really fun. I felt like I made more progress in one semester than I did in 2 years at high school.",
        "course": "GERMAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.9,
    "department": "German",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0yMzI4OTgz",
    "lastName": "Birkhold",
    "legacyId": 2328983,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Phenomenal professor, cares much more about engaging discussions than grades. He is hilarious and his lectures are great. You can do the bare minimum and get an A.",
        "course": "GERMAN2254"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "OMG I absolutely love Prof Birkhold. One of my favorite professors ever. If I could take him for every class (with the same enthusiasm oc), I would do it in 0 time. He is so passionate and you can tell he absolutely loves teaching and truly cares about his students. I wish I had gotten to take this class in person. Ask him about Tangled, yw.",
        "course": "GERMAN2254"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Birkhold is the funniest professor I've ever had. He is super understanding and keeps class interesting. He really knows his stuff and is just a super great and interesting guy.",
        "course": "GERMAN2254"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "So chill and so funny! If you take his class (which I highly recommend) he will say often that he doesnt care about grades which really comes across. He exempted pretty much the entire class from quizzes and discussions for the rest of the semester. Hes got some sass and will def challenge your beliefs but he is hilarious so his class was v fun.",
        "course": "GERMAN2254"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "As a guy, Matthew is great. Brilliant and hilarious, probably my fav prof. But this class was horrible. Lots of reading. Lectures/in class debates made me want to rip my hair out. When he gives you the option at start of semester, OPT OUT OF TAKING THE QUIZZES! Otherwise it will be 10x harder to get an easy A. Take a class of his, just not this one",
        "course": "GER2256"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor",
        "course": "GERMAN2254"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "A brilliant professor and everyone in the class loves him.",
        "course": "GERMAN2254"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Funny man with good jokes. Friendly and knowledgeable.",
        "course": "GERMAN2602"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hands down best professor I've had at Ohio State. Class was interesting and helpful - he didn't care about grammar as long as we were learning the culture. Really takes the time to get to know his students; stop by his office hours and talk, he's so interesting. Absolutely take a class with him if you get the chance",
        "course": "GER3300"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best professor I've had.",
        "course": "GER2256"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Carmen",
    "id": "VGVhY2hlci0xNjQ2NDYz",
    "lastName": "Taleghani-Nikazm",
    "legacyId": 1646463,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Taleghani was very nice to us and was incredibly caring when we had issues. There is a lot of work, but it is not necessarily difficult if you pay attention. She is also a pretty lenient grader. All in all a pretty good class.",
        "course": "GER301"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very kind and the class was very easy. I surprisingly learned a lot as she is German and knows what things to focus on. Sometimes I thought the class was too easy though, lots of completion homework points and silly group discussions to describe pictures she put on the board--things like that. Super easy though and requires no effort so still take.",
        "course": "GER301"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a very sweet professor that tries to be funny and encourage participation from students. She also dresses super cute! I think she sometimes forgets that she is teaching a higher level German class, so she feels the need to translate a lot of easy words, but that's really my only gripe with her. Super easy class and I learned SO MUCH! Take it",
        "course": "GER3201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Carmen was a very caring Professor, but I do wish she would be a little less nice where it matters. Her class is not hard, but you might not learn as much as you would have with another professor. This is the only time I've ever felt like there was too little homework -- and I have an engineering degree!.",
        "course": "GER4600"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Taleghani is awesome! She gives good feedback on written assignments but doesn't take a ridiculous amount of points off for mistakes. Effort is what matters to her. If you participate in class and do most of the assignments you will get an 'A'. She is super accessible and really wants to see her students succeed.",
        "course": "GER3600"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "She's super nice and her class isn't hard. Just show up and participate and she'll love you. She doesn't proofread her handouts or powerpoints which got on my nerves a bit, but it's not really a big deal. She'll allow the class to go on tangents if they're interesting which can be fun and you learn from those, too.",
        "course": "GER301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "German",
    "firstName": "Marielle",
    "id": "VGVhY2hlci0yODQwODg2",
    "lastName": "Beach",
    "legacyId": 2840886,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "There is a lot of homework but that should be expected when learning a new language. She was very flexible and was able to understand when the class was struggling in a subject, so she would adjust how she teaches to help us learn. She is very young and understands what it is like to have a hard course load so she tries to help make things bearable",
        "course": "1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "German",
    "firstName": "Budkima",
    "id": "VGVhY2hlci0yODU1Nzc1",
    "lastName": "Uskokovic",
    "legacyId": 2855775,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Budimka was a great instructor! She explained everything very clearly and the homework felt intentional, not just busywork. There's quite a bit of reading, however the book she chose was fairly interesting. Do the homework and show up to class and you will pass this class with an A, no problem. Wish she was teaching 2102!",
        "course": "GERMAN2101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "German",
    "firstName": "Bethany",
    "id": "VGVhY2hlci0yMzAzNzk2",
    "lastName": "Richetti",
    "legacyId": 2303796,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "(Individualized Instruction) - Dr. Richetti is a wonderful instructor, and genuinely nice person. You can tell she really wants students to do well. In this course, there were mandatory appointments, and she made sure that any questions I had were answered during them. Also, she responded to emails quickly, which was helpful.",
        "course": "GERMAN1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Julia",
    "id": "VGVhY2hlci0yNDYyNTc2",
    "lastName": "Polczer",
    "legacyId": 2462576,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Julia is awesome, she really cares about students and makes the class very engaging and fun to go to. 10/10 would take a class with her again. She's also pretty cute :)",
        "course": "GERMAN1102"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Awesome teacher, really enjoys being there and teaching German. Takes effort to learn more about the students and use it to make the class better. 9/10 would recommend!",
        "course": "GERMAN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 2.2,
    "department": "German",
    "firstName": "Melissa",
    "id": "VGVhY2hlci0yNDM5ODQ3",
    "lastName": "Epperson",
    "legacyId": 2439847,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Engaging course.",
        "course": "GERMAN1101"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "She made us all cry when she said we should know this from the slide and we all felt less than.",
        "course": "GERMAN1101"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "I am actually the last person that rated. I'd just like to come back and say I got a B in the class because of Melissa, not a B+. I am a straight A student and this was the worst experience of my life.",
        "course": "GERMAN1101"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "I hoped I wouldn't wake up every day before German. I tried extremely hard in class and ended up with a B+. Melissa did not care about students, didn't explain any material, made the comment &quot;how are you guys not getting this?&quot;. Majority of the class failed most of the Carmen quizzes. Will never take German again because of this/her",
        "course": "GERMAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "German",
    "firstName": "Kathrin",
    "id": "VGVhY2hlci0xODY1OTE0",
    "lastName": "Frenzel",
    "legacyId": 1865914,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing teacher. She is funny, knowledgeable, and cares about her students. It is the only class this semester where I'm happy to be there every day. The textbook is used heavily but in a good way - it is not a math textbook. 11/10 best teacher on campus.",
        "course": "GERMAN110101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kathrin is seriously one of the best teachers at Ohio State. It was honestly so helpful to have a teacher who knew the language and culture of Germany so well. The way she taught the class was one in which I was able to learn German better than with any other foreign language teacher I've had in the past. Not to mention she's such a fun teacher!",
        "course": "GERMAN110301"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kathrin is an amazing teacher! She made German interesting and she really cares about her students. She was helpful in office hours and her homework assignments (daily) help you learn the material and practice what will be on the weekly quiz. Take her class. :)",
        "course": "GER100201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "German",
    "firstName": "Johanna",
    "id": "VGVhY2hlci0zMDM2ODA3",
    "lastName": "Klingler",
    "legacyId": 3036807,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Klingler was my first German professor and so far she is the best! She gives amazing feedback and is personable with students. She expects high results from her students but she has amazing lectures so you feel like you're always having fun. I would highly recommend her. ",
        "course": "GERMAN-1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2,
    "department": "German",
    "firstName": "Katharina",
    "id": "VGVhY2hlci0zMDIzMTE2",
    "lastName": "Vogel",
    "legacyId": 3023116,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Student: So _ works like _, yeah?\nKatharina: 'No,' followed by 5 minute explanation resulting in the final conclusion being the same as what you said/asked.",
        "course": "2102"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Frau Vogel is an extremely nice woman, but her teaching style leaves much to be desired. For the first 2 weeks, our Canvas modules page format changed each day, and uploading assignments didn't work. She gave us tons of busywork both in and out of class and didn't have an OSU email, making it hard to contact her.",
        "course": "2102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 2.9,
    "department": "German",
    "firstName": "May",
    "id": "VGVhY2hlci0xODgyODI3",
    "lastName": "Mergenthaler",
    "legacyId": 1882827,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Poorly taught and boring lectures. Save yourself from her. Professor Mergenthaler does not care about students as evident by her attitude and treatment towards her students.",
        "course": "GERM4300"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "There is little structure to the class- you will have no idea what is going on half the time. The lectures tend to be mind-numbingly simple while the required readings are wayyyyy too advanced for anyone in the program. To be fair though, where Professor Mergenthaler lacks in teaching ability she more than makes up for in passive aggression. ",
        "course": "GERM4300"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "May's lectures are without a doubt the hardest ive ever had in the german department. If you have never taken a philosophy course or don't have a deep understanding it, your going to spend long nights doing research. May is a very nice professor and really does wants students to succeed, its just the subject of this course is just on another level.",
        "course": "GERM4300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took May's poetry class last year. It was very challenging as we read a lot of Derrida which was awful. But May clearly put a lot of preparation into each class and knew the material inside out which meant I was able to get a grasp of the very challenging literature. May is the kindest professor I have ever had. Take a class with her if you can.",
        "course": "GERMAN8300"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "May is a great instructor. She's very German in that she's very to the point, and if you make a mistake in class you can be sure that she'll correct you. It seems like she will be a very tough grader, but she's actually more interested in seeing that you put in a great effort and learned something. If you devote yourself to learning you'll ace it.",
        "course": "GERMAN4200"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "As easy as this class was it can be best described as frustrating. May consistanly shows up late with half finished powerpoint slides and a ton of excuses for why nothing she was supposed to get done was accomplished. The course is filled with busy work makes you feel like you haven't learned anything at the end of the semester.",
        "course": "GERM2251"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "While this class was easy it wasn't at all what the course description said. She openly admitted that the course description was wrong and that we would be doing something different. The problem is, she didn't tell us this until three weeks in. She is very opinionated about the material, the easy was to get an A is to agree with her opinions.",
        "course": "2251"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great class - professor uses readings and discussions well and explains things very clearly. She also chooses readings and fosters discussions so that it is interesting. No tests - just presentation and small paper. If you participate you will get a good grade",
        "course": "GERMAN3451H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.1,
    "department": "German",
    "firstName": "Paul",
    "id": "VGVhY2hlci01Mjk5MA==",
    "lastName": "Reitter",
    "legacyId": 52990,
    "numRatings": 58,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very short descriptions of papers and what was expected of us, but as long as you put effort in you should be fine",
        "course": "GER3252"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Paul Reitter is an okay professor at best but what really bothered me about this class is how few grades there were.  I got a 93 and a 95 on my two papers and 5/5 on all my quizzes and to get an A in the class I had to get at least a 90 on the final.  Not what I wanted out of a GE course.  ",
        "course": "GER3252"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "BEST professor ever. The class was so easy, I didn't do most of the assigned readings or watch the videos and still did so well. Every quiz is taken during class time. Easy extra credit opportunity that goes along with every assignment",
        "course": "GER3252"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "This man is a chill easy going genius. Very nice and incredibly smart. Lectures are typically just him speaking but they are very insightful and help towards the project.",
        "course": "GERMAN2251"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Reitter is a very interesting and knowledgeable person! Sometimes class gets really boring because it's just him rambling. If you go to class and read the readings and watch the movies assigned for German 3252, you will get an A. The coursework is super easy, but participation is graded. If it wasn't graded, you would be able to pass w/o attending.",
        "course": "GERMAN3252"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Paul is impressive. Just take a look at his background and OSU is lucky to have him. Its one of the most interesting classes I have ever taken. He's extremely proficient. Every class is typically an inspirational and passionate lecture followed by screen time. As long as you keep up with the syllabus there is no reason to not get an A.",
        "course": "GER3252"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "GER3252 is an eye opening class about the Holocaust. Main grades were two short essays and the final. Highly recommend.",
        "course": "GER3252"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was equally as interesting as it was informative and inspiring. Those were all \"in-\" words, but anywayss \"in\" this class we had lectures for the first half and watched the film for the second half. Surprisingly neither half was more INtriguing than the other. PR taught his material well and connected one focus to the next with ease.",
        "course": "GERMAN3252"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not only is he very inspirational, he is funny and entertaining at the same time. I HATE lectures, but did not dread a second of this class. I recommended to all my friends and would take again myself.",
        "course": "GER3252"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "You can tell he really cares about the topic and he makes it very interesting to learn. Go to class, he talks for 20 minutes then you watch films the remainder of the time. Didn't read any of the books and still passed. Great class.",
        "course": "GER3252"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome professor! So much extra credit!!!",
        "course": "GERMAN3252"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Paul cares about this topic and is very passionate during his lectures. Every class is typically a 20 minute lecture and the rest of the class is spent watching a movie. You are assigned books to read, but you can get an A without reading them. There are a few quizzes, two essays, and a final to make up your grade, but overall a very easy A.",
        "course": "GER3252"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "It's a literature class so of course you should expect to read. However fairy tales are generally short, and he doesn't assign very many at one time. The reviews on the fairy tales however are harder, and longer. The class overall is not very hard. As long as you put forth the effort you will do fine.",
        "course": "GER2251"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very nice guy even though the subject of the class was weird. It's not hard to do well just complete the readings and go to class because he will give you the answers to the quizzes during his lectures. He genuinely cares about his students and even learns people's names.",
        "course": "GER2251"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved Paul! His passion for the material is so evident when he lectures. He wants everyone to succeed and practically makes it impossible not to. He answers all the reading questions for you and gives you the exam essay questions ahead of time. There's no excuse why you shouldn't get an A. I would definitely take this class again!",
        "course": "GERMAN3252"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "literally gives you all the questions for the exams before hand. if you put in a little work its fairly easy to get 100%. the films are very interesting and definitely worth while to watch. The only minor downside is that he can be a little long winded at times but this demonstrates he clearly knows what hes talking about. ",
        "course": "GERMAN3252"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very nice guy.  The material is pretty interesting, and if you show up and do the work you should get an easy A.  Great GE Lit...but I almost wish it was a bit more of a challenge.",
        "course": "GER3252"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "I thought he was a wonderful professor. He was funny and definitely knew the class material. He would get off topic but it was always something interesting or had some sort of point. I would recommend him to anyone wanting a literature credit.",
        "course": "GER399"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class was very easy. All you do is watch movies about the holocaust and read short stories, then you discuss them. Short quizzes and 2 exams equal your grade. Gives you the essaay questions a week in advance in order to prepare. Hard not to get an A or a B. Easy class and nice guy",
        "course": "GERMA399"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 4,
        "comment": "A great guy and a very interesting class.  You watch movies and discuss 5 books.  His exams are 20 MC questions and 5 short answers questions which he grades pretty fairly.  If you are look for an easy class to fulfill you literature GEC this is the one for you.",
        "course": "GER399"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "This was a great class. He's laid-back and the class was interesting.",
        "course": "GER250"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 1,
        "comment": "He is quite a character and very entertaining just to study him and his behavior. He always gets distracted and off topic.  His class was really easy you just watch movies and listen to him talk.  He uses huge weird words though and i would always have to go to office hours to figure out what he meant.  Cute man who I swear has ADD.  He is a genius",
        "course": "GERMA399"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 3,
        "comment": "One of the best professors I've ever had. He is absolutely brilliant and provides every opportunity for the students to have success.",
        "course": "CS651"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class was very interesting, the movies were very good and so were the books. The exams aren't hard as long as you watched the movies and read, plus he gives you the exam questions ahead of time. Easy A",
        "course": "GER399"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 2,
        "comment": "This Holocaust class was very interesting. This is not too much of a lit class. Read one story every week and watch a movie. The movies were really good. For the midterm and final, not too bad. He gives the essay question out one week prior to the exam and the short answer questions are discussed in class, so pay attention and it's not hard!",
        "course": "GERM399"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "I could only wish to have his rich vocabulary. If someone offers an opinion during discussion, he'll take the same idea and beautifully twist the words to make it sound so much better. Class was a cake, however. Gives essay before hand, but keep up with discussions as they end up being short answer questions. Lots of writing, but pretty easy A.",
        "course": "GER399"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class and interesting material! You have to read several books and lectures consist of watching movies which are covered on the tests. The MT and final have in class writing portions but you get the question beforehand. Professor is friendly and helpful.",
        "course": "GER399"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very interesting class abut the holocaust.  Very graphic.  Easy tests, but a lot of writing (short answer and essay format).  Questions are from class though and you get the essay question beforehand.",
        "course": "GERMA399"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class! We watched movies and read interesting books! A midterm and final and a few EASY quizzes. This is probably the easiest lit class, and still stimulating!",
        "course": "GER399"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "EASY! attendance isn't required.  only a midterm & a final. able to use a note sheet on both. just write down the answers to the questions b/c they are on the tests. fun class...you watch a lot of movies.",
        "course": "GERM399"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 2,
        "comment": "Interested in the subject material, essay midterm and final.  Gives you the 3 questions before, but they are so open and you could easily write a 5 page paper for each question.  Too much writing for a test in my opinion.  I rushed to finish on both the midterm and final.",
        "course": "GERM399"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Reitter was an amazing teacher. He knows his stuff and is passionate about teaching it to others.  It is an easy class to attend because he lectures for about a half hour and then all you do is watch movies.  Make sure you go to class because the movies are covered on the exams. Make sure you essays are very detailed and it will be easy to get an A",
        "course": "GER390"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 1,
        "comment": "best class i ever took! just read the stories, watch the movies & take the notes he gives you & you'll do fine. exact questions from the notes were on the tests. but if you're not interested in the holocaust, take something else. easiest A i ever got. would take it again if i could :)",
        "course": "GER399"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is absolutely gorgeous, and super smart.  Made it nice to come to class :)  Watched movies and read short articles for homework, he gives handouts to help review for tests.  One midterm, the final, and two quizzes all quarter.  Very enjoyable class, despite horrifying content (it IS a Holocaust class afterall)",
        "course": "GERM399"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "GER399"
      },
      {
        "index": 36,
        "rating": 1,
        "difficulty": 3,
        "comment": "He's a very nice guy, but....his lectures are VAGUE at best. You never know really what is expected of you. There's know real direction during lecture. The class it'self is organized and the material is interesting. I would just cautious taking this prof - it's hard to know what he wants out of his students - Makes it hard studying for exams.",
        "course": "GERMAN399"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 3,
        "comment": "I thought he was a great teacher. Class was the best I've taken. He loves to talk and tends to ramble A LOT. Just keep up with the material, and it's an easy and enjoyable A.",
        "course": "GERMAN399"
      },
      {
        "index": 38,
        "rating": 2,
        "difficulty": 2,
        "comment": "This man loves to talk!! He is unclear because in discussions, you're never sure if you've given a right or wrong answer to his question. Not the most organized teacher either, but his class isn't too bad.",
        "course": "GERMAN250"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 3,
        "comment": "Super smart guy. His vocabulary is out of this world. Class a bit hard but very good. Take him whenever you can.",
        "course": "GERMAN399"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 4,
        "comment": "Class was very interesting...his lectures were not.  Little organization to lecture/discussion, never knew what he wanted out of his students.  Did well, but worked extremely hard for a GEC.",
        "course": "GERMAN399"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 1,
        "comment": "Good class.  We read some cool books but be prepared to listen.... a lot.",
        "course": "GERMAN367"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very intelligent/articulate. Lots of readings.  Some lectures could be a little dense and over our heads, but he would explain if needed.  Great feedback on student projects and papers.  Always there for his office hours and very willing to help.  I look forward to future classes he'll be teaching.",
        "course": "GERMAN850"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 3,
        "comment": "Paul &quot;Heine&quot; Reitter knows his stuff, but the way he leads discussions seems a bit disorganized.",
        "course": "GER850"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Paul Reitter knows his stuff, is very articulate, and is incredibly interesting to listen to.  Tests aren't too bad, just be prepared to write/analyze since that is the focus of the class.  But he definitely is fair and expects a lot from you.  Definitely would take more classes from this man!",
        "course": "GERMAN399"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good professor, good class.  Exams are pretty easy if you do your work, but I don't know how you could take the exam without doing your work. Fair grader, though.  He really knows his stuff.",
        "course": "GERM399"
      },
      {
        "index": 46,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GERMAN399"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 1,
        "comment": "Reitter is a pretty cool prof. The class is depressing as hell, but no body falls asleep when theyre looking at a pile of dead bodies. Lots of movies (schindlers list, life is beautiful etc), didnt lecture too long- his lectures were pretty interesting for the most part, and very little course work.",
        "course": "GER399"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 2,
        "comment": "paul is the an awsome teacher he know his stuff and is very helpful",
        "course": "GERMAN399"
      },
      {
        "index": 49,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great prof! Lectures were interesting, but occasionally boring. The class basically consists of 1/3 of each lecture discussing books/films, and the other 2/3 watching the films. And the only assignments are 2 quizzes, 1 writing assignment, and the final. Great class, TAKE IT!!!",
        "course": "GERMAN399"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very intelligent, and one of the best lecturers I've had in my 4 yrs at OSU.  Tests seem hard, but he's a very fair grader.  I learned a lot and enjoyed myself at the same time.  Two thumbs up.",
        "course": "GER399"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very excellent and thorough teacher.  Made classes entertaining and enjoyable.  Wonderful guy. REcommend him to anyone.",
        "course": "GERMAN399"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is very thorough.  He definitely knows his stuff inside and out.  Made class entertaining: 45 min. discussing a 10 page. reading and the remaining hour or so watching movies.  I'd recommend taking the class or having him as a professor.",
        "course": "GER399"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 5,
        "comment": "Extremely conscientious, knows his topic inside and out, will do anything to help you, but you better be in class, and you better know how to write essays and identify passages from the books! But he listens and he's fair.",
        "course": "GERMAN399"
      },
      {
        "index": 54,
        "rating": 1,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "GERMAN299"
      },
      {
        "index": 55,
        "rating": 3,
        "difficulty": 1,
        "comment": "nice guy, but too easy - and not always well prepared",
        "course": "299"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very friendly and intelligent",
        "course": "GER399"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very friendly, helpful, and just plain great! Wonderful guy.",
        "course": "399"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you get a chance, take a class with him!  He is very energetic, and fun!",
        "course": "GER291"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "German",
    "firstName": "Haley",
    "id": "VGVhY2hlci0yNzM4NDUw",
    "lastName": "Grubb",
    "legacyId": 2738450,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Haley was a great teacher. She is nice and easy to talk to, and she is very willing to help. Her style of teaching worked very well for me and made German 1 easy for a person with little experience.",
        "course": "GERMAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class with her and she is nice. Just do the work and you will get an A.",
        "course": "GERMAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.4,
    "department": "German",
    "firstName": "Katra",
    "id": "VGVhY2hlci0xMjI4NzMz",
    "lastName": "Byram",
    "legacyId": 1228733,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "I had her for 2101. She's not the most peppy but she does care about her students and wants them to succeed. there was a lot of work and at times she grades pretty hard. i also lowkey thought she hated me and she didn't really have a reason to. participation and group work is big and she moves very quickly through material but overall good.",
        "course": "GERMAN"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "An intelligent,  caring professor who  encourages students to think critically.  Offers opportunities for extra credit",
        "course": "2350"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am taking this course as an audit.  The class is enjoyable and informative.  Dr.  Byram is knowledgeable and organized.  To get the most out of this class, it is best to be prepared and participate.  ",
        "course": "2350"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is so boring.  Boring. Boring. Boring. WOW don't go to lecture. I literally signed the attendance and then left after the pop quiz (if there was one). All of her slides are online and so are the films. I read one of the five books she assigned and still got A's on the essays. ",
        "course": "GERMAN3252"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "20% of your grade is based on attendance and pop quizzes, 40% on two essays, and the remaining 40% is the final. High-stakes, but the material is engaging and the essays are actually pretty short. Just be sure to read and show up for class.",
        "course": "GERMAN3252"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She really loves the course she teaches and definitely wants her students to do well in the course.  Make sure you pay attention, take notes, and SHOW UP TO CLASS. She gives in-class pop quizzes so make sure to finish the required reading for the day before you show up and if you miss, make sure you are caught up in the films. PARTICIPATE!!!",
        "course": "3252"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "She's a very reasonable and likable professor.  Shows a lot of films so it is easy to doze off.. but pay attention to the details! ",
        "course": "GERMAN"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Interesting person.  Truly cares about her students, but she does want them to learn a lot, so it can be difficult.  As long as you take good notes and participate, you shouldn't have a problem.",
        "course": "GERMAN2350"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is very passionate and cares about giving students a good education. Listens to feedback on the class and is a clear lecturer. A bit of a tough grader but if you pay attention and can write well you'll be fine. Really nice person overall.",
        "course": "3250"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "The books and movies watched in class were interesting and overall I enjoyed the class. The essay grading was a bit tough and the feedback was unclear and unhelpful. The only reason I got an A in the class is because I aced the final. Attend lecture because of in class quizzes!",
        "course": "GERMAN3252"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "VERY hard grader. Do not recommend as a GEC.",
        "course": "GERMAN3252"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is a very hard grader, if you do not write exactly what she thinks you WILL get tons of points taken off. The class is only out of 100 points so it is difficult to do well. Do not recommend as a GEC.",
        "course": "GERM3252"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Awful. If don't write exactly what she thinks, which is sometimes impossible to decipher, you get a million points off.",
        "course": "GERMAN3252"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Easy class, but tough/annoying grader. If you don't say almost exactly what she believes or wants you will get points taken off. Does random things in class like run around and says random things.",
        "course": "GERMAN3252"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is by far the best professor I have ever had. She's always willing to go more than out of the way to help students if asked. She is a fantastic teacher, very intelligent, compassionate, and always looking to do better.",
        "course": "GERMAN3200"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class as long as you do most of the readings and attend most of the classes. Movies and books were interesting but the subject matter can be upsetting at times. As long as you pay attention it is very easy to get an A.",
        "course": "GERMAN3252"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "She knew so much about the content and was really interested in what one liked and didn't like how the class was going and offered to change things if necessary. I recommend this class to everyone that is ready to face the Holocaust in detail.",
        "course": "GERM399"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "I did 20% of reading,but I write well.No focus/prssure on each indiv. person,u could simply raise ur hand whn you'd like.She was very welcomng of different opinions-i noticd even the essays were &quot;do u feel ___ occurred yes or no&explain why w/exmpls or quotes.&quot;NOT strictly &quot;expln this&quot;.Cares about ur view! Answers emails.Kept &quot;order&quot; in the class.",
        "course": "SHOAH399"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class seems like it should be really interesting, but the way that she conducts lectures is terrible. very very repetitive. the final exam is short answer and one long essay. your answers have to repeat back the statements/opinions she expressed in class. you're opinions or interpretations mean nothing.",
        "course": "GER399"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very good prof., I would recommend this class to anyone!",
        "course": "GERMA399"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 3,
        "comment": "She may have had interest in the subject, but she clearly did not explain that to us.  It is frustrating that in a class that deals with such a sensitive subject she did not give any personal accounts of why she was teaching.  Her lectures were misguided, and her exams were detail specific.  The books/films were great, but she was useless.",
        "course": "GER399"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "It's obvious she has immense knowledge of literature but her incompetency of how to conduct a class, let alone a discussion is overwhelming. Answer questions as she would answer them as your opinion seems useless.",
        "course": "GERMA399"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "You have to go to class bc all her tests revolve around lecture material and the books you have to read. Test were 2 essay's and short answer. Very straight forward. Take the class if you can handle reading 50+ pages a night",
        "course": "GERM399"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great professor, very serious and sometimes not very compassionate, but overall a great teacher. This class is a lot of reading, as well as a weekly essay, but because of the high number of grades, it isn't too hard to do well. Good, interesting class, definitely recommend this professor.",
        "course": "GER301"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "Katra rocks... if you are generally interested in learning, she is a great Prof.",
        "course": "GER250"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GERMA367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 5,
    "department": "German",
    "firstName": "Jeff",
    "id": "VGVhY2hlci0yMzE3MjM4",
    "lastName": "Frazier",
    "legacyId": 2317238,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is mostly discussion-based. He's very patient--you could make the same mistakes over and over again and he would just explain it every time. If you participate in class and do the work on time, you will find his class easy, rewarding, and fun.",
        "course": "GER1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Jeff! He made learning German so fun. He was incredibly helpful and really cared about his student's understanding of the stuff he taught. I would definitely recommend taking a class with him if you are able to. ",
        "course": "GER1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Could not have asked for a better professor to learn German from. So sweet and understanding, Will forever remember. ",
        "course": "GER1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jeff is one of my favorite professors I have ever had. He is so nice, and if you participate he can get to know you. He even gave me a magazine from a soccer team that we both support. A very well structured class with an amazing teacher. Definitely take this if you need German credits.",
        "course": "GER1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jeff is very kind and understanding when you participate in class. If you show in class that you know and understand German, he is more likely to cut you some slack when mistakes happen on assignments, because he understands the extent of your abilities.",
        "course": "GERMAN1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jeff is a fantastic professor who clearly cares about his students. He did a great job at teaching us effectively while keeping the class very manageable.",
        "course": "GERMAN1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Frazier is a wonderful professor! He is very nice and understanding. His lectures are also really easy to follow and if you don't understand something he does a great job making sure you do. 10/10 one of the best professors I've ever had. Made me want to take more German classes.",
        "course": "GERM1103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely wonderful German 1102 professor. Because this is written in 2020, this is coming from a student who had to deal with hybrid delivery. But don't let that scare you. Jeff Frazier does everything in his power to make the learning environment as engaging as possible, and turns taking a foreign language from being a chore into something fun.",
        "course": "GERM1102"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Jeff is alright. He is a very lenient grader on class work and homework(basically as long as you do it, and show effort, you should get at least a C on the assignments). He does assign a lot of work though, so keep that in mind. The only challenging part of 1103 was the tests. You only get 55 mins to take them and they are stupid hard.",
        "course": "GERMAN1103"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "I was so lucky to get Jeff for both 1102 and 1103. Hes caring and a lenient grader but still gives useful feedback and corrections. Jeff is excited to answer questions and loves seeing participation. He assigns small assignments almost daily, but theyre perfectly manageable and made to help you practice and remember German.",
        "course": "GERMAN1102"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jeff is a great instructor, he was always a joy to have class with, he made sure his students understood what was going on every moment of the class. Just attend class and do homework and he will help you with the rest.",
        "course": "GERMAN1103"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. I was worried coming into college german but Jeff made it amazing and simple. You do a decent amount of work but it is all pretty simple and Jeff makes it easy to understand and will help you with anything.",
        "course": "GER1102"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Pretty good teacher. He's not a super tough grader, and as long as you pay attention and do your homework you should be fine. Just make sure that you keep up with the lessons.",
        "course": "GERMAN1102"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Jeff is basically the professor I prayed for before taking German. I was petrified to take a foreign language, and somehow decided to take German. Going into it I knew it was going to be the toughest class I would take in college. Not only was Jeff awesome, but very understanding in where each student stood. He was approachable and very friendl",
        "course": "GER1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.8,
    "department": "German",
    "firstName": "Kevin",
    "id": "VGVhY2hlci0xMDIxOTQ2",
    "lastName": "Richards",
    "legacyId": 1021946,
    "numRatings": 68,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "For this class being a GE there is tons of assignments. None too difficult but usually like three a week with lots of movies to watch and books to read. Essays are graded kind of tough. Attending the zoom during class time is extra credit.",
        "course": "GERM3252"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy very nice. You'll need to buy a bunch of books and watch various films for your essays but I never did any of that and still did good. Highly recommend joining the optional zoom meetings that are for bonus points, they add the points to your essays which is a higher % of your grade so it's great. Pretty manageable class tho",
        "course": "GERM3252"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is a pretty easy GE and also very entertaining. You do need to buy a few books to complete the essays, but they were overall enjoyable and short reads. Professor Richards is also very nice and cares a lot about this topic as well as students doing well in class. He also provides lots of easy and fun extra credit too.",
        "course": "GER3252"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "This is the 2nd course I have taken with Dr. Richards. He is clearly knowledgeable and passionate about his studies and expertise. I do have some comments about the course, as it obviously involves very heavy material that should not be censored, but can feel desensitizing at times due to the sheer volume of traumatic content required for viewing.",
        "course": "GERM3252"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "I loved having Dr. Richards, as both his class materials and extra credit opportunities were well-shaped and super engaging. He cares a lot as a teacher, and the only reason I gave him a 4 on this review was that he was a little hard to reach as an online lecturer of 300 students, even after one appointment and a couple emails.",
        "course": "GER3252"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is a very caring professor and the course is generally easy! It is a decent amount of work for a GE though, with a weekly quiz, like 3 assignments and some readings/films. But it's a pretty easy course otherwise with decent extra credit. I would recommend him!",
        "course": "GERM3252"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kevin is a great gen ed prof. He is very practical and and easy grader as long as you turn in your assignments. we did a lot of group work but I don't mind that. He really cares about his students and even brought in Crumbl cookies on our last day of the semester. Overall would 100% take him again if I have the chance. ",
        "course": "GENED1201"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kevin was very nice and caring, wanted you to learn and be successful. Some of the PebblePad stuff seemed pointless, but he had no control over that being a department requirement. 100% would take him again. ",
        "course": "GENED1201"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great GE class. Workload was extremely manageable, and at your own pace each week. The films he assigned were a bit long, and requires you to buy books to read which seemed like a bit much. My only real complaint is that the grader was a bit harsh on the essays. Definitely take for GE credit!",
        "course": "GER3252"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had Dr.Richards for GENED 1201, and he was a great person and really cares about his students. His class is based on Pebblepad assignments. Some papers, assignment tend to get a bit tedious at the end but nothing that was too hard. Otherwise a great laid-back class that was kind of like a brain break.",
        "course": "GER103"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor and class were great. He is an easy grader as long as you put effort in. He assigns books but I did not purchase or read a single one and passed with a 97. He also hosted two weekly zoom meetings that were optional for extra credit, as well as multiple early turn in bonus opportunities for essays and more. I would totally recommend.",
        "course": "GERM3252"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best professors at OSU. He cares about his students and the topics he covers. The format is weekly 11 question quizzes, one annotation and a small assignment. Theres 3 800 word essays spread out. This is a great and easy GE to take, he makes everything clear. I would absolutely suggest this professor to anyone.  ",
        "course": "GERM3252"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Quite a hefty amount of reading/ watching lectures and movies, but I found everything to be really interesting so it wasn't painful. Dr. Richards is a great lecturer and I was engaged all semester. Weekly assignments weren't super stressful. I think it's a good GE that is fairly easy but also interesting. Worth taking with him!",
        "course": "GERM3252"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fairytales was a very well-organized online asynchronous class. The projects are graded fairly easily, and the lectures are very short and easy to watch. ",
        "course": "GERMAN2254"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is a great professor and obviously loves teaching this class. Although it shows up as an online course when scheduling, it is actually asynchronous, with lectures being extra credit. The weekly assignments can sometimes can be time-consuming but graded easily. Biggest grades are two essays and a final project. I'd recommend for a GE.",
        "course": "GERMAN2254"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very responsive and understanding guy who challenges students, but not excessively. It was easy to navigate this course, although some assignments took a long time. For a lit GE, I would say it was pretty painless. Lectures are interesting, readings are short, and you get to watch movies.",
        "course": "GERMAN2254"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Richards is a great lecturer and is very passionate about what he teaches. He makes the instructions clear on every assignment so there is no confusion when completing an assignment. He wants everyone to do well, so if you have a question, don't be afraid to ask ",
        "course": "GER3252"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such an interesting and unique class, and Kevin Richards was literally such a nice guy. Despite the class being asynchronous, he still makes himself very available for office hours. Overall a very easy class to be successful in, yet still interesting and fun to learn about. ",
        "course": "GERMAN2254"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class online, and I found it very easy. The professor was obviously passionate about the topics he was teaching, and the lectures and readings were enjoyable. There were weekly quizzes and readings which were not too difficult. There were also two essays that were lightly graded and a final project that was also lightly graded.",
        "course": "GERMAN2254"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very interesting class and Professor Richards is a great person. Class is honestly a lot of work for a gen ed and requires you to buy a lot of books (most of them can be found online). the TAs for this class kind of suck though, put a lot of effort into my essays and was not greeted with a very kind grade. ",
        "course": "GERM3252"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "TAKE THIS CLASS FOR LITERATURE GE CREDIT! It's the best and very interesting. He was very easy and the TA who graded my paper gave me an A every time. Only 2 papers. No final exam or midterms. There's a final project at the end and it's very easy. Quizzes are easy too. Highly recommend for a gpa booster.",
        "course": "GERMAN2254"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was very interesting and easy to understand. Although it is a lot of reading, he does a good job in making it engaging for the class. Papers and projects are both open ended and have clear grading criteria.m Definitely would take this class again.",
        "course": "GERMAN2254"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "This asynchronous class is easy as long as you stay on top of the work. Theres a lot of content each week but the quizzes are pretty short and easy if you just skim. Also hes just such a great guy and actually cares about his students.",
        "course": "GERMAN2254"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Online asynchronous class so I never interacted with Dr. Richards, but he structured the course well and it was not a ton of work. Readings were fun and short. The big assignments other than easy quizzes were 2 essays and a short video project. The essays had averages in the mid to high 80's, so make sure to put effort in those to get an A.",
        "course": "GERMAN2251"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "amazing class!!",
        "course": "GERMAN2254"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "You read 5 books for class and have to write 3 essays on them. The books are generally interesting but if you do not enjoy reading I would not recommend. The weekly quizzes are generally easy, but he is kind of a hard grader on essays. Lectures are interesting and not too long. This class was interesting and I would 100% take it again.",
        "course": "GERMAN3252"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is funny and his material is presented in an interesting way.",
        "course": "GERMAN2254"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 2,
        "comment": "Seems like a great guy, but I found a lot of his lectures to be really confusing and hard to follow. There were lots of things he would just brush over but his quizzes were super specific. Discussions every week and having to respond to others posts were very annoying. I liked the content of the class but I would not take a class by him again.",
        "course": "GERMAN2254"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "Handles heavy subject matter respectfully. Lectures arent ridiculously long, ungraded quizzes to make sure you understand content along with weekly end-of-module quizzes. Gives great feedback on assignments. Hes easy to reach by email and extremely understanding. All around awesome professor.",
        "course": "GERM3252"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took Professor Kevins class in AU20 and it was great! Really super understanding guy and class was easy. Since it got moved online there were weekly modules that only really took about a two days to complete. He also gave a whole week to complete papers that happened about three times the semester. There was also two extra credit opportunities.",
        "course": "GERMAN3252"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy. Excellent teacher, and I enjoyed the class. He really wants people to learn and understand and is very chill. Also an interesting guy with some good stories about his time living in Germany. 10/10, would take more classes with if I wasn't changing majors.",
        "course": "GERMAN1101"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "Im taking this class out of interest and I was afraid that I might no longer be interested if this class went poorly, but its actually the opposite. Im excited to do work for this class and the lectures are great! You wont be disappointed if youre taking this class!",
        "course": "GERMAN3252"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "His German 3252.02 online class is extremely easy. There are no test, just weekly quizzes. I ended the classes with a 97 and I didn't read any of the books or watch the movies. If you put in the work you will pass. The grading is a little slow for some of the bigger assignments, but the class did have 200 people so that is expected.",
        "course": "GERMAN3252"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very kind and caring professor who really cares about the subject. No exams, just two short papers and then a longer final project. Provides extra credit. Make sure you go to class to get the lecture quiz points and participate in online discussions. Not too difficult to get an A. Very interesting GE and opened my eyes to many different topics",
        "course": "GERMAN3252"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never met a teacher that cares more about what they teach than Kevin Richards. This course was a generally easy course but partly because of how much he makes his courses interesting. Again, super easy GE and a professor that loves to teach it. Just show up and take the pre/post quizzes and pass.",
        "course": "GERMAN3252"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easily the most chill professor at Ohio state. There are daily quizzes to just make sure you did readings and pay attention in class, but if you do that you're pretty much guaranteed an A. I usually spent no longer than an hour or two on the essays and get a solid A. Super easy grader, interesting class, definitely take if you want an easy GE",
        "course": "GERMAN3252"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really enjoyed his lecture and felt that it wasn't stressful but I was still able to learn a lot.",
        "course": "GERMAN2254"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 1,
        "comment": "If you are looking for an EASY LITERATURE GE, this is it. As long as you show up to class, you will pass. Easy review quizzes at the beginning and end of class every day. But you get to use your peers, book, and internet. Professor is passionate about his work and makes the class interesting.",
        "course": "GERMAN2254"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 2,
        "comment": "Holocaust Lit was life changing for me. Dr. Richards was incredibly passionate and at times his lectures were truly captivating. You do have a few papers that are long, but plan ahead and they're not hard. This class will have you internally battling yourself as you have to confront the acts of the Holocaust. If you pay attention, you will grow.",
        "course": "GER3252"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is a great professor who makes learning fun. Lots of reading and watching movies for daily quizzes, but its not too bad. Great Literature GE!",
        "course": "GERMAN2254"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing guy. So smart and passionate, lectures are so interesting. There's quizzes at the start and end of each class, but you're allowed to work with other people, so they're easy A and good filler points. Such a caring guy too, he wants to see his students succeed. He's genuinely interested in their perspectives too.",
        "course": "GERMAN3252"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 3,
        "comment": "Kevin is a great teacher, and his lectures are extremely interesting, interactive, and engaging. I learned a lot about Grimm's Fairytales from him, and he assesses you well (i.e. easy daily quizzes, fun video project, etc.) My only complaint is that he can get kind of political/expresses his opinions during class, which was annoying. Great class!",
        "course": "GERMAN2254"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is the best professor I've had at OSU by far. He cares about what he is teaching, and gives engaging lectures. If you have to chance, take one of his classes!",
        "course": "GERMAN3252"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is one of my favorite professors. This class is such a heavy topic (Holocaust Lit) but he manages to bring in humor where appropriate and obviously cares about his students. You'll read &amp; watch pieces past the usual &quot;Diary of Anne Frank&quot; and &quot;Boy in the Striped Pajamas&quot; and all of his choices are interesting. Highly, highly recommend!",
        "course": "GERMAN3252"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Richards is an amazingly passionate guy who clearly enjoys what he's teaching. He is extremely kind and lighthearted and inspirational all at the same time. I took his Holocaust class and he taught it in such a comprehensive and thought-provoking manner. Really easy and lenient on grading.",
        "course": "GERMAN3252"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best classes I've taken at Ohio State. Dr. Richards is one of the most enthusiastic and passionate professors I've experienced. The class is very fun and fast paced, making it fly by. There is a 5 question reading quiz at the beginning of every lecture but they are very easy if you skim the short readings.",
        "course": "GERMAN2254"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy Literature GE, would definitely recommend. Strong emphasis on history of the Holocaust through film and literature. Watched a number of movies (some good, some bad) and read 4-5 books. Didn't necessarily have to read in great detail. Short quizzes at the beginning and end of each lecture, so you must attend class regularly!",
        "course": "GERMAN3252"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 3,
        "comment": "There was a short five question quiz at the beginning of each class over the reading, two papers, one video presentation, and a final. If you're looking for an easy GE to take, definitely take this one. Dr. Richards is also a very nice guy",
        "course": "GERMAN2254"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is great. Would recomend.",
        "course": "GER3252"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 1,
        "comment": "He actually the coolest dude ever Need to hear his life story",
        "course": "GERMAN2251"
      },
      {
        "index": 51,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Richards is a good professor but could improve in some areas. His pace is fast, slides are sometimes ambiguous, and the rubrics can be vague. However, he is passionate and encourages analysis of the literature from multiple perspectives. If you have questions, attend office hours as he is incredibly knowledgable. A chill, interesting GE to take",
        "course": "GERMAN3252"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 4,
        "comment": "Overall, Dr. Richards is a good professor but could improve in some areas. His pace is fast and slides can be ambiguous. Rubrics can be vague. However, Dr. Richards is passionate and encourages analysis of the books from multiple perspectives. If you have questions, attend office hours as he is incredibly knowledgable. A chill, interesting class.",
        "course": "GERMAN3252"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome lectures, very engaging classes! Interesting topics, great group discussions.",
        "course": "GERMAN2251"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fantastic professor! His lectures were very interesting and enjoyable. The readings and films were all great. The class was participation heavy, but the discussions were all engaging and genuine. The writing assignments were mostly creative. If you're looking for a GE, take any class with Kevin Richards.",
        "course": "GER2251"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kevin was a very down-to-earth, genuine professor. His class was very interesting as well as fairly easy. There were only 2 essays during the semester and a final, not much work at all. Would recommend this class/professor",
        "course": "GER3252"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy GE. Dr. Richards is super laid back and grades pretty easy on the essays. There's a little bit of out of class work though.",
        "course": "GERMAN2251"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 2,
        "comment": "Learn a lot about the difficult subject of the Holocaust, very knowledgeable",
        "course": "GERM3252"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kevin is one of the best instructors I've had. His lectures are clear & the material is interesting. He was very approachable and gave great feedback on papers if you went to office hours. Can't say enough nice things about him.",
        "course": "GER3252"
      },
      {
        "index": 59,
        "rating": 3,
        "difficulty": 2,
        "comment": "Kevin was an amazing professor and made the class super easy and fun to learn about especially when discussing a difficult topic such as the Holocaust. He gave about 2-3 papers the semester and then you only had a final. The in class quizzes are difficult if you didn't read but there is a lot of extra credit to help your grade.",
        "course": "GER3252"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 1,
        "comment": "I can't say enough nice things about this professor. I would highly recommend taking this literature GE class. The topic is Holocaust lit & film, and will read very interesting books and the films we watched in class were really good. He is such a nice guy too, I will miss him!!!!",
        "course": "GERMAN3252"
      },
      {
        "index": 61,
        "rating": 5,
        "difficulty": 2,
        "comment": "Called German Lit and Pop Culture but ended up being German Science Fiction. Very interesting readings. Great class structure. Essentially you are assigned readings, write a journal, and then you spend class time discussing them in groups of 3-5, then as a class. We wrote one longer research paperpresentation at the end, but you choose the topic.",
        "course": "GERMAN2251"
      },
      {
        "index": 62,
        "rating": 4,
        "difficulty": 2,
        "comment": "Super fun course. This is a litpop culture course, and he changes it up every semester. This semester was science fiction. Cool guy, passionate about what he's teaching, really knows his stuff. As long as you do the work you'll be fine. Sometimes you don't have to read the entire book to get the idea though. I'd take it again.",
        "course": "GERMAN2251"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Herr Richards! Kevin was a great teacher for my first semester in college, easy, but I learned a lot. He's very interested in everything German and Scandinavian, and will totally keep touch with you after being your instructor. Just earned is PhD, too.",
        "course": "GERMAN104"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's awesome.  He really cares for the students and will definitely help you during office hours.  I recommend taking his class if you need GER 104.",
        "course": "GER104"
      },
      {
        "index": 65,
        "rating": 4,
        "difficulty": 1,
        "comment": "Let me just start with how great this teacher is, he is very involved in the material and enjoys teaching. The only negative was his timeline goes alittle out of order and his power points are confusing if you do not attend class. But his test and grading is very fair",
        "course": "GER250"
      },
      {
        "index": 66,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. Made class fun and interesting. Assignments were very basic. Definitely recommended.",
        "course": "GER250"
      },
      {
        "index": 67,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best German teacher I've ever had. Easy if you go to class and pay attention! Definitely take this class with him or any class offered by him at the university. you won't regret it",
        "course": "GER103"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kevin is a TA working on his PhD in the dept of Germanic languages. He lived in Germany for 6 years and knows tons about the culture (I think he met his wife there). Because of his experiance and attitude about learning, he makes an excellent germ 101 teacher. If you do the work, you will get a good grade and learn a lot of language and culture.",
        "course": "GERM101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Elaine",
    "id": "VGVhY2hlci0zMDQ4ODY3",
    "lastName": "Fitz Gibbon",
    "legacyId": 3048867,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Sweetest prof I've had. Elaine made me actually enjoy German w/ her enthusiasm, care, & patience with everyone. I would take any of her classes again without a second thought. Lots of hw but that's the department, not her. She also returns grades back quickly w/ a relaxed late policy. Very communicative & compromising person that makes learning fun",
        "course": "GERMAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely sweet, cares a lot about her students. Homework is relatively easy but there is a lot of it. Lots of collaboration with classmates but not for a grade.",
        "course": "GERMAN1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "German",
    "firstName": "Trevor",
    "id": "VGVhY2hlci0zMDY3NzYy",
    "lastName": "Teafatiller",
    "legacyId": 3067762,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "herr teafatiller was really good about being patient with us, since this was german 1. the homework all felt very useful, though there is a lot of it, so beware. overall, great time in the class and i feel ready for german 2. ",
        "course": "Germ1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.6,
    "department": "German",
    "firstName": "Barbara",
    "id": "VGVhY2hlci0xODk1MTE5",
    "lastName": "Heck",
    "legacyId": 1895119,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Frau Heck is very kind and is willing to help her students. She has high standards for her students and is tough with grading. Her teaching is quite fast-paced however, I learned quite a few new grammar topics in this course. I recommend her as a teacher and this class is not too difficult as long as you do the work and put in effort. ",
        "course": "GERMAN3101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really fun and helpful professor.",
        "course": "GERMAN2102"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Super sweet and caring woman, but she gives SO much busy work as assignments. It's really annoying after a while. Her teaching style reminds me of a grade school foreign language class. If you are in a 3000-level German class, you obviously (or should) know a thing or two about the language, but she acts like you need to be taught things 1000 times",
        "course": "GER3602"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Frau Heck is the best Professor I've ever had, on or out of the department. If you want to pass the class you almost definitely will. She is almost always in her office when not teaching, and is very easy to access. She is very understanding, if you're having problems and just shoot her an email she will almost definitely help you out. Love her!",
        "course": "GERMAN2101"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "Frau Heck truly is a kind and caring professor; however, she does not make 2102 easy. There's lots of homework each night, and she is a really tough grader, as she often takes lots of points off for small mistakes. She is extremely willing to offer help when you are struggling though, and genuinely cares about you and your performance in the class.",
        "course": "GERMAN2102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Frau Heck is the greatest professor that I've ever had. She genuinely cares about those who take her class and she will do anything to see that you succeed. The work load is not too crazy and she understands that sometimes you can't get to an assignment because you have other things going on. 10/10 would definitely take one of her classes again.",
        "course": "GERMAN2102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Frau Heck is literally the best. She's a great teacher in as sense that she can get her point across to anyone. She's also super easy to talk to which makes getting help a breeze. I love that she pushes you to see your potential. I consistently look for her classes when scheduling. Couldnt imagine the German dept. without her. She's such a gem.",
        "course": "GERMAN2101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "The best teacher here in the department. Clear and logical lecture, always willing to help. Quizzes and Homework always prepare you better for the tests and learning language.",
        "course": "GERMAN2101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Frau Heck is the absolute best! She is great at being clear and speaking slow which is so important in foreign language acquisition! Very caring towards students.",
        "course": "GERMAN2102"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's honestly the best teacher I've had at Ohio State. She really cares about the students and helping them to succeed.",
        "course": "GERMAN3101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Love Frau Heck 3 i missed class multiple times and she was always extremely willing to meet with me outside of class and help out. She genuinely wants you to learn and succeed.",
        "course": "GERMAN3101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "A little eccentric, but in a badass grandma sort of way. Very good teacher and very willing to work with students outside of class. ",
        "course": "GERMAN3101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's amazing. I've had Frau Heck since I came to school freshman year and she's become like a mentor to me. She is always there for you and loves what she does. She's a little kooky, but it gives her character and she has an amazing personality. Love this woman to death!",
        "course": "GERMAN"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "A very knowledgeable and helpful professor. If she knows you can do better than you're giving her, though, she'll try to push you to be better. A very caring woman and fun to shoot the breeze with. Also very helpful to talk to if you just need clarification on something. Always willing to talk.",
        "course": "GERMAN2102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "German",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yODUyNDE4",
    "lastName": "Kramer ",
    "legacyId": 2852418,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I am not a fan of how the german classes are structured at OSU but I don't think that's his fault I think it's department wide. He is caring and very very understanding, and I would absolutely take him again. ",
        "course": "GER1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "This man is one of my favorite professors ever. He was very accommodating and really cares about his students. Highly recommend this man.",
        "course": "GER1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.6,
    "department": "German",
    "firstName": "Jaclyn",
    "id": "VGVhY2hlci0xMTQzNjcz",
    "lastName": "Kurash",
    "legacyId": 1143673,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is really passionate about both teaching and German. She does her best to make sure you understand the material. Participation really helps. One of the best instructors I've had.",
        "course": "1103"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class is just like any other in the series.  If you did well in 1101 and 1102 you'll get an easy A in 1103.  Her explanations of the grammar lessons can't be beat.  You'll learn a lot from her.  Would take again.",
        "course": "1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is wonderful. Super helpful, she'll write you a letter of recommendation for whatever, she'll answer questions, her grading is fair, and she's just wonderful. Friendly, fun, super nice, just all around fantastic",
        "course": "GERMAN1103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is such a great professor. She's always available in office hours if you have questions and is fun to just talk to as well. Very enthusiastic in class and entertaining. Take her classes as much as you can.",
        "course": "GER110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is really sweet, fun, laid back, and she will teach you great things in a very easy to understand manner. She was great, I only wish I had her as a teacher for a longer time!",
        "course": "GRMN101"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "I came into the class thinking that i couldn't possibly learn anything from this professor, but i ended up learnign a great deal. She is very helpful when it comes to papers, and she is extremely understanding. If you pay attention and do all the assignments, you should expect to get a decent grade.",
        "course": "GERMN230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent Instructor!",
        "course": "GERM571"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3,
    "department": "German",
    "firstName": "Jason",
    "id": "VGVhY2hlci0yMTIwNTI1",
    "lastName": "Owens",
    "legacyId": 2120525,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr. Owens is a great teacher. This is a senior seminar, so you get out of the class what you  put into it. Nothing should be spoon fed to students at this point. Do the reading, talk in class, make the page requirements and pay close attention to everything he says because he likes to sneak in jokes during lecture and they are always hilarious.",
        "course": "GER4350"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very robotic, very strict to his system which makes you feel like you're back in high school. Multiple small group discussions every day that get annoying and are unnecessary. Assigned a paper due over spring break. Grading system is terrible.",
        "course": "GERMAN2251"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "German",
    "firstName": "Bernd",
    "id": "VGVhY2hlci0xNjk4MjQw",
    "lastName": "Fischer",
    "legacyId": 1698240,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fischer is great! Super funny and very intelligent. If you speak up he'll love you otherwise he might not remember your name. He wants students to do well, and gives many opportunities to fix mistakes on papers.",
        "course": "GER3200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor",
        "course": "GER401"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's pretty laid back and won't force you to read (with papers or quizzes). I think it's a reflection of the school more so than him that many won't read because of this.   He's very academic at times, but he can also come down to earth, though less so. I enjoyed his class and think anybody would get a lot out of it. ",
        "course": "GER6200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hr. Dr. Fischer is a very intelligent man. He knows more about English and German grammar and history than anyone. His humor is very \"German\" in that it's very sarcastic, ironic and full of \"Schadenfreude\". But if you get the chance, take him. He's a great guy and is extremely willing to help his students and wants them all to get high marks.",
        "course": "GER401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.8,
    "department": "German",
    "firstName": "Berit Ursala",
    "id": "VGVhY2hlci0xODk1NTc5",
    "lastName": "Jany",
    "legacyId": 1895579,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "awesome professor",
        "course": "2101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "I absolutely loved her, I missed alot of class so my grades weren't as high as they should be but she was fantastic I def recommend but you must pay attention and go to class!",
        "course": "GERMAN2101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3,
    "department": "German",
    "firstName": "Helen",
    "id": "VGVhY2hlci0xNzEwOTE=",
    "lastName": "Fehervary",
    "legacyId": 171091,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Helen Fehervary is the worst \"professor\" I have ever had.  I e-mailed her a question and she actually confronted me in class to tell me she's a \"scholar and [doesn't] have time to answer questions by e-mail\".  Worst teacher I've ever had.  DO NOT TAKE A COURSE WITH HER.",
        "course": "GERMA630"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "DROP NOW",
        "course": "GER422"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "This professor is very discouraging and not at all understanding. She provides no rubric, then gives out horrible grades with no explanation. No one in the class knows what she expects ever, and she plays favorites. She constantly goes off on useless tangents and is extremely opinionated. She is a smart woman but I do NOT recommend taking her class",
        "course": "GER630"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "her discussion are very tangential, which can help with practicing german, but often she would lapse into english for minutes at a time. yes, she is very liberal and a feminist, and those viewpoints can make for pointed discussion, but i found her respectful provided the student could back up their words. she's a little crazy, but i learned a lot.",
        "course": "GRMN463"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Excellent Professor!",
        "course": "GER572"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a very intelligent person that has a lot of personal experience to draw on. I enjoyed the class. She does spend a lot of time off topic, but it was stuff I found interesting. She's very opinionated, but you can disagree with her. Just know when to put in your 2 cents and leave it at that. You need to be able to write well and do the reading.",
        "course": "GER292"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "She's a little unorganized...she didn't pass out a syllabus until mid-third week. Reading and assignments are manageable. Take home midterm and final made things very easy. Tough on grammar so be prepared! OVerall, it was a good intro to lit class.",
        "course": "GER230"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is the worse professr, I have ever seen at the Graduate school. Never follows the schedule, talks anything out of personal opinions. And after all talking about GDR, for the entire life, would no wonder make anyone an expert in that field!!! So no big deal. Just avod confronting her, if you don't want to be insulted.",
        "course": "GER960"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "At first you will prob want to drop the class cause shes crazy...don't worry she's just testing you. Pretty much her opinions become truth in this class, so just roll with it. She is super super super liberal and goes off on crazy tangents all the time, but some of it is useful. A very smart lady, just dont get on her bad side.",
        "course": "GER463"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved her class! She is a wealth of information if you are willing to learn.",
        "course": "GERM463"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's smart, witty, and very insightful, but doesn't tolerate morons.  The people who don't get Fehervary, don't get education that pushes you learn.",
        "course": "GER850"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Unorganized.  Unprepared.  Serious bias against any male/non-ueberfeminist.  Irrelevant readings and discussions.  Waste of time.  Made mean comments about students personal lives.  Tangent-queen.  Apparently smart, but you'd never know it from what she teaches.  Wait a quarter...or year...to avoid.",
        "course": "GERMAN702"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "wanted to have a make up class for Martin Luther king day.if you see her outside of class she is going to be more sympathetic to you.",
        "course": "GER463"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Scattershot teaching style, but very helpful if you see her outside of class. Not intolerant so much as she wants supports for arguments (i.e. she wants you to think critically). Her knowledge of European culture and history is vast. If you pay attention and go to class you'll learn alot",
        "course": "GER409463"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "Helen Fehervary is not intolerant towards other people's views.  She likes to play Devils-Advocate, and challenge her students.  If you're prepared for class, she's prepared for class.  She is one of the most intelligent people I have ever met.  Just speak up if you're having trouble.",
        "course": "409"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Although she is a little unorganized, she is very knowledgeable, her classes are very interesting, you can find out a lot if you listen",
        "course": "GERMAN702"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "Had to drop the course.  She has the worst teaching style of any teacher I have ever had.  If you see her name as the teacher on the list, wait a quarter and see if it's a different teacher.",
        "course": "GERMAN401"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "Highly unhelpful and unorganized in terms of planning lectures and midterms. Turned class into political debates unrelated to the topic at hand, very intolerant of other viewpoints. Frequently cuts off students wishing to comment during  discussion.",
        "course": "GERMAN463"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Incredibly engaging, talented and passionate professor.  Students who want easy answers in life won't like her, but students who like to think about complicated problems will think highly of her.  Go to class with an open mind.",
        "course": "GERMAN701"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "incredibly disorganized, frequently goes on a tangent unrelated to materials, terrible mood swings and frequently makes students uncomfortable",
        "course": "GERM753"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.4,
    "department": "German",
    "firstName": "Bernhard",
    "id": "VGVhY2hlci0xMDYxMjU0",
    "lastName": "Malkmus",
    "legacyId": 1061254,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Although there is a fair amount of work in this class, the professor is great and keeps things interesting.",
        "course": "GERM2251"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "I had BM for German 463 and changed into his 630 section as soon as I heard he was teaching one. Easily one of the most helpful teachers ever!",
        "course": "GERM630"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor.  Really outstanding.  Herr Malkmus is friendly, organized, engaging, and just a joy to be around.  Everyone in my class loved him.  I would highly recommend taking any of his classes.",
        "course": "GER463"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very nice, funny and helpful. Course was very rigorous for 3 credit hours.",
        "course": "GERM303"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "GER301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Bill",
    "id": "VGVhY2hlci0xODQwNzkw",
    "lastName": "Baker",
    "legacyId": 1840790,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very fun professor. Keeps class interactive so you learn quicker. Seems like a pretty cool guy, he makes us laugh a lot. Homework is usually every night but it'll take about 10 minutes. I love German so I really enjoyed the class.",
        "course": "110101020"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Sophie",
    "id": "VGVhY2hlci0xNzc3NDIy",
    "lastName": "Lahr-Eigen",
    "legacyId": 1777422,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Sophie is so nice! She made 8 AM German fun.  Not super easy, but I learned a lot from her.  She is very funny and relateable.",
        "course": "GER1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.4,
    "department": "German",
    "firstName": "Luke",
    "id": "VGVhY2hlci0xNTQ0NTI5",
    "lastName": "Bauer",
    "legacyId": 1544529,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was definitely my favorite class because of Luke.  He made the material interesting and taught us much more than expected.  Instead of always following the department's lesson plans and books, we learned about current events and learned some slang.  Great teacher!!!!",
        "course": "GERMN1103"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Luke is a really cool guy. He is down to earth and real with his class. He is knowledgeable and helpful...and also easy on the eyes.",
        "course": "GERM1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Luke is a great guy and someone that I could probably be friends with. He knows his German, and is really talented with languages. However, he always seemed scattered and disorganized, and seemed like he hadn't had a decent amount of sleep in a very long time.  It was not uncommon for him to forget to bring things to class.",
        "course": "GERMA104"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "He was a fun teacher, had a great energy. Even though I hated German, his class wasn't too bad",
        "course": "GER104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher! Makes German easier to understand and makes class entertaining. Always willing to help when you need it and lenient when it comes to homework. Definitely recommended!",
        "course": "GRMN103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "German",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci0xNzYzNDA3",
    "lastName": "Schuman",
    "legacyId": 1763407,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "All the papers you right are one page papers, and have 4 and can rewrite two of them. You also have 4 short things about culture, and in class assignments. Easily get a B or higher.",
        "course": "GEMAN2251"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 5,
    "department": "German",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0xNjAwNTY2",
    "lastName": "Hancock",
    "legacyId": 1600566,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lizzie was fantastic. She made class interesting, cared about all of us in the class, and was super helpful. She's also British.. so it's fun listening to her accent haha.",
        "course": "GER1266"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great instructor...probably would've had a great grade if I ever studied with consistency. Ha.",
        "course": "1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lizzie is an awesome instructor. She explains the material in a way you can understand and is exceedingly helpful. I actually took 2 of her courses and both were excellent.",
        "course": "GER102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent Prof. Learned a great deal from Lizzie. Would recommend.",
        "course": "GERM1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very nice, and keeps class interesting.  Does good job of covering fundementals.  Very cute.",
        "course": "GER101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Linh",
    "id": "VGVhY2hlci0yMDkyMjc3",
    "lastName": "Vu",
    "legacyId": 2092277,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I switched from Spanish to German and it was one of the better decisions I made.  Linh was amazing and very helpful.",
        "course": "GERMAN110101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "German",
    "firstName": "Timothy ",
    "id": "VGVhY2hlci0yMDA2MjQ5",
    "lastName": "Reinhart",
    "legacyId": 2006249,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "One of the worst teachers i've ever had. For a foreign language teacher, he had to look up several words and phrases online because he didn't know them off hand. He would ask random questions during exams, wasn't helpful out of class and was extremely condescending. I learned nothing from him.",
        "course": "GER1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4,
    "department": "German",
    "firstName": "Gina",
    "id": "VGVhY2hlci0yMTEwNzc4",
    "lastName": "Wrobel",
    "legacyId": 2110778,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Gina is a great teacher! The class is a lot of work but you leave knowing so much more German than before. Homework is assigned daily & there are ongoing projects too. At times it felt like a lot, but it was manageable. She is very helpful, especially if you go to her office hours. Really cares about students. Would highly recommend her",
        "course": "GERMAN1103"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was strict on grading down to the umlauts over the letters, and capitalization of nouns. It seemed like no matter how hard I studied I could not improve my test or quiz grade. That was very frustrating. There was so much covered it such a short period of time. This was another reason the tests were difficult. However she was helpful on the rest",
        "course": "GER1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "German",
    "firstName": "William",
    "id": "VGVhY2hlci0yMjE4OTQ2",
    "lastName": "Baker",
    "legacyId": 2218946,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "He's a horrible teacher. He's rude and dismissive and will not give you a break. I ending up failing his class just because I didn't present homework for one unit, even though homework was not graded. I did so much work for his class and he screwed me over for no reason.",
        "course": "GER22712"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.9,
    "department": "German",
    "firstName": "Amber",
    "id": "VGVhY2hlci0xNTM3NDk1",
    "lastName": "Suggitt",
    "legacyId": 1537495,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Be ready to really learn a whole lot in her class. It's very much learn a topic, and practice it until you get it. Participation is part of her grading and she is kinda picky about it. Loved the class and loved the professor",
        "course": "GR201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amber expects more as you progress through German courses. She's very smart and even more helpful. ",
        "course": "GR202"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Instructor was demanding but exceptionally helpful. You will learn a LOT from her. I actually considered taking another of the classes she teaches even though it wasn't required for my major.",
        "course": "GER104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Outstanding instructor. She created a classroom atmosphere conducive to participation and served as an excellent moderator for discussion. The content was also interesting and contributed to my intellectual growth. This was the best class I took at tOSU.",
        "course": "GER250"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "More demanding than other german instructors, but extremely helpful.  Willing to review concepts from earlier courses.  Very very nice.",
        "course": "GER104"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's a nice lady, and if there's something from an earlier class (101-103) that you don't understand she's eager to help. no complaints",
        "course": "GER104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.1,
    "department": "German",
    "firstName": "Stephanie",
    "id": "VGVhY2hlci0yMTE1MDE5",
    "lastName": "Walford",
    "legacyId": 2115019,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great teacher and cares about the material. She was happy to be in class and teach new topics and has a great sense of humor. The course does require a bit of time outside of class to study vocabulary, just like any language class does. Overall not too difficult.  One of the best professors I have ever had.",
        "course": "GERMAN1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is very clear in what she requires for the course.  Also, she is HILARIOUS.",
        "course": "GER1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "stephanie is always really upbeat and her lessons are a lot of fun. ive always found german really hard but ive gotten a lot better after having stephanie as an instructor. she explains things really clearly but is also always available to help you out after class or in her office hours. she also just really chill and nice.",
        "course": "GERMAN1102"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "she was a terrible teacher. very rude and was not very good at explaining the topics well.",
        "course": "GERM1110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I actually wanted to come to class because she made every lesson fun and memorable!",
        "course": "GERMAN1101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Made a course I was scared to take feel very manageable. It's not easy to learn a language in a college environment because it can be embarrassing at times to mispronounce things and difficult to keep up with new info, but Steph was knowledgeable and made it easier to succeed. Great personality, excellent sense of humor. Highly recommend!",
        "course": "GERM1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "AND she's from England so she has a rad accent ",
        "course": "GERMAN1101"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Stephanie is an excellent German teacher. I had to take the class for my major and wasn't looking forward to the mandatory credit, but I was pleased to have a teacher who knows the subject, makes it easy to comprehend, who understands students' situations, and who is on the level of John Oliver and Ricky Gervais as a great British comedian.",
        "course": "GER1101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Stephanie is always willing to take time to help students. Her sense of humor is very dry (British), but also very funny. She takes care to use aural, visual, and sometimes kinesthetic teaching styles, to ensure that all of her students are being considered. An excellent instructor.",
        "course": "GER020"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "This was my favorite class at OSU. Steph was more than willing to stay at extended hours in her office to help and constantly checked her email. I don't have one bad thing to say. I would 10/10 recommend to a friend. She actually made it fun and answered any and all questions repeatedly if necessary!",
        "course": "GERMAN1101"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "Horrible",
        "course": "GER211"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.8,
    "department": "German",
    "firstName": "CJ",
    "id": "VGVhY2hlci0xMTA1ODY0",
    "lastName": "Brown",
    "legacyId": 1105864,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Had him for three courses- 101, 102, and 104! Would not have wanted it another way.",
        "course": "GERMN104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "CJ is frickin gawd allmighty!!  I loooove him, plus he's hawt with them piercings!!  His class is a blast!",
        "course": "GER101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "A really great teacher. He is like another student. I truly enjoyed his class.",
        "course": "GER101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "German",
    "firstName": "Tung",
    "id": "VGVhY2hlci0xODkyODE2",
    "lastName": "Chu",
    "legacyId": 1892816,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Herr Chu is a fantastic teacher! Fun, engaging, and helpful. You can tell that he wants his students to succeed. Email communication was sometimes a bit slow but he constantly encouraged us to see him in his office hours. Recommended!",
        "course": "GERMAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite classes, one of my favorite teachers! He's a native speaker, so he knows what he's talking about. Great sense of humor, very energetic, and enthustiastic about teaching German. Gives also good feedback. I will definitely take another class with him.",
        "course": "GERMAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "German",
    "firstName": "Alice",
    "id": "VGVhY2hlci0xODY1NDMw",
    "lastName": "Schlingman",
    "legacyId": 1865430,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really chill, super awesome, and lots of fun!",
        "course": "GERMAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Simple explanations, speaks clearly, great professor.",
        "course": "UPDATEDAUGUST"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.5,
    "department": "German",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0xMzM5NjM5",
    "lastName": "Luly",
    "legacyId": 1339639,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Exceptional German speaker who seemed to know what she was doing.  She was kind and accommodating for the most part.  The class was difficult only for those students who didn't really belong in the class to begin with.  If you show up to class and put in some effort, you'll do well.",
        "course": "GER104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "One word to describe Sara- AWESOME! She was very laid back and communicated very clearly with us. She realized learning a foreign language is not easy, so she made it a worth-wild experience and engaged us to learn. She joked with us and made us feel comfortable, which is important when speaking in front of other people in another language.",
        "course": "GER104"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "she's very funny and to the point. she swears a lot and can't spell for her life. as long as you write your essays on time and they are pretty decent(put effort into it) she usually grades easy. overall, very cool and relaxed and the class is all about fairytales so it's kinda interesting anyway. participation seems to be a plus for her,so speak up",
        "course": "GERMA250"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "German",
    "firstName": "Marie",
    "id": "VGVhY2hlci0xNTc2NzM1",
    "lastName": "Malkmus",
    "legacyId": 1576735,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Marie is very nice, but I found her grading unreasonable at times.I am a very good writer and still received C papers in her class.  None of them were C papers, and several were meant to be personal opinions and yet I was critiqued for leaving ideas out that in my opinion didn't pertain to my writing. Be warned, she hardly gives A papers.",
        "course": "GERM367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.3,
    "department": "German",
    "firstName": "Kyle",
    "id": "VGVhY2hlci0xNTQ1MDk1",
    "lastName": "Kissell",
    "legacyId": 1545095,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "He is a nice guy but I found myself falling behind in class. Nothing against him I just didnt care for his teaching style.",
        "course": "GER102"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "This man.. let me tell you. He is a very strange one. You'll usually find him with a mismatched button shirt and ink all over himself. Class was manageable, tests semi hard.. study the culture and you'll do well.",
        "course": "GERM103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.5,
    "department": "German",
    "firstName": "Tom",
    "id": "VGVhY2hlci0xMTEzNzAw",
    "lastName": "Stefaniuk",
    "legacyId": 1113700,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class.  There were quite a few assignments, but they didn't take long and were usually helpful.  The outofclass activities also kept things interesting.",
        "course": "GERMA104"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Tom was a great teacher.  He was a fair grader and made learning German interesting.  He has lots of great stories to tell which sometimes takes away from in-class learning, but coming to class is definately fun.  For a foreign language he gave out an appropriate amount hw per class and graded it very easily.",
        "course": "GER104"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "A lot of busy work was assigned during this class. It was pretty pointless and when he explained things, you really never fully understood what was going on until you asked your classmates. He sends out extra homework assignments at 12 p.m. and focuses on his 'favorites' in class. DEFINITELY would've chosen another teacher over him knowing this.",
        "course": "GER104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Tom is so hot that it is distracting.  He is tall and ha beautiful eyes and when he talks in german all of the girls in the class just melt.  He is a really nice guy though.  He's kind of a hard grader for a german class.  Its the only german class i ever didnt get an A in.",
        "course": "GERMA104"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "He definitely assigns a lot of busy work that doesn't seem to help much.  A lot of times he waits until the last minute of class to take quizzes and hand back graded work.  I'm almost always late for my next class.  Class is pointless sometimes, other than to hand in assignments.  If given a choice, I'd take German 104 with someone else.",
        "course": "GER104"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "He definitely assigns a lot of useless busy work.  Sometimes he's very vague when he gives assignments. If you don't understand something, ask him.  He explains things very well once you ask a particular question. I find class to be rather unhelpful at times. If I had a choice, I'd pick another instructor over him.",
        "course": "GER104"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "He was an awesome teacher. Assigns a lot of busy work, but a very leniant grader! Pretty laid back.",
        "course": "GERMA104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "German",
    "firstName": "Nicholas",
    "id": "VGVhY2hlci0xMjU3Mjgy",
    "lastName": "Spindel",
    "legacyId": 1257282,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good class! Not hard if you show up and do the homework. Annoying daily quizzes but other than that a fairly good time, and that's saying a lot being that it was at 8:30 everyday!",
        "course": "GERM103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Herr Spindel was probably the best professor I've had at OSU. He's an extremely helpful and makes me look forward to going to German everyday. He prepares you very well for the test/quizzes making the class fairly easy, if you do the homework. He assigns a lot of homework, but it takes at most a half hour every night to complete. Great Prof!",
        "course": "GERM101"
      }
    ],
    "SEI": []
  }
]