[
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.3,
    "department": "Greek",
    "firstName": "Georgios",
    "id": "VGVhY2hlci0xODExOTIw",
    "lastName": "Anagnostou",
    "legacyId": 1811920,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great guy and fairly easy class. Unfortunately no grades were put in Carmen all semester so I didnt know where I stood until I got my final grade.",
        "course": "MDRNGRK2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is the best!!!!!! Easy A",
        "course": "MDRNGRK2000"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very passionate and intelligent. I really enjoyed him as a teacher. However, there is a lot of reading, so be aware of that. Also, exams can be a little difficult, so make sure you pay attention to the readings and lecture throughout the class. Many topics are very interesting, others not so much. Overall, I really like him.",
        "course": "MDRNGRK2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Greek",
    "firstName": "Anna",
    "id": "VGVhY2hlci0xMzA4Nzc4",
    "lastName": "Peterson",
    "legacyId": 1308778,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anna was great.  She was easygoing, and I agree with the previous rater's description of her having an &quot;excellent rapport with students.&quot;  If you show up and do the assignments, you will get an A.",
        "course": "LATIN614"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy weekly quizzes, attend class and you should be fine. Anna is very nice and helpful, and definitely an easy grader.",
        "course": "CLASS322"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anna is incredibly helpful, intelligent, and easygoing. she has a great rapport with students. Take her classes. That is all.",
        "course": "CLS322"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really nice and straightforward.  Translate 30 or so lines per day for homework.  Class consists of translating.  The final project was really fun: translating 20 or so lines of poetry into colloquial English.  The class average for the class was 92.8%.",
        "course": "LATIN206"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Greek",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0xMjU4MzQx",
    "lastName": "Dubina",
    "legacyId": 1258341,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dubina is extrememly helpful, you can tell she wants you to succeed.  She tries her best to make the subject matter interesting, however, when the subject matter is Latin grammar, that's nearly impossible.  She will work with you if you need it.  Come to class every day, because there's probably a quiz.  Great teacher!",
        "course": "LATIN103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Didn't read much went to her recitation and aced most of the quizzes. I recommend taking this class with Ric Rader and Dubina as your TA.",
        "course": "CLASS222"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.5,
    "department": "Greek",
    "firstName": "Roderick",
    "id": "VGVhY2hlci0xMjg0ODI3",
    "lastName": "Saxey",
    "legacyId": 1284827,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Roderick was an awesome TA, I learned a lot from him. Very helpful! Brought in other stories that made the myths more understandable. He needs to talk louder but he added a lot that the main professor didn't talk about. Quirky sense of humor. Easy grader, do all the readings and you've got an A, my grade was higher than I expected.",
        "course": "CLASS222"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "He was amazing! Really good. Knows a lot and helps you understand. I would definitely take his class again.",
        "course": "CLSCS101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nice guy, very helpful and you can tell he wants to help you understand.  He'll explain things after class if you ask him. He sometimes goes off on tangents, but you'll learn a lot if you pay attention.",
        "course": "CLAS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Greek",
    "firstName": "Calliopi",
    "id": "VGVhY2hlci0xMDg1MDY4",
    "lastName": "Dourou",
    "legacyId": 1085068,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best prof I have ever had! She was the nicest person ever and would do anything to help her students. You were always prepared for any tests or quizzes and learned a lot.",
        "course": "MDNGR103"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is the best instructor I have ever experienced in college. She is very understand and kind and does anything possible to help you. I would recommend her class to anyone. I love it when she brings Greek food for the class as well!",
        "course": "MDNGR102"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Love Calliopi... she's so helpful and nice.  She does spoil us though... Couldn't ask for a better prof",
        "course": "GREEK103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "I wish I had another class with Mrs Dourou! She should get nominated for best Teacher!",
        "course": "GREEK102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Calliopi is amazing. She's really funny and makes the class a lot of fun to attend even when you are learning grammar. She is always willing to help and re-explain something if people don't understand. She works with students and gives them choices and takes their comments in to consideration. One of the best professors I have ever had.",
        "course": "GREEK101"
      }
    ],
    "SEI": []
  }
]