[
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Health Information Science",
    "firstName": "Kristen",
    "lastName": "Heitman",
    "legacyId": 3074769,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Professor Heitman is just not it. Spent well over 2 hours working on one assignment just to get a 60% for doing essentially one part wrong. Did not feel like I deserved that low of a grade for the work I put in."
      }
    ]
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2,
    "department": "Health Information Science",
    "firstName": "Teresa",
    "id": "VGVhY2hlci0yODQyMjc4",
    "lastName": "Gueth",
    "legacyId": 2842278,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The professor is an extremely tough grader and doesn't follow her grading rubrics. Points are removed from discussion board posts with no explanations. Other professors of the class are much more caring, provide 2 attempts on quizzes, explain point deductions, etc. I highly recommend taking Ethics of Healthcare with anyone else!!",
        "course": "4000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Would not answer an email all semester and did not abide by her own rubrics",
        "course": "5300"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "Professor's rubrics are not clear and leaves aggressive comments on assignments. Professor also refuses to answer email.",
        "course": "5300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "super nice professor and class was totally managable",
        "course": "3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Health Information Science",
    "firstName": "Kristen",
    "id": "VGVhY2hlci0zMDc0NzY5",
    "lastName": "Heitman",
    "legacyId": 3074769,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Professor Heitman is just not it. Spent well over 2 hours working on one assignment just to get a 60% for doing essentially one part wrong. Did not feel like I deserved that low of a grade for the work I put in.",
        "course": "HTHRHSC4900"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.4,
    "department": "Health Information Science",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0yMjkzNDE1",
    "lastName": "Olejownik",
    "legacyId": 2293415,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Hated her a lot! She grades hard for work that really doesn't matter, even took off points for something not being long enough when it was an opinion with no rubric whatsoever. There is a lot of work for no reason. I hated this class more than anything, would rather have an 8 am every day instead of having to take this class with her even again. ",
        "course": "HTHRHSC4570"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Olejownik was a great professor! Very soft spoken and you can tell she really understands what she's teaching! I would definitely take a class by her again. ",
        "course": "HTHRHSC2530"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class does have a lot of assignments but they are actually really interesting and tie into the course nicely. I have had Jennifer for 2 other classes and have nothing but good things to say about her. She is easy to contact and always willing to help. 10/10 ",
        "course": "HTHRHSC4570"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this class for HRS Health Sci course elective, terrible professor, WAY too much work for an elective, take something easier bro.",
        "course": "HRS4570"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very nice professor. Interesting content but need to put in work for good grades. ",
        "course": "HRS2530"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Olejownik is knowledgeable in her field, but thinks this class is more important than it is. Her exams are too hard, she gives out WAY too much lecture and reading material and she expects you to dedicate so much time to this class. TONS of group work, isn't clear about the format of exams at all. Doesn't answer questions clearly. Do not take. ",
        "course": "HRS4570"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class was a fairly easy A, but the prof can be unorganized which made the course frustrating. Weekly reflections, 4 exams, no final or midterm, 1 group project, and a few homework assignments. Attendance counts so make sure you show up &amp; get the attendance code.",
        "course": "HTHRHSC4570"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite class and professor ever. Group assignments weekly, proctored midterms, and 2 books read throughout the semester with weekly quizzes. Definitely some work but extremely thought provoking and worth it.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is my favorite professor I have ever taken. Her classes are interesting and she is awesome. Midterms are proctored so you need to study, there is a group assignment almost every week with a final group project at the end of the semester, and you read a book throughout the semester with weekly reflections. Definitely need to put in work",
        "course": "HTHRHSC4570"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class, while somewhat challenging, is very informative and Dr. O makes it interesting and interactive! She is very tuned in to the struggles of students and is flexible with extensions and changing formats. She does what is in the best interest of students and is always willing to clarify and give feedback when asked!",
        "course": "HRS4570"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. JO was one of my favorite professors at Ohio State and I highly recommend her integrative medicine course. She is an extremely knowledgeable professor with countless personal experiences that make for a unique and interesting class everyday. If you aspire to work in medicine, you will benefit tremendously from taking this course with her.",
        "course": "HTHRHSC4570"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "Took her online and you need the books because youre quizzed on them every week. It was way too much work for a 2000 level course and everything is worth so little points too for so much work. She is understanding and lets you vote on when you want the exams but I would not take this class again.",
        "course": "HRS2530"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. O is a great professor but I have never taken an online class with such a heavy work load. Out of the 6 total online classes I've taken this semester and the 15+ I've ever taken, this one by far has the most reading material, videos, lectures, homework, group work, and assignments. It was ridiculous for a 2000 level class in my opinion.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Olejownik really succeeded at making this class engaging in an online setting. I enjoyed the group participation that occurred throughout the semester. It replicated that in class feel. The class was interesting, balanced, and rewarding. She easily answered questions. A great prof who has impacted my life inside and out of the classroom.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "This was my favorite class so far at Ohio State! I did not know much about Integrative medicine before this class. Each week I eager to learn about a different aspect of alternative medicine. Dr. Olejownik did a great job of organizing a class that was interesting, engaging, and enjoyable! I feel blessed to have been her student. MUST TAKE!",
        "course": "HTHRHSC4570"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "I took this integrative medicine course for the minor. Its an interesting course but her lectures are long and dry. She gives out so much information when a majority of it is not needed. do the group work,and  its an easy class. But studying for exams can be difficult, but she did give a study guide for midterm. Attendance is required for grade",
        "course": "HRS4570"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jennifer was one of the most organized professors I have ever had. Each week, she laid out a day-by-day schedule (for your benefit) that you could follow in order to stay on top of each assignment. There is multiple group work and assignments in order to mimic a classroom setting. The course content was interesting and very inspirational.",
        "course": "HTHRHSC2530"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "She is by far the most unorganized professor I've ever had. She isn't clear in her grading criteria. She can be very pretentious. The content of the class is not difficult, and you can still get a good grade, but it is very time consuming. She thinks the class is more important than it is. She told a group they may have to meet on Thanksgiving.",
        "course": "HTHRHSC4300"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Olejownik is incredibly unorganized. I took this integrative medicine course online and while it is supposed to be an interesting and relatively easy course her grading style and lack of clarity made it difficult to get the grade I desired. You are required to get two textbooks.",
        "course": "HTHRHSC4570"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 3,
        "comment": "I am about to graduate from OSU and Dr. Olejownik is the most unorganized, unclear, and overall confusing professor I have ever had. She doesn't give you instructions and is literally so unorganized that she has confused herself on multiple times this semester. Take a different professor! This shouldn't be a tough course, but with her it is.",
        "course": "HRS4570"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Health Information Science",
    "firstName": "Aubrie",
    "id": "VGVhY2hlci0yNzkyMDUx",
    "lastName": "Sanchez",
    "legacyId": 2792051,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "The content is moderately challenging but do not email her with any issue because she's extremely unprofessional and not flexible at all. Do not recommend. ",
        "course": "HTHRHSC2500"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor was great and the class was very straight forward. It consisted of roughly 5 midterms which were very easy in difficulty and then weekly assignments. I would say I spent maybe an hour per week on the course and ended with a 99. Highly recommend.",
        "course": "HTHRHSC2500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.6,
    "department": "Health Information Science",
    "firstName": "David",
    "id": "VGVhY2hlci0yODEwNjI1",
    "lastName": "Ellsworth",
    "legacyId": 2810625,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Useless assignments that don't teach us anything. Made us download sketchy software onto our devices that no other professor has ever made us do. Overall, sadly, a complete waste of time ",
        "course": "HTHRHSC4370"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "The class content is a bit difficult. The exams are proctored so you need to study. However, if you study ahead of time and review the study guide (which he gives ahead of time), you will do well in the class. ",
        "course": "HTHRHSC4370"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "He was not interested in teaching at all, none of his lectures are his own. Packback is useless and you pull subjects out of thin air every week for just 3 points, he also lied about all of us students who emailed him issues, takes pride in people doing poorly in his class.",
        "course": "HTHRHSC4370"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "The summer semester is definitely at a faster pace. But if you watch all the lectures and fill out the study guide, you should get good scores on the tests. Professor Ellsworth is very caring and accessible outside of class. He did all he could to accommodate for any issues that I faced and was very understanding as well. ",
        "course": "HTHRHSC4370"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Ellsworth provided a lot of difficult information but nothing too crazy. The tests are proctored but if you study well and take notes, the tests are a breeze. It is a difficult class but certainly not impossible to pass. Main factors are the tests and one big project. If you put in the work, you can easily pass the class.",
        "course": "HTHRHSC4370"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Tests are extremely difficult and proctored. He does not communicate well and the class was made way more difficult than it needed to be. There are little things graded besides tests, a group project, and using packback.",
        "course": "HTHRHSC4370"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Ellsworth is one of those professors that makes it their personal mission to make the class WAY tougher than it needs to be. Tests are PROCTORED! The material is not terrible but his methods are. ",
        "course": "HTHRHSC4370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Health Information Science",
    "firstName": "Kristen",
    "id": "VGVhY2hlci0yNTg5MjA5",
    "lastName": "Welker",
    "legacyId": 2589209,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Exams are very straightforward and if you understand what is going on in class you'll do fine on the exams. There is a semester long group project but it is broken up into parts and very mangable. Kristen Welker is very kind and tries to make class as interesting and fun as possible. Weekly discussion post can be annoying but they are easy points. ",
        "course": "HTHRHC3400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Love Dr. Welker! I took the class for Health & Wellbeing theme- great decision. She gives weekly quizzes with unlimited attempts and weekly discussion posts. We had one group project that went basically the whole semester that wasn't that hard and she gave very clear instructions for it. Lectures are interesting and she is nice and really funny. ",
        "course": "HTHRHC3400"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "By far my favorite professor I have had so far at OSU. Expectations are clear and manageable. She cares about her students and wants them to succeed. Would absolutely recommend taking her class.",
        "course": "HTHRHSC4950"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "An overall awesome professor. There are short weekly quizzes with multiple attempts, midterms are very doable and a few easy projects. Her class is straightforward and interesting and she is so sweet",
        "course": "HTHRHC3400"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Love Professor Welker, she really cares about what she is teaching! There's a decent amount of lectures but the assignments, tests and projects are very reasonable. Really loved all my classes with her.",
        "course": "HTHRHSC4000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Dr. Welker! She is new to OSU but is by far my favorite teacher. She is funny, relatable, and really cares for her students! Her tests are fair and she doesn't throw any curveballs. She says you need the book, but you don't need it. She made this class really interesting!",
        "course": "HTHRHSC4950"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.7,
    "department": "Health Information Science",
    "firstName": "Carl",
    "id": "VGVhY2hlci0yNDg1ODUw",
    "lastName": "Maresh",
    "legacyId": 2485850,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Exams are 100% of your grade. He's retiring this year, so he was happier while teaching his lectures, actually showed some personality which was great. He's an amazingly accomplished man and a great resource. The amazing man had some amazingly specific and difficult exam questions. Overall, he was a good and less bitter professor than expected.slay",
        "course": "KNHES3414"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "This class is graded on 3 exams only, they are take home and they mostly consist of what was on the slides. The slides and this professor how ever, are very redundant. The professor spends the majority of the time talking about his accomplishments, how much money professions make, and his buddies that he had on his journey in exercise science.",
        "course": "KHNES2360"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took Dr. Maresh's intro to exercise science class and had no issues. If you have any issues or concerns with anything he is easy to reach and fair at making adjustments. His lectures can be tough to sit through as he only reads off the slides, but they are important for the 4 exams which are the only grades in the class. ",
        "course": "KHNES2360"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "Hes alright, I had him last semester for 2360 and finishing this semester with him as well in 3414. All he does is read the lecture slides nothing else to elaborate the material. The book feels useless bc he puts questions on the quizzes that make no sense. Grades are strictly quizzes so study often.",
        "course": "KNHES3414"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Would not recommend this professor to anyone. Had him last semester for 2360 and it was fine because the content wasn't that hard. This was awful. Content was so hard and only thing he did was record himself reading the lecture slides. Only grades are exams and many questions are not covered in the textbook or lecture. Nice guy but DO NOT TAKE HIM",
        "course": "KNHES3414"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Exams are your only grades for the class. I took this online during covid - and the recorded lectures were really long. Im not sure if itd be the same in person, but the lectures are really interesting. Study at least a couple times thru the week and youre good",
        "course": "KNHES2360"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Maresh taught Intro to Exercise Science and that class was probably one of my favorite classes I've taken so far at Ohio State. There are only 3 grades for 3 tests so your final grade depends on your performance, but if you attend class, review lecture slides, and study, it's super easy. Dr. Maresh is old school, but a true gem.",
        "course": "KHNES2360"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "awful.",
        "course": "KNHES3414"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Grade is strictly determined by test score. Many tests questions are not covered in lecture.",
        "course": "KNHES3414"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 1.8,
    "department": "Health Information Science",
    "firstName": "Manjusri MJ",
    "id": "VGVhY2hlci0yNTM3Mjc5",
    "lastName": "Nguyen",
    "legacyId": 2537279,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Just all around horrible.",
        "course": "HIMS5655"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "This is not a heavy class; however, it is all self taught. I did not learn anything from him. He assigns a textbook in the start of the semester and that is where most of your homework is from. I learned a lot in the class, just not anything from him. He does help when you email him, so if you're struggling try that.",
        "course": "HIMS5648"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "This professor does not understand the role of teaching. This course is 100% self learning with little to no direction from professor or TA. I passed this class only because I put in twice as much work outside of class researching the items I wasnt taught. Quizzes were filled with errors and grading was extremely arbitrary.",
        "course": "HIMS5655"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very manageable class, not a ton of work (2ish assignments/week), enjoyable (but tedious) assignments from a textbook. Seems to be a very fair grader. I'm waiting on numerous grades with only a few weeks in the semester left, one from over two months ago. If you don't mind waiting for grades, take this class! He's very kind and accessible by email.",
        "course": "HIMS5648"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Terrible. Carmen page is very hard to follow, quizzes are ridiculous with the types of questions asked. Does not grade anything at all, It has been a month in and no graders were entered and there have been 2+ assignments per week. assignments are also misleading and very open to interpretation. Guidelines are not set and very unclear. DO NOT TAKE",
        "course": "HIMS5648"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Health Information Science",
    "firstName": "Adam",
    "id": "VGVhY2hlci0yOTAzMDE3",
    "lastName": "Snyder",
    "legacyId": 2903017,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Attendance is pretty strict, easy class besides that. A page of notes were allowed on the midterm and final.",
        "course": "HTHRHSC4000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Overall good prof; really caring, friendly, and approachable. The lectures can get pretty boring and there was mandatory group work every week. His attendance policy is crazy strict so if you have a habit of skipping class don't take his class- you will fail. If you get the attendance points the rest of the class is easy to pass in my opinion",
        "course": "HTHRHSC4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 1.2,
    "department": "Health Information Science",
    "firstName": "Julie",
    "id": "VGVhY2hlci0yNTA1NjQ2",
    "lastName": "Young",
    "legacyId": 2505646,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Course is well organized within Carmen, modules are laid out week by week which is helpful. This professor re-uses all of her course content, seems uninterested in helping students, and is extremely inaccessible in terms of being able to meet. Difficult exams. A bad experience, I highly recommend you take this course with a different professor. ",
        "course": "HTHRHSC5900"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class was a breeze. Very easy A! comprehension quizzes and weekly check ins were completion points. There are 3 exams in this class, which are fairly easy if you watch the lectures (didn’t touch the text book). I had very little interaction with the professor and she as very vague in the review sessions. Luckily, the class is straightforward. ",
        "course": "HRS5900"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her lecture videos don't give half of the information that will be on the exam or test. Not just me saying that, everyone in the class was stating how hard and not fair how the course was ran.",
        "course": "HTHRHSC5900"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "this professor was the worst professor ive had. doesnt care about her students at all. three exams and if you fail one your grade will suffer. half the class failed a midterm and she didnt offer a curve. her lectures are vague and test questions are extremely specific.",
        "course": "HTHRSC5900"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Learned more about her daughter and her research then I did any content for the class",
        "course": "HRS5900"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrid, horrid teacher. I really cant emphasize how bad she is. A lot of the bad stuff she did has already been hit with the other reviews but theres more. she plagiarized one of our final quizzes, the answer to one of the questions was a different professor. Shame we pay all this money for this awfuL teacher to get pushed out in front of us. Run",
        "course": "HTHRHSC5900"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "It's a shame rate my professor does not offer a rating of 0/5 because that's what she deserves to get. It's hysterical how little she cares about her students. I would rather go through a full year Organic Chemistry again than have her as a professor. The most unorganized professor at this university. If you have to have her I send my condolences.",
        "course": "HTHRHSC5900"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Does Professor Young even want to be here? doesn't care about the students.. all too often her quizzes are not consistent with the material teaches. also her carmen page is near impossible to navigate. worst teacher i've had at OSU. avoid",
        "course": "HTHRHSC5900"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "VERY softly speaking through material, poorly explaining her way through haphazardly made pptx, and fumbling her disjointed Carmen page. Worst of all, she doesn't care about your success. Upon missing a week and a half of class before a midterm, when asked if &quot;she could upload review Q's&quot;, she said &quot;No, that would take too long&quot; Take anyone else.",
        "course": "HTHRHSC5900"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst instructor ever! She literally copied and pasted the course content from the other instructor. She does not know what's going on the course, and does not seem care about her students. Even not responding emails before my final.",
        "course": "HTHRHSC5900"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "What I thought was going to be an enjoyable class ended up being plain awful. Only a few assignments worth very little, one bad score literally wrecks your overall grade. Hard to recover. Instructor seemed really disorganized and was difficult to communicate with via email. The final is extremely time consuming and detailed. Avoid if you can.",
        "course": "HTHRHSC5900"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Horrible experience. Never have had an online course managed so poorly. Deleted assignments and inability to respond to student questions. What should've been a fairly easy A has been abolished by her own incompetence. Does not seem to care about her students.",
        "course": "HTHRHSC5900"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible Experience. The class was only quizzes and exams. The content was very unorganized making it hard to study for exams. She seemed to not care about her students or their success.",
        "course": "HTHRHSC5900"
      }
    ],
    "SEI": []
  }
]