[
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.9,
    "department": "Hebrew",
    "firstName": "Galit",
    "id": "VGVhY2hlci0yNTE5ODIy",
    "lastName": "Golan",
    "legacyId": 2519822,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Galit genuinely cares about her students, she makes sure we understand the material well and will explain it if we dont. Easily my favorite professor so far.",
        "course": "HEBREW1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Galit is one of the nicest professors I had throughout college. I had her for Hebrew 1101, 1102, 1103, and 2105. She was always thoughtful and helped whenever any students needed it. She always lets her students know that the priority is to try your best and keep practicing if you don't get it right. She tries to make class fun and engaging too!",
        "course": "HEBREW2105"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Galit really cares about her students and is very approachable both in and out of class. Participating in class is very important (both for learning and grades). She is very willing to work with students where they are at and is focused mainly on growth. Always ask questions because she gives really good answers and may adjust her lessons for them.",
        "course": "HEBREW1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Galit is the best professor I've had in my entire college career. I've never had a professor say they care so much about my success and actually shows it. I have taken HEBREW 1101-1103 with her and am now taking 2105. I cannot recommend her enough. She doesn't try and trick you, and teaches a hard language in a way that is so well organized.",
        "course": "HEBREW1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Galit is one of the best professors I have had at OSU. She cares SO much about her students and will do whatever it takes for you to succeed. Her class was super fun and ended up being one of my favorites. Attendance is mandatory but if you come to class it's very manageable. 10/10 recommend!",
        "course": "HEB1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Galit is very hands on. She makes sure you know what your doing. Her goal isnt to cram but to actually teach. She wants you to learn and will do everything possible to help you get a good grade!",
        "course": "HEBREW1101"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really love Galit! I am filling out a ratemyprofessor form for her because I was shocked to see that she didn't have any reviews! Galit is charismatic and caring. She knows how to make class fun while also clearly explaining concepts. I absolutely recommend taking her. I believe she has actually won a couple awards for her teaching!",
        "course": "HEB1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.6,
    "department": "Hebrew",
    "firstName": "Tyler",
    "id": "VGVhY2hlci0xNzc2NzY3",
    "lastName": "Yoder",
    "legacyId": 1776767,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "If you want an easy class this is not for you. He expects a lot from his students so expect to work nonstop on his class. His exams are all fill in the blank and his review sheets are way to long to actually help you. He's a nice guy and means well but honestly his class is the worst.",
        "course": "HEBREW2703"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Don't take his class if you just want an easy ge course. He grades papers/exams strictly and requires footnote format. There are multiple texts/books to read and the lectures are boring and unnecessarily complicated. The exam has many questions don't list the story making it difficult since you read around 4-8 stories a week.",
        "course": "NELC3700"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Tyler is a nice guy and cares about what he teaches. However, his lectures a very boring and the work he gives is often just busy work. He makes the class much harder than it needs to be. The class is a lot of work, don't take it if you're looking for an easy class to fulfill a requirement",
        "course": "HEB2700"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Tyler is the nicest guy ever. He is a fantastic teacher! The class is a ton of work but it's really rewarding. If you put in the time and effort to do the reading assignments the class is an easy A. He curves the midterm and final a lot. The daily quizzes help bring up your grade. I would definitely recommend Tyler as a teacher!",
        "course": "HEB2700"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Tyler is great teacher! He presents the material extremely well and is so helpful! The class is a lot of work but so worth it. It is also very possible to get an A if you just complete the homeworks and study for the midterm and final. I would definitely recommend this class and Tyler to anyone!",
        "course": "HEB2700"
      }
    ],
    "SEI": []
  }
]