[
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.7,
    "department": "Hospitality",
    "firstName": "Thomas",
    "id": "VGVhY2hlci0zMTM3Njc=",
    "lastName": "George",
    "legacyId": 313767,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "This guy is straight up terrible in his last quarter of teaching.  It is almost like he wanted his last quarter to be as disorganized as his first.  Avoid this guy like the plague that he is!",
        "course": "HSP560"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "George was nice, i like his extra credit which give me lots of points which makes your grade from C to B. You must need to COME to class everyday. 561 was hard for me, 560 is so-so, but the extra credit helps a lot. 560 extra credit was paper, 561 is problems.",
        "course": "HOSP561"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "i thought 560 was a lot easier than 561. He gets all his test questions from the book so if you want an A, you basically have to read the book cover to cover--just going to class everyday isn't enough. He would tell you to study certain info and then totally different info was on the exams. I studied a good amount and got a 89%",
        "course": "HM561"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "must buy book or go to class. lectures are dry... reeeally dry, but he's a nice enough guy and will help you if you ask him anything directly. not like you can avoid him so i'd say go to every class and try your hardest to pay attention, some material on tests is a little surprising. easy material, but you need to know what the prof expects.",
        "course": "HSPMG560"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Yeah I know the lectures are a bit dry, but he knows his stuff. 400 is a very interesting class and I wish I would have gone more. 560 is boring and 561 is a little difficult since it is accounting...but he is so nice and always willing to help.",
        "course": "HM561"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Nice guy.  Interesting class and learn a lot!",
        "course": "HM400"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Teacher at first hard to like, yells alot and sometimes rude. No impulse to want to go to class and still got a C. Puts powerpoints on carmen but leaves certain things blank that you have to get in class. Each class very boring. Papers with partners suck/little point value and short answers on test very detailed and alot of points. Read the book",
        "course": "HM400"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor might seem mean the first day but don't let him fool you.  Hes a good guy who knows the stuff and grades lightly on short answer questions.  Exams are likely to be 30 Truth/False questions and rest on short answers questions.  As long as you attend most of the lectures and take down the notes, study the night before, you are set for an A.",
        "course": "HM560"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "he needs to retire. he's old, boring, and i'd rather pluck my eyelashes than sit through his lectures. you have no choice tho... if youre in this major, youre stuck with him at least 3 times",
        "course": "400560561"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Reads directly from the overheads or straight from the book.   Uses the same tests each quarter so it is easy to study off of other students tests if you feel the need.  Yells a lot and doesn't really teach.  Expects students to already know everything",
        "course": "HM560AND561"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "still uses transparencies, be ready for lot of t/f, 400- just not a good class, bad material, 560- study all lists, &quot;short answer&quot; = lists/definitions, 561- accounting, what i thought would be the most hard was the easiest of them all, not a bad prof, expects a lot, very knowledgable",
        "course": "400560561"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "Not the best... tests ask very basic and very detailed questions... a lot from the book so if you dont read your book, this will be hard.  Could be an interesting class but he chooses to make it as boring as possible.  Arrogant and somewhat rude.  Called my class dumb.",
        "course": "HM400"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "This teacher seems to know his stuff.  The only problem is that he does not give you a clear idea of the test format and what is going to be covered.",
        "course": "HOS400"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "I must agree. His personality was not one that made the classroom environment open to learning. Most of the material he asked for on the tests no doubt will prove to be useless in life. One of the worst HM classes offered at OSU!",
        "course": "HM400"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst Prof. I have EVER had.  Obviously doesn't know enough to be teaching about the industry.  Spiteful, rude.  Avoid him AT ALL COSTS!!",
        "course": "HM400560"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 2.9,
    "department": "Hospitality",
    "firstName": "Betty",
    "id": "VGVhY2hlci0xMjE0ODc3",
    "lastName": "Kaye",
    "legacyId": 1214877,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Betty was amazing. She's there for you, but has expectations that you do your work yourself and earn the grade you receive. There are very few assignments and even then, they are super easy. All tests are on Carmen. This class really sums up the Hospitality Industry for those who are new to it.",
        "course": "CSHSPMG2600"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Betty is the worst instructor I've had at Ohio State. She made me decide to transfer to other schools next semester. I have tried my very best but still lost my 4.0 in her class. She should not be an instructor for this major at all because she seriously is not even close to a hospitable person. She was there to trick and trap students, not to help",
        "course": "CSHSPMG2610"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Drives me nuts. Never attended her classes because the amount of times she said, \"And the fact of the matter is\" and the way she would lower her voice to almost a whisper. She is very helpful and wants you to do well. I managed to do well despite not going because most of the tests were straight from the book give or take a few questions.",
        "course": "CSHSPMG"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class is for the ManageFirst program and various manager skills that are necessary when working in a Food Service establishment. Since the exams are very structured Betty cannot stray too much from the material, change the exam, or give credit for \"bad questions\". But she is very helpful, gives notes that can be applied on the job.",
        "course": "CSHSPMG3720"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "The first few wks of class came off as really easy.  Over time, the online exams became harder & the info covered in class does not help w/ the exams or broaden our knowledge. She fails to update grades & on the last day of finals she updated them & submitted (leaving me with a C) and I was unable to get it changed nor did I get an explanation.",
        "course": "CSHSPMG4800"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Betty Kaye is a very sweet woman.  Yes her exams can be tricky, work in groups and you dont have much to worry about.  If you have any questions about the major or job advice Betty loves helping people.",
        "course": "HSPMG370"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is not one of the best professors definatly ohio state has though she is ok.If you are looking for true knowledge prbably not the best professor. We did our quizes but never knew which ones we missed and we gave our midterm probably making the same mistakes because she did not posted which answeres were wrong and which were right.U are on ur on",
        "course": "CSHSP350"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Why people say she is easy,she is not easy at all.When you're working alone it is very hard,not like other people just cheat on their whole group.I get pass on this class for B, thanks for the lab and paper assignment.EXAMS ARE HARD. 370 class MORE HARDER.As people below says she never reply your email,seriously insult me personally.its like WTF.",
        "course": "HOSP350"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ms. Betty is a wonderful, wonderful woman.  If you only ask, she will go completely out of her way to help you with anything.  Online tests - so find you a big group and you are guaranteed an A.  Ms. Betty doesn't treat you like kids, as some other professors do.  She believes that attendance should be absolutely optional as we all are adults.",
        "course": "HOSP551"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a very nice person and can be very helpful when you know how to ask questions.  She doesn't require you come to class.  I went to class only on the first week of school.  All tests are online, she encourages taking tests in groups.  I never studied for them - open the test and look up answers in the book.  Really is not that difficult!!",
        "course": "HOSP350"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "terrrrrible class with an even worse teacher. she LIVES for the NRA and her biased views of new legislation are beyond annoying. biggest waste of time for a class and its too bad shes the only option.",
        "course": "HOSP350"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "she never reply your email, when she's not in mood when im asking what the chapter will be on the exam, she ask u to look at urself. the exam even got D, and the average class C+ or B-, she's the worst hosp prof i ever had plus she can't teach",
        "course": "HOSP350"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "talks about herself",
        "course": "HMGT350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 1.8,
    "department": "Hospitality",
    "firstName": "Kathryn",
    "id": "VGVhY2hlci01NjQzOTE=",
    "lastName": "Stafford",
    "legacyId": 564391,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Worst teacher ever. Boring lecyure don't go just use the text for the online midterms. Won't email you back so don't bother. Only saving grace is online MC exams that are right out of the book.",
        "course": "CONSC567"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Use the text!! She takes questions for her online quizzes basically straight from the text. Attendance is not necessary. Only 4 online quizzes and an online final. Soooo easy, but boring lectures.",
        "course": "CONSC543"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely boring lecture. Don't need to go if you read the text. Notes are word for word from book. Online exams are the nly grade",
        "course": "CONSC543"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "terrible teacher! some of the exam questions are unclear & have more than 1 correct answer. She was nice at times, but also had this attitude to where it was her mission that students do bad. I would have prob ended up with a C- after final. but she accidently sent the answers to the exam so every1 got an A on final witch help me end up w/a B.",
        "course": "CS644"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "You will not learn 1 thing during & after taking this course! dont go to lecture bc her notes are right from the book,plus only 6 people go on a given week. GO TO LAB! nothing is due in lab and attendance is not taken, but she does the HW in lab which u will not know how to do w/out being there. Exams are online so get to know students in the class",
        "course": "CS644"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "Worst class I have ever taken! Although I received an A in the class, the material was not at all interesting. She is a nice lady, but doesn't like to stay on topic. They made the class better in the sense that only 1 small book is required. BUY IT. You won't do well without it. I learned everything from the book.",
        "course": "CSCFM567"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "I have to say, this class is pretty rough. The subject is easy, but she makes it very difficult--not very helpful. I had to teach myself the topics online (separately, not through her), but after that, I did fine. Easy tests, totally unclear HW. You need the book-the HW is there, and go to lab. If you catch on to her style fast, no problem.",
        "course": "CSFRM644"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "I wouldn't say her quizzes are impossible...just dumb.  A lot of books and reading for a three credit hour class.  Goes off on wild tangents and tells crazy irrelevant stories.  Once talked about MagLite Flashlights for 30 minutes.  This class overall is just a waste of time.  EHE needs to reconsider this class.  Teacher gets kinda an attitude too.",
        "course": "FRM567"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 2,
        "comment": "Probably one of the worst professors I have ever encountered. She made material that was dry and uninteresting in the first place completely incomprehensible. The only way your gonna get a good grade is to to go to the TA and do your homework right with her every week....that and make sure you get a big group to take the tests with.",
        "course": "FRM567"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Test were very hard and confusing.  Make sure you let her know when there are mistakes!  Best way to survive the class is to get a group together to take the tests early on.",
        "course": "FMRES567"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst teacher I have had at OSU.  Tests were all but impossible.  I didn't even bother going to class because it didn't help at all for the online tests she gave with multiple correct answers.  In order to do well, you just had to guess the answer that she thought was correct.",
        "course": "FRM567"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "The exams are ridiculous.  I think she truly prides herself in making them hard and hearing us complain.  Her lectures don't make sense. She also doesn't understand that it is a 3 credit hour course.  OSU needs to find a new teacher.",
        "course": "FMRES567"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Awful teacher! Awful class! Awful exams!",
        "course": "FMRESM567"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "She is a terrible teacher.  Extremely unorganized.  Her exams were unbelievalble.  The answers never made any sence, and sometimes, there was more than one correct answer.  It blows my mind that Ohio State would hire this woman to teach so many classes.  As if having her for one class was not bad enough, I had her for four.",
        "course": "644ANDOTHERS"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 2,
        "comment": "She is the worst teacher I have ever had.  She loves that she is from Texas, and sounds like it.  Her logic and thought process amazes me (in a bad way) and she will continously get off track talking about her son who she makes sounds like an idiot.  If you can avoid her I highly suggest it.",
        "course": "FRM644"
      }
    ],
    "SEI": []
  }
]