[
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.8,
    "department": "Hospitality Management",
    "firstName": "Mark",
    "lastName": "Kelnhofer",
    "legacyId": 2545798,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "He is very helpful and straightforward about exam material. I found the homework hard, especially since it was 100% remote, so I recommend taking an accounting class in-person."
      },
      {
        "index": 1,
        "rating": "4.0",
        "comment": "Mark's very passionate about accounting. There were 2 pieces of homework every week and 2 lectures a week, with an exam every few weeks that covered a few chapters at a time. Lectures were boring but attendance is 90 points at the end of the semester. Before every exam he covered every question that would be on it, making studying easy."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "so so so awesome. It took accounting with him and he wants to set you up for success as best as possible. before the exam he goes through every question and gets as close to giving the answer as possible. he does not want to trick you but make it as simple and clear as possible"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "This is the first time OSU has offered this course. Mark talks really slow so it's easy to get bored during lectures. Goes over everything in the book during class time. This class will probably be harder in person."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Very easy and requires minimal effort. Should be an easy A. When you take the quizzes online you don't get to see the questions you missed, and there were several questions that went completely against what was stated in the powerpoints. I inquired about this and he said he would look into it and get back to me but I never heard from him again..."
      }
    ]
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.8,
    "department": "Hospitality Management",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNTQ1Nzk4",
    "lastName": "Kelnhofer",
    "legacyId": 2545798,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is very helpful and straightforward about exam material. I found the homework hard, especially since it was 100% remote, so I recommend taking an accounting class in-person.",
        "course": "CSHSPMG2100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Mark's very passionate about accounting. There were 2 pieces of homework every week and 2 lectures a week, with an exam every few weeks that covered a few chapters at a time. Lectures were boring but attendance is 90 points at the end of the semester. Before every exam he covered every question that would be on it, making studying easy. ",
        "course": "CSHSPMG2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "so so so awesome. It took accounting with him and he wants to set you up for success as best as possible. before the exam he goes through every question and gets as close to giving the answer as possible. he does not want to trick you but make it as simple and clear as possible",
        "course": "CSHSPMG2990"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "This is the first time OSU has offered this course. Mark talks really slow so it's easy to get bored during lectures. Goes over everything in the book during class time. This class will probably be harder in person.",
        "course": "CSHSPMG2100"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very easy and requires minimal effort. Should be an easy A. When you take the quizzes online you don't get to see the questions you missed, and there were several questions that went completely against what was stated in the powerpoints. I inquired about this and he said he would look into it and get back to me but I never heard from him again...",
        "course": "CSHSPMG2990"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.6,
    "department": "Hospitality Management",
    "firstName": "Annemarie",
    "id": "VGVhY2hlci0yNDIzNjA3",
    "lastName": "Turpin",
    "legacyId": 2423607,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took the asynchronous version of the course, and it was super easy. There were weekly quizzes that aligned with the lectures and discussion posts that took me about 30 minutes to complete. There were a lot of guest speakers and touring opportunities, which made the class interactive. Prof Turpin also really cared about our success.",
        "course": "CSHSPMG2600"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Turpin is literally amazing. She is super understanding and willing to help. The guest speakers are amazing. Quizzes are basically straight from the textbook. She is wonderful.",
        "course": "CSHSPMG4600"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Turpin has impressed me since day one! My favorite part about this class is the informative prerecorded guest speakers about once a week which gives great insight into the hospitality business! There are 2-3 assignments due a week but they are pretty easy!",
        "course": "CSHSPMHG2600"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Pretty easy class, she takes weeks to reply or just doesnt read her emails",
        "course": "CSHSPMG2600"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Turpin provides very informative lectures, guest speakers, and feedback. Her class is inclusive and allows you to interact with peers who have similar interests or career choices. She is a great person for networking and cares a great deal for her students. She is awesome and I personally learned a lot about hospitality from her.",
        "course": "CSHSPMG2800"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is by far the best teacher I have had in college! She genuinely cares about her students and always makes time to answer any questions you may have. She usually brings in speakers to the classroom, which makes class 10 times better because we get to hear about how they started and what they are doing now. definitely take 1 of her classes!:)",
        "course": "CSHSPMG2800"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anne is one of my favorite professors that I have had in college. She truly cares about her students and knows what she is talking about. Most projects are done through group work, which makes the class much easier. We took field trips to different hotels and had many hotel workers come into our class and speak about their experiences. Well done!",
        "course": "HOSP2800"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Turpin is awesome! We do a lot of group projects in class and have a lot of speakers too. She doesnt really lecture as much which makes the class fun and easy. You NEED the textbook. Most of your reading will be outside of class and you will have online quizzes.",
        "course": "CSHSPMG2600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.3,
    "department": "Hospitality Management",
    "firstName": "Kim",
    "id": "VGVhY2hlci0yMjE2MDc1",
    "lastName": "Bartley",
    "legacyId": 2216075,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kim is such a caring and respectful professor! She cares more about having us learn the material rather than testing us and giving us a ton of assignments. She is really understanding if you have issues with submitting assignments. My favorite professor at OSU!!",
        "course": "CSHSPMG3720"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Bartley is one of my favorite professors for the fact she provided real valuable information and tips for your career. Many professors in the hospitality management program study the industry while Bartley has worked in it and networked with so many for most of her life. Yes the lectures, but they hold long-term value.",
        "course": "CSHPMG3720"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lots of papers. The majority of the your grade is papers and the participation. The lectures are boring and LONG!",
        "course": "CSHPMG3720"
      }
    ],
    "SEI": []
  }
]