[
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.2,
    "department": "Human Resources Management",
    "firstName": "John",
    "id": "VGVhY2hlci0yMjk1MDUx",
    "lastName": "Schaffner",
    "legacyId": 2295051,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love this class so much. John is my favorite professor. The class is structured differently than most I have taken, and I learned about so many aspects that I had never considered before. It was life-changing! ",
        "course": "BUSMHR4228"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "I really love this class so much. Professor Schaffner is a really kind and patient professor. Learn an lot from his class, everyone should take this class!!!",
        "course": "BUSMHR4228"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Take this class!! Low-stress/low pressure, Schaffner wants you to feel comfortable coming to/speaking in class. Discussions are facilitated/ encouraged, but you aren't forced to participate. You're allowed to make what you want out of the material. Most caring professor -- wants you to succeed + will talk to you outside of class on his own time ",
        "course": "BUSMHR4228"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "The class overall was disorganized. Meeting times are never confirmed he also does not reply to email, with no proper grading system. The course is lackluster with poor instructions. Grading scale does not make any sense. No separate peer review, just an overall team review so certain students can easily get away with doing absolutely nothing.     ",
        "course": "MHR7238"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Schaffner thinks he is cool and overate himself. Throughout the semester he gave very vague rubric the entire time. Even intentionally discourage you from writing the optional essay which he used as an obstacle for you to enter an A- or A then he won't have a hard time curving overall.  You won't learn real stuff from this class.",
        "course": "MHR7238"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "John was the best professor I had at OSU, and he sets up his class so that students can decide what they want to learn (within reason). I wish he taught more undergrad classes, I really enjoyed intro to coaching",
        "course": "BUSMHR4228"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "You're missing out if you haven't taken intro to coaching",
        "course": "MHR7512"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fantastic professor who genuinely cares about his students.",
        "course": "BUSMHR4228"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Schaffner is a great professor! Applicable course materials. He pushes you to be better. And he's a great person, so you truly want to make him proud. The readings are interesting (not a typical textbook), and there isn't much work outside of class, but I got so much out of this class!",
        "course": "BUSMHR7228"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.8,
    "department": "Human Resources Management",
    "firstName": "Sang Hoon",
    "id": "VGVhY2hlci0zMDMxNTY1",
    "lastName": "Han",
    "legacyId": 3031565,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very kind but his lectures are very boring. Very few people show up to them as they are not mandatory. If you study his review slides you will get at least a B on his exams. Just put an ounce of effort and you will succeed. ",
        "course": "3200"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really cares about his students. If you study the lecture slides before the exams you'll be fine ",
        "course": "3200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a very caring guy who cares if his students learn from his class. There are 14 extra credit opportunities where when you show up to class you complete a couple of questions. 3 exams where he tells you which slides to memorize and understand so just work on those and you should do good. Material is pretty common sense and easy to understand",
        "course": "3200"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "worst professor worst class run away from him",
        "course": "3200"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Han barely understands the material he is actually lecturing. The lectures are an hour and a half, yet a good majority of that time is spent talking in circles. The class is weighted out of only 300 points in which is in the form of 3 ridiculous exams. ",
        "course": "3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4,
    "department": "Human Resources Management",
    "firstName": "Stephanie",
    "id": "VGVhY2hlci0yNDEzNTM1",
    "lastName": "Wapner",
    "legacyId": 2413535,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great recitation leader for BUSMHR4490! Leads great discussions and is very helpful.",
        "course": "BUSMHR4490"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "Not a great course.",
        "course": "BUSMHR4330"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wapner is amazing! Really knows her stuff, fun to talk to, and wants to prepare her students for the real world. She may be a little tougher on some of her grading, but she can back it up with explanations and a clear rubric. Can't recommend her enough",
        "course": "BUSMHR4330"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Wapner is an amazing professor. Her class is straight forward. Tests are straight from the power point slides and very high level, and she does her best to make the class interesting. She has several guest speakers and cancels class often. She assisted me with career work outside of her normal class duties. Amazing person to know.",
        "course": "BUSMHR4330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3,
    "department": "Human Resources Management",
    "firstName": "David",
    "id": "VGVhY2hlci0yNTQ5OTE4",
    "lastName": "Thompson",
    "legacyId": 2549918,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "One group project about a Harvard case, one 10-pager (minimum) essay, participation and attendance (pop quizzes), 40% of the lecture grade is factored into your final grade. This is the same for all sections (except pop quizzes), however, thompson is a tough grader for the presentations. Take heidi instead, I would not recommend taking his class. ",
        "course": "BUSMHR4490"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "His lectures are decent, but attendance is not mandatory, so there is pretty much no reason to go to class. The class is made up of 3 exams with no other points, but he offers a couple extra credit opportunities and he outlines how many questions from each chapter and section of the book will be on the exam which is clutch. Take him for sure!",
        "course": "BUSMHR3200"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Exams take up 100% of your total grade. No homework, No practice. Class is so boring. Hes a good teacher and cares but this class could not be less appealing. If you dont know definitions or psychology youre bound to not do well",
        "course": "BUSMHR3200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Thompson could give a lecture on the phone book, and he'd still find a way to make it interesting. Expect an enthusiastic professor with a lot of stories and some great job advice. Very easy guy to talk to. Clearly outlines which topics he'll include on exams. Just study a little bit and you'll do well. ",
        "course": "BUSMHR3200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of my favorite classes taken this year! Really engaging and simple as long as you came to class. Not a lot of outside work if you did work during class.",
        "course": "BUSMHR4236"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Grade is based entirely on 3 non-cumulative exams, which are supposed to be based on the lectures but if you really want an A, at least skim the text & know all vocab. Best to create a study guide based on lecture slides, which he just read off of during lecture. He sometimes cancelled class last minute which was frustrating. Do the extra credit!",
        "course": "BUSMHR3200"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Take 3200 with someone else! He just read the slides and had no idea what was on the exams (which are the only thing you're graded on). I bought the hardcover book because I study better with the physical thing, then for exam 2 he said that you needed to buy the online text because exam 2 and 3 were administered through McGraw Hill. DISORGANIZED!!!",
        "course": "BUSMHR3200"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Thompson did a good job with this class. Class consisted of one presentation, a final paper, and attendance. Every class had one team presenting and an optional discussion at the end regarding the presentation. I liked the setup of this class and enjoyed the conversations during it. Very relaxed atmosphere and easy to get a good grade.",
        "course": "BUSMHR4490"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 2,
        "comment": "Very unorganized Professor. Class is graded off of 3 exams only. Accidentally included random information on the second exam so he had to curve it because the average was in the low 60s. Pretty easy class if you study the terms in the textbook, just a really unorganized guy. ",
        "course": "BUSMHR3200"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Take 3200 with someone else if you can, worst professor by far! Was never prepared for class and grade was only from the exams. Exams had no corelation to the material that was taught, he would just read off the slides and did not give any other information. Class average for second exam was a 60 something I believe.\n",
        "course": "BUSMHR3200"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 2,
        "comment": "I had him for recitation and did not care for him. He NEVER responds to emails and takes a very long time to grade papers and presentations. He did not teach at all and he was never really prepared for class. This entire 4490 class is a waste of time and effort, didn't get anything useful out of it besides sitting through 20 min presentations. ",
        "course": "BUSMHR4490"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Thompson is a wonderful choice for the business senior capstone class. He knows what he is talking about and gives every student a fair chance to grab an A for the class. Everyone should take his class!",
        "course": "BUSMHR4490"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Human Resources Management",
    "firstName": "Raymond",
    "id": "VGVhY2hlci0yNTYxMzgx",
    "lastName": "Noe",
    "legacyId": 2561381,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Noe is an expert in his field and it shines through in his lectures. He is funny and really cares about his students. \nIf you have to take his course, reach out to him! He is a great resource and will help you if you show a genuine interest in the class.\nOne thing I will say is, the weekly assignments do require a fair amount of reading.",
        "course": "BUSMHR4322"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Took him for MHRM. He is very funny! He makes lectures easy to follow and enjoys teaching. His first exam is a lot of info and hard to study for, he grades hard. Last exam is easy, but he grades hard. He looks for certain words and phrases that if you don't have it, you miss points. Group project, pretty easy.",
        "course": "BUSMHR7301"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Noe has been such a funny professor, that knows how to make somewhat boring material more interesting. He has a great personality and is a very understanding professor if anything ever comes up.",
        "course": "BUSMHR4322"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Most disorganized prof ever. Half the time we couldn't figure out what readings to do for class. There were an insane amount of readings (chapters and outdated articles from the 80s and 90s). He was nice enough, but makes you keep track of your participation. So people were talking just to get points, and discussion was always off the rails.",
        "course": "BUSMHR7301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1.9,
    "department": "Human Resources Management",
    "firstName": "Howard",
    "id": "VGVhY2hlci0xMTI3ODM2",
    "lastName": "Klein",
    "legacyId": 1127836,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is the worst professor I have ever had at OSU. He is kind of mean to me, though he's smiling, I can see he doesn't like me. He keeps pausing during lectures to look at his handout. He seems to like to be a knowledgeable professor, but he's not helping on the group project and give useless feedback and limited feedback times. ",
        "course": "BUSMHR4324"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Quizzes are hard, but you've got to do well or else you'll have to take an even more impossible midtermfinal. He has no real world experience so don't expect real-life examples. ",
        "course": "BUSMHR4324"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "This teacher did cure insomnia as the above rater had said. Everyone in our class would put their head down or be day dreaming. Mid-quarter reviews were unanimous &quot;use voice inflection&quot; he is incredibly monotone which does not help his cause.  Nice guy but will call you out in class if you don't answer correctly.",
        "course": "MHR756"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Such a awful person. Answers no questions. Excellent cure for insomnia though.",
        "course": "MHR856"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "zzzzzz...that pretty much sums it up. He posts all the slides online, but you have to attend just to do the 3 in-class assignments and you don't know when he'll collect them. He makes the exams from both lecture and material in the textbook that he does NOT cover in class, so in order to do well on the exams, you need to read the textbooks too!",
        "course": "MHR400"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "most boring class ever taken..you will fall asleep while the professor is speaking..i think i've never hated a professor so much..and he is not a fair grader",
        "course": "HRM630"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 1,
        "comment": "I ended up feeling sorry for this professor. The class was the most boring I've ever taken in college, and I'm not the type of person to just say that. At one point this quarter, a guy stood up (in the huge Hitchcock Hall lecture room), yelled &quot;THIS IS THE WORST CLASS EVER,&quot; and stormed out. Enough said.",
        "course": "BZMHR430"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Human Resources Management",
    "firstName": "Margaret",
    "id": "VGVhY2hlci0yNjIzNDEz",
    "lastName": "Lewis",
    "legacyId": 2623413,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is one of my favorites Ive taken art fisher so far. The class is very interactive and the professor genuinely cares that everyones questions get answer. The class lacks structure but that kinda what I liked about it. Overall this class was pretty easy and there was no stress. ",
        "course": "BUSMHR4221"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class has so much potential, but was disappointing. Professor Lewis is caring, but her lectures lacked structure. She did a lot of talking and wanted the class to participate which mostly resulted in awkward silences. The content is not difficult and assignments are easy, just not as interesting as I had hoped going into this class. ",
        "course": "BUSMHR4221"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took this class for fun, and it ended up being one of my worst grades due to tough grading. I thought it would be useful but it seems like you showed up to class with no goal or plan each session and just rambled on. Participation is very important, but impossible to pay attention to. Seems to play favorites. Lectures dragged on to no end.",
        "course": "BUSMGT4244"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Human Resources Management",
    "firstName": "Shuxia",
    "id": "VGVhY2hlci0yNjQzNzYx",
    "lastName": "Zhang",
    "legacyId": 2643761,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I think she's a pretty good professor. She will send you emails reminding you of assignments and arE very responsive to emails. The tests were not easy, but definitely not hard if you study for it. Also, there are tons of extra credits that can boost your grade to a next level. Definitely take her class again. ",
        "course": "BUSMHR3200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Shucks ( Carrie) is a wonderful Professor. She gave us lots of (6%) extra credits. And you will get more if you participate some Zoom research, which is easy. The book is not mandatory. She will discuss lots of terms in her class. The PPT is clear and covers all the information for the open-notes&amp;book exams. The average score of exam is often 90%.",
        "course": "BUSMHR3200"
      }
    ],
    "SEI": []
  }
]