[
  {
    "avgDifficulty": 2.2,
    "avgRating": 3.8,
    "department": "Human Ecology",
    "firstName": "Catherine",
    "id": "VGVhY2hlci04OTM2NTA=",
    "lastName": "Montalto",
    "legacyId": 893650,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Overall she really does care about her students and makes it known you can come to her for help. Can skip up to 9 classes, but I wouldn't recommend, as this makes your grade go down due to the in class activities. Problem sets are pretty straight forward- she was a little bit harsh in grading these. Online exam for the final. ",
        "course": "CONSCI3930"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easily the best class I've taken at OSU. I went to office hours every week I could just to be sure I was doing the homework right, and she would give me feedback on what I was doing right and where I went wrong. She really cares about her students and truly wants them to learn and gives them every opportunity to do so.",
        "course": "CONSCI3930"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Doing this class online was very easy! You have a quiz almost every week which are very easy to complete (only 10 questions). The hardest part about the online course is the consumer segment profile, but it is really not that bad! She provides instructions for it and for discussions. If you can take an online course with her, I highly recommend! :)",
        "course": "CONSCI3940"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "Possibly the worst class I have ever taken. I enjoyed statistics and somewhat enjoyed CSE, but this class is just frustrating. Tedious homework each week and you feel like you don't learn a thing.",
        "course": "CSCFFS4150"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worst class I've ever taken. There are weekly homework assignments that are obscenely tedious and will take you hours to complete. She is passionate about the course but is not great at teaching. To anyone who thinks CSE was hard, this is CSE amplified x10. It was like taking CSE and a high level stats class in one.",
        "course": "CSCFF4150"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst class I've ever taken. Huge software issues for Mac users. Yeah, she will stay after class, but that's only good for people who have the time and like having it wasted. This class does not teach what it is supposed to teach. Huge repeat of Stats135 and CSE 100. Do yourself a favor: skip class and read the book.",
        "course": "CSCFF4150"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor.  Will help you if you need it.  Stays in comp lab after class for you to work and ask questions.  Half Hw(which takes a little bit) and half MC exams.  Overall class is not very difficult, nowhere near CSE 200.  Take her is you can.",
        "course": "CSCFF4150"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "This teacher was extremely helpful. The class is boring at times, but you should attend if you want to do well since the slides are not posted online. Exams are almost verbatim from the study guides she posts. Keep up with the online quizzes, do well on the project and exams, and attend most classes and you'll be fine. The extra credit helps too!",
        "course": "CS340"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "This class is painfully boring. Dr. Montalto might work to find a better way to teach this class by involving students more in the lecture.  The subject matter really lacks practical application, so it's tough to listen to.  Material that works in the real world would be easier to listen to.",
        "course": "CS340"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "I went to a total of 5 out of 30 classes and got a B-. She made it SUPER easy with the review sheet before each test. Study that and you'll be fine. I missed a few of the weekly quizzes which is why my grade was so low. Otherwise it would have been an A-. She is painfully boring, talks to the class as if we are 5, and is pretty useless.",
        "course": "CONSC340"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never had such an awesome professor in my time at OSU.  She makes relatively boring material very interesting to hear about.  Just go to class and pay a little bit of attention and enjoy your A!",
        "course": "CONSC340"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never had such an awesome professor in my time at OSU.  She makes relatively boring material very interesting to hear about.  Just go to class and pay a little bit of attention and enjoy your A!",
        "course": "CONSC340"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very nice teacher, genuinely interested in what she is teaching, interacts with the class well. Makes sure that subject for the small assignments that she assigns are explained. Does not put notes online, if the class is attended, it is not very difficult at all",
        "course": "FRM340"
      }
    ],
    "SEI": []
  }
]