[
  {
    "avgDifficulty": 2.2,
    "avgRating": 3.8,
    "department": "Human Ecology",
    "firstName": "Catherine",
    "id": "VGVhY2hlci04OTM2NTA=",
    "lastName": "Montalto",
    "legacyId": 893650,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Overall she really does care about her students and makes it known you can come to her for help. Can skip up to 9 classes, but I wouldn't recommend, as this makes your grade go down due to the in class activities. Problem sets are pretty straight forward- she was a little bit harsh in grading these. Online exam for the final. ",
        "course": "CONSCI3930"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easily the best class I've taken at OSU. I went to office hours every week I could just to be sure I was doing the homework right, and she would give me feedback on what I was doing right and where I went wrong. She really cares about her students and truly wants them to learn and gives them every opportunity to do so.",
        "course": "CONSCI3930"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Doing this class online was very easy! You have a quiz almost every week which are very easy to complete (only 10 questions). The hardest part about the online course is the consumer segment profile, but it is really not that bad! She provides instructions for it and for discussions. If you can take an online course with her, I highly recommend! :)",
        "course": "CONSCI3940"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "Possibly the worst class I have ever taken. I enjoyed statistics and somewhat enjoyed CSE, but this class is just frustrating. Tedious homework each week and you feel like you don't learn a thing.",
        "course": "CSCFFS4150"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worst class I've ever taken. There are weekly homework assignments that are obscenely tedious and will take you hours to complete. She is passionate about the course but is not great at teaching. To anyone who thinks CSE was hard, this is CSE amplified x10. It was like taking CSE and a high level stats class in one.",
        "course": "CSCFF4150"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst class I've ever taken. Huge software issues for Mac users. Yeah, she will stay after class, but that's only good for people who have the time and like having it wasted. This class does not teach what it is supposed to teach. Huge repeat of Stats135 and CSE 100. Do yourself a favor: skip class and read the book.",
        "course": "CSCFF4150"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor.  Will help you if you need it.  Stays in comp lab after class for you to work and ask questions.  Half Hw(which takes a little bit) and half MC exams.  Overall class is not very difficult, nowhere near CSE 200.  Take her is you can.",
        "course": "CSCFF4150"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "This teacher was extremely helpful. The class is boring at times, but you should attend if you want to do well since the slides are not posted online. Exams are almost verbatim from the study guides she posts. Keep up with the online quizzes, do well on the project and exams, and attend most classes and you'll be fine. The extra credit helps too!",
        "course": "CS340"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "This class is painfully boring. Dr. Montalto might work to find a better way to teach this class by involving students more in the lecture.  The subject matter really lacks practical application, so it's tough to listen to.  Material that works in the real world would be easier to listen to.",
        "course": "CS340"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "I went to a total of 5 out of 30 classes and got a B-. She made it SUPER easy with the review sheet before each test. Study that and you'll be fine. I missed a few of the weekly quizzes which is why my grade was so low. Otherwise it would have been an A-. She is painfully boring, talks to the class as if we are 5, and is pretty useless.",
        "course": "CONSC340"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never had such an awesome professor in my time at OSU.  She makes relatively boring material very interesting to hear about.  Just go to class and pay a little bit of attention and enjoy your A!",
        "course": "CONSC340"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never had such an awesome professor in my time at OSU.  She makes relatively boring material very interesting to hear about.  Just go to class and pay a little bit of attention and enjoy your A!",
        "course": "CONSC340"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very nice teacher, genuinely interested in what she is teaching, interacts with the class well. Makes sure that subject for the small assignments that she assigns are explained. Does not put notes online, if the class is attended, it is not very difficult at all",
        "course": "FRM340"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.2,
    "department": "Human Ecology",
    "firstName": "Kate",
    "id": "VGVhY2hlci05MjgxMzQ=",
    "lastName": "Adkins",
    "legacyId": 928134,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Adkins is great. She's fun and interesting and knows a lot about this course from her work. We were originally supposed to have pop quizzes, but she ended up doing a movie project instead on He's Just Not That Into You. Most of your grade is from your paper, so make sure to turn things in on time. Discussion groups (every week) were easy.",
        "course": "HDFS5340"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class if you pay attention and go along with the rules. She tells you the first day of class that the average of the class is an A. She is very nice and always there to help. Definitely take this class.",
        "course": "HDFS2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Discuss topics & watch related videos in class. Brings in speakers that are relevant to material, but also helpful with life lessons. Awesome professor. She's nice and doesn't grade too rough, as long as you know how to write with proper grammar and structure.",
        "course": "HDFS2367"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is a great teacher.  There are 2 big papers and 1 small one.  They are pretty easy.  Go to class because she takes random attendance.  She is very willing to help and answer questions.",
        "course": "HDFS367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really Nice and very helpful. she is understanding and flexible, and really easy to talk to in class. Good movies and discussions too! I recommend this class.",
        "course": "HDFS9497"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really easy class if you put in the work. Two big papers that she gives you lots of in class time to work on. You watch a lot of really good movies too",
        "course": "HDFS367"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class content is interesting but the way she teaches and explains paper requirements can be a bit confusing. Attendance is not mandatory but she does take random attendance during some classes and you are tested on what a guest speaker will lecture about so going to class is really beneficial. She also always lets us leave early.",
        "course": "HDFS367"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "My major is HDFS and I needed this class for it.  The class information was very appealing to me, but it was Dr. Adkins first time teaching and I think she learned a lot through this quarter (such as making class informative for all, rather than discussion time).  Going to class is recommended (although not always interesting).",
        "course": "HDFS367"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "She no longer makes students do those presentations. Class is mostly note taking from power points, but she puts all the power points online so you don't miss much if you don't show up. I liked her a lot, she is very to the point and she is a therapist so she has some interesting stories and there was great discussion at least in my class. I don't",
        "course": "HDFS360"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class but you have to come to class and read the book to do well. She was a bit boring sometimes but kept a good pace and told some funny stories.",
        "course": "HDFS360"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "great class, though a little boring at times.  Does seem to assume that none of her students have any experience with marriage or starting a family.  Other than that, she is very straightforward about what is on the exams and more than willing to help her students.  I really liked her and felt that the class was highly informative.",
        "course": "HDFS360"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "grades easily, makes the class interesting, i definitely would recommend it!",
        "course": "HDFS360"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "good teacher, very interested in what she does.  makes class easy, only puts material from class on exams, recommended",
        "course": "HDFS360"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class is terribly boring, and about half of every class day is dedicated to boring presentations by peers that are not relevant to tests or anything else. This teacher is an extremely conservative republican who is unable to keep her political views in her pants. This was the worst class I've ever taken. NOT RECOMMENDED!",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.5,
    "department": "Human Ecology",
    "firstName": "Natasha",
    "id": "VGVhY2hlci04NzcxMjU=",
    "lastName": "Slesnick",
    "legacyId": 877125,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Slesnick was a great professor. She cares about students and the content. Attendance is mandatory. However, the lectures are really boring. It was difficult to stay engaged.",
        "course": "HDFS2900"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class was all-encompassing of the subject matter. It was a lot of reading and then the class was a review of the reading. Prof is very nurturing of growing professionals and I am enriched from taking this class with her.",
        "course": "HDFS8876"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Loved the class, my interest in the subject has increased and I look forward to taking another course with Dr. Slesnick",
        "course": "HDFS560"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "By far one of my favorite professors.  At first I was extremely hesitant because there were only 3 grades (2 exams 1 paper 33% each), and it was very easy to doze off in her class.  But if you actually sit down and pay attention, she's very intelligent and loves what she does.  It's an easy class and I recommend her over anyone else",
        "course": "HDFS560"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Boring class. But, easy to pass if you study.",
        "course": "HDFS560"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "HIST101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.1,
    "department": "Human Ecology",
    "firstName": "Michael",
    "id": "VGVhY2hlci04NTk0NzU=",
    "lastName": "Knerr",
    "legacyId": 859475,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Didn't throw curve balls. If you honestly do the reading and put forth a little effort to make sense of it, it's a cakewalk.",
        "course": "HDFS2200"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "His class was easy, but he wasn't really involved in the class at all. He doesn't give extra credit and he doesn't round grades at all",
        "course": "HDFS2200"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Knerr was great. I did not study or read my book at all, but his tests are 100% from the text. I recommend getting the kindle edition or some other type of online based book which allows you to 'search' this saved me from having to scan through endless pages and allowed me to ace the final and pull off an easy A with minimal work required.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dont waste your money on textbooks, you don't need them. The reading quiz is only over the double abcx model. Its a boring class with attendance taken randomly but overall, not that hard.",
        "course": "HDFS660"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very knowledgeable. Also very hot!",
        "course": "HDF66"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is great",
        "course": "HDF66"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Know the Double ABCX model for sure. Bought the books but never used them. I'd suggest just using the library's books so you don't waste your money.",
        "course": "HDFS660"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class. Lots if small assignments, a group project, and a final. I went to all classes, but only the last 4 were mandatory because of group presentations. We have 2 books, which are WAY too expensive. I would get it from the library before buying them. The book is helpful for the assignments and for the final",
        "course": "HDFS660"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "Easy class--you don't really need to show up to lecture to get away with an A.  A lot of group activity though; don't expect to just go to class and sit for the entire time.  He'll make you get up and move.",
        "course": "HDFS660"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of my favorite prof. so far in college! Love him!! He is a great guys and cares about his students.",
        "course": "HDFS360"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Clear lecturer and loves group work. Gets annoying after the first class. Grading is very strict, no curve at all, was 2/3 points from an A but didn't get it.",
        "course": "HDFS360"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is an awesome teacher. The class is not hard but you have to do a lot of group work which kinf of gets annoying. One of the nicest teachers I have ever had in college. I didnt study at all and got a B+. Would recommend.",
        "course": "HDFS360"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Go to class and read the book and you will have no problem getting an A.  Being in class is more important than reading the text.",
        "course": "HDFS360"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's nice and helpful when you ask for it.  The class isn't hard, but he makes you do a lot of group stuff.",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  }
]