[
  {
    "avgDifficulty": 2.3,
    "avgRating": 2.9,
    "department": "Human Development",
    "firstName": "Xin",
    "id": "VGVhY2hlci0xNTg5NDU4",
    "lastName": "Feng",
    "legacyId": 1589458,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Out of 400 points with a couple of extra credit opportunities. \nSmall group discussions help us understand the material better.\n3 exams that are mostly extended response questions, so you have to be able to explain the contents learned.\n4 homework assignments.\nFinal project. \n\nShe's very understanding, reach out to her bc she's willing to help.",
        "course": "HDFS2900"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "This class was asynchronous online, but none of the material was covered by the professor. We had a textbook, but no video lectures. There were weekly open-book quizzes and discussion board posts. The quizzes were super easy because could find all the answers in the book. I never read the chapters, I just looked while taking the quiz. Easy class.",
        "course": "HDFS2410"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Not a single lecture for an online class, recorded or live. Every single thing was from the book with no other teachings provided. I would never take this class again",
        "course": "HDFS2410"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor- would take again. Got a 100 in the class",
        "course": "HDFS 2900"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class itself is not very difficult. Go to class and pay attention and you will do fine. Dr. Feng is also very willing to help students succeed in her class.",
        "course": "HDFS2900"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "I think she is fair and responds to feedback about parts of the class, but instructions for assignments were not always very clear. There are opportunities for extra credit and the tests are pretty straight forward if you use the study guide she provides. There are also a lot of in class discussion group assignments that count as your attendance.",
        "course": "HDFS2900"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was very difficult.  It was hard to understand the teacher and her instructions were very unclear.  While I ended up with a decent grade in the class, I did not learn much getting there.",
        "course": "HDFS334"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Barbara",
    "id": "VGVhY2hlci0yNTg5MTYz",
    "lastName": "Hodgdon",
    "legacyId": 2589163,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ms. Hodgdon is a great instructor for this course. She really cares for her students and gives them so many resources to succeed both in her class and outside of class. The class itself is easy, but also is interesting if you do not know much about the subject matter. The class consisted of easy weekly quizzes and an occasional one page paper.",
        "course": "HDFS2400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "The asynchronous version of this class was super easy. I did not read the textbook and passed all the weekly quizzes. Other than those, there were three one-page reflection papers and lots of extra credit. The professor really cares about students and tries to be as lenient as she can be with the pandemic.",
        "course": "HDFS2400"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class I have taken at OSU. She posted weekly modules with 10 point quizzes at the end or an occasional 1-page reflection paper. Book is not necessary, all quiz material is online or throughout the articles she assigns.",
        "course": "HDFS2400"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took the online class and it was very simple. One short quiz a week which has no time limit. I ended with over 100% with barely any effort except reading some of the book (which can be found online for free!). The professor is very nice. She sent out resources for us during this time (currently the COVID-19 pandemic) and truly cares about you.",
        "course": "HDFS2400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 1,
    "department": "Human Development",
    "firstName": "Diandra",
    "id": "VGVhY2hlci0yMzI2MDA5",
    "lastName": "Gordon",
    "legacyId": 2326009,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Do not take her class! ",
        "course": "2350"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Disorganized from begining when syllabus & assignments were uploaded 2 weeks after the semester started. Commented on students not reading the syllabus when she does not follow the syllabus at all. Takes 2 months to grade papers, NEVER publishes the modules on time, gave homework over break, but did not answer emails because she was on her break",
        "course": "2350"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "- Claims to follow syllabus- SHE DOES NOT\n- Changes due dates because she doesn't open assignments on time\n- Gives homework over Spring Break\n- Syllabus quotes that she will respond to emails in 24 hours- SHE DOES NOT\n- Passive aggressive wording in emails and announcements\n\n",
        "course": "2350"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "She was the worst professor ever. She claims she responds to emails in 24 hrs but takes a week plus, she doesn't answer her Q&A discussion, and she takes over a month to grade small assignments. We had hw over spring break that wasn't open, then didn't answer any of us about it, then sent a passive-aggressive message bc none of us completed it.\n",
        "course": "2350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.8,
    "department": "Human Development",
    "firstName": "Deanna",
    "id": "VGVhY2hlci0xNDA3NzUy",
    "lastName": "Wilkinson",
    "legacyId": 1407752,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took a fully online course with Professor Wilkinson in Fall 2020. While this was a tough semester for me due to personal matters, Professor Wilkinson did everything she possibly could to accommodate and help me. Moreover, she left extensive feedback on all assignments and you truly knew what was expected out of you for every assignment.",
        "course": "HDFS4370"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class is titled Families and Stress. The reading was all current articles with no textbook to buy. I found the information interesting and the discussion posts were a good way to engage with classmates. Dr. Wilkinson is knowledgeable and passionate about teaching. We used apps called Padlet and Genopro, which made assignments fun.",
        "course": "HDFS4370"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Deanna was so helpful with any questions you had. She cared so much about each student and wanted us to succeed. She was very open and honest from the beginning and that made the class even better because we were able to be open and honest about our own families and lives. She was such a gem so highly recommending taking her class!",
        "course": "HDFS4370"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. D is a genuinely nice person and is caring of her students, however she is not the best professor. The course was disorganized and the expectations were not very clear. For example we had an &quot;exam&quot; that was assigned on Wed that ended up being a 5-6 page paper due Sun. Bottom line: Is she the worst professor? No. Would I recommend her? Also no.",
        "course": "HDFS4370"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Wilkinson is a professor who is extremely caring and clearly cares about her students. With the semester being online in an odd format, there was some disorganization and sometime it was unclear what we should be doing for assignments. However, she was so accessible by email that any questions were quickly answered.",
        "course": "HDFS4370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Professor Wilkinson for 2900 and now 4370. She cares a lot about her students and puts in a great amount of effort and time into her classes. The only thing I would say was that it seems a bit unorganized at times, however she is always willing to help you succeed! I highly respect her for her openness, vulnerability and willingness to help.",
        "course": "HDFS2900"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is very informative. It covers a broad range of topics relevant to today. Dr D is very flexible, understanding, and made the most of an online format for a class typically done in person. She was excellent! Dr. D has a lot of material in place of a book which is even better if youre economically conscious.",
        "course": "HDFS4370"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 2,
        "comment": "It is very clear she cares about her students, and she is nice; however, the class is consistently unorganized and needs a lot of work. Course material is sensitive and you are given no trigger warnings. TAs are undergrad students. AND Dr. D asked us to write a review on here to &quot;put in a good word for her&quot;, which felt very unprofessional.",
        "course": "HDFS4370"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took HDFS 2900 with Dr. Wilkinson in the fall of 2020. With everything being online, she made herself accessible pretty much at all times through email, GroupMe, and Zoom. She was also flexible and willing to adjust assignments for students along the way. You can really tell she cares about the success of her students.",
        "course": "HDFS2900"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. D taught me during fall semester 2020 for Research 2900. She is a great professor and had all of her lectures recorded and uploaded online. She was accessible outside of class and talked to us through Zoom and GroupMe as well as email. She cares about her students and is flexible and willing to work with them",
        "course": "HDFS2900"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Wilkinson was a great professor! She has plenty of office hours, is very approachable, and made sure we knew she would go the extra mile for us. The course had a discussion post each week over the readings and lecture material, and two major projects. If you put in the work you'll do well. I would definitely take this course with her again!",
        "course": "HDFS4370"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Wilkinson is understanding and gives a lot of resources to succeed in her course. I also feel that she is a relatively fair grader with assignments and discussions.",
        "course": "HDFS4370"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Wilkinson was an outstanding professor. Shes very understanding, accommodating, and adjusted quickly to an online format. As long as you read the assigned reading in the book, the corresponding assignments are easy.",
        "course": "HDFS2900"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Given that his course was delivered online and that is a difficult format to get this content across, this professor was very accommodating, listened to feedback, gave great feedback, is passionate about the topic, allows for personalization of projects that goes a long way in engagement, and is the most personable, caring professor Ive ever had.",
        "course": "HDFS2900"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is a nice person but by far the worst professor I've ever had in my college career. Her lectures will put you to sleep and attendance is a large part of the grade. She is super disorganized and you never know what is going on in the class. Her exams are super hard and she doesn't prepare you well for them. DO NOT TAKE.",
        "course": "HDFS2900"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. D really cares about what she is teaching. She helped us to understand what research is really about. Her tests are not ones you can just memorize, makes you apply what you've learned. She is helpful, and understanding! I enjoyed the class. ",
        "course": "HDFS2900"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is easily one of the worst professors I have ever taken. Attendance is 10% of the grade so you have to go to class and I dread it. She is incredibly unorganized. We have a group project due in 2 weeks and EVERYONE is still completely unsure as to what is going on. No one knows what she expects and what we are supposed to be doing for anything.",
        "course": "HDFS2900"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "probably the worst professor I have ever had, and I am a senior so I have had quite a few bad professors. Very unorganized, we do a group project and no one even knows what to do cuz its so unorganized, completely pointless class and I feel bad for anyone who has to take it with her. She is not very smart either.Most pointless class ever.Shes awful",
        "course": "HDFS2900"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 2,
        "comment": "Seriously...Not very organized but she is really nice. She will try to help you out and I think she means well but you don't really know exactly what you are being graded on. Sometimes she takes attendence but sometimes she just gives you points. Also, in class activities are really pointless.",
        "course": "HDFS2900"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 3,
        "comment": "The most disorganized class I have ever taken.  We had a revision, to the revision, to the revision to the syllabus, the final project also got revised several times, assignments got moved then dropped, quizzes were inconsistent (then we never got them back for review).  Majority of material didn't pertain to our field..",
        "course": "HDFS334"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "I was dreading this class before hand, but ended up really liking it. Dr. D. is really passionate about her field, which made the class interesting and enjoyable. A lot of work, but nothing too hard. I learned a lot and really liked her as a professor.",
        "course": "HDFS334"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.5,
    "department": "Human Development",
    "firstName": "Anita",
    "id": "VGVhY2hlci0xMzgwNjgw",
    "lastName": "Parker",
    "legacyId": 1380680,
    "numRatings": 36,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class is super easy, only a few writing assignments, a group assignment and some quizzes. All of which are very easy to get an A on so this is a great class. Also, Anita is great she is super interesting and loves working with students.",
        "course": "HDFS2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anita is a hilarious and knowledgeable professor that taught me things that I should have learned back at high school. This is a very easy A course and the best part is that the material we cover is super interesting! You would really have to be careless to get anything below an A in this course.",
        "course": "HDFS3440"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anita is amazing and truly cares about each and everyone of her students. If only all professors were like her. Absolutely look no further!! Sign up!!",
        "course": "HDFS3440"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I advice all students take Anitas class. I learned more this semester than I ever have before. Wonderful person!!!",
        "course": "HDFS3400"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved this class!! Take it... Look no further just sign up. It is easy, but Anita makes it so interesting. She is hilarious. Also the concept of the class is important, and I think everyone can take something valuable out of it.",
        "course": "HDFS2367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anita is my favorite professor I have ever had. She makes class comfortable, engaging and fun! She is an overall wonderful woman. Highly recommend this professor.",
        "course": "HDFS3440"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is an incredibly kind and funny woman. She is a fair grader, expects you to be able to write like a college student, she is very big on grammar. She is a very passionate teacher and makes you want to be interested, but sadly few people participate. Would definitely recommend her class, especially 2367. No textbook, but you read a novel.",
        "course": "HDFS2367"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome &amp; Easy Class. If you are looking for an easy second writing class, take this class for sure.",
        "course": "HDFS2367"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anita was one of my favorite teachers at OSU. She genuinely cared about each and every one of her students and was completely understanding. Although she took attendance every class, she offered close to 40 extra credits points that allowed you to be able to miss a few classes here and there.",
        "course": "HDFS2367"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is one of the best professors I have ever had! She is wickedly funny and also super kind. She is very respectful of her students and understands we all have our own lives that could sometimes get in the way of class.",
        "course": "HDFS5440"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loved this class so much and Anita! One required book and a few quizzes on the chapters but I never even read the book and still got a 5/5 on the quizzes. Gives a lot of extra credit, too.",
        "course": "HDFS2367"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Easiest writing class ever. Every week there's a discussion and open book quizzes. Easiest A ever!",
        "course": "HDFS2367"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Not a difficult class. She provides enough extra credit to make up for missing a few assignments. Readings aren't bad, the reading quizzes are easy points. Her weekly announcements are helpful for staying on task and being aware of what's coming due. I never had any conflicts but she seems to be a flexible professor if you're having any trouble.",
        "course": "HDFS2367"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best teacher I've ever had at Ohio State. Makes you want to learn and really tells you like it is.",
        "course": "HDFS5440"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very poor communication. Lack of timely grading of assignments. The entire class is still waiting on promised feedback on the rough draft a day before an extended deadline for the final paper. This is really disappointing since this is a writing class and we have nothing upon which to build success.",
        "course": "HDFS2367"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "Anita was clear and made learning about sexuality interesting and fun. She even has speakers come to class to discuss their lives/experiences. If you don't go to class, you will definitely fail. Attendance is worth 45% of your final grade, so easy.",
        "course": "HDFS5440"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anita is a fantastic instructor! Probably one of the best I had at OSU, I actually took every other class she taught after taking my second writing with her. She has a really fascinating life and really does talk about it in her classes! Super easy class to do well in; just go to lectures, and try your best on the group projects and you'll pass.",
        "course": "HDFS2367"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Being a senior taking upper division classes, this class was great to have with this. I took this course to fulfill my  second writing requirement. The course can be unorganized at times, but show up for every class and you'll pass. She has a big heart and wants everyone to succeed. Anita is a great person. (requires one inexpensive book)",
        "course": "HDFS2367"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 1,
        "comment": "You'll be put into groups of 3-6 people according to the TV show you chose. Total score is based on 1 individual paper + 1 group presentation + 1 group presentation + attendance, etc. It's an easy class but make sure you go to the lectures because Anita takes attendance.",
        "course": "HDFS2367"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "easy class. funny class.",
        "course": "HDFS360"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "Anita is a great professor. She is one of the first professors I've had that actually loves her job and is genuinely interested in helping students learn not just course material, but about life in general. Follow instructions and complete work and you will get an A. Her 'textbook' is a chapter book, just make sure you keep up with readings.",
        "course": "HDFS2367"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 1,
        "comment": "Anita is an awesome professor! I had her for 2 HDFS classes, and both were very easy and interesting. Anita makes the class fun, and is extremely helpful. Definitely one of my favorite professors at OSU.",
        "course": "HDFS5440"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great professor. Her class is extremely easy, but you actually learn. Most assignments were group work which was really nice. She makes everything fun and interesting. I highly recommend her to anyone. Just make sure you actually go to class.",
        "course": "HDFS2367"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was the best teacher I have ever had at OSU!!!!",
        "course": "HDFS5440"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor.  Easiest A I have gotten in my entire life.  She is very nice and lean and wants everyone to get A's.  If you take it in the summer she is so chill and I can't imagine she is that much stricter during the year.  Best second english I could ask for.  Watched different TV shows and did group projects on them.  What could be better?",
        "course": "HDFS2367"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anita is an amazing professor! Her teaching style is extremely interesting and effective.  She made even the most boring topics engaging.  Also, you should get an A as long as you show up for class.",
        "course": "HDFS2400"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "She really enjoys teaching. She always makes the lectures interesting. But overall it is one of the easiest A's I have taken, but I still learned a ton!",
        "course": "HDFS2400"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 1,
        "comment": "She is what is wrong with OSU. She's \"easy.\" She quite literally delivered my whole class A's on a silver platter in attempt to not receive bad SEI's for her complete lack of concern for her classes. However, students love this and keep signing up for her classes so don't take her if you're one of the few who care about their college education.",
        "course": "HDFS2400"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 4,
        "comment": "I am not sure what happened to her, we did not received a syllabus until 5 weeks into the semester. She has cancelled 4+ classes within less than an hour notice - bad thing for commuters and the '+' class was to take attendance bcs she was cancelling again. We pay thousands of dollars for classes and to cancel them and not be prepared - not good.",
        "course": "HDFS2400"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took her human sexuality class. She was always entertaining and kept us well informed! GREAT CLASS AND VERY EASY!!! ",
        "course": "HDFS370"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "I wish I could take more classes with her, she is one of my favorite teachers!",
        "course": "HDFS367"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Anita is a clear professor who tells you exactly what your need to know. She also let us do these PSA's instead of papers!!! Awesome Prof, you don't need the book for her class though, I didn't use it at all.",
        "course": "HDFS364"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anita is great! Class is very easy and fun. Lectures are to the point and she tells you exactly what you need to know for the exams. She tells you at the beginning of the quarter that you need to buy the book- but you don't. We never use it and you get all the info you need for tests in lecture.",
        "course": "HDFS361"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "this is my second class with her- love it and her teaching style! makes things SO much easier and fun to be in class.",
        "course": "HDFS370"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "anita is a rockstar- choose her!",
        "course": "HDFS370"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "awesome class. anita made it so much fun and made it easier to understand! I recommend any class with her!",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.8,
    "department": "Human Development",
    "firstName": "Larissa",
    "id": "VGVhY2hlci0yMjE3NjIy",
    "lastName": "Brophy",
    "legacyId": 2217622,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Stopped going after day 2 because I was bored. Assignments and exams were annoying, but weren't terribly hard. She had a rough semester and tried to communicate with us as best as possible, but given all the changes and confusing setup, she should've made lectures online and more accessible. ",
        "course": "HUMNNTR3704"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "I took her for HUMNTR 3704 fall 2022, that class just wasn't an option on here. Professor Brophy is very unorganized and extremely rude. She does not communicate due dates or instructions well and when people contact her about it, she is not receptive and does not take any responsibility. I would never take her again, she is not a good professor.",
        "course": "HUMNNTR4504"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dry lecturer, quizzes material from the book never covered in class, when OSU made adjustments for Covid-19, she never updated the syllabus, just conveyed changes during &quot;housekeeping&quot; portion of a live zoom that she didn't record. Was very insensitive to essential workers' needs for flexibility, cares more about her own rules than student success.",
        "course": "HUMNNTR4504"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Brophy is very nice and down to earth. She reads off of slides but doesn't post them and there are pop-in-class-activities worth 5 points, so you need to go to class. The first exam was an easy A, but don't let that fool you because the material gets more tough. Overall good professor.",
        "course": "HUMNNTR2310"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Grades include online \"quizzes\" (can use resources and not timed), 3 exams, and extra credit for attendance and \"participation\" (on TopHat). Extra credit increased my grade by 10%. Book helps for the quizzes and studying, but she gives most information in lecture and posts powerpoints online. She also posts study guides for exams (very similar).",
        "course": "HUMNNTR2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.9,
    "department": "Human Development",
    "firstName": "Codina",
    "id": "VGVhY2hlci0yMjc2NzM5",
    "lastName": "Kawar",
    "legacyId": 2276739,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She seemed really nice, wish I could have had her in person! The class was very easy, just weekly quizzes on the textbook that you had two tries at, a couple interesting and simple discussion posts, and a final paper that wasn't too hard and kind of fun to write! Very interesting material and hope to have her in person at some point!",
        "course": "HDFS2350"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Kawar is great! Take her class",
        "course": "HDFS2520"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's cool and she always met with me every time I needed her. I got a lot from her class and she is very smart. She always offered me chocolate when I was in her office, and I really liked that!",
        "course": "HDFS2250"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Mrs. Kawar is a good professor and knows her stuff. There were weekly quizzes and some discussion posts, which were ok cus it was open book. But the final exam paper was a bit to hard for me. I got a B plus so im cool with that. Yes, id take her class again in the future.",
        "course": "HDFS2350"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor! This was an online class but it felt very personal and comfortable. There were weekly quizzes and a final paper at the end. The quizzes were open book so i had to get the textbook. Overall she is cool and I would take all the classes she teaches.",
        "course": "HDFS2350"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is a great professor. Thanks to her I switched my major to HDFS and I am now considering counseling grad school. Mrs. Kawar is a great professor and I felt truly cared for.",
        "course": "HDFS2420"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "She thought the parenting online class and I did well in it. This is the second class with her. She's very cool. Everything was well structured but beware of the quizzes.",
        "course": "HDFS2350"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Codina is an awesome professor. Ive always looked forward to go to her classes. I had to take a week off due to a death in the family and she met with me to arrange my assignments so I wont be behind. Shes really smart and passionate about teaching and very understanding.",
        "course": "HDFS3440"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Id take any of her classes. Her teaching style made the whole semester to go really smoothly. I loved her lectures and videos. She also gives you opportunity for extra credit",
        "course": "HDFS3440"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Take her class. If you pay attention during class you almost dont need to study home. I didn't and I got a A-. She has many class activities and videos that made me remember the material a lot better. I enjoyed her class and I looked forward to it as opposed to other classes. You need the text book.",
        "course": "HDFS3440"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Mrs. Kawar is one of the best teachers I've had. She took extra time and met with me to talk about MFT since this is what I want to pursue for graduate school. She is very funny and gets everyone involved in discussions and uses media to soften up class material. I loved her class because she made the theories and concepts easy to remeber and fun.",
        "course": "HDFS2420"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a great teacher. I found her to be knowledgeable, patient with my pace of learning and very pleasant.  I will take all classes she has to offer.  She has a great sense of humor.",
        "course": "HDFS2420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 2.5,
    "department": "Human Development",
    "firstName": "Catherine",
    "id": "VGVhY2hlci0yMzM4Njg2",
    "lastName": "Van Fossen",
    "legacyId": 2338686,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "she's the worst but its really really easy",
        "course": "HDFS4370"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "She doesn't teach well at all. But she's nice. All group work so if you get a bad group that will be hard.",
        "course": "HDFS4370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Alexandra",
    "id": "VGVhY2hlci0yNDM5NDM1",
    "lastName": "VanBergen",
    "legacyId": 2439435,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Alex was the best professor I've ever had. Participation, course activities and online quizzes. No exams, just three papers that are about a character that relate to the topics. Can submit prompts weekly to earn feedback and extra credit! The final paper is the first two combined with a few more prompts. Lots of chances to earn extra credit!",
        "course": "HDFS2420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Stephen",
    "id": "VGVhY2hlci0yNDk1MTg3",
    "lastName": "Gavazzi",
    "legacyId": 2495187,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Gavazzi is a passionate and fair professor. He wants you to succeed in the course, sets clear grading criteria, and offers feedback on assignments. The structure of the course is easy to follow - I would definitely recommend!",
        "course": "HDFS5350"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Gavazzi is truly a professor who cares for his students and their well-being. He is always available to give feedback and will never make you feel stupid for a question or an answer. He also is very laid back and funny in class!",
        "course": "HDFS5350"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Gavazzi was one of my favorite professors. He is passionate about what he teaches and really does want his students to succeed! Class consisted of weekly discussion boards, quizzes over the chapters and 2 papers! Complete all work on time and put in effort on your papers and you will pass with no issue. 10/10 recommend Professor Gavazzi!",
        "course": "HDFS5350"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Gavazzi was such a genuine professor. He wants his students to succeed and offers so many options to improve your grade or earn extra credit. The textbook is written by him which helped to really understand the content.",
        "course": "HDFS5350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Human Development",
    "firstName": "Colin",
    "id": "VGVhY2hlci0yNjQ0OTE5",
    "lastName": "McGinnis",
    "legacyId": 2644919,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "I believe Colin is a new professor, which makes sense. The structure of this course was disorganized, and the assignments were tedious. Colin wants his students to succeed but failed to grade our assignments in a timely manner. Because of this, it inhibited our success in completing further assignments.",
        "course": "HDFS3450"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.4,
    "department": "Human Development",
    "firstName": "Karen",
    "id": "VGVhY2hlci0xMDk1Mzcy",
    "lastName": "Crockett",
    "legacyId": 1095372,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Do not take an online class. Listening to her online lectures is like listening to TV static noise- SO hard to understand. She asks for really specific things in assignments that aren't always easily found. She seems like she would be accessible if you needed help, and the class is fairly easy if you keep up, but do not expect to enjoy yourself",
        "course": "HDFS3450"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class is absolutely awful for an online class. 3 midterms where there is only 10 minutes to complete 15 problems. On top of that there is an unbelievable amount of reading and work to be done each week. This teacher is the absolute worst and I do not encourage taking this class or any class with this human.",
        "course": "HDFS363"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great course! She gets to the point and does not beat around the bush. Her exam are straight forward and material isn't too heavy. Very easy course if you show up to class.",
        "course": "HDFS3450"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great teacher! As long as you show up to class and do the assignments you'll do great. No busy work. She really understands young children, you can tell she has a lot of experience.",
        "course": "HDFS363"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "This teacher is awesome!  She really knows her stuff and will help you with anything!  The class is informative and I would strongly recommend her.",
        "course": "HDFS461"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Human Development",
    "firstName": "Meghna",
    "id": "VGVhY2hlci0yMjIwMzM1",
    "lastName": "Mahambrey",
    "legacyId": 2220335,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "(Intimate Relationships class) Meghna was one of my favorite teachers I have ever had. Super fun class, she is very very passionate about relationships and shows it through how she teaches it. There is one paper which is a research paper, but she breaks it down and has it due earlier in the semester which helped when finals came around. Super fun!!",
        "course": "HDFS5340"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Mahambrey was the best professor Ive had at OSU. She truly has a passion for what she teaches and encourages her students to think about things differently. Class was made up of discussions, quizzes, group work and a research paper. Attendance is a must but is very worth it!",
        "course": "HDFS5340"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "TA for my class as a PhD candidate. Very passionate about what she's teaching-- did other work during class the whole semester",
        "course": "HDFS3200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Interesting class, even more interesting professor. She teaches material from the book, but reading is not required. She cuts a lot of unimportant information. Only three papers all semester, max one page ea. Watches video clips (Ellen, vines, jimmy Fallon) in class and are tested on them, so attendance isn't mandatory but is recommended.",
        "course": "HDFS2400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Human Development",
    "firstName": "Micah",
    "id": "VGVhY2hlci0yMzI2MDE3",
    "lastName": "Gerhardt",
    "legacyId": 2326017,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Micah is a young grad student, but a good teacher. His class format is lecture and a participation activity. Easy to get a good grade",
        "course": "HDFS2410"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "This was my first online class and it was even easier than the in-person version of the class. I had to do a discussion posts and take a quiz every week. There were two projects and a final. Everything was basically word for word from the textbook. I ended with over 100% in the class. It just took awhile for assignments to be graded.",
        "course": "HDFS2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.9,
    "department": "Human Development",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0xNjc4OTc5",
    "lastName": "Lang",
    "legacyId": 1678979,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The course listed isn't accurate. Dr. Lang is an AMAZING professor. She truly cares about her students and is willing to work with you. The class was very organized, and she was always available to help us out! I recommend her for any course!!",
        "course": "HDFS2810"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved her and this class! Was so interesting and she sets it up in a really easy way to succeed. She is so understanding and helpful if you need anything. You get put into discussion groups so hope for a good group because you have to wait for them to do work to do your own with discussion posts. Some big assignments but they weren't too bad.",
        "course": "HDFS2810"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely loved her as a professor. Made a three hour class entertaining and really tried to teach about things the class was interested in. Group work (which is awesome when you have a good video), quizzes and group discussions.  If you put in the work, you'll do well. Probably my favorite professor at OSU.",
        "course": "HDFS362"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Good class. Good teacher. Easy class. Group project. Typical HDFS class. But she's cool.",
        "course": "HDFS362"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Steven",
    "id": "VGVhY2hlci0xMzg0ODkw",
    "lastName": "Petrill",
    "legacyId": 1384890,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very kind professor who drives me to go to class every day. Going also helps a lot for the exams given. Would take again and have learned a lot from the course that will help my career.",
        "course": "PSYCH3550"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "COVID-19: Class was asynchronous, optional synchronous lectures x1/wk. Straightforward exams, opportunities for points via weekly discussion boards. A few denser article readings but rare. Enthusiastic lecturer, very kind and cares about students' well-being during the pandemic.",
        "course": "PSYCH3550"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. He really cares about his students and wants you to do well. There are no surprises on the tests so if you go to class and put in the time you will do well. One of the best professors I've had at Ohio State!",
        "course": "PSYCH3550"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy, super nice. His study guides and in-class reviews before the midterms and final made them a breeze.",
        "course": "HDFS361"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best college professor i've had yet!! he really wants all his students to get A's and he makes sure he lets you know EVERYTHING that will be on exams. he posts class notes you can print off so class isnt mandatory but going to class is very helpful, plus you get bonus points. Exams are not cumulative !! AWESOME TEACHER",
        "course": "HDFS361"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "VERY good professor! dedicated to his work and students, no a difficult class. Slides posted before class (print off)with spaces for notes. Exams are easy, based on material only covered in lecture/discussion. Book is optional! VERY GOOD class and professor!",
        "course": "HDFS361"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 3.9,
    "department": "Human Development",
    "firstName": "Eugene",
    "id": "VGVhY2hlci0xNjkwODAx",
    "lastName": "Holowacz",
    "legacyId": 1690801,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Pretty easy class, but there is a bit more work than I expected. There is a discussion board, quiz, and essay due each week. The final was just a paper. Just do the work on time and you'll be good (even still, he is pretty flexible).",
        "course": "HDFS2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "There is a bit of work to this class, but it was really easy. There's an essay, quiz and discussion board post due every week and 2 reflection papers. Learned so much, the material was super informative. The TA's are awesome too! ",
        "course": "HDFS2200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "one of the easiest classes I've ever taken in my life. pretty much if you follow the rubric exactly and do the 3 assignments a week on time you'll end with 100%. he also gives really good feedback on your assignments too!",
        "course": "HDFS2200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing prof, very understanding and easily accessible. I learned so much from this class. Plus, lots of points are offered so don't worry if you mess up. The work is going to seem intimidating, I promise it isn't bad. Try your best and you will get the grade you desire.",
        "course": "HDFS2200"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Eugene is great and seems to do his best to make life easier for his students (esp during the SP20 pandemic). His class is very structured and can honestly be a lot of work, but once you get in the hang of it it's not so hard at all. There are study guides for the midterm and final that are pretty helpful, but still study on your own. Overall easy",
        "course": "HDFS2200"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 2,
        "comment": "Lectures were very boring. I could not wait to get out of this class. However, it was an easy A. ",
        "course": "2210"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "There are biweekly quizzes alternated with short answer papers that are pretty straightforward. The class feels long but the content is actually interesting and useful in my opinion. He has extra credit sometimes. And he takes attendance. I have not really used the textbooks required for the class because all the info to study is in the slides.",
        "course": "HDFS2210"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 1,
        "comment": "Posts all powerpoints, which is nice.  Group project & a final exam which is all essays.  Lectures are awful and make no sense while he is talking, but if you read the powerpoints later, you'll be fine.",
        "course": "HDFS4370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Human Development",
    "firstName": "Eugene",
    "id": "VGVhY2hlci0xOTQyMDkx",
    "lastName": "Folden",
    "legacyId": 1942091,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Do not suggest taking more than one Folden's classes at a time. All classes are set up the same, so the assignments are all very similar and take awhile to complete. The material is kind of boring, but he is a wonderful professor so it doesn't really matter. Basically an automatic A as long as assignments and exams follow the rubric he provides. ",
        "course": "HDFS3200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Folden is great! The material of the class is interesting and current. My only complaint is the assignments get very repetitive. Every week you will have a quiz, discussion board, and course activity. All very easy and graded fairly, just follow the instructions and it is a guaranteed A. Exams are easy and straight forward, but can be lengthy.",
        "course": "HDFS2420"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Folden was great. He would go very in depth to help with exam questions and was always very genuine. He was willing to help at all times and you can tell he really loves the topics. The exams were not timed, but it was a lot of writing to get an A. Would 100% take him again if I needed to.",
        "course": "HDFS2420"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "His need to be funny is distracting. He likes to hear himself talk. His lectures are preachy and practiced. Braggadocios. Bombastic. It was like he was acting & not genuine. The content is not difficult and he was an easy grader. Is grade inflation a thing here? I want a professor who knows the material more in depth and who is less needy.",
        "course": "HDFS2420"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was my second class with this professor, I love the style of the course. He is super easy to contact, and overall a wonderful human. ",
        "course": "HDFS3200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Folden was amazing! I had his class online because he unfortunately was unable to teach it in person this semester, but it was still such an easy class to take and understand! Material was fairly easy. Seemed so caring and like he truly enjoyed teaching this class! Definitely would take another class with him in the future. ",
        "course": "HDFS2420"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Folden is a great professor who is very responsive, even in an online class. He frequently checks in with students and can be flexible if needed. Course work is manageable and does not require a considerable time commitment. I would take his class again if I could!",
        "course": "HDFS3200"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Not a difficult course, but made so much easier by how good of a lecturer Dr. Folden is. Attendance is required but never felt like a chore, class was fun and engaging no matter the topic. The written response exams were easily the most difficult part of the class, but there are so many easy quizzes and other grades that they balance out.",
        "course": "HDFS2420"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the most invested, passionate professors I've ever had. For reference, he was awarded the Alumni Award for Distinguished Teaching in 2021 & many other honors/awards. He created or helped create (at least 5) classes in Human Development and Family Science. If you have the chance to learn under him before he retires, do it without question.",
        "course": "HDFS2420"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Folden is the BEST! A genuinely nice guy, who not only cares about his students but also wants them to succeed. The material isn't difficult but would definitely be harder to understand had he not explained everything so well. Always had a smile on his face and made coming to class easier.",
        "course": "HDFS3200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class asynchronously and I have still never felt so supported and encouraged by any other professor. Im so sad I only had one class with him. 10/10 would take a class with him again. Folden is golden!!",
        "course": "HDFS3200"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Folden is the embodiment of all that is good in this world. Assignments are clear and concise each week and never take up too much time. Even though I took this class asynchronously, he truly made the effort to make his students feel acknowledged, both academically and as a person. The kindest professor Ive had the pleasure of working with.",
        "course": "HDFS2420"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I would lay my life down for this man. I took Dr. Folden during the 1st covid semester and he is the most understanding professor I have seen. He knows that students don't want to sit through pointless lectures so he releases 1 condensed, well-prepared and straight-to-the-point 15 minute video each week &amp; he is very approachable in office hours.",
        "course": "HDFS3200"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "super easy class if you put forth the effort early on in the semester. read the book &amp; youre set! quizzes are short and easy. discussion posts are interesting. dr folden &amp; his TAs are always willing to help and post videos weekly. truly cares about his students even when online. loved this class!!!!",
        "course": "HDFS2367"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Folden is one of the best professors I've ever had. Clearly cares about students and teaching. This was a 4 wk class over the summer, so it was everyday. The class had thought papers (every class you write a paragraph or so), 4 discussion boards, 2 exams, and a 8-10 page research paper. The exams have more questions than points, so extra credit",
        "course": "HDFS5430"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "Eugene was one of the easiest professors I've had. He was very adamant about teaching and loved doing what he did. He tried to make class exciting so as not to bore you and was known to call on students for some answers/thoughts here and there. For every exam, he would give bonus points and would give you the short answers ahead of time.",
        "course": "HDFS3200"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Dr. Folden!  If you get the chance to take his class, DO IT!! He is soo entertaining and can make the boring material interesting. You can tell her loves his job and truly wants you to learn.  I would have to say he's one of my favorite professors of all time.",
        "course": "HDFS3200"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Folden literally brings me to tears I laugh so hard in his class! He is energetic and hilarious! He doesnt use powerpoints because he writes his notes by hand on the board during lecture. No need to read the articles or chapters before class, his notes are all you need. Exams are straight forward and easy. One 7pg final paper, but it's EASY.",
        "course": "HDFS3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Autumn",
    "id": "VGVhY2hlci0yNTc4NDA0",
    "lastName": "Bermea",
    "legacyId": 2578404,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The BEST professor I have had at OSU! The material interesting and participating in class comes very naturally. I promise you will be able to relate to many things in this course, even if you do not think you will. No midterm. No final. One paper, about 2-3 pages in length. All you have to do is show up to class and contribute. TAKE THIS CLASS!!!",
        "course": "HDFS3440"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy class, attendance is mandatory though. Just make sure you show up and pay attention in class and you'll get an easy A.",
        "course": "HDFS3440"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Bermea is a great professor! She is nice to students and accepts feedback. Multiple times throughout the course she changed our group work based off of what students wanted or added extra credit when asked. Attendance is mandatory and you will have to go to all the lectures, but other than that it is easy to get a good grade. ",
        "course": "HDFS4370"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Bermea is a great professor. She is passionate about what she is teaching and cares about her students. The class is mostly based on class discussions and group projects with a few quizzes and assignments here and there. If you follow her rubrics, you should get an A.",
        "course": "HDFS4370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.4,
    "department": "Human Development",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xODg5NTI0",
    "lastName": "Betz",
    "legacyId": 1889524,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "This course is okay, but grading and feedback were seriously lacking. I would get points off for things that weren't clearly explained and the grading was slow too. ",
        "course": "HDFS2367"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "\n(Review of a FALL 2022 HDFS 2367 American Family Issues Course)\nDr. Betz is a fine person, but as a professor, he is dry, disinteresting, and injects personal conjecture rather than focusing on facts. His references are inappropriate, and he lacks helpful feedback. I do not recommend him or his course.",
        "course": "HDFS2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Betz is an incredible professor. He is so kind, his lectures are really engaging, and he sets his students up for success.",
        "course": "HDFS2367"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was great. Dr. Betz enjoyed teaching the content and there were great discussions had. It took a long time to get grades back and there was no feedback to help on the final paper. There are daily writings every day, 5 assignments, and a final paper. Lots of opportunities for extra credit. ",
        "course": "HDFS2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "You are allowed 2 absences before affecting your grade. 5 1-page assignments throughout the semester which basically write your final for you. The lectures were engaging and interesting, with a peer discussion and short paragraph graded on participation each class. Final paper discusses family conflict in any movie you want. Dr. Betz was great! ",
        "course": "HDFS2367"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Nice guy, knowledgeable about the subject, TA does all the grading, slow turn around on grades, not a lot of opportunity to earn points. 16% of the grade consists of 4 exam questions, with exams making up 50% of the total. Participation in class is only 13% of the grade.",
        "course": "HDFS2900"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Betz is obviously a very nice guy, and he does his best to make the class interesting despite the super dry material. His tests are straight off the study guides, but he grades the essays harshly, so know your stuff beforehand.",
        "course": "HDFS2900"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very dry content and he doesnt make it any better. Stands and lectures the entire class and doesnt put any notes on the slide so you have to be constantly listening. He also doesnt grade anything, the TA does. Gives a study guide for the 3 exams, which were helpful. Dont need the book. No true attendance/class discussion points.",
        "course": "HDFS2900"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE HDFS 2900 WITH PROFESSOR BETZ. His test are way too hard. He has no true attendance system. He is very unorganized.",
        "course": "HDFS2900"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy if you study and pay attention. He gives you a study guide for the exams that are very straight forward. Homeworks are also easy, only 5 throughout the semester",
        "course": "HDFS2900"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Human Development",
    "firstName": "Theresa",
    "id": "VGVhY2hlci0yMTcyMzg2",
    "lastName": "Settle",
    "legacyId": 2172386,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very caring and willing to help you if you ask. Gives a lot of work and is very specific about it how she wants it.",
        "course": "HDFS2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.7,
    "department": "Human Development",
    "firstName": "Roy",
    "id": "VGVhY2hlci0zNzgxMzA=",
    "lastName": "Fish",
    "legacyId": 378130,
    "numRatings": 25,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Roy doesn't have too much interaction with his online classes, but he was super helpful when I needed  him. Also, he'll send out reminder emails every week for deadlines. The midterm and final are very easy. You will have weekly work to do online, but it was extremely easy. It takes some time, but an easy A if you do the work.",
        "course": "HDFS2400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class! I took the online version and It's super easy. You get to take each quiz 5 times and the midterm and final are 90% questions from the quizzes. If you do the work you will get an A.",
        "course": "HDFS2400"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Clearly states his expectations out of students for the course. Just stay on top of assignments and review previous quizzes to study for exams and you should come out with a good grade.",
        "course": "HDFS364"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took the class online...awesome!  Easy A if you stay on top of the quizzes and posts. Make sure you take the quizzes all 5 times as the midterm and final questions directly come from the quizzes!",
        "course": "HDFS364"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Take the class online! Very easy!  Stay on top of quizzes and discussion posts.",
        "course": "HDFS364"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "take him! easy a!",
        "course": "HDFS364"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took the online class. He is extremely helpful.  Do quizzed and study from those.",
        "course": "HDFS364"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took the online version and its really easy. Make sure you take each quiz 5 times and study that for his exams and you'll do fine.",
        "course": "HDFS364"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took online course. You have a quiz each week but is an easy A if you wait til the last second and look at the &quot;Q&A&quot; discussion board. Also have to post 5 posts every 2 weeks which is also easy. Tests are kind of hard but his study guides make them a little easier as long as you go through them. Study guides are essential to doing good on the tests",
        "course": "HDFS364"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely LOVED him! I took the online version and loved it. It's very organized, he is very helpful, and the material is actually pretty interesting. As long as you do the weekly quizzes and study for the midterm/final you'll do just fine. There were two papers but they were very easy and graded leniantly. LOVED IT! Take this class!",
        "course": "HDFS364"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "NOTE TO ALL: seriously. for the midterm and the quizzes, take all the 19 quizzes 5 times each. it may seem annoying, but actually try on each of the questions. for the ones you miss, look them up. print them all out and ONLY study them for the tests. 99.9% of test questions come from quizzes",
        "course": "HDFS364"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "amazing amazing amazing prof. wish all my teachers were like roy. extremely clear instructions. extremely helpful. doesnt put up with **** only bc he is extremely fair. all students should know exactly what he wants bc he explicitly states his instructions in more than one way. i took this class online and it was the easiest class ive taken",
        "course": "HDFS364"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "I didn't appreciate how organized and clear Dr. Fish's distance learning class was until I took a bad, poorly organized class.  Everything is laid out in the syllabus, and things were organized very well.  Dr. Fish requires that his students do some writing in this class, which is a good thing.  He is responsive and helpful, as are his TAs.",
        "course": "HDFS364D"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "VERY GOOD PROFESSOR, KEPT THE CLASS INTERESTING AND TEACHING STYLE WAS CLEAR",
        "course": "HDFS101"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Fish, is so approachable. I took the online version of his class (Winter 09) and enjoyed it. His response time to questions was great which is important because the class is online. If you read the chapters the quizzes/exams are self-explanatory and you will breeze through the class. I would highly recommend him as a teacher.",
        "course": "HDFS364"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Fish was a very nice/helpful teacher. I took the online version and found it to be really easy. To ensure an A on exams - take the quizzes many times and study them hard. Test q's come directly from the quizzes. I never read any of the chapters and got an A just by doing this. There are a few assignments but they are easy as well.",
        "course": "HDFS364D"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 3,
        "comment": "I took the online version and overall it was very easy, but the syllabus does tell you that you must participate in discussion boards that do not pertain to class to get an A.  I wrote on DB's 7 times and got A's on every single assignment but got an A- for the course because I didn't participate enough&#63;&#63;&#63; Rude when I emailed him too.",
        "course": "HDFS364"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "All I have to say is know the quizzes for both the midterm and the final. He pulls questions directly from the 19 online quizzes so if you know these questions, it is very easy to get an A on the exams. The quizzes are impossible not to do well on because you are allowed to take them as many times as you want. This is an easy class to get an A in!",
        "course": "HDFS367D"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "I liked the setup up this class online. However, the 6 point quizes were 15 questions that were questions in the fine print of the book. Midterm and Final was decent and some of the assignments weren't bad. If you keep up with the online discussions and quizes you will do fine.",
        "course": "HDFS367D"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Fish (was a GTA, but graduated) is one of the best professors at OSU!  He is very personable and friendly, and will go out of his way and do anything to help the students succeed. He grades fairly and his tests are not hard as long as you study for them. I wish there were more classes that I could take of his! I highly recommend him!",
        "course": "HDFS367"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Roy is a great professor.  He is very lenient with his writing assignments and willing to help his students in any way possible.  He adds funny clips to his slideshows to keep everyone interested.  I highly recommend him if you need a second level writing course.  Oh, and he throws a pizza party at the end of the quarter! :)  Can't beat that!!",
        "course": "HDFS367"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Such a nice guy, I wish there were more classes I could take of his!",
        "course": "HDFS367"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very nice guy, and very personable.  Assignments are reasonable and course material is well organized.  Does not spoon-feed you the notes, but does give you almost complete powerpoint slides to keep you listening and filling in, which I think is way better than just seeing all the notes done for you",
        "course": "HDFS367"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "HDFS367"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "This guy is great. He's personable, has his PowerPoint slides on the web, and grades more then fairly.",
        "course": "HDFS367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.4,
    "avgRating": 1.1,
    "department": "Human Development",
    "firstName": "Tatiana",
    "id": "VGVhY2hlci0xMDk1Mzc0",
    "lastName": "Vashchilko",
    "legacyId": 1095374,
    "numRatings": 29,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Although I learned next to nothing in this course, it was an easy A+ if you put in a bit of effort; she graded ridiculously easily. Her lectures were confusing, but if you used her PowerPoint slides to complete your projects you would get 100%. If you're confused about anything, talk to her in person and she'll tell you exactly what to do.",
        "course": "SGMA591"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Just no. Shell ask you a question, that no one knows the answer to, will wait for you to answer, and when someone finally answers, they're wrong, and she can't explain why. She sends an email everyday clearing confusion, because she can't ever explain it properly in class, in person, or on any of her platforms. Be ready to know things you dont know",
        "course": "SGMA591"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I'm about 3 weeks into the semester and can tell you that Tatiana is the WORST professor I have ever encountered. Don't answer her questions because you'll be wrong anyways and she won't be able to explain why you're wrong. You're just wrong. Participation is important because we're still in Junior High, right? How did she get hired as a Professor?",
        "course": "SGMA591"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her lectures are extremely terrible. Use your textbook and quizlet! She doesn't explain things clearly. The tests were actually composed of all information in the book. good luck. ",
        "course": "BUSMHR2000"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Grade is based entirely on 2 exams and online quizzes. If you don't read, you won't pass the exams. The lectures cover maybe 50% of the material on exams. The powerpoint slides are online, and her lectures are pretty unorganized. 2nd exam seemed way harder than the first. No curve. Hard to want to go to her 8am class considering the bad lectures.",
        "course": "2000"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Wanna use a sigh emoji here. Her class is boring and she is a little mean.  No curve and no email response. In addition, I still have no idea why she never upload PowerPoint before class",
        "course": "2000"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "I haven't been to her class since the first day. You can't understand a word she says and her lectures are very unorganized. I don't know how she has a job here. The online quiz answers are all on quizlet and the exams are manageable. Do yourself a favor and take it with a different teacher, or just don't go to class.",
        "course": "2000"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is so disorganized, her lectures never make any sense but she makes you participate. Our class was small and we have lots of presentations which she interrupts and takes over so you show the information in the same disorganized way she would. Awful teacher, avoid if possible",
        "course": "BUSMHR3000"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "Cant understand anything she says.  almost all of her exam answers are on an online test bank.  Helped my grade ;). Apparently used to have inclass assignments.  Not the case this year",
        "course": "BUSMHR2000"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "So picky!!!",
        "course": "BUSMHR"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her lectures are helpless and she has very heavy accent. It doesn't make any difference if you are going to the class or not. The quiz is confused and exams are difficult. Never taking her class! ",
        "course": "2000"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "By and large the worst teacher I have ever had. DO NOT TAKE THIS CLASS WITH HER TEACHING. I can't believe she got a job here in the first place. She is so disorganized it's comical. Have to attend lecture to get bogus points. She's so bad I have my headphones in the whole time. God awful. Tests are somewhat reasonable if you read the book.",
        "course": "BUSMHR2000"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "CAN'T UNDERSTAND HER LECTURES AND HAVE TO GO TO CLASS DUE TO THOSE RIDICULOUS PARTICIPATION POINTS...",
        "course": "BUSMHR2000"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is a horrible teacher, not because her heavy accent, but because the way she teaches. Waste so much time just to make sure everyone participates in her confusing lecture. Wait until another professor teaches this class, or you have no choice.",
        "course": "BUSMHR2000"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 3,
        "comment": "She tries to use this \"Learning Catalytics\" thing and usually runs out of time before we have the chance to get our participation points. Says \"but ummmm\" so many times it feels like I'm watching How I Met Your Mother.",
        "course": "BUSMHR2000"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "A percentage of your grade will be marked on how often you participate in a lecture hall that seats over 300 people. The professor is ambitious in her lesson plans, often wanting the large class to break off into groups or play jeopardy. Very uncomfortable for people who do not like to speak during class.",
        "course": "BUSMHR2000"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "I have never had a teacher with such a thick accent and who could not understand her student's more. Tries to make every student contribute to lectures in a 250+ student lecture hall. She could not finish a lecture on time if her life depended on it.",
        "course": "BUSMHR2000"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "The WORST teacher I've ever had!! Do NOT TAKE THIS CLASS!",
        "course": "BUSMHR2000"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Thick accent, required professor for the course. Half the time I cannot understand what she is saying and it doesn't seem like she does either. Has participation mandatory in a 200 person lecture hall. If you don't have to take her, don't.",
        "course": "BUSMHR2000"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 3,
        "comment": "Without a doubt the worst professor I've ever had and will probably ever have. Class is a complete waste of time due to her unfocused lectures and her nonsensical participation activities, the worst of which was a Jeopardy game for a lecture of 250 people. Unfortunately, she's the only professor offered, so you can't get around taking her class.",
        "course": "BUSMHR2000"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Super hard to understand, cannot follow any of her ideas because every other word is \"uhhh umm so ok\". Class is stupid because of the participation points. She's not in touch with how classes work here dont take it if you dont have to.",
        "course": "BUSMHR2000"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "Near impossible to understand through her thick russian accent. Lectures are unbearable, but required due to participation. Worst professor to teach this class, but had no other options. AVOID FOR YOUR GRADE AND MENTAL SAKE.",
        "course": "BUSMHR2000"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "Going to her lecture is torture, she \"um\" a lot, heavy accent, hard to follow. online quizzes are not that hard, but heavily based on the textbook. strongly don't recommend it.",
        "course": "BUSHR2000"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "don't take her class for your sake....",
        "course": "BUSMHR2000"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wish I had other choice than taking her class but unfortunately she's the only one teaching this class this semester....And every lecture I had a hard time understanding what she's talking about....I don't think her lecture's that useful, but I have to go anyway just because of those ridiculous (personal opinion) participation points.",
        "course": "BUSMHR2000"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "We have no choice to take other professors' class! There is only she who teaches BUSMHR2000. Her classes are horrible! Strong Russian accent, don't know what she's talking about, not helpful at all. She even asked 250 students to change seats in classes just for her to take attendance, oh, and also looked at the tiny words on the screen.",
        "course": "BUSMHR2000"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "I have only been to 3 lectures of this profession, and man it was torture. I had a really hard time trying to figure out what she was talking due to her thick Russian accent. I am going to drop this class!!",
        "course": "BUSMHR2000"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is the worst teacher I have ever had! DO NOT take her class! I would say she makes more grammar mistakes than I do in her meaningless lectures and slides. If you want a reasonable grade for your effort, avoid her because she teaches nothing and expects you to know everything. She really hurt students!",
        "course": "BUSMHR2000"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is a nice person, but her class is extremely boring.  The lectures are hard to sit through and make little sense due to her thick Russian accent.  Although the tests weren't hard, I would take someone else if possible so you can enjoy the class time.",
        "course": "HDFS650"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Human Development",
    "firstName": "Sujata",
    "id": "VGVhY2hlci0yMjI0MjE3",
    "lastName": "Ponappa",
    "legacyId": 2224217,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Weekly quizzes with two tries, two discussion posts, and two short papers. One of the easiest classes you'll ever take. Some quiz answers are on quizlet or just use the index of the book to find the page the answer is on. The only way someone could not get an A is if they didn't complete the assignments. Highly recommend for an easy A.",
        "course": "HDFS2400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was great because it did not take up very much time. There were a couple of short papers, and every week there was a 5 point quiz (based off a chapter in the book) due. She even gives you 2 tries on the quizzes, so it is very easy to do well in her class. I definitely recommend it.",
        "course": "HDFS2400"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Super strict and serious. No wiggle room. Boring and dry lectures. Professor assigned group projects",
        "course": "HDSF4370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.9,
    "department": "Human Development",
    "firstName": "Sean",
    "id": "VGVhY2hlci0xOTI1ODgy",
    "lastName": "Noe",
    "legacyId": 1925882,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class is all about education, so if you don't want to teach it may become repetitive and boring.",
        "course": "HDFS3620"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's very helpful and clear on the important material. He'll tell you what to focus on even though there might be a lot of slides in his lecture. He's an easy grader and very clear. 5 Assignments in the semester but easy to do. Participation matters because his lectures have blank spaces which you can only fill by being in class. Easy quizzes",
        "course": "HDFS 3620"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Classes were too long. He was always trying to cram a million slides into one lecture. ",
        "course": "3620"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Human Development",
    "firstName": "Tracy",
    "id": "VGVhY2hlci0yMTA0MTA5",
    "lastName": "Settle",
    "legacyId": 2104109,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Read 1 chapter per week, do a short discussion post, 2 responses, and a chapter quiz. One family tree project. Worst part is reading the book, but even that isn't bad. Very responsive and understanding. Makes it sound like it will be hard to get 100% on discussions, but I haven't missed a point yet. Definitely would recommend, especially online.",
        "course": "HDFS2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super helpful.  Weekly assignments but not tough.  Projects are long but not tough would def recommend her and this class.  Took her online idk if in class would make a difference but would definitely recommend it online.",
        "course": "HDFS2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Human Development",
    "firstName": "Mitchell",
    "id": "VGVhY2hlci0xNDYxNTgz",
    "lastName": "Bartholomew",
    "legacyId": 1461583,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's extremely helpful, but his jokes kinda suck at 8:30 in the morning.",
        "course": "PSYCH111"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mitchell has a lot of respect for his students and is genuinely keen on making the subject matter as relatable as possible. The classroom was a safe place for us to discuss opinions. Mitchell was very well organized; his instructions for our assignments were always clear and to the point. Glad I signed up for his class",
        "course": "HDFS2420"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I would take another class from him. I loved the way the classroom was like a democracy, we learned and participated the way the students wanted to. I really appreciated the set up of the class and how he really related to the students. The twitter campaign was a great way to allow us the opportunity for our learning to be used for the real world.",
        "course": "HDFS2420"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mitchell is probably my favorite professor I have had at osu. He is a great guy, I actually picked up an HDFS minor and took two of his classes because of how much I enjoyed his first class. Good teacher and motivated to engage discussions, which I enjoyed a lot.  He also looks like Noah from the notebook which made paying attention a lot easier.",
        "course": "HDFS2420"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor! Options for which class project you want to do, opportunities to gain back points lost. Optional textbook, and had a survey before class started to find out what topics everyone wanted to learn about and how they prefer class to be structured. Really awesome professor!",
        "course": "HDFS2420"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Mitch is an awesome professor. Very chill, and willing to help you out. Pretty easy class; we didn't use a textbook at all.",
        "course": "HDFS2420"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Nicest professor I've had. He's not bad on the eyes either. Two thumbs up!",
        "course": "HDFS"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was a pretty good teacher. The class material wasn't very difficult. And we had group work. I thought it would be horribly painful,but it really wasn't. He enjoys teaching and admits that he's not necessarily an expert in the field but will use his resources and encourages students to use theirs to find the answer (encourages laptops in class!)",
        "course": "HDFS363"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "He changed his syllabus very often & moved project due dates around. He should check the academic calendar and plan more accordingly. Also, the group work he created involved too many people in a group (6-7 people). How does he expect 6-7 people to have schedules which allows for them to meet up enough to prepare a project&#63;! But overall, easy class",
        "course": "HDFS361"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Definitely one of the better professors I've had. The class is easy and attendence isn't mandatory. He may not be an expert on the subject but he will do the research to find you an answer. And it's worth going to the lectures just to look at him!",
        "course": "HDFS361"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "Really good class, interesting topic. The level of difficulty is low and it is a nice class to take if you are looking for a change from some of the impossible classes at OSU! He is really young and you might as well go to every class because he is good looking.  You don't need to get the book because the slides pretty much tell you everything",
        "course": "HDFS361"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very helpful and really tries to help the students learn. Easy-going atmosphere but you still learn lots of material. Not to mention gorgeous :)",
        "course": "HDFS361"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "I actually enjoyed this class.  Even though I don't necessarily like the topic of child development the professor tried to make it interesting and showed relevant material outside of the really dry book.  There are also a lot of opportunities for extra credit so that helped my grade when I missed a class...and he's not bad to look at either.",
        "course": "HDFS361"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class is a good one to take if you are looking for an easier class one quarter.It is interesting and you don't learn complex material.  The professor is really helpful and understands where students are coming from. He knows we have lives outside of class. && i agree ... pretty good looking.",
        "course": "HDFS361"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was good for an easy A but the prof has no idea what hes talking about in terms of course content. Probably one of the most boring lecturers i've ever had but class attendance isn't really necessary to succeed. I'd recommend it based on ease",
        "course": "HDFS361"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dashing. Just plumb dashing.",
        "course": "HDFS361"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.7,
    "department": "Human Development",
    "firstName": "Felisha",
    "id": "VGVhY2hlci0xMjg4NzY4",
    "lastName": "Lotspeich",
    "legacyId": 1288768,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I enjoyed this class, especially the format of it. As long as you can apply your life to the material and group discussions, you are set. Dr. Lotspeich is very kind and helpful as well. ",
        "course": "5350"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very nice. Helpful if you ask questions. Would take another class with her!",
        "course": "HDFS364"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "She was very scatterbrained. Nice girl though.",
        "course": "HDFS364"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Erica",
    "id": "VGVhY2hlci0xNTAwMTE2",
    "lastName": "Hartwell",
    "legacyId": 1500116,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very nice and smart.  Go to class, participate a little, and do the work and you will do great.",
        "course": "HDFS370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 3.8,
    "department": "Human Development",
    "firstName": "Samuel",
    "id": "VGVhY2hlci0xNTU4NDA2",
    "lastName": "Shannon",
    "legacyId": 1558406,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Really easy if you can suffer through a bunch of dumb 18 year olds express their opinion on parenting since he INSISTS on discussion and mandatory attendence. However, easy paper grader, the 2 exams are made up of the exact same online quiz questions you get 2 chances on and take throughout the semester. He's a good guy, bad at leading discussion.",
        "course": "HDFS2350"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I liked this class! You can tell he loves teaching, the content, and his family. Tries to make the class as helpful as possible. All powerpoints are online and questions for exams come from the quizzes. He is an easy grader and very understanding. Dont be scared off by the paper - it is not bad at all. I recommend his class!",
        "course": "HDFS650"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "You are responsible for taking your own notes, but it is hard to know what to write because all he does is write one word on the board incomprehensibly and then goes off on tangents. Every class we never got through all the material.The exams were pretty much our own opinions on parenting so it would be hard to fail a final which was nice.",
        "course": "HDFS665"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Keeley",
    "id": "VGVhY2hlci0xODEzNzY2",
    "lastName": "Pratt",
    "legacyId": 1813766,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Keeley rocks! She is super intelligent in her area of research and loves what she does. She is willing to accommodate as long as you communicate with her. Her class is easy as long as you attend and listen during lecture. The class may sometimes get boring but if you participate it makes it much more worth it and class is often dismissed early.",
        "course": "HDFS2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 1,
    "department": "Human Development",
    "firstName": "Rongfang",
    "id": "VGVhY2hlci0xODM3NDc0",
    "lastName": "Jia",
    "legacyId": 1837474,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her heart's there, but her language skills aren't. Huge language barrier. You don't learn much from her no matter how hard you try to decipher it all.",
        "course": "HDFS2410"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Directly from book and powerpoint.  Difficult to understand points made. Would miss this class every time and just read the book if it were not for the in-class assignments that are just a waste of time.  Take this class on-line if it is a possibility!",
        "course": "HDFS2410"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "So incredibly hard to understand her. Don't do it.",
        "course": "HDFS2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Kyle",
    "id": "VGVhY2hlci0yMTExMzI5",
    "lastName": "Bartholomew",
    "legacyId": 2111329,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a great lecturer and does not use the slides as a crutch, but as supplement to his lecture! He is very knowledgeable and passionate in the area of fam. sci..",
        "course": "HDFS3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Human Development",
    "firstName": "Anastasia",
    "id": "VGVhY2hlci0xMzk3NDk1",
    "lastName": "Snyder",
    "legacyId": 1397495,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not an interesting class but she makes it an enjoyable one. She is super smart and knows what she is talking about. Easy exams.",
        "course": "HDFS334"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was an excellent teacher and very helpful. I felt that I learned a lot in her class.",
        "course": "HDFS364"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "I couldn't stand this class.  Most boring I've ever taken at OSU.  She said the class was just recently made mandatory for HDFS majors which I think totally sucks. Not useful for all HDFS careers.  Teacher was nice, but just goes by powerpoint presentations everyday.",
        "course": "HDFS340"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 3.9,
    "department": "Human Development",
    "firstName": "Kimberlee",
    "id": "VGVhY2hlci0xMjU5OTc3",
    "lastName": "Kiehl",
    "legacyId": 1259977,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Kim Kiehl. She's a great teacher and very relevant to the class. She's easy going, keeps class interesting, and accepts assignments late!! She understands we are students w/ a lot on our plates. I turned in one paper a week late and got full credit and turned in another paper like 3 weeks late and still got credit. Kudos to Kim!",
        "course": "HDFS662"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a really great professor. She totally understands that her class is not the only one you are taking. I had a lot going on one week, and she let me turn in an assignment the following week. I really liked her and class was't so bad. She let us out 45 minutes early every class. I wish I could take a class with her again!",
        "course": "HDFS665"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "very very easy class, take this class if you want an A. but put the effort in as well.  she will not respond to your emails.",
        "course": "HDFS662"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "The syllabus stated that class was mandatory but she never gave us points or deducted them. We had 2 papers and 2 surveys. She was pretty easy going and worked around my schedule when I needed help with something. Great teacher & you should definitely take her if you have the opportunity!",
        "course": "HDFS665"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "class was really easy. all we did was two papers and two surveys. the syllabus said attendance was mandatory but nothing happened when i didn't show up... she is really interesting though, i only missed because i was sick! she is rally slow at responding to emails though, so approach her after class or something instead.",
        "course": "HDFS665"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. No book, online take home midterms you have a week (or more) to complete. Funny lecturer, but do go to lecture. It's pretty much mandatory for the rest of the grades and a lot of the info on the tests come from it. Take notes in addition to her powerpoints. Always ends class early. Just a great, no extra crap, teacher",
        "course": "HDFS665"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easiest class ever! Large part of your grade is a paper and open note/online exams that you have a week to take. Attendance is pretty much mandatory, but class is very interesting an she is very clear and explains her powerpoints well. you need to pay attention to lecture, even though the slides are posted, bc exam questions rely heavily on lecture",
        "course": "HDFS665"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 1,
        "comment": "Took over the class in the first week or so. She made the class a lot easier than it was supposed to be. We got the main points but she cut the busy work crap. A good teacher, but doesn't respond to emails.",
        "course": "HDFS662"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Had to attend class, but other than that the class was great. She gave us take home exams and only had one &quot;paper.&quot; She has easy points to bring up your grade. The only downside to this class is that if you have a question, do not expect an answer. She doesn't respond to emails.",
        "course": "HDFS665"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an awesome professor! She understands that we have other classes besides hers and doesn't assign too much work. Her class is so easy so I definitely recommend taking it!",
        "course": "HDFS662"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.6,
    "department": "Human Development",
    "firstName": "Amy",
    "id": "VGVhY2hlci0xMjMwOTQ5",
    "lastName": "Bonomi",
    "legacyId": 1230949,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Bonomi has a strong anti male bias and represses any discussion of female perpetrators of domestic violence. In a psychological sense she projects the negative attributes of society on men and the positive attributes on women. I was uncomfortable in her class and would not recommend it to male  or female students.",
        "course": "HDFS370"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor! I would recommend her to anyone! She is a free thinker and encourages one-on-one time with students. The class is mostly discussion based so no textbook is necessary. There is one major group project and a couple quizzes here and there but not many at all. If you do well with your group and grasp the concepts, you'll do fine.",
        "course": "HDFS370"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Bonomi is absolutely incredible.  She encouraged every student to think for themselves and made the class atmosphere extremely incredible. If you ever have the opportunity to take one her classes I strongly recommend it.",
        "course": "HDFS370"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was very easy and down to earth...We did not use text at all, instead printed article off line..She didn't give us exam either..We only did 2 papers that was two page long and 2 quiz's and 1 project...overall the class was very easy because it was mostly discussion..",
        "course": "HDFS370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3,
    "department": "Human Development",
    "firstName": "Kathleen",
    "id": "VGVhY2hlci0xNjk5MDA0",
    "lastName": "Artman-Meeker",
    "legacyId": 1699004,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Love her enthusiasm.  1 on 1 she gave great instruction.  But her group instruction was too ambitious/unfocused.  We did assignments we never received instruction on, we did readings we never talked about or were quizzed on.  We were given busy work to supplement her lack of clear instruction.  She's still a great resource, just not in a group.",
        "course": "EDSPE507"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's great! Definitely easy! Take this course. Besides having to go to class for points the class is a cake-walk and she's super nice. If your love little kids this class will be good for you. No book. Everythings on carmen.",
        "course": "HDFS461"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.5,
    "department": "Human Development",
    "firstName": "Jasmin",
    "id": "VGVhY2hlci0xODg5NTIz",
    "lastName": "Carmona",
    "legacyId": 1889523,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class. All quizzes are done online. Only one exam (the final) which is also online. If you attend class you will do fine. She has activity days, and if you are not there you lose points. Great prof.",
        "course": "HDFS2420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Human Development",
    "firstName": "Suzanne",
    "id": "VGVhY2hlci0xMzQwMDUw",
    "lastName": "Bartle-Haring",
    "legacyId": 1340050,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Just 5 quizzes and 2 tests the whole semester, which are pretty tricky and there are not many points in the class. She is a pretty good teacher in my opinion, able to clearly relate the theories with examples. We were required to purchase and additional $20 TopHat subscription for class attendance/participation though",
        "course": "HDFS3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Daria",
    "id": "VGVhY2hlci0xNTA2NTM5",
    "lastName": "Marchionda",
    "legacyId": 1506539,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Daria is uh-mazing. I loved her class and actually looked forward to it every week. She is a fair grader, helpful and best of all hilarious. She gives plenty of examples and time to complete assignments. I wish every writing class could be like hers - maybe then I would actually enjoy writing. TAKE THIS CLASS & YOU WON'T REGRET IT",
        "course": "HDFS367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Daria is amazing!!  She is very helpful and nice.  The class is easy but only if you go to class and pay attention.  She relates the material to our life.  Work and family seems boring but she makes it fun and interesting!  Fair grader and lets you argue grade if need be.  A must take!",
        "course": "HDFS367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher! She is really interested in what she teaches so she's able to actually relate to the students interests too. Available for help after class most days and always responds to e-mails. Show up to the class and pay attention and look over her powerpoints before tests and you'll do fine. Two big papers but that's it.",
        "course": "HDFS367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easily the best professor I have had in my two years. Willing to go above and beyond to make sure students get what they want out of the class. Extremely understanding and helpful. Everyone dreads the required second level writing course but she somehow made it something enjoyable, I actually liked going to this class. Definitely recommended",
        "course": "HDFS367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seriously she is one of the greatest professors I have ever had. She really wants everyone to do well and she is so nice and very helpful. I wish I could take her for the rest of my classes at OSU. She is amazing. Take her class for sure.",
        "course": "HDFS367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. Really helpful and wanted to be there for the students. Boring material, but she helped make it more interesting. Very fair grader - know whats on tests and papers. I would recommend this class to everyone!",
        "course": "HDFS367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very nice, funny, and helpful!",
        "course": "HDFS367"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Daria is one of my favorite teachers I have had at OSU. She takes the driest material known to man and makes it interesting. She connects with the class well. She goes above and beyond to help her students out and will do anything in your power to help you get a good grade. Definitely take this class!",
        "course": "HDFS367"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Daria is the BEST teacher at OSU! She teaches relevant information that is useful for every stage of life. She take a boring textbook and adds her own witty insight, and encourages class discussion. Go to class, study occasionally, and you are set for success!",
        "course": "HDFS367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.5,
    "department": "Human Development",
    "firstName": "Hana",
    "id": "VGVhY2hlci0xNTg4NDA4",
    "lastName": "Yoo",
    "legacyId": 1588408,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved her. She was funny but still portrayed the information well.  Her tests were straight forward and fair. She has an accent but speaks English well. It's funny to answer her questions about some things in the english language.",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 1.6,
    "department": "Human Development",
    "firstName": "Deborah",
    "id": "VGVhY2hlci0xNDM2Njk2",
    "lastName": "Wasserman",
    "legacyId": 1436696,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "worst teacher i have ever had. She is literally a nutcase who cant explain a darn thing.",
        "course": "HDFS362"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Even with my book I was unable to find the correct answers on quizzes.I failed this class because at the start of the quarter she told us that she believes everyone learns differently &class is not mandatory, but class activities are 20 points,but were never put online. she's horrible lecturer who makes everything more difficult than it needs to be",
        "course": "HDFS362"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Quizzes are IMPOSSIBLE. Hard to understand. She screwed up my grade and it is still says an &quot;E&quot; according to the registrar because of the insane way she grades her quizzes she screwed up the grading. I should have a B!!! This is still not fixed after a week and half of acknowledging to the class she messed up the grades.",
        "course": "HDFS362"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": ":( This class is horrible so far... her online quizzes are ridiculously hard.  She's a very nice lady and her lectures can be funny but the quizzes are wayyy too hard for an HDFS class, trust me!",
        "course": "HDFS362"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Human Development",
    "firstName": "Trina",
    "id": "VGVhY2hlci0xNDk5ODE0",
    "lastName": "Spencer",
    "legacyId": 1499814,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is not nice to her students at all. One of my classmates father passed away and she refused to allow her to make up the quizes in the class. She is really rude to her students when you ask her a question. There are quizes due every day before class and there are assignments due throughout the quarter. She's just not nice n very rude to students",
        "course": "HDFS464"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Human Development",
    "firstName": "David",
    "id": "VGVhY2hlci0xMzQwNjc3",
    "lastName": "Andrews",
    "legacyId": 1340677,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's a very funny teacher and I'd highly recommend this class. You do need to study for his tests, but they're easy if you study well! :)",
        "course": "HDFS361"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.5,
    "department": "Human Development",
    "firstName": "Tara Jeanne",
    "id": "VGVhY2hlci0xMjA2NjA4",
    "lastName": "Lehan",
    "legacyId": 1206608,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Her aesthetics were amazing, and her voice was one of the soft and sweet.  I think she is a great professor and I would love to take any of her classes! I actually enjoyed her lectures and I feel she is very smart. Did I mention beautiful&#63;",
        "course": "HDFS361"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Her exams were impossible! The questions are sooo specific  - it doesn't matter if it's online! She has you do busy work not related to her exam questions as well.",
        "course": "HDFS364"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "She's an awful professor. I agree with the other negative comments. She pretends to want to help you, but really has no interest in the success of the students. If possible, I'd take this class with another professor. I'd even have waited another qurter to take the class if I would've known how awful she is.",
        "course": "HDFS360"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "I took this online. She is ridiculous. She does NOT want to help you, and she definitely is flaky about her deadlines. She says something is due on one date, but then closes the window to turn things in early then blames the students. This happened to me several times. This class is relatively easy if you read, but a ton of busy uneeded busy work.",
        "course": "HDFS360"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I did not do as well as usual on the first midterm because I did not read the book. After I went to meet with her and started reading, I did fine on the other midterms. She also has you write papers and do activities in class that help your grade. You can definitely get an A in the class, but you have to put in the effort. Not for slackers!",
        "course": "HDFS364"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "She expects you to teach yourself. She wants you to have read the whole book and take outlines before going to class. Tests are impossible to do well on.",
        "course": "HDFS364"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed her class, it was very interesting! I liked how she did not act like she was far above us, as many professors do. She is very down to earth and creates a relaxed atmosphere in class. There is a lot of reading but it is interesting material. Tests can be difficult b/c she does not let you know what exactly to expect..good teacher!",
        "course": "HDFS360"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Test are completely ridiculous. Went to her afterward to see what I could do to improve on the next test and she could not give me any advice. She likes to act like she will help you but when it comes down to it she really doesn't.",
        "course": "HDFS364"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "HDFS360"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class was easy but time consuming. You have to do outlines for every class and know everything from the book and from lecture.",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Human Development",
    "firstName": "Arielle",
    "id": "VGVhY2hlci0xNDEyMTk0",
    "lastName": "Sheftal",
    "legacyId": 1412194,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is extremely easy! She posts her notes online before class--so all you have to do is just fill them in during lecture. The material can get boring and lengthy, but not her fault. She hands out a study guide before the exams, which is the exam itself. Go to class--its easy!",
        "course": "HDFS361"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 2.6,
    "department": "Human Development",
    "firstName": "Heather",
    "id": "VGVhY2hlci0xMjA2NjA3",
    "lastName": "Katafiasz",
    "legacyId": 1206607,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was a really hard grader on the projects/papers.",
        "course": "HDFS364"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Lectures quite a bit about HER job, but what she does is significant for a lot of the class material.  Seemed new at teaching, but worked with students after everyone did poorly on the exam and most of the class ended up with an A!",
        "course": "HDFS360"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "She lectures about what she does-family therapy. If you don't have a book you are screwed since she will test on things not discussed during class. She grades papers like shes an english professor. Boring lectures and requires you to participate in stupid &quot;activities&quot;. But she will work with you for xtreme circumstances. Always late.",
        "course": "HDFS360"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Terrible.",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Human Development",
    "firstName": "Rashmi",
    "id": "VGVhY2hlci0xMjAwNzYw",
    "lastName": "Gangamma",
    "legacyId": 1200760,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Enjoyed the class, it was an easy class, and she was a great instructor and always helped us.",
        "course": "HDFS364"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Attendance is only 20 points out of 300, so you don't have to come if you don't want to.  All notes are posted online.  No questions from textbook -- all questions are from powerpoint.  I did not buy the textbook and did fine.  Tests are no longer open book/open notes as others have stated.  There are two papers, 4 short quizzes, midterm, and final",
        "course": "HDFS364"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Rashmi! She is so nice and really wants her students to succeed. She is also kind of funny at times! The workload is very managable and all of our tests were open note with two large papers to write. Take Rashmi for a good time!",
        "course": "HDFS367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's an incredibly relaxed and kind teacher. Try to pay attention, don't pack up early or come in late. She really cares about the opinions of people in her class, and in our class even let us take a &quot;re-test&quot; because students thought the questions on her first test were tricky and confusing. If you have the opportunity, take her.",
        "course": "HDFS364"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.1,
    "avgRating": 4.8,
    "department": "Human Development",
    "firstName": "Atika",
    "id": "VGVhY2hlci0xMTA5MDk5",
    "lastName": "Khurana",
    "legacyId": 1109099,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "atika is a good teacher, very smart and knows what she is talking about! work hard on the study guide and you can definitely get an A in the class!",
        "course": "HDFS362"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Atika was one of the best professors I've ever had class with. Very approachable and understanding.Hope to get more classes with her.More like a friend rather than a teacher!Highly recommended!",
        "course": "HDFS362"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not a very hard class at all. She gave a very detailed study guide and was a helpful professor.",
        "course": "HDFS362"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "She's an amazing teacher and the class is really easy! Didn't buy book and still pulled off an A! Just be sure to attend class regularly and print off the notes before hand and you'll be fine!",
        "course": "HDFS360"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "I loved her! She really is more like a friend than a teacher and she made the class very interesting. Easy to get an A, she guides you through the exams and is very helpful. Fun class- I hope to take more classes with her!",
        "course": "HDFS362"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Atika is wonderful. She made the class vry interesting and fun. Textbook is unnecessary. She is by far my favorite and best teacher that I have had at OSU. I can't wait to take my next class with her.",
        "course": "HDFSHDFS"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was awesome!! She truly cares about her students and was very easy.  We had to write a 5 page paper and 90% of the class got over a 97%.  She is very nice and helpful.  A little difficult to understand sometimes because of her accent.  I would take her again if I could! Wonderful prof!",
        "course": "HDFS360"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class would not have been as interesting if I did not take it with Atika. She was so helpful, not only with class info, but also with truly trying to enrich her students' lives. Don't take the class with her if you don't appreciate this kind of teacher because she really cares. There aren't too many like her; try not to take advantage of her!",
        "course": "HDFS360"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Atika is one of the best instructors I have ever had at OSU!!! She is extremely nice and is genuinely interested in seeing the success of the whole class. Her exams we grade in class and she always provides a review sheet which is very helpful. She also has many activities in class to keep students interested. Overall great class.",
        "course": "HDFS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4.1,
    "department": "Human Development",
    "firstName": "Robyn",
    "id": "VGVhY2hlci0xMjQ5ODAw",
    "lastName": "Ziolkowski",
    "legacyId": 1249800,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "She inspired me to continue on to be a Kindergarten teacher.",
        "course": "HDFS461"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "You can tell she has worked with kids - lots of examples. Loved her - Hated the book, online discussions and Kohn!",
        "course": "HDFS461"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "great class",
        "course": "HDFS461"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "none",
        "course": "HDFS461"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I liked her - I work with children that have disabilities and was able to really use the information",
        "course": "HDFS461"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "HDFS461"
      }
    ],
    "SEI": []
  }
]