[
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Humanities",
    "firstName": "Nancy",
    "id": "VGVhY2hlci0xODYyNzQ5",
    "lastName": "Tewksbury",
    "legacyId": 1862749,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "I think she was funny and had interesting things to say. It was clear to me that all she wanted in the class was participation, even if the answer wasn't entirely right. The readings were a lot, but I managed to read it in like the 30 minutes before class started. Her insights were good. Overall, she's pretty gracious if you engage.",
        "course": "CHINESE4403"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nancy's class is very fair. Just be prepared for the assessments as her classes are assessment driven.",
        "course": "EALL1231"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've taken 4 classes with Professor Tewksbury, and she's easily one of my top favorites. She's very willing to work with you if you have issues, though she's very hard to reach outside of class, so you'll have to stay late or come early to talk to her. I only had to buy like one book for her classes, the rest used free materials.",
        "course": "CHI2231"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "While the other commenters here are focusing on her character (which crumbles under pressure), she is an incompetent teacher. She has no idea how to adapt to her students and make the content of her course engaging in any way. When offered suggestions about how to better her teaching style, she only can say that she has 20 years in academia.",
        "course": "CHI2231"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's amazing. She's a great lecturer, and goes on occasional tangents with fun insights into the content and her academic past. There's a fair bit of reading, but it's all pretty interesting. As long as you go to lecture you'll pass without a problem. She will call on people randomly, she really wants full class participation. Always interesting.",
        "course": "CHINESE2451"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a very respectable professor. She makes you read A LOT, so if you aren't into that then probably stay away. She gives constructive and helpful feedback, and grades fairly if she sees you try and participate. 2 in-class papers that she graded fairly and 2 presentations, graded fairly. I'm not even a good writer, so you'll be fine. Love her!!",
        "course": "COMPSTD1100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nancy makes you work for your grade but isn't that why you go to college. She stimulates your mind and makes you think. Lots of reading but very well worth it.",
        "course": "CHI4404"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "She will call you out in class if it looks like you aren't paying attention, and she takes attendance every day. Lots of reading (usually about 50-60 pages between classes), but many of the books/outside readings are very interesting. Two in class papers and two presentations (one in a group and one on your own). Lots of in depth discussions",
        "course": "COMPSTD1100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nancy is a fantastic lecturer with strong analytical and critical thinking skills. She frames the class subject matter (a chronology of Chinese drama and reading of several lengthy plays) with a social sciencey schema, extrapolating onto gender identity and female powersocial space in the works. Yes, it's a shxtload of reading but its worth it.",
        "course": "CHINESE4404"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Stay away from this course!! She expects you to read (and print off) almost 100 pages for each class. Need 4 books. She will call on you in class and ask you about the readings, so if you don't do them you are screwed. 2 in class papers and 1 final presentationpaper. You definitely have to work for your grade and lectures are the absolute worst. ",
        "course": "CHIN4404"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "I only went to her class twice and decided to drop. After syllabus day, she assigned over 80 pages in reading for the second class. She expects you to print the material, have it read by the next class (which for me was in two days) and participate in in-depth class discussion. I didn't want to go through her projects or essays, so I left. ",
        "course": "CHI4404"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is absolutely horrible. There is WAY too much reading. Last time I checked this was a 3-credit hour class, not 5. She is not clear about her expectations and wastes a great opportunity by making a potentially interesting course completely unbearable. It's only week 4 of the semester and I cannot wait to be done with this class. ",
        "course": "CHINESE4404"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "Overall, I really did not like this class. I barely learned everything and students were picked on randomly to talk in class. Being randomly picked on does not bother me much, but I know some people really do not like it. She was very confusing with what she expected of you. There were two presentations and a final paper.",
        "course": "CS1100"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Nancy allows for a semi-engaging class. Discussions make up 90% in class. In class writing 10%. As long as your vocal and active in class you're fine. However, grading is of a different story. First grade was received half way through the semester, the remaining at the end. She is also unwilling to change grades even if it is by .17 points B to B+",
        "course": "CS2103"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Nancy is a great professor. She is a deep thinker and helps teach her students to become so also. If you are the least bit substantially minded or interested in philosophy, psychology, sociology, or critical thinking you will enjoy the 2103 class on The Self. A lot of reading is required but it is all intriguing. Show up and apply yourself.",
        "course": "COMPSTD2103"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lots of Reading! But if you keep up with it and show up to class you will get at least a B. A couple of presentations that are decently enjoyable. This is not a blow off course though. You will work for your grade if you want a good one.",
        "course": "COMPSTD1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.3,
    "department": "Humanities",
    "firstName": "Amy",
    "id": "VGVhY2hlci0xMjYyODU0",
    "lastName": "Gregg",
    "legacyId": 1262854,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this class! So much work just for a ge credit. Be prepared to do lots of assignments and papers focused more on how to write than learning about the actual course content. She grades very strict and petty, so I would not recommend this class unless you are okay with doing lots of work and barely learning anything. ",
        "course": "PHR2367"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Stay away!!! Wayyyyy too much homework for a gen ed. On top of that, 90% of the homework she does assign is meaningless busy work which contributes absolutely nothing to your intellect. Super annoying class in my opinion.",
        "course": "PHR2367"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "Took this class over the summer and she posts \"lecture videos\" that are less than 10 minutes long, reads word for word off the slides so listening to her talk is useless, and then gives you 6 chapters of reading about how to write a research paper as well as 2 hours of other videos to watch. Not a hard class, just a bad professor. ",
        "course": "PHR2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's a very understanding and caring teacher. She responds well and gives many opportunities for help and guidance. A very helpful and kind teacher.",
        "course": "PHR2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Only to be addressed with Dr. Gregg or Professor Gregg nothing more nothing less. She's actually is a good professor if you give her a chance. Lots of readings and quizzes. Big final project in the end (not that bad). Just pay attention (even though it can get boring) and you'll have an easy A.",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Amy Gregg is a hard teacher. She is one of the few teachers who thinks its acceptable to give students more homework during the time of COVID because classes are online. She wasnt flexible for people who worked and always hosted class in terrible hours. She definitely took on more classes than she could handle which made the students struggle.",
        "course": "HIST2703"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Powerful woman. Only to be addressed as Dr. Gregg. No cinnamon gum or loud bags of chips in lecture. If you respect her, she will respect you. Attend extra credit and treat her as a PERSON. Everyone in class is scared of her, but shes really funny and approachable if you are as well. Passionate about cancer (husband in remission) precious woman.",
        "course": "HIST2703"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Amy Gregg expects people to participate but the minute you do, and she doesnt know the answer to the question, she will give a rude statement trying to make you look stupid in front of the class. She is constantly calling people out directly/indirectly and thats unprofessional. She isnt easy to talk to at all. Would not take her!!",
        "course": "HIS2703"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "I hope and pray that I never cross paths with such an arrogant self prof again. She teaches the humanities yet still calls Native American's &quot;Indians&quot;. She is patronizing and feels the need to talk down to students she is supposed to teach. Yet the course works seems to be designed for highschool freshman. DO NOT TAKE ANY CLASS SHE TEACHES",
        "course": "COMPSTD1100"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "It will be extremely easy if you are American students. This class's topic is racism. What she did to international students exactly fits her topic. An arrogant and unfriendly instructor.",
        "course": "COMPSTD1100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class was super easy, I think she gave out almost all A's, as long as you showed up and spoke at least once a week (it was a once/week class). Yet, she teaches her opinions as facts and is very condescending. I loved her as a person (talking after class), but hated her as a teacher. Recommended for an easy A!",
        "course": "CS100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "WOW! I can't say enough great things about Amy. She is an amazing professor who really knows her stuff! She knows all students personally and really strives to help you gather the picture of what life in like for American Indians. Amazing class and teacher.",
        "course": "CS100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Somethings seemed tedious, but she knew what she was talking about the the hot rating is no joke.",
        "course": "CPS367"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Totally awesome teacher. She knows her subject extremely well, knows every single student. You would actually learn from her class. This class will be the most refreshing time of your day. Highly recommended.",
        "course": "CS100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "She did an awesome job, it was a relief to go to her class and actually enjoy the class compared to my others...She did an awesome job, I HIGHLY recommend her, well worth it!!",
        "course": "CS100"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amy is an awesome professor.  Very dedicated to what she is teaching and identifies with everyone in class.  I wish could have taken more classes of hers!",
        "course": "CMST100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.6,
    "department": "Humanities",
    "firstName": "Ulises Juan",
    "id": "VGVhY2hlci00MjEzMzQ=",
    "lastName": "Zevallos-Aguilar",
    "legacyId": 421334,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "He's a nice guy, but my entire grade for the semester was based off 100 points. This was very frustrating as having 4 points docked from a midterm or final (which made up near 50% of your grade) dropped your grade significantly. Attend class or you'll be screwed. He offers some extra credit, but not enough assignments with how little there are.",
        "course": "SPAN4560"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hes an awesome professor, goes to the point. Office hours were definitely helpful!",
        "course": "SPANH565"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "He's a good guy, but I'm not sure what the point of the class was. We did e-journals for every class, a student presented on the reading, and then we had a class discussion. I'm not really sure what he did other than hand out a 93% to everyone. He's a nice guy and can be funny, but this class was a little frustrating.",
        "course": "SPA3450"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "Participate in class!! He grades off of participation, so talk a lot. He grades easy on exams. No final, just a final paper, which he helps you with.",
        "course": "SPA3450"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Honors seminar, mandatory attendance and participation. Not the most interesting professor but is very knowledgable. Fair grader. Nightly reading was a little much but you didn't have to read everything. Besides that, ejournals for reading, 2 presentations and one 10 page paper",
        "course": "SPAN680H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "You have to be committed with Indigenous causes to get the best of this course",
        "course": "SPANH565"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "He was a pretty bad professor. He went on tangents in every class and wouldn't let anyone talk. He has a certain answer in mind when he asks a question and any other answer is just flat out wrong. Most of the class is pointless and you probably don't need to go but, he grades on participation and attendance, so that sucks. DON'T TAKE HIM.",
        "course": "SPANH565"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "He interrupts students every time they try to speak. He does not allow for much student participation, yet he grades on participation. He grades just to have a certain amount of students receive each letter grade. I doubt he actually read all of our papers.",
        "course": "SPAN565"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "While the class ended up being easy to get a good grade, getting there was tough. He was not at all clear during lectures, and we never even talked about the actual poetry that the class was about, just beat around the bush. But that doesn't mean he didn't expect you to know it anyway. I'd say about 1/2 of each class was a total waste of time.",
        "course": "GRAD"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "SPAN650"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "SPAN556"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 2.8,
    "department": "Humanities",
    "firstName": "Jay",
    "id": "VGVhY2hlci01NzI3MjM=",
    "lastName": "Kandampully",
    "legacyId": 572723,
    "numRatings": 47,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jay was an amazing professor and the class was very easy. There were in class discussion questions and weekly review questions that were an easy A if you went to class. I will say though the lectures are quite boring but the material was very easy to understand. ",
        "course": "3910"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "mandatory attendance for only 4 lectures (discussions) and the answers are discussed in class. 2 papers but theyre easy, just make sure to start them a couple weeks in advance. no textbook - answers are from class and the lecture slides. 1 assignment a week where you answer 2 short questions. discussion every 2 weeks. no recordings though.",
        "course": "CONSCI3910"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Jay is not very clear with communication. Our class had to tell him to clearly communicate in order for us to get things done. He grades the leadership papers on how well of a leader you are, not how you understand the material which is frustrating.",
        "course": "CSHSPMG5780"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "The lectures are all over the place and it's a miracle that I scored as high as I did because I cannot tell you anything that I was supposed to learn from this course or the other course that I took. I feel for his story and its great that he made something out of himself but this was a waste of my tuition dollars. Don't buy the book.",
        "course": "CONSCI3910"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Honestly probably the most kind hearted and selfless person I ever met , he mad my senior year one of a kind.",
        "course": "CONSCI3910"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jay is the most caring and kindhearted professor I've ever had! He starts every class with an inspirational video because he truly wants to leave a positive impact on every one of his students. There's only one short assignment a week and two longer papers, so you can listen to lectures without stressing over memorizing everything.",
        "course": "CONSCI3910"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is such a wonderful and inspirational professor. Sometimes his lectures would make me really emotional. He really really cares for his students and is just an overall great person. You definitely have to try in his class, I wouldn't consider it an easy blowoff class or anything. I highly recommend taking him if you enjoy professors who care!",
        "course": "CSHSPMG3910"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Kandampully did an excellent job with this class given the circumstances. CSHSPMG3910 would usually be in person, but the COVID-19 pandemic moved the class online. He responds fast, gives good information, and is very understanding.",
        "course": "CONSCI3910"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is a very odd professor. His lectures are pointless. He teaches stuff that is common sense and you think that the quizzes will be cake. But they're not. I recommend buying the e-book. You're allowed to use the book on the quiz/test and it's much easier to search the words on the e-book vs. trying to find them with the actual book(which he wrote)",
        "course": "CONSCI3910"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 2,
        "comment": "Do the 15% extra credit paper since quizzes are SUPER hard (even with it being open note) for what the subject is. Seriously buy the book. Always show up on the discussion days, group projects, etc. are due. If you turn in a paper early into his mailbox, however, you do not need to show up for that class day. Pointless lectures.",
        "course": "CONSCI3910"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Kandampully is the best professor I have had at OSU. I am not even a consumer sciences major; and I learned the most I have ever learned at Ohio State, in his class. There are tons of quizlet accounts out there IDENTICAL to his tests, so just study and youll EASILY get an A.",
        "course": "CONSCI3910"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "He really cares.",
        "course": "CONSCI3910"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Tests aren't as easy as you would think. A lot of the stuff he talks about seems like common sense, but the tests weren't that easy. He was very nice and his lectures were interesting. Not a hard class, but you do need to study for the quizzes.",
        "course": "CSHSPMG3910"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "Discussions are easy, projects were pretty smooth. The quiz tests questions are very specific. Lectures are extremely boring but that's where he gives the notes. Hard to understand at times.",
        "course": "3910"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 5,
        "comment": "test are not as easy as you think there going to be. ",
        "course": "CONSCI3910"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "Awesome guy. Very easy class. 3 quizzes, 1 paper, 1 research project. Quizzes and paper are common sense, easy A's. Research paper takes time, but you have a partner and it goes by quick. I spent 3 days before it was due working on it, got 100. I'm a lazy student and this class was a breeze. I would absolutely recommend it. Jay is really cool, too.",
        "course": "CONSCI3910"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dreadfully boring and everything is pretty unclear. My partner on my paper decided to not help and he made me finish it on my own with no extension, despite telling me to wait for her. The class is pretty much common sense, but he creates graphs that are impossible to understand without going to class.",
        "course": "CONSCI3910"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class, nice guy. People need to quit complaining about this class being hard. Go to class occasionally, especially the one before the quiz, he will tell you EXACTLY what's on it. Start the term paper a few weeks before, that's it. I consider myself a lazy student, aced his class. Dunzo.",
        "course": "CONSC310"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 1,
        "comment": "DONT BUY THE BOOK.Extremely easy.3 quizzes 25 questions only worth 20 pts so you can miss 5 and still get a 20/20.project is 40% of grade.never used the book.Work on the project throughout the quarter not all at the end.Go to the class before the quizzes, he literally tells you everything that will be on them.",
        "course": "CONSC310"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "I would take CS 310 winter quarter b/c he doesn't teach it during this time.  Janielle Guerin teaches it and you have 4 quizzes and one 3page paper that you get full credit if you meet 3 pages. In this class you have to write a 15page paper and actually read the book.  Winter quarter you dont have to read his book. Just go to class.",
        "course": "CS310"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jays (guest prof. at our UAS)insights and comments on hospitaliy management were extremely helpful adding a broad int. approach to our tyrolian narrowness on the issue. Paper was a lot of work and not really fun to do. Hello from MCI/ Austria",
        "course": "HOSPITALI"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "he must of changed his style from the ones below i never went to calss and just showed up on quiz days, which were same as the book, and i did they 12 page research project and he checked it 5 times before we (group of 2) turned it in so we got 100 and there are 3 quizzes that are 40% of your grade and the 60% is that project easy A",
        "course": "CONSC230"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 1,
        "comment": "Extremely easy. I got a 100% in the class. The class is a joke. Just make sure you at least read over the material before his &quot;quiztests&quot; and do really well on the paper....write at least 15 pages!",
        "course": "CONSC310"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worst professor I've had in 5 years at OSU.He basically takes it personally if you don't make it to every class and treats you as if you had stabbed him because you were gone one day. The whole point of his lectures seems to be to stroke his giant ego. Good for him that he made it from nothing into a cushy teaching position, but nobody else cares..",
        "course": "HSPMG680"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "Kandampully was a HORRIBLE prof! he is useless, and if you miss just one class he condemns you to not get any help in his class. It was like the Kandampully parade with his stupid stories, and the &quot;textbook&quot; that he wrote! I don't care that he had to steal copper wire to feed his family when he was little and look at him now!",
        "course": "CON310"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 5,
        "comment": "He changed his style from huge papers to multiple choice tests this quarter and they are HARD!  He offered extra credit because the averages were low 60s but probably won't be as nice from now on.  You MUST go to class and take notes if you want to pass.  Class is boring, but he isn't as bad as some people say.  Con sci Majors Just grin and bear it",
        "course": "CONSC310"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 5,
        "comment": "TERRIBLE, he is the worst professor of my college career. Tells his class that his class is &quot;as easy as kindergarten,&quot; then 1/2 is failing after 2 midterms... he offers extra credit one day, unannounced, and then does not allow me (despite having documentation of a funeral i was at that day) earn these extra points... AVOID my buddy Jay at all cost",
        "course": "CS310"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 4,
        "comment": "useless. he's the author of the book so i'd suggest buying it bc if not you'll have no idea what chart goes with what... he published them all and they're horrible. wastes loads of class time talking about himself. o! and he &quot;100% guarentees&quot; everything. exagerates statistics and makes stuff up on the fly. nice but opinionated. i feel bad...",
        "course": "CONSC310"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 4,
        "comment": "One of the worst professors I have ever had in college.  Tells dumb stories that waste my time in class that have nothing to do with exams.  Avoid Jay if at all possible.  I dropped this class because his exams are so hard even though I went to every class AND read the awful book he wrote. UGH!",
        "course": "CS310"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 2,
        "comment": "Go to class (not mandatory, but extremely useful). Do not need the book. If you listen to him and study your notes from class, you will be fine.",
        "course": "CS310"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 4,
        "comment": "Where do I start&#63; I gladly ended up with a C+. For the paper he said my half was worth an A and my partners half was worth a C so we got a B. I thought that was toal BS. I got a 60 on the first midterm after he said it would be sooo easy. Then managed to get a B+ on the final. I went to 2 classes because everything is in the book (that he wrote).",
        "course": "CONSC310"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was my lowest grade of the quarter with a C+. He started the quarter saying the class was very easy.  If it was so easy why did half the class get below a 70% on the midterms&#63;",
        "course": "CS310"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor is worth avioding if possible. He loves to make up stories and lie quite a bit to the class. I was releaved to pass this course, since i went every time and barely passed his exams. Which are a joke and hard to do.",
        "course": "CS310"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 2,
        "comment": "So mean to students. Just an awful teacher.",
        "course": "CONS310"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 4,
        "comment": "I can't even believe a university like OSU would let this guy teach! VERY disappointed w/ his class, he is NOT helpful, and very stuck on how &quot;wonderful&quot; of a person 'he thinks' he is... I am an A student and I got a decent grade in his class but this is by far the WORST prof I have ever had. It's sad that he has a job...",
        "course": "HM680"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 5,
        "comment": "Hard to understand, rude to students, not helpful.  Failed half the people for the first midterm.  He is definately the worst teacher I've had in four years.",
        "course": "CONSC310"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 4,
        "comment": "Go to class, and you won't get an A..no one does",
        "course": "HM680"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ridiculously easy.  Papers are not that hard just babble for 14 pages and your good!  Test are pretty easy basically gives you the questions he's going to put on the test the class before test.  Attendence is mandatory, but have someone sign in for you...DUH!",
        "course": "CONSC310"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 3,
        "comment": "Probably the least helpful, and non caring professor ever. He's a jerk.",
        "course": "HM680"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was difficult to do well in.  His lectures are difficult to follow, and what he wants on assignments and tests is never clear.  The worst thing was that he said he would not drop grades for attendance, but he dropped me a whole letter grade for it.  If you take him, go to class!",
        "course": "CONSC310"
      },
      {
        "index": 41,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class sucks!!  He is so hard to listen to.  His stories often do not relate in any way to the topic of discussion.  Both of his classes are all about huge papers that are so repetative you wonder why you are typing them.  Beware...he takes attendance to heart!!  If you miss a lot of class or leave early often he will fail you!!",
        "course": "CONSC310"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 2,
        "comment": "He failed over 50% of the class on the midterm and you need a 60% to pass the class! Then when you go talk to him he is not helpful at all!",
        "course": "CONSCI310"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 3,
        "comment": "Assigns groups of 10-15 students for a 10,000 word paper.  RIDICULOUS and UNREALISTIC.  easy class tho, he still sucks.  If you talk in his class he starts telling stories about he moved from his country with just 10 dollars in his hand and then tells you to take the class next quarter",
        "course": "HM680"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 4,
        "comment": "To nice to be teaching!",
        "course": "TC310"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 2,
        "comment": "No interest in helping students learn, more interested in proving numbers attending! Treat us as managers&#63; Hah, doesn't even treat us as customers or staff, only numbers. Book not necessary if go to class. Class not necessary if read book!!! Would avoid this prof.",
        "course": "FRM310"
      },
      {
        "index": 46,
        "rating": 2,
        "difficulty": 3,
        "comment": "He does not treat you like a student&#63; He is not playing with a full deack of card!",
        "course": "FMRESM310"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class, great teacher very willing to help students.  Class is easy if you do not go and very easy if you go.  Attendance will assure an A on 16 page paper cause you can basically just rewrite the notes.  Have fun in this class it is fun and easy!",
        "course": "FRM310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.4,
    "avgRating": 2.1,
    "department": "Humanities",
    "firstName": "Christopher Alexander",
    "id": "VGVhY2hlci0xOTA5MTA=",
    "lastName": "Reed",
    "legacyId": 190910,
    "numRatings": 35,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "some of these reviews just mentioned his bad side, even though he is strict, he is a very experienced professor who has traveled to China and Japan and has personal accounts from his travels and his teaching reflects the culture taught there. and it is understandable as to why some people don't like him, he is not everyone's favorite cup of tea. ",
        "course": "HIST3404"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "While it was clear that he loved what he was teaching, his attitude toward the students was quite condescending. He blames technology mishaps on the students rather than accepting his mistakes. The essay exams are harshly graded on grammar mistakes rather than content, which should not be the case in a history course.\n",
        "course": "HIST2402"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "I don't want to perpetuate the idea all New-Yorkers are rude, but Reed is rude and harsh. He \"tries\" to crack a joke every now and then but what good does it do if in the same breath you make a student cry? Wanna take a history class? Choose a different Prof, avoid my mistake. He basically divided the class based on who he liked and who he didn't. ",
        "course": "CHINESEHIST"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "One positive? He's traveled to the places he teaches on. Beyond that as a professor he makes his students appear diminutive by how he spoke to us. Slow grader. Little to no helpful input on assignments or essays when asked how to improve. Rudely cuts off students during mandatory discussion. Insulted entire class on having to curve the final.  ",
        "course": "HIST3405"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "! pro is that he's smart, but the rest are cons. This class is supposed to be a 2000lvl class but is handled like a 3000-4000lvl class by the Prof. Both the Prof and the grader are difficult to communicate with and offer little no help. Anything both offer is layered with rude comments and insulting language veiled in \"polite correction\". ",
        "course": "HIST2402"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "In all honesty this Prof was had a few good moments of being funny, but none of that really mattered with how they spoke to our class as a whole and individuals. Very condescending and higher than thou attitude, if you want to learn about the history they teach then try another professor. Very clearly picks favorites and turns people on eachother  ",
        "course": "HISTOFCHINA"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Reed really seems to know what their teaching on(as a teacher should)but if you really need this class taking any of his classes as the only one for the semester it'll take up all your time it seems that's how he wants it to. He messed up a few assignment and quiz's worded wrong, when asked bout it he made it sound like the classes fault. ",
        "course": "HIST3405"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Reed has the credentials/knowledge to back up their place at OSU in their field, but high academic ability is no excuse for poor personal skills. He'd scold the entire class making to difficult approach for help let alone participate in the mandatory discussions. He never took ownership for his mistakes in class, avoid this professor. ",
        "course": "HST398"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is intelligent, yet holds little to no respect when speaking. He simply speaks over others, yet he requires class discussion. I can't help but ponder if he were recorded if he would still hold the position at OSU that he does, people of low humility have low character, and I'd rather not learn from people with poor character.",
        "course": "HIST2402"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Clearly cares for the history and knows much of what he speaks on. However, he is quit condescending and belittling in his speech towards his students and often lords his intelligence over that class in a manner removed of any humility. He can do no wrong nor make a mistake it seems. ",
        "course": "HIST3404"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "The class material is very interesting however, Dr. Reed is often very difficult to work with. He is a very tough grader and often inconsistent. There are required dicussions in class which would be reasonable if he didn't just decided some days to be downright condescending to some students if he didn't agree with them or understand their point.",
        "course": "HIST3404"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "Hardest class I took at OSU. This guy would have weekly reading quizzes, but the questions were dumby specific. I would have to take INTENSE notes and read them over and over again. The grading was hard, but he did allow you to get revisions before it was graded. I walked away learning a lot and it was actually a favorite course for me.",
        "course": "HIST3404"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Reed is a very knowledgeable professor and I learned a lot from his class. Attendance and participation during SLDs are mandatory and you have to read the books or you won't pass the quizzes. Overall it's not an impossible class but you definitely have to put in the effort. Final is a paper which is optional if you did good on the midterm.",
        "course": "HIST3404"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had a class with Dr. Reed over 20 years ago. He had a high expectation of his students. When I started his class, I lacked academic discipline. After finishing his class, I was a stronger student, writer, and analyst. Looking back, he had a positive influence on my life. He is tough, because he cares. He may make you better, if you give effort.",
        "course": "HST398"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "Home boy is very passionate about what he teaches, but he grades so hard.",
        "course": "HIST2402"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "Prof. Reed is a good historian, not a good professor. He assigns an abundance of homework on top of belittling students in both lecture and recitation. This class is obviously his entire life's work and he expects no less from his students. I am not a history major. I had an interest in Asia's history and his class made me lose all interest.",
        "course": "HIST2402"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "Spends the first 20 minutes of every class basically telling students everything they do wrong. He is not helpful and does a poor job of explaining where points are coming from. Does not use carmen and does not give feedback so you won't know your grade until the end of the semester. Honestly though, I suffered through it, you can too.",
        "course": "HIST3405"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "Seeing as the professor clearly wrote the previous post, ignore it. Prof. Reed is condescending, rude, and insulting. He expects students to know the most minute details of the reading and concepts and berates them when they don't know those concepts. His class is based on horribly facilitated group discussions. Worst history professor I've had.",
        "course": "HIST3405"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "Although Professor Reed can seem a little cold at first, he eventually warms up toward the end of the class, especially if he gets to know you.  His lectures can be a little dry at times, and you must take excellent notes because recording lecture is strictly prohibited. Take this course if you are dedicated to Chinese history and want a challenge.",
        "course": "HIST3404"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "Extremely hard professor. He posts a study guides prior to exams, but the exams don't relate to the lectures at all so you have to pretty much look everything up. Always went over class time. Do NOT take unless you're truly interested in the course.",
        "course": "HIST2402"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 5,
        "comment": "Prof. Reed is an extremely challenging professor. He pushed me harder than any prof. ever has done, and it's meant the world to me. Don't take his capstone class if you aren't willing to be challenged. But if you hang in there, you'll be better for it.",
        "course": "HIST598"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 5,
        "comment": "Don't take Reed's class unless you're prepared to work. Reed isn't the most approachable guy, and he does come off as rude (sometimes intentionally I  think, but if you do the work and participate you should come out of his class with at least a B, and understanding of China.",
        "course": "HIST546"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 4,
        "comment": "DO NOT TAKE. If you do, don't worry about going to the lectures, as they don't correlate with the exams. He's really disrespectful to his students and TAs, and has very elitist opinions. He also can't pronounce Japanese and Korean words very well.",
        "course": "HIST142"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst. Teacher. Ever. His lectures were unfocused, irrelevant to the exams, and tended toward bitterness. Very little patience with questions or with students in general. I did not enjoy this class, and felt that my recitation TA taught me more than he did in lecture. He clearly knows his stuff, but his delivery could use some work.",
        "course": "HIST142"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "Egomaniac. Wastes class time.  unapproachable",
        "course": "HIST545"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "Expects students to be history scholars prior to enrolling. Low tolerance for students who are not, or have not traveled to China (even though course has no prerequisites). Lectures are more of an incomprehensible rant, not always following outline posted the night before. He knows his stuff, very well, but good luck getting any of it from him.",
        "course": "HIST142"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "Please avoid taking Professor Reed.  He's very unhelpful and unpredictable.  He bad mouths students behind their backs.  I suspect he doesn't have very many friends because he is very abrasive and has a bipolar personality.  The workload is way too heavy for any right-minded person. He encourages class discussion but shoots down everything you say.",
        "course": "HIST598"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 5,
        "comment": "Definite chip on his shoulder.  Not approachable and not helpful.  He assumes that class is the most important/only class you have.  Impossible to please as far as grades.  Makes the student lose interest and not care anymore by week 5.  Do yourself a favor and avoid him.",
        "course": "HIST598"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 4,
        "comment": "He has a definite chip on his shoulder. He feels that students in his classes should view Chinese history as their lives, and thus regardless of historical background should have a perfect background knowledge before entering his class. He is callous, condescending, rude, and thinks nothing of trying to make his students feel inadequate.",
        "course": "HIST598"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 5,
        "comment": "He requires a lot of his students..an awful lot. He comes off as brusk and unapproachable but if he sees that you are really putting forth the effort to learn the material then he will bend over backwards to help you. His lectures are a little dry, and he spends a lot of time ranting about various subjects. Still, he is incredibly knowledgeable.",
        "course": "HIST142"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Reed is NOT the most helpful of Professors. Very correct in mentioning his major chip on his shoulder. One thing bugged me about him was the lack of teaching on his part. He expected the students to teach one another... he relied heavily on the p",
        "course": "HISTOFCHINA"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "I've had a roller coaster relationship with him. He knows an incredible amount about China, and you will learn things never reported in the US media. But he does have a chip on his shoulder and his grading is hard/unfair. Take him if you want to learn, but not if you want an A (it won't happen).",
        "course": "CHINESEHIST"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 4,
        "comment": "Disgruntled about life and does not really teach.",
        "course": "HST398"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 4,
        "comment": "This guy has a chip on his shoulder and seems somewhat defensive. I don't think he is a bad guy, but def. comes off that way.  Lectures are very scattered and it is hard to follow.  Interesting topics, but I haven't learned to much from him. Read the book",
        "course": "HIST142"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 4,
        "comment": "He yells at the students in lecture about the students that don't come to lecture. Plus, if you do try to answers his questions, no have to real importance, and you are wrong..he scolds you.",
        "course": "HST142"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.2,
    "department": "Humanities",
    "firstName": "Gail",
    "id": "VGVhY2hlci00ODk1MTI=",
    "lastName": "Kaye",
    "legacyId": 489512,
    "numRatings": 29,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I LOVE Dr. Kaye, she is the sweetest woman ever. I just hate that this class is mostly lectured/graded by her TA, who is kinda tough. However, she is very responsive with emails and willing to give feedback, so I don't think it's fair to give her a bad rating. The class itself is easy but the work can be tedious. I'd take her again in a diff class",
        "course": "PUBHHBP3510"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class was unorganized and lectures were not engaging.",
        "course": "4067"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very very sweet woman! Posts the cutest weekly update videos for the class. Lots of the grading/lecturing is done by the TAs, but Prof Kaye was very quick to answer any emails/questions I had. Not a very difficult class, the weekly assignments definitely forced me to learn the material and were sometimes long but never really hard!",
        "course": "PUBHHBP3510"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Kaye is such a wonderful person. I genuinely felt bad for skipping her lectures so often because she is such a kind-hearted soul. However, with that being said, it is probably the easiest class I have taken in college and definitely one of the most tedious. Loved the professor, definitely wished she taught a different class though.",
        "course": "PUBHHMP3510"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Gail is so sweet and caring. She reminds me of my own grandmother. The class is very straightforward and easy to do well in as long as you do the weekly assignments (some of which are worth as much as your final exam). The content is very interesting, but most of the time I learned it all myself before the two exams. No class on Friday.",
        "course": "PUBHHMP3510"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Gail is great! This was one of my favorite classes, 2 tests worth 10 and 15% of your grades. Weekly assignments with really clear directions, no class on Fridays. Would really recommend this class.",
        "course": "PUBHHMP3510"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Nice Prof. Easy A. Daily attendance not necessary but there are random pop quizzes (10) on readingclass activities throughout the semester. Study guides tell you exactly what info from the power points for the midterm and final. Group projectpaper was a huge pain. ",
        "course": "PUBHHMP3510"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "I didnt attend this class very much after the first exam.She gives us the powerpoints online between that and the book I didnt need the class.She basically just goes over the powerpoints anyway.I attended maybe five or six classes and still got an A.But I did study alot my main issue is she doesn't tell you what you miss on quizzes,just the grade.",
        "course": "NUTR310"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took this class because I had interest and it fulfilled my GEC requirement.  However she went a lot more indepth and made it much harder than it needed to be.  While it was interesting it was extremely difficult.  I read the book and attended every class and still struggled.",
        "course": "NUTR210"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took class online. very boring. out of 500 points 260 are practically given. the rest is the midterm and final..120 each. This class is basically like biology. Material is pretty tricky and test questions are extremely detailed. Carmen discussions are helpful. If you keep up with the reading you'll be fine. I didn't and still got a B+.",
        "course": "NUTRI310"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Kaye is extremely nice but I had a really difficult time in this class with exams.  There are a lot of easy assignment points and online quizzes but the tests were so hard.  The averages of the first 2 tests wer 71% and 63%. I'm hoping for a B- in the class. :-(",
        "course": "HUMNU210"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "Don't take the class, i thought i could get through it but i was wrong. It is so so boring, i actually fell asleep during lecture in a huge lecture hall. Material is difficult which i do not understand since it is just an intro class. she also assigns busy work that is completely pointless. And she is annoying-exaggerates her lame east coast accent",
        "course": "HN210"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Her lecture isn't the most exciting hour ever but the information she presents is clear.  She is extremely understanding and helpful if you need extra help or considerations....just ask in office hours.",
        "course": "HN210"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class was pretty easy.  She read everything straight from the slides, which were available online so basically I hardly ever went to class.  She does offer extra credit points from time to time for attendance, needless to say I didnt get any but I did recieve an A- in the class anyway. Read the notes and read your book, you'll be A OK",
        "course": "HN210"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "not that bad, never bought the book and got an easy A.",
        "course": "HNTR210"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Tests harder than you think. Need to read book and study the in class notes. She would throw in random questions especially calculations that she didnt say you needed to know. Nice lady, but not too great with her tests.",
        "course": "HN210"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "I think she is a great professor!!! Lots of information but she tries to make it easier. Quite a few extra credits which made me get an A-!",
        "course": "HUMNNTR210"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 2,
        "comment": "This lady is terrible. Bad at lecturing, bad at helping, bad overall.",
        "course": "210"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "I totally disagree with everyones comments and ratings. Gail Kaye was an excellent teacher and she really made the class fun. Her test were challenging but they were not that difficult if you studied",
        "course": "HUMNTR210"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 5,
        "comment": "i took this class last quarter on top of chemistry and stats and i was hating life. it is a lot harder than it should be. however, the final is literally made up of questions that were cut and pasted from the previous exams. study the previous exams for the final and nothing else.",
        "course": "HN210"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class is harder than it needs to be but get to drop 1 exam grade. She was nice to me when I talked to her. I agree the tests are tricky and throw in random facts from the book that weren't on the study guide.",
        "course": "HN210"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "she is a terrrrrrrrible professor, stay as far away from this lady as possible. I am an honors student and im gonna end up w/ a C in this class if I'm lucky i hate this class just because of this terrible professor. STAY AWAY",
        "course": "HN210"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 4,
        "comment": "I agree the test are hard, but you need to make sure she realizes the questions on the test are not from the study guide, and she will make the nexy one a lot better.  I got a C, F,B,B and pulled an A- in the class, just go to her to see what is needed, and the final is sooo easy!!",
        "course": "HUMANNUTRITION"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 3,
        "comment": "This professor is not very helpful. To my understanding she takes the material from a 300 level class and uses the same exact material for this entry level nutrition class. She does not like to hear problems and is very unlikely to help you with them.",
        "course": "HNTR210"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "Gail Kaye is the devil. She takes her job way too seriously and thinks we care way more than we do. Considering it's a GEC (aka GENERAL Elective Course) it should't be as hard as it is. If you take 210, don't take Gail Kaye!",
        "course": "HUMANNUTRITION"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class is one of the most devious classes I have taken. Considering it to be a introductory class, it is super hard. Very tricky...I have a 3.3 and I pray for a C+ in this class",
        "course": "HUMANNUT210"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 5,
        "comment": "I feel as is I am teaching myself. Her tests are tricky and nearly impossible. Don't take her if you can avoid it.",
        "course": "HUM210"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "The good news is you don't have to go to class alot of the time- online lectures, bad news- the tests are really hard and she does not help out in lecture at all- if you contact her she will help though- I would get a another professor though if possible",
        "course": "HUMNUT210"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 5,
        "comment": "Extrememly hard!",
        "course": "HUMANNUTRITION"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.5,
    "department": "Humanities",
    "firstName": "Frank",
    "id": "VGVhY2hlci0xMjAwMzI=",
    "lastName": "Coulson",
    "legacyId": 120032,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class is super easy as he gives out clear instructions on what will be on the exams and has all the materials posted.",
        "course": "CLAS2202"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Coulson was one of my favorite professors so far at Ohio State. His class was very straightforward. He gives study guides that are the exact same as the exams, and even gives the essay prompt early. I would recommend writing the essay early and having him look it over before the exam. Overall one of my easiest GE's.",
        "course": "CLA222H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "So easy. Lectures were easy to follow and interesting. Analyzed Roman lit and history. Grade made up of 3 exams (blue book format). Does give you a study guide that tells you exactly what will be on the exam, so you can easily prepare. Don't HAVE to buy the books, but harder to follow along w/o them. Both he and TA are accessible outside class.",
        "course": "CLAS2202"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class if you show up to lectures and take notes. Exams are based off of lectures, so as long as you pay attention and have a way to recall what he talked about, you'll be fine. I would recommend doing as much of the reading as your schedule allows though, his lectures make much more sense then.",
        "course": "CLAS2220H"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Gave great recaps on chapters in your readings( aenied, odyssey, euripedes 1&4 and metamorphoses) no homework, easy identification tests. Great instructor;really loves what hes teaching!",
        "course": "CLAS2220H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very clear about what will be on exams and gives you everything you need to get an A even if you don't read the books (but reading is encouraged). The final grade is based on 2 exams and a participation grade (attendance). He is very nice and his interest in the mythological stories rubs off on you!",
        "course": "CLAS2220H"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "4 midterms all semester with study guides that tell you exactly what is on there (options for term ID, passage ID, and essay). All lecture powerpoints are posted on line, along with analysis of the readings. No need to attend class or read. Overall, easy A for  a GE",
        "course": "CLAS2202"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Two exams (Vocab, passages, short essay) and a longer paper. He tells you a lot of what will be on the exam so you know what to focus on. I only read sparknotes and then studied from my class notes. Note taking was frustrating for me because he tended to jump around from topic to topic and my notes were unorganized. He was a very generous grader.",
        "course": "CLA222H"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy A. Go to class, write down everything he mentions (and he will also tell you what is important/what he wants you to know VERY VERY explicitly). Reading assignments are brief but interesting (~30 pages every other day). Tests are straightforward if a bit long-winded but I do recommend this class if one is looking for a GEC.",
        "course": "CLASS222H"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Read and you'll be fine.. good guy",
        "course": "CLASSICS330"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Pretty cool guy.  I got a 100% in his class but then again I'm really into literature.",
        "course": "CLAH221"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Read Ovid, learn for life!",
        "course": "CLA220"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Make sure to read and go to class -  you'll be fine",
        "course": "CLA225"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.5,
    "department": "Humanities",
    "firstName": "Maurice",
    "id": "VGVhY2hlci0xOTYyMTU=",
    "lastName": "Stevens",
    "legacyId": 196215,
    "numRatings": 35,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Maurice is an actual angel and one of the kindest people you will meet at OSU. Their intersections class includes a before-class reading followed by classes that are typically discussion-based. Maurice is really good at facilitating an environment where you can be comfortable with being uncomfortable and have great conversations. Highly recommend!",
        "course": "COMPSTD4921"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Maurice is great! They are so engaging within class discussion and focuses on letting the students be the teachers themselves. They are very clearly well informed on the topic. My only personal 'issue' is an occasional lack of structure within the class, but the class discussions each week and Maurice's flexibility makes up for what it is lacking. ",
        "course": "COMPSTD4921"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Maurice Stevens is an incredible educator with a sincere commitment to supporting their students academically and personally. Maurice created a learning environment conducive to conversation, collaboration, and critical theory analysis. This course promoted introspection and revolutionized my perspective on what is possible. ",
        "course": "COMPST4921"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "They really strive to foster knowledge building &amp; relationships both with &amp; among the class. And it worked - I was honestly a little sad after our last class session. They are very kind, caring, and understanding and recognize that your best is enough. As long as you engage with others and the material, you'll be fine. Most classes are discussions.",
        "course": "COMPSTD4921"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Maurice is an incredible and caring professor. They provide a really good space for all students to participate as much as they each can. They gave readings each week that we were expected to reflect on &amp; pose questions about, and it was such an open discussion space that facilitated learning. Take a class with Maurice if you have the opportunity!",
        "course": "WGSST4921"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "This is the easiest course I have ever taken. Dr. Stevens brings a unique perspective to their teaching and strives to ensure that the course is not burdensome. However, I found myself turned off by how easy the course was. I really enjoy reading and analyzing literature, but we read very little and most of the analysis was personal reflection.",
        "course": "COMPST2105"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "LOVE Maurice. Take his class!!! He is brilliant and very granola but I'm into it - he doesn't use Canvas, and the class is more focused on facilitating an environment of learning and critical analysis vs the usual regurgitation of memorized material. One of my favorite classes I have ever taken at OSU and plan on taking another with him!",
        "course": "COMPST4921"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's a good person & genuinely cares for his students. He created an atmosphere of caring. But class structure was incredibly unorganized. There was a syllabus but it changed so frequently that one had to guess what he wanted for that class period; it was frustrating. Readings usually 20-30 pgs. Good class, poor instructions for assignments",
        "course": "COMP4921"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Stevens was honestly the best professor I've ever had at OSU. I can say that he is the only professor that has made a lasting impression on me. I took his class my first year at OSU and still think about what I got out of that class today. I'm grateful to have met him and to have been a part of his class. ",
        "course": "COMPSTD1100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Of the many professors of my undergrad, Professor Stevens made a lasting impression. Years later I am looking him up and submitting this review so others may benefit from his intellect and heart. ",
        "course": "DIVERSITY"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Maurice is the best professor I've ever had. I left each class feeling enlightened and could apply what I learned to so much in my life. The class was more like a retreat that allowed me to step out of everyday life and relax and I loved it. Very easy A. Maurice doesn't go by the syllabus, but lets his students guide the class. Great experience!",
        "course": "3607H"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class as a GEC and I'm so glad I did. By far THE best class I've taken during my time here at Ohio State. At first Prof. Stevens struck me as a touchy/feely guy and that there wasn't going to be much substance to the course--I was so wrong! Although the course name is a misnomer, you will learn a lot and have fun! TAKE THIS CLASS!",
        "course": "COMPSTDS3607H"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "First and foremost this man is a genius. Second this class definitely changed me for the better. Third the material covered didn't have a lot to really do with the course description, but I found it to be both interesting and relevant to just life in general. Everyone should take a class with Maurice. Much love.",
        "course": "COMPSTD3607H"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "Maurice Stevens is the most brilliant professor I have ever had. He is a true intellectual and this class will inspire and enlighten you. If you have a chance to take his courses, do it. It was easy, but I also learned more in this class than in any other. Don't miss out on the opportunity to learn from Professor Stevens.",
        "course": "3607H"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "I absolutely loved this class and would recommend it to anyone. Such a positive and encouraging atmosphere. The conversations were intriguing and pushed me to grow as a person and a student. Please do yourself a favor and take this class.",
        "course": "COMPST2105"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is intricate and intriguing. The material is dense, but well-selected and engaging. It's clear how deeply invested Dr. Stevens is in the learning of his students. He makes the environment inviting; drawing out thoughts and building on them against preconceptions and convention. Students change for the better after taking his class!",
        "course": "COMPSTD2105"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Stevens is SO great! I would recommend this class to anyone. There are a lot of readings for class, but you only have to understand the main concepts of the books to participate. He really creates a great learning environment. Really interesting material. Plus, he gave everyone an A!",
        "course": "CMPST358H"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "Mr. Stevens is a great teacher, one you will learn a lot from.  Class is really challenging but you get a lot out of it.  Gave everyone an A.",
        "course": "CST358H"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "Maurice is awesome! Lots of reading in this class, though, and the material is kind of dense. Everyone in the class got an A.",
        "course": "CMPSTH358"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "The best teacher I've ever had at OSU. He is all about self-organization, so if that freaks you out he may not be the best teacher for you. He created such a great learning environment - going to class felt like a deep conversation with good friends. Absolutely would recommend him to anyone, and would love to take class with him again.",
        "course": "CS358H"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "What would we POC's in Comp Studies do without Maurice&#63;",
        "course": "GRAD800"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really enjoyed this class. Completely discussion oriented. Dr. Stevens is interesting as a lecturer and is helpful outside of class. Lots of reading and group work, so  if that's not your thing you may want to bow out of taking this class. Otherwise, a great professor and class.",
        "course": "CS545"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Excellent professor, encourages you to think for yourself.  If you want to do well in his class, make sure to participate in class and engage in the course material.  His papers for this class were pretty open ended, which was a nice change, being able to write what I wanted instead of following a prompt.  I highly recommend him.",
        "course": "CSH100"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 1,
        "comment": "He is a great teacher and easy to follow.  The class in general is kinda tough, but trust me in the end you will pull off an A if you go to class everyday and do all the essays! .....Easy A.  Good teacher!",
        "course": "CS100"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "Makes you analyze things in ways you never would have previously.",
        "course": "COMPH358"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had Stevens for Comp Std 367.01 and he was awesome. Always willing to go the extra mile to help students with their writing and reading. Wasnt picky when grading papers, looked for content more then grammar. Would take another class if available. Great Great Professor.",
        "course": "CMPST367"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Stevens was an outstanding teacher. I signed up for Comparative Studies 367.01 without knowing anything about it and it was a pleasant surprise. He is a young guy who is down to earth and has a great way at relaying hard to understand information. Just go to class and do the readings and you will be fine.",
        "course": "CS367"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "amazing teacher- learned more in that class than in my college career.",
        "course": "CS545"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 5,
        "comment": "I had Prof. Stevens for several courses, and enjoyed them all. He is a good, but difficult professor. I appreciated the difficulty in his courses because I found it challenging. I found him to be very helpful and open-minded. I would recommend him only if",
        "course": "COMPSTUDIES"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best professor I've had at OSU",
        "course": "COMPSTUDIES"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 3,
        "comment": "He is probably the worst teacher on campus. If you don't agree with his opinions, drop the class because you will not get a decent grade. It is sad that he recieved some outstanding teacher award. For the amount of tuition that we pay OSU should hire real instructors.",
        "course": "CS201"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Stevens is the best teacher I've ever had.  He is interesting, kind, and extremely intelligent.  But if you are a bigoted or ignorant person, you probably won't like his classes",
        "course": "CS"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 3,
        "comment": "I disagre. This is the worst class ive ever taken. Its ALL subjective material about the oppression of blacks and other minority groups through history.  He wants you to &quot;think for youself&quot; when in fact all he wants to here is what he has taught",
        "course": "CS201"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Had him for comparative studies 201.  It was not a blow off class but it was easy once you put the time into it.  Was a very interesting class",
        "course": "CS201"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 2,
        "comment": "The Coolest Teacher I ever had. I had him in Comparative Studies class.",
        "course": "CS205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 3.7,
    "department": "Humanities",
    "firstName": "Philip",
    "id": "VGVhY2hlci0zMjk5Mjk=",
    "lastName": "Armstrong",
    "legacyId": 329929,
    "numRatings": 34,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Armstrong is one of the best GE lecturers. He will tell you everything that you need to know before the exam. Moreover, he will discuss some decent questions of the society with us. There are three exams and three papers, they are not that bad. Such a good experience with professor Armstrong!",
        "course": "COMPSTD1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors that I've had in a long time. He is extremely knowledgable about COMPSTDS. If you ask for help while working on assignments, he is willing to provide good feedback so that you can improve your work. He also lets you focus on topics that you are interested in, and works with students so that they can succeed. Great teacher",
        "course": "COMP597"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor. Was very passionate about the lectures he gives. Strongly recommend Professor Armstrong if you want a professor to be caring, understanding, and helpful in your academic experience.",
        "course": "COMPSTD3360"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "I was interested in the lecture topics but felt the TAs helped me understand difficult readings more than he did. Many times there are pop quizzes that are basically impossible and worth such a large portion of our grade. I went to every single lecture and read every single reading and still rarely managed to get over 50% on the quizzes.",
        "course": "COMPSTD1100"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you need to take compstd1100 or one class in literature, I strongly recommend you take it with other professors or choose another class in literature. His lectures are very boring, and the quiz during the recitation chooses something from the class, which is hard to prepare. The paper, exam are all very difficult to prepare and write.",
        "course": "COMPSTD1100"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's a great guy and the class def makes you think but he's not at all in charge of grades. Every grade came from the TA so if your unfortunate and get a TA that grades hard you're pretty much doomed. There's 3 TAs so 3 different standards for the same class which is really messed up. Choose another GE and avoid this class if possible.",
        "course": "COMST1100"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't take this class. I initially read that this class was a relatively easy GE, but they couldn't have been more wrong. Anyone I have discussed about what this semesters class was like, agreed it was too hard. Too many readings, pop quizzes, and few assignments that are graded harshly. I worked too hard to get a B, and so many others did as well.",
        "course": "COMST1100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "The fate of your grade is entirely up to the TA. There's three exams and three papers in this class. Not going to lie, the reading is kind of a lot. You don't really have to do it or go to lecture. Go to your section (where attendence is graded) and go to office hours for your papers. The TA will be grading all your stuff so make sure they like it.",
        "course": "COMST1100"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Professor Armstrong is a nice guy and is lecture heavy. There's not much solid information in the class and that's the point. He gives you information and lets you decide how to interpret it (it's a humanities class). There's 4 papers and 3 exams and a few small (easy) quizzes. This class is VERY easy if you stay disciplined DO THE READINGS.",
        "course": "COMPSTD1100"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Don't bother buying the books listed on the syllabus. You can find PDFs for all of them by googling. While attendance is mandatory, the lectures are actually interesting. Exams are composed of mostly short response questions, and you can bring in outlines of the questions to the exams.",
        "course": "COMPSTD1100"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Armstrong is a genuinely nice guy. The class is not clear cut in any way, but that's pretty much the point. Forces you to think (if you can stay awake, that is). I liked the readings in this class and thought they were interesting. TA pretty much determines the fate of your grade, but definitely not a difficult GE.",
        "course": "COMST1100"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "Philip Armstrong seems like a good guy; however he's just a lecturer. A VERY boring lecturer. The TA's make the quizzes and control grading, so if you get a tough TA, you're out of luck. In my class, the quizzes were over specific lecture and reading materials, and were unnecessarily difficult. Don't buy the books, just look up summaries online",
        "course": "COMST1100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's one of the very few truly engaging and caring professors to be found at Ohio State. The Comparative Studies department is the gem of the humanities at OSU, and so too is Philip of the department.",
        "course": "COMPSTD2864H"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "I actually really enjoyed this class. The lectures went by quickly and the readings were much shorter and more captivating than other lit GE classes. I definitely learned a LOT about global cultures in an enjoyable way. The class isn't particularly difficult, just be prepared to write for the 2 exams and 3 papers, which aren't difficult.",
        "course": "COMPSTD1100"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "I'll be blunt: I loved Professor Armstrong. There were few clearcut answers provided to the classroom inquiries, largely because that wasn't the primary objective of the class: it was to question, suggest, and better understand the plurality of problems that we actively confront in the worlds--modern or premodern--we participate in. Take his class!",
        "course": "COMPSTD2864H"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is what you make it. It could be mind blowing if you want it to, but I just sort of paid attention and did the assignments, he's the easiest grader on the earth.  You could get away with not reading; he doesn't really check or care as long as you say something at some point during the class. Be prepared to here \"what's at stake here?\"",
        "course": "COMST1100"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "He purposefully asks really tough questions to force you to really structure your arguments. I learned a lot in this class and really improved on my persuasive essay writing due to his notes! There are a couple quizzes, two short papers, and papers for the midterm and final, pretty straight forward. Should be an easy A or B, but you still think.",
        "course": "COMP597"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Completely agree with the person about 4 below me. He thinks everything he says is sooooo profound. He's always asking-What's at stake here&#63; I didn't learn anything, but it was an easy A. I did all the readings right before the midterm, and that was the extent of my studying. Papers were not hard. Why does he have a chili pepper&#63;&#63;&#63; Not hot.",
        "course": "CMPST567"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "I thought he was a very good teacher. I was not looking forward to taking a literature class, but he made it interesting and the papers were not that difficult. It is sometimes hard to understand exactly what we are supposed to write about, but it was still a good class.",
        "course": "COMP301"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "EXCELLENT Professor. My favorite and best by far.",
        "course": "HUM100"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 3,
        "comment": "Never knew what he wanted from me on the papers. Thinks everything he says is profound, but it's not. All he does is ask rehtorical questions in leacture. Hard to stay awake because he is so boring. Never knew what my grade was since the class isnt on carmen. The TAs are helpful if you have questions. Overall confusing class.",
        "course": "CSTUD100"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Armstrong was a good teacher and made it clear that he was there to lead us to a better understanding of our world and to have a greater appreciation for its complexity and the conversations we have on a daily basis. This was a wonderful class, and although more discussion would have been nice, Dr. Armstrong did a wonderful job!",
        "course": "COMPH240"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was insanely boring. He's very smart, but the lectures feel a bit redundant and a lot don't even apply to the world. The exams aren't too bad, just make sure that you're very detailed on essays and don't use broad themes from the class. Hopefully you get an easier TA than I did....",
        "course": "COMP100"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 3,
        "comment": "lectures are SOO boring, he asks a lot of rhetorical questions so it sometimes gets confusing and has no visible point, exams are easy (hopefully you get a good TA to grade it), gives you options to pick from on the exam ahead of time so you can prepare the big essay, its really not a bad class, just lecture is rough to get through without dozing",
        "course": "COMP100"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was sooo boring. The lectures especially. Some of the readings were interesting but he gave us no structure for the assignments. We were just sort of on our own.",
        "course": "COMPSTD301"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "He talks forever about how to analyze visual images, just so the class lasts the full hour and 48 minutes.  He does have a French accent which is cute, but other than that, the class can be really boring.  Readings are easy, midterm was easy, a final  15 min presentation in place of the final exam.",
        "course": "COMPSTD275"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "very good teacher, lovely accent, very knowledgeable about many different types of literature and movies, willing to show students what is out there in the world which I appreciated. Interesting class, never bored. Cared about his students, quite helpful.",
        "course": "COMPSTUD100"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor; fascinating, intelligent, looked forward going to class everyday.  He is compassionate about what he teaches, and really cares about his students.",
        "course": "COMPSTDS100"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "This teacher was one of my most helpful and memorable at OSU. Opened my eyes to the world of literature!",
        "course": "COMPSTD100"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 1,
        "comment": "Probably the worst lecturer I have ever had.  Spends more time talking about nothing than anyone I've ever met.  Thinks his points are profound and interesting, while they are really just the ridiculous opinions of a madman.",
        "course": "COMPSTUD100"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "great instructor, very indepth and communicates the subject matter clearly. definately an awesome teacher!!!",
        "course": "COS100"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interesting to listen too, especially if you enjoy English accents. I would definately reccommend this class for an eye opening perspective of the world around you. Did I mention he was a Brit&#63;  lol",
        "course": "CMPSTDS100"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Armstrong went out of his way to communicate dense, difficult material.  He is an amazing teacher.  Was willing to give up his time to make sure I understood the material.  A must!",
        "course": "CS660"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 1,
        "comment": "Comparative Studies 100 was an interesting and easy class.  He is very passionate, and works to make every class have depth.  A little dramatic at times.  Well recommended.",
        "course": "CS100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 2.9,
    "department": "Humanities",
    "firstName": "Fritz",
    "id": "VGVhY2hlci03MzQyNTA=",
    "lastName": "Graf",
    "legacyId": 734250,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "This was one of the most frustrating classes I have ever taken. Absolutely zero organization and awfully boring/tedious lectures. Impossible to get ahold of and randomly canceled class. Ultra specific quizzes that were impossible to study for. Took the entire last half of the semester to grade the midterm. Sweet old guy but should NOT be teaching. ",
        "course": "3401"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Graf is a nice guy, but if you don't like long lectures I do not recommend this class. His lectures last the entire class (and sometimes over). That being said, if you are really passionate about Roman religion and want to learn more, take this class! He also grades heavily on about 4-5 quizzes, a midterm, and a final exam. ",
        "course": "3401"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lectures are boring and all over the place - hard to follow/can't participate. Slides are confusing and include many typos. Can't learn material. Not communicative about schedule/things in general. Only grades you will receive in this class are from quizzes and 2 essays that are worth 30% of your grade EACH. Nice guy, but difficult to understand.",
        "course": "3401"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Bunch of quizzes made up 10%, then a paper was 40% and the final was 50%. Super nice guy who clearly loves what he teaches, but it was very scary to have so much of the grade on a paper he barely talked about/that there wasn't even a rubric for. Classes were super boring with no participation, if he asked questions and discussed it'd be way better",
        "course": "CLAS2220H"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "The course was fascinating but poorly structured. It could have been a little better put together in terms of grouping topics; possibly into units. The lectures were fun and very interesting, but beware that the readings were very necessary in order to understand the lectures. Fun if you are willing to put the work in.",
        "course": "CLAS4031"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "very unclear about schedule and due dates. Extremely specific quizzes and unnecessary PowerPoint slides.",
        "course": "CLAS3304"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Fritz is the bomb, very enthusiastic lecturer and clearly loves what he does. His accent can take a while to get used to, but he is very open about having you ask questions if you didn't understand what he said. 1010, would recommend him.",
        "course": "3401"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is the man! He's so nice and extremely fair. My class was about the Greek gods and we just had to have readings done which weren't that bad at all. The books were interesting, there were a lot of books but I only spent $100, and you could even get away without reading if you don't want to although I recommend it. Overall is exactly what you want",
        "course": "CLASS327"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "I pulled out close to 100% in this class.  Go to class, do the readings, and you can easily get an A.  Minimum effort required, no homework at all, just the weekly quizzes.  If you do the reading and listen to what he says, it should be cake.",
        "course": "CLASSICS222"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is not bad at all.  If you go to class and take notes, you should get an easy A.  The quiz questions were embarassingly easy sometimes",
        "course": "222"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class was unusually difficult, I had a friend who took H222 and it was easier than this class. The weekly quizzes are very hard, he asks very specific non-important things. His teaching style is not very helpful in learning the material. I would not recommend this course to anyone.",
        "course": "CLASSICS222"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Contrary to what everyone else has said, it is entirely possible to get an A in this class. I have one. All you have to do is got to the lectures, read the readings, and go over the notes for an hour or two before the quiz. Definantly NOT impossible. This is a very interesing class and I highly recommend taking it.",
        "course": "CLASSICS222"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "His powerpoint slides seem like they were made by a ten year old. Nothing seems to be very organized in this class. Most times his lectures and the readings barely overlap, so you've got a****load of information to know for each week's 25 question quiz. He also says there will be no curve but I bet few people will get A's if he doesn't.",
        "course": "CLASSICS222"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 1,
        "comment": "Good lecturer, nice guy. Thick accent though, I missed things that he said here and there. This is a very interesting class.",
        "course": "CLASSICS222"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 1,
        "comment": "Easy class, Easy Grader.  Once you get past his European accent you'll understand everything.  Highly recommended for those with Liturature GECs!",
        "course": "CLASSICS222"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "he sucks",
        "course": "CLASSICS222"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.8,
    "department": "Humanities",
    "firstName": "Eugene",
    "id": "VGVhY2hlci03MjIxMDA=",
    "lastName": "Holland",
    "legacyId": 722100,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "He turned a previously graded A+ paper and after following all his advice gave me a C- for the entire class. I have talked to other professors who all agreed that should not have happened. He is by far the worst professor at OSU. Made me give up academics. Extremely pompous and arrogant and otherwise unpleasant to be around.",
        "course": "COMPSTD4990"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class was enjoyable and applicable to people of all fields of study! There was a good variety of fiction, nonfiction, and film which really made the concepts discussed come full circle. Films were watched and discussed in class and were great bases for the papers written. Participation is essential to the class but also very helpful to you!",
        "course": "COMPSTD2104"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was a good surprise for me as I was not at all into the subject! 3 essay exams that if (I think) you put effort into them, you'll get decent grades. He's not out to trick students; very fair & on the easygoing side. Go to class b/c participation is important & discussion is valuable! Lots of reading but not too difficult, & it pays off.",
        "course": "COMPSTD2104"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Avoid at all costs. Unclear on goals and grading system. Poor communication and unapproachable. Unmotivational. I would never recommend.",
        "course": "COMPSTD4990"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Holland is extremely intelligent and knowscares a lot about what he is teaching. Assigned readings were difficult, and he attempted to make them clearer but oftentimes had difficulty communicating his thoughts clearly and helping the conversation go in a productive direction. Easy grader, no tests",
        "course": "CS4661"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome class! Eugene really knew how to engage the students. I actually enjoyed going to class everyday. He is very helpful and funny.",
        "course": "CS598"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "He's a nice guy, but unless you are really into french history, you won't enjoy this class. He lectures the entire time. He speaks very well for not being a native speaker. Most people get As and Bs on his exams but you definitely have to study for them (they're completely essay). Class isn't impossible, but isn't easy either.",
        "course": "FR643"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "There are ways of making history class fun and interesting. This guy knows none of these. Make sure your french is good before taking this class because he talks the entire hour and 48 minutes without stopping.",
        "course": "FREN643"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "okay",
        "course": "COMPST100"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "He has unclear/vague writing promts some of the time. His class was challenging yet fair. He does have a good sense of humor, but make sure the class takes up the full hour and 48 minutes.",
        "course": "HCOMPSTUDIES"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "I had to drop his class because he makes you read too much.  He seems like a nice guy, but I just never understood what he wanted from his students.  I'm not saying you shouldn't take him, but I did think he was hard.",
        "course": "COMPSTDSH100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Humanities",
    "firstName": "Jibril",
    "id": "VGVhY2hlci0yNTA5Njc1",
    "lastName": "Mohamed",
    "legacyId": 2509675,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor! He works hard to make sure you succeed in his course.",
        "course": "SO1101"
      }
    ],
    "SEI": []
  }
]