[
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.5,
    "department": "International Studies",
    "firstName": "Anita",
    "id": "VGVhY2hlci05NTUxNjg=",
    "lastName": "Bucknam",
    "legacyId": 955168,
    "numRatings": 32,
    "summary_comment": "Professor Bucknam is highly regarded for her effective teaching methods and engaging lectures, which are both informative and entertaining, often incorporating personal anecdotes from her time in the CIA. She emphasizes clear communication and offers extensive support through office hours, helping students improve their writing and understanding of the material. Her grading is rigorous but fair, with a focus on a few key assignments that, when completed diligently, can lead to high grades.",
    "summary_comment_short": "Professor Bucknam is highly regarded for her effective teaching methods and engaging lectures, which are both informative and entertaining, drawing from her experience in the CIA. Students consistently praise her clarity in assigning grades and providing guidance, making it possible to achieve high marks with consistent effort and attendance at her office hours.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor- your grade is determined by only a few things, mostly papers. However it's fairly easy to do well if you go to her office hours and attend class. Everything you need to know for the midterm is in the lectures, which are entertaining- she uses anecdotes from her time in the CIA- and class almost always ends early. Highly recommend. ",
        "course": "INTST3700"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Anita is an AMAZING professor who gives really good insights on the national intelligence system and intelligence as a whole. She gives really good lectures and as long as you take good notes you will be fine. There are only a few graded assignments but as long as you go to her office hours she will help you correct or improve your work.",
        "course": "INT3700"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you want to work in the IC, you need to take 5703. Anita's lectures are straightforward and memorable every time. She challenges you to improve your writing skills and if you use her as a resource, you will improve. ",
        "course": "INTSTDS5703"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Bucknam is by far the best professor I have had at Ohio State. She is a tough grader but she will tell you exactly what you need to do in order to get an A. Go to her office hours and ask her questions because she is a well of knowledge. ",
        "course": "INTST3700"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ms. Bucknam is extremely sweet and is definitely someone to talk to with interests in working as an intelligence officer/analyst for the government. She provides clear directions to all assignments and is great to talk to outside of class if you have questions about career and professional opportunities. I would take her class in a heartbeat again.",
        "course": "INTSTDS5701"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Bucknam clearly loves teaching about Intelligence work, and has lots of interesting stories. Easy midterm and quiz, three short intelligence style papers, a short briefing, and a long final paper. The intelligence style papers are difficult, but if you ask she will help you and tell you what to write. ",
        "course": "INT3700"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "There are 3 CIA-style briefings (one page long), a lengthy final paper, and a quick and easy presentation. She tells fascinating stories of her time with the CIA. Also, make sure to go to her office hours! She will walk you through each paper to make sure you get an A. About 60% of my class got an A overall, 40% got a B. ",
        "course": "INT3700"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": ".",
        "course": "INT3700"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Bucknam is a true expert in her field and is very good at communicating the realities of modern day intelligence work. She is a kind person and is genuinely interested in seeing her students succeed. Be sure to visit her office hours for help with her papers.",
        "course": "INTSDTS3700H"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Bucknam is my favorite professor ive had so far, and really cares about her students. Shes very helpful in office hours and shes passionate about her lectures and theyre pretty interesting!",
        "course": "INTST3700"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "The class itself consists of solely lectures with no slides or images, which does tend to get boring, but she is an ex-CIA agent who shares multiple stories during the lectures. The class is only graded on a couple of things, and the three papers are difficult, but she will help you so much during office hours. There is a presentation.",
        "course": "INTST3700"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Bucknam extends her office hours regularly and is always willing to meet you after and outside of class to help on assignments. Take advantage of this! Though attendance is not mandatory, I highly encourage going, as she has an optional quiz at the end based on them that could save your grade (it replaces one of the paper grades).",
        "course": "INTST3700"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 5,
        "comment": "She's a wonderful friendly lady with a vast amount of experience in the CIA and many stories to go along with it. HOWEVER, she is probably one of the hardest graders I have ever had. Papers are assigned to be written in an unfamiliar style. LONG final paper instead of a final. Also, no powerpoints for lectures and she talks really fast.",
        "course": "INTST3700"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "Go to office hours!!! Lectures are long and boring, and she doesn't have slides to display or post. However, midterm and quiz were easy. Papers did not seem difficult but you have to go to her office hours. She will tell you exactly what to write to get an A. Had interesting stories about the CIA.",
        "course": "INTST3700"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 3,
        "comment": "Go to her office hours with your paper/ideas and she'll tell you exactly what she wants and how to write it",
        "course": "INTSDTS3700H"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 5,
        "comment": "This class was way over my head. I was excited when I found out papers are a page long but I received Ds or Fs on my papers that I thought were well written! Its awesome she worked for the CIA so I was excited for her class but she's an extremely tough grader. I went to her for help with my papers and she didn't give good feedback. Dropped class.",
        "course": "INT3700"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great class taught by a great instructor. First class taken in my Security and Intel major, very impressed by the amount of information Anita covered using her personal experience and unique background. Nice and funny, and always willing to help during office hours. Not an easy A, but if you put the effort in you will be fine.",
        "course": "INTST3700"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "She assigns hard papers (PDB's; Presidential Daily Briefings). Though the papers are tough to get a hang of, she is very helpful in office hours. She is probably the best, most inspirational professor I have had while at OSU. She really wants to see her students exceed. She also has great stories from the CIA!",
        "course": "INTSDTS3700H"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really cool that she has background experience with the CIA. Very helpful with papers and lets you go into her office hours where she will read over the actual paper and tell you exactly what to change in order to do well. Lectures can be boring, but overall its a good class. ",
        "course": "3700H"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Bucknam's class is great. She starts off with discussing current events which really helps keep you informed of what's going on in the world. The papers are very reasonable and you don't have to do much of the reading to do good on exams. Just pay attention and participate in class, and go to office hours for help.",
        "course": "INTST3700"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "One of the best professors I've had at OSU.  Lectures were always interesting, and writing assignments were pertinent and graded very fairly.  It's not hard to get an A if you pay attention, specifically to feedback on papers.  You don't have to do any of the readings to do well in the class.",
        "course": "IS350"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "The best advice for this class is to go to office hours. The content of the class is interesting and not difficult to understand, but the papers can be tricky if you try to do it on your own. She is looking for specific points. Overall, the class is enjoyable.",
        "course": "IS350H"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Midterm/quizzes very fair. Papers can be really hard to know what she is looking for. Overall a really good teacher, you will learn a lot if you go to class.",
        "course": "INTST350H"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "Informative; very clear as to what she wants to impart; very encouraging as to class participation; she will help you open your eyes to what is going on in the world; a real benefit is that she attracts a group of students who are interested in the field, some with military backgrounds, which adds to the quality of the discussion",
        "course": "INTD350"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Bucknam was an enjoyable teacher.  I didn't care much for the writing assignments, but she seemed to grade them fairly.  The midterm and final paper were very easy if you paid attention and thought about what she said in class.",
        "course": "IS350"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Bucknam clearly has a deep understanding of not only her class' subject area but the importance of it in the world. She is engaging, interesting, and always willing to help guide students when they encounter difficulties. While her class is long, it is always interesting and engaging. Take a class with her if you can - you won't regret it",
        "course": "INTST350H"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is ex-CIA intel analyst so she's very helpful if you want to know anything about intel or the CIA but not very helpful about other intel agencies...tried to tell me the DEA can not arrest people. very nice lady. recommended",
        "course": "IS350"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor... very clear in expectations... go to class... take notes.... do the readings up until the midterm... you will learn a lot... you will need to work hard but getting an A is not too difficult and this class is very rewarding.",
        "course": "IS350"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "A great teacher and a great person!",
        "course": "INT350"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very fair and fun class.  Very focused on current events and how to analyze these events.  Papers are difficult to write and require that you think outside the box.  Midterm is not too difficult but you need to study.  Professor Bucknam is always willing to help; go to class and you will do fine.",
        "course": "IS501M"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellect lecturer!  I really enjoyed both of her classes and loved the discussion.  There is a lot of writing, but once you get used to the style she wants it is doable.  The reading isn't necessary, but if you're interested, it is very informative.  Go to her office hours when you can, she gives great advice and is easy to talk to.",
        "course": "IS501M"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great instructor, very interesting, go to class and pay attention and you should get a B.  Not difficult to get an A and you learn a lot.  This is how all classes should be conducted: Learn a lot and very possible to get a good grade.  Take this professor.",
        "course": "IS350"
      }
    ],
    "SEI": [
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "20408",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.57"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "27650",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "18431",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.75"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "21772",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.81"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "22127",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.57"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "27565",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.5"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "24674",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.58"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "27372",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.67"
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 3.2,
    "department": "International Studies",
    "firstName": "Jeffrey",
    "id": "VGVhY2hlci0yODM1NjE=",
    "lastName": "Lewis",
    "legacyId": 283561,
    "numRatings": 121,
    "summary_comment": "Professor Lewis is highly regarded for his extensive knowledge and engaging humor, particularly among students who have taken multiple courses with him. However, his classes are noted for being demanding, with extensive reading and essay-based assessments. While some students find the workload challenging and criticize his grading and class management, many appreciate the depth of learning and the opportunity to engage with complex historical topics.",
    "summary_comment_short": "Professor Lewis is highly knowledgeable and genuinely engaging, particularly appreciated by students who enjoy deep dives into history and international studies. However, his classes are noted for being extremely demanding, with extensive readings and challenging essay assignments that some find overwhelming.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 5,
        "comment": "The workload is too much for a general ed class. But, if you truly like history, this class has a lot to offer. I learned more in this class than I've ever learned in a history class. Since there are only essays, many of the textbook readings can be skimmed. I recommend fully reading the supplemental readings as I got the most out of them.",
        "course": "3350"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class requires a ton of work, with dense lectures, numerous readings, and 3-4 essay exams. While challenging, using resources like Unstuck ai for study prep can help manage the workload. Prioritize this class over others to succeed.",
        "course": "3350"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "not a good teacher AT ALL does not grade well, impossible to understand lectures, and does not care about students when they are going through something in their personal life. try to avoid his classes at all costs. ",
        "course": "IS4700"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr.Lewis is an awful professor. He would cancel class last minute. His PowerPoint would have slides that were over 100+ and go off topic for half of the class. On top he will make you redo the whole assignment for no reason then dock you points for &#8220;being late&#8221;. DONT TAKE HIS CLASS!!!",
        "course": "IS553WMD"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is by far the worst professor Ohio State has on staff. How he's still employed is a mystery and a travesty. He grades without any real rubric, based entirely on vibes. This class also means nothing and is just a required GE. He's one of those professors that thinks you should spend all your time on his class. Disgrace to professors everywhere.",
        "course": "3350"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "This professor is extremely knowledgeable on the topics he is teaching, but does not have realistic expectations for this undergraduate course. The readings are many and extremely long. He has way too many criteria in his essay prompts to fit the maximum word limit. It is nearly impossible to encompass all that he is asking for in his assignments. ",
        "course": "4700"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "I have absolutely enjoyed both International Studies 3701 and 4700 with Jeffrey Lewis. He is so knowledgeable on the course topics and genuinely so funny, and I love his dad humor. Both of courses I have taken with him were writing-heavy, but I prefer essays to exams. Overall, this professor has taught me so much. ",
        "course": "4700"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "First of all, Jeffery is one of my favorite International Studies teachers. I have taken two classes with him so far, and hope to take more. He has the funniest dad humor and is so intelligent in his field. While he is a tough grader, I have learned so much from him.",
        "course": "4700"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Lewis is overall a tough grader. His expectations are completely unrealistic and with how his class is structured, it is almost impossible to do what he asks because the readings are extremely long. His due dates are also insane with due dates at 10am. He also randomly assigns his papers, so if you do not check his page you will miss them",
        "course": "INTSTDS4700"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "If there was a zero-star rating, I'd be smashing that button faster than a kid in a candy store. The expectations for this class are as realistic as a flying pig. This course is set up so you have no time for anything else. He set this class up with expectations of a graduate class. The readings are longer than a Costco receipt of a mother of 5.",
        "course": "4700"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class I have ever taken in my life. Mistake taking it with him especially during summer. TONS of readings on top of 3-4.5 hours of lecture each week. Has 3 midterm essays and a final, the first one expected you to basically condense a month's worth of material with only 1 week to write it. Do NOT recommend. Every week felt like I was drowning",
        "course": "3350"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Wow my advisor said this was going to be bad and I guess he was right. He expects you to read hundreds of pages of text books but don't worry he has pictures for every page......",
        "course": "INTSTDS4700"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "I'm extremely disappointed with how this class ended. We ran out of time to cover all the material, so rather than let it be, during the last 3 weeks of school he's assigned supplemental readings, and two 1500 essays. All due during finals. He's the type of prof who expects you to prioritize his class even though its a GE. Would not recommend. ",
        "course": "3350"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is way too much work for a GE. Honestly, I would change this class from 3 credit hours to 5.",
        "course": "3350"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Extremely boring lectures and readings, the class is made up of \"biweekly\" reading assignments that roughly cover the material, along with three midterm exams of 1500 words each. On top of that, the final exam is two 1500 word papers, one that covers the last part of the material and one that covers the ENTIRE class. Not worth it for a GE.",
        "course": "3350"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is the more information dense class I've ever taken. During the essay midterms, you'll be expected to summarize the whole unit with a small word limit, and failing to mention really niche details will TANK your grade. The final is TWO  1500 word essays, which is absolutely cruel and insane, considering that this is a GE class. ",
        "course": "3350"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "How Dr. Lewis is still employed is beyond me, this man is without a doubt the WORST professor I've ever had. There is no clear grading guidelines, so he just gives grades based on vibes. Meaning, if you're not one of his chosen few, you're not getting an A. I started skipping like halfway through because I couldn't take the condescension anymore.",
        "course": "3350"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Some of the reviews from this semester seemed a bit harsh. There is a lot of readings and very few assignments; however, supplemental readings basically supplanted the textbook, as I barely read it and did fine. HOWEVER two essays for a final is unforgivable. Pick one -- covering the last unit or the whole semester. Can't have both.",
        "course": "3350"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "does not make respect visible!",
        "course": "3350"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "Normally I wait until final grades are posted, but this prof just SUCKS. There was an instance during the beginning of the semester where I had to go to a funeral, and he refused to give me a extension, and he held a grudge against me for the rest of the year. ",
        "course": "3350"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dear reader, I know you're looking at that 5 level difficulty and thinking, \"Well, I'm built different!\" and I'm here to tell you, no you are not. This class was genuinely so horrible in terms of workload that I got a vitamin D deficiency from how much time I spent indoors working on it. ",
        "course": "3350"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "This is the class that broke me. I'm a junior, and this was the first class that ever made me adopt the \"it is what it is\" attitude because of the sheer difficulty of this course. Putting in 10 hours of work will get you the same grade as 3 hours of work. Prides himself on not giving out 'easy A's\". Don't take this class unless you have to!",
        "course": "3350"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Lewis has got to be the most conceited professor I've ever had the displeasure of taking. On all of your written assignments, you MUST agree with him, and you MUST use the same logic as him, and you MUST not have any original thoughts at all. The only problem? His lectures are so long/monotonous, you'll spend 3 hours searching for 1 sentence. ",
        "course": "3350"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Lewis throws tons of work w/ impossible deadlines & no grading guide.  Lectures felt like showing off, not teaching. Unclear feedback left us lost. Don't take this class! ",
        "course": "3350"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "Your only grades in this class comes from five 10 page papers, of which you get a week to write. Absolutely insane. This guy has no clear grading rubric, and is one of the toughest graders I've EVER had! I'm an English major, so writing is kind of my whole thing, but I never got above a B+ on my papers. TL;DR this prof sucks",
        "course": "3350"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wish I could drop my SEI that was over 3000 words of how much I hated Dr. Lewis. I simply couldn't whatever I did, get decent grades on his papers. No clear rubric. I'm a strong writer, but if your paper does not meet his biblical like expectations, prepare to receive mark offs for any little mistake. Horrible student-prof relationship, horrible.",
        "course": "3350"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "I took this class as a GE, thinking that it would be a fun little overview of European History. I couldn't have been more wrong. This course is like 12 AP classes in one, in terms of the workload, and the prof is a sad middle aged man who doesn't care about students at all. Avoid him if you can.",
        "course": "3350"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 5,
        "comment": "OSU fire this guy challenge",
        "course": "3350"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 5,
        "comment": "I hated this class with every fiber of my being and used to literally sob when he assigned essays because I knew no matter how much time/effort I put into them, I was going to get a B- max (I don't think he ever gave anyone A's). Cheers to this hell of a class being over!",
        "course": "3350"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 5,
        "comment": "I'm a STEM student, and I ended up putting in more time for this class than I did my ochem hw. He assigns a ridiculously amount of work and gives you no time to complete them. He always talks about his special interests, which aren't that important to the class concepts. ",
        "course": "3350"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 4,
        "comment": "IS 4852. Kind of rude and thinks he knows everything - won't let you finish asking a question before he tries to answer. doesnt have clear grading criteria but will mark off for whatever even we we asked for a rubric. smart guy, class has a lot of good info, but him himself I wouldn't take again. he has just gotten worse every time Ive have him",
        "course": "INTLSTUDIES55"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Lewis is, without a doubt, the worst professor I've ever had. His lectures are nothing but white text on a black background, and he just drones on and one with no class participation or checking to see if we follow. You have to read 2 textbook chapters a week, and theres additional readings on top of that! Too much work, too little time. ",
        "course": "3350"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 4,
        "comment": "Most information dense class I've taken in the major, hundreds of pages of reading a week, harsh midterm grader. Professor is very knowledgeable and passionate about the field and WMDs, loves to discuss or talk in and around class.",
        "course": "INTSTDS4701"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 5,
        "comment": "You will learn a lot from Dr. Lewis, but man is it hard to get A's on the papers. If you are an excellent writer, this class is for you, and he definitely prepares you well for the papers, but 3 major papers and a final is about the only grades you'll get so it is hard to clutch an A with the way he grades.",
        "course": "INTSTDS4701"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 5,
        "comment": "I honestly loved his lectures and found them interesting. But he assigns so many long essays and only gives you 2 days to write them. Probably one of the toughest essay graders I have ever encountered too, and he is not even an english teacher. You HAVE to show up to every lecture to be able to perform well on the essay style midterms.",
        "course": "3350"
      },
      {
        "index": 36,
        "rating": 1,
        "difficulty": 4,
        "comment": "I realized I finally needed to file for disability because he taught so awfully on Western Europe (which ive been learning since middle school) which I LOVE the topic, but it was so bad that I mentally could not write any SIMPLE 1500 word paper without a breakdown. I could not care enough. ",
        "course": "3350"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 3,
        "comment": "I havent been in this guys classes for 3 weeks and I cannot listen to a word he says. Its just constant rambling and the slides are white text paragraphs on black backdrops. I swear that I do my very best to listen because my grades are so important, but he just goes on and on with no real point. \nBeen in 3 different classes of his, all the same.",
        "course": "INTSTDS4700"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, very good lectures. Loved the class, only thing is tons of reading, but a lot of the readings were very good and engaging!\nTime consuming class and work but great content and professor. Will be trying to have him again!",
        "course": "4700"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is one of the hardest graders I have ever encountered. He doesn't have a consistent grading rubric and takes a lot of points off for minor details. I have never worked so hard in a class and had little to show for it. I hope to never have to take another of his classes again. ",
        "course": "4700"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 4,
        "comment": "For a 3 credit hour class there is so much reading. You don't have enough time to read and watch the lecture videos before you hit a paper assignment. It's a lot to balance with other classes. Don't ask for too many extensions, even valid reasons (like a funeral) may not be good enough to get you what you need to succeed. Good luck.",
        "course": "4700"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 4,
        "comment": "Overall a good professor, but his class requires a significant time commitment and can be very hard. There are a lot of readings for a 3 credit hour, and they're important for the papers--if you don't think you'll have time to do the readings, don't take this class.",
        "course": "INTSTDS4700"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 5,
        "comment": "I've had three courses with Dr. Lewis and in each one I've learned more than in most of my other courses combined. All of his classes are intense and eat up more time than you would expect from a 3 credit hour course. Still, if you are willing to put in the necessary work, there are few better professors out there.",
        "course": "IS4701"
      },
      {
        "index": 43,
        "rating": 4,
        "difficulty": 5,
        "comment": "Expect to put in a lot of work on these papers. The final was a doozy- basically writing two heavy papers. Lectures are interesting and I learned a lot. Was skeptical about this class coming in but found it to go deeper than expected.",
        "course": "INTSTDS4700"
      },
      {
        "index": 44,
        "rating": 1,
        "difficulty": 5,
        "comment": "Listen, I like a nice easy going professor. This guy is not it. When you try hard and read all the 50+ pages he expects you to read for a paper and still don't receive an A, I'd say this guy grades hard. He expects you to cover a lot of material within a 2-3 page paper so be prepared to write an excellent paper. I pray I don't have to run into him",
        "course": "INTSTDS4700"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 4,
        "comment": "Okay so based on my tags it might seem like I didn't love Dr. Lewis but it's the complete opposite! This was my second class I took with him and I liked it a lot better than 4700. The material is so interesting and there are 3 midterm papers and a long final paper. I put in a good deal of effort and it paid off, I loved learning from him.",
        "course": "INTSTDS4701"
      },
      {
        "index": 46,
        "rating": 2,
        "difficulty": 4,
        "comment": "4000's level course or not, no one has time to read 300 pages in a single week. He will assign entire 30-page chapters for you to read when there will only be a few specific pages of relevant information within the assignments. He expects us to sift through loads of irrelevant information when he doesn't even do that in his own lectures.",
        "course": "INTSTDS4700"
      },
      {
        "index": 47,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's very passionate and knowledgable about what he teaches, but if youre not good at writing papers then you should avoid this class. 5 papers, 2 pages each and 8 page final. Very difficult topics, very difficult to get A's on them. He gave us alot of reading (made us buy 5 books) on which the papers are based on. His handwriting is illegible too.",
        "course": "INTSTDS4700"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 4,
        "comment": "I have never met a teacher who was so polarizing. Some people hate him, others love him. This class was very interesting, and Lewis knows what he is talking about. His lectures can be boring but he is crazy smart. There are 4 papers a semester and then a final paper. He assigns long readings but you only need to skim to write the papers.",
        "course": "INTSTDS4550"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 4,
        "comment": "AVOID AT ALL COSTS. Do not take this class unless you absolutely have to. The lectures are boring and not interactive. You'll have to write 5 papers over the course of the semester and you will basically teach yourself all the material. His handwriting is absolutely ILLEGIBLE but yet he still writes all over your papers and expects you to read it.",
        "course": "INTSTDS4700"
      },
      {
        "index": 50,
        "rating": 2,
        "difficulty": 3,
        "comment": "Do not take this class if you don't have to. It is a waste of time. You'll read a couple chapters out of the 4 or 5 books he assigns. Your grade is based on 5 papers and a final that is really just an additional 2 papers itself. The lectures consist of him reading off 60+ slide powerpoints and he puts them all online anyway. Avoid at all costs.",
        "course": "INTSTDS4700"
      },
      {
        "index": 51,
        "rating": 2,
        "difficulty": 4,
        "comment": "He knows his stuff, but lectures are boring and difficult to pay attention to with only a brief outline to guide his thoughts. Lots of detail-oriented papers, must quote the readings. Tough grader on papers, and his handwriting is not legible even though he writes all over them. Nice guy but did not get much out of the class.",
        "course": "IS4195"
      },
      {
        "index": 52,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Lewis takes attendance for the first few classes, and after that I recommend not to bother going. Class was based on readings and his lectures, both of which made me fall asleep. For the papers just skim the readings, pick out some direct quotes, and use his PowerPoint slides (which he puts online). Easy class if you know how to write papers.",
        "course": "INTSTDS4700"
      },
      {
        "index": 53,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Lewis is very knowledgeable and an adequate lecturer. The class consisted of only 6 short reflection papers and a longer final paper but in order to do well on them you definitely have to go to lecture and I would recommend reading the material. The books were interesting and easy to read. It wasn't difficult but not much to rave about either.",
        "course": "INTSTDS4700"
      },
      {
        "index": 54,
        "rating": 3,
        "difficulty": 4,
        "comment": "Don't get me wrong he was very knowledgeable about Terrorism, but I got nothing out of the lectures. It didn't matter how many times you went to class, the information was in the reading and you practically had to draw it all out yourself. His writing is eligible and his lectures are very monotonous. Get ready to read and research A LOT.",
        "course": "INTSTDS4700"
      },
      {
        "index": 55,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't take this class if you aren't good at writing papers. There were only six grades for the entire semester, including the final, and they were all difficult papers. He knows what he is talking about and is very passionate during lecture, but I just hate the way he assesses and grades the students.",
        "course": "INTSTDS4700"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very knowledgeable professor and respected, but somehow makes a dynamic topic boring at times. Lectures can help on papers but other times feel pointless and aren't mandatory. Graded on 5 papers and a final consisting of 3 papers. These papers ask for a lot for being only 3 pages each; do all the readings. He's a very tough but fair grader.",
        "course": "INTSTDS4700"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof. Lewis is a walking textbook! This man is very knowledgable on the subjects he teaches. Classes are comprised of just lecture, so if you may get lost easily if you don't pay attention. 5 papers and 1 big final paper. A lot of daily readings and all of them are absolutely essential. Not an easy class but you will definitely learn a lot!",
        "course": "IS4700"
      },
      {
        "index": 58,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Lewis was very knowledgable about the subject matter, but lectured with a poor sense of direction. I was unaware of what information was important and what was not. He expects you to have prior knowledge about terrorism, so if you don't, I would not recommend. I'm very disappointed and thought this would be an interesting  class.",
        "course": "INTSTDS4700"
      },
      {
        "index": 59,
        "rating": 3,
        "difficulty": 4,
        "comment": "write good papers, get a good grade. going to class isn't SUPER important, but it 100% makes writing the papers easier. prompts are always detailed and clear. good class, but also pretty boring despite such a dynamic subject",
        "course": "INTSTDS4700"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 4,
        "comment": "Had this professor for class a few times but I knew what I was getting into. Everything he teaches applies to my study so if you are thinking about taking any of his classes just for fun make sure you like the material he will be covering. The lectures are long, and he does go on tangents, but it's easy to ignore the extra info.",
        "course": "IS4701"
      },
      {
        "index": 61,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Lewis is a great guy.  Have to work for the A, but all the resources are available to be successful (the books and Carmen readings). No exams, only 5 three-page papers and an eight-page final paper. Must cite everything in the papers which can be time consuming, but really makes sure you learn the material. One of my favorite classes thus far.",
        "course": "INTSTDS4700"
      },
      {
        "index": 62,
        "rating": 4,
        "difficulty": 2,
        "comment": "The man's knowledge of his subject matter is incredible. He's like a walking talking textbook at times. If you find the subject interesting, this is a plus, if not, his lectures will be long. He loves starting group discussions though, so that will break it up. Readings are long, but as long as you throw in a few references in the papers, not hard.",
        "course": "INTSTDS4700"
      },
      {
        "index": 63,
        "rating": 4,
        "difficulty": 4,
        "comment": "He lectures from start to finish, goes extremely fast, but definitely knows what he is talking about. You have to right a handful of papers that require you to attend lectures and do the readings-he is a tough grader. Also, the readings are SUPER long and dry. You will learn a lot, but have to work really, really hard if you want an A.",
        "course": "IS4700"
      },
      {
        "index": 64,
        "rating": 3,
        "difficulty": 4,
        "comment": "Because he knows so much about the topic lectures can drag on, although this can be helpful for writing your papers if you can pay attention for that long. I liked his paper topics and the content although the readings were tedious and hard to get through.",
        "course": "INTSTDS4700"
      },
      {
        "index": 65,
        "rating": 2,
        "difficulty": 3,
        "comment": "I hated this class. There was a ridiculous amount of reading assigned and papers were tedious because you couldn't use outside sources for info. He gave way too many frivolous details in lectures, talked to fast, and was impossible to keep up with. I felt like I was in a science class sometimes. He's a very tedious man. At least he's hot though.",
        "course": "INTSTDS4701"
      },
      {
        "index": 66,
        "rating": 5,
        "difficulty": 4,
        "comment": "Excellent professor who is obviously fascinated with his subject. There's a lot of writing and reading to be done, but he's willing to review drafts before submission. The lectures are long, but he never makes it feel tedious. ",
        "course": "INTSTDS4700"
      },
      {
        "index": 67,
        "rating": 3,
        "difficulty": 3,
        "comment": "Great teacher who loves what he is talking about. Took his terrorism class over summer and lectures got to be really long and kind of boring. However if you do the readings the paper topics are fairly easy if you put in effort! I learned a lot of interesting things from the class and would take him again! ",
        "course": "4700"
      },
      {
        "index": 68,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Lewis is super knowledgable in terrorism, which sometimes means his lectures can get boring as he get bogged down in the details. Attendance isn't mandatory but the readings are! Most are on carmen but there are a few books (super cheap on Chegg). You have to write a 2-3 page paper for 57 topics from the readings and a final paperno tests. ",
        "course": "4700"
      },
      {
        "index": 69,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lewis was excellent. Being a historian by training, he came to teach this class out of his own interest, and it shows. He rarely speaks in definite terms, instead encouraging students to think for themselves and form their own opinions. One of my favorite classes and professors.",
        "course": "INTSTDS4700"
      },
      {
        "index": 70,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor.  Presents material well, engages the class in good discussions, it obviously interested in the subject and enthusiastic about teaching it, and overall is quite likable.  If you're looking for a course with low work levels, go elsewhere.  If you're looking for a good course taught by a prof who likes what he teaches, you've found it",
        "course": "IS4701"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 3,
        "comment": "I'm not even sure how a poor rating is possible. I took 4 classes from Professor Lewis and learned more in one lecture than I did in the whole of other classes. He is demanding but fair. Go to class you won't regret it. I wasn't even a great student of his as I had my business to run while in school and I still learned more than in other courses.",
        "course": "IS553"
      },
      {
        "index": 72,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lewis is a great teacher!! I would advise you to never skip a class because his lectures are incredibly informative. The readings are supplementary to the lectures, he usually doesn't  lecture exactly what you have read, so if you miss class you miss a lot. Grade is entirely based on papers, but if you put in the work he is a fair grader",
        "course": "INTSTDS4700H"
      },
      {
        "index": 73,
        "rating": 5,
        "difficulty": 3,
        "comment": "A phenomenal professor who is very obviously an expert on his subject. I would recommend to anyone looking to take International Studies courses.",
        "course": "INTSTDS4700"
      },
      {
        "index": 74,
        "rating": 5,
        "difficulty": 3,
        "comment": "He assigns a ton of reading.  All of the grades come from papers and attendance.  Nice guy.  He doesn't really respond to emails.",
        "course": "INTSTDS5195"
      },
      {
        "index": 75,
        "rating": 4,
        "difficulty": 4,
        "comment": "Class is entirely lecture-based, with no time for discussion, even when current events directly relate to class. All the grades for the class are from papers over the readings. The lectures are almost useless, I only referenced them a few times on the final paper.  When he lectures, he somehow makes a very interesting topic seem very boring.",
        "course": "IS4700"
      },
      {
        "index": 76,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lewis is one of the best professors I have had at OSU. Its true that you will learn more in one lecture than in 10 weeks of some other courses, and he is a fairly hard grader for the papers - which by the way is your entire grade, there are no tests.  There is a lot of reading, but its well worth it",
        "course": "IS554"
      },
      {
        "index": 77,
        "rating": 5,
        "difficulty": 3,
        "comment": "Terror & Terrorism was the first class that I took with Dr. Lewis. It is a pleasure to take his courses. There is a lot of reading, the lectures are detailed - but in just one class you will learn more on a topic than most do in an entire quarter on a subject. I went on a 45 minute tangent myself about the material he covered in just one class.",
        "course": "IS553"
      },
      {
        "index": 78,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interesting well spoken professor. Prof. Lewis knows this subject backwards and forwards and does a great job and teaching. It also helps that he is very easy on the eyes.",
        "course": "INSTD553"
      },
      {
        "index": 79,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good professor. Definitely an expert in his field, and lectures are quite interesting. He's engaging and very approachable. Can be a tough grader but gives very specific guidelines regarding what he wants in papers. Readings are important, but you can get by as long as you skim over them. Highly recommended.",
        "course": "IS555"
      },
      {
        "index": 80,
        "rating": 4,
        "difficulty": 3,
        "comment": "Really enjoyed this class! Dr. Lewis clearly knows his stuff. He was a tough paper grader, but was happy to discuss them with you (which is necessary because his handwriting's awful). He's pretty approachable, and I'd take a class with him again. Put in the time to do the readings, put in the time for papers, you'll be fine!",
        "course": "IS555"
      },
      {
        "index": 81,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Lewis is one of the best teachers I've ever had. He does require a lot of reading but the readings are extremely helpful to his lectures. His style of teaching is extremely in depth. I didn't do amazing in his class I got a B- but I learned a lot. I am taking his IS555 section this quarter and looking forward to it.",
        "course": "IS553"
      },
      {
        "index": 82,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is very interesting and knowledgeable, but lectures are very heavy & long. His handwriting is very frustrating because it is horrible. It is literally impossible to do all the readings with other classes, but have get the main ideas & use them A LOT in papers. Lecture is really only useful for the final paper; other papers are based on readings",
        "course": "IS553"
      },
      {
        "index": 83,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is very intelligent and informed but is challanging. He is a hard grader and expects you to be able to get a lot of information (lectures and reading) into the papers which he assigns every couple of weeks. The good thing about him is that if you realize you are doing poorly, he assigns enough to improve. his handwriting sucks though.",
        "course": "IS554"
      },
      {
        "index": 84,
        "rating": 5,
        "difficulty": 3,
        "comment": "Knowledgeable and well-spoken prof. Lots of reading and a response paper to write every two weeks. Only complaint is that there is a five page paper due the last week of the class and a ten page paper due as your exam which makes the last two weeks very stressful and back-loaded.",
        "course": "IS553"
      },
      {
        "index": 85,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interested in the material. He's a tough grader, but very helpful when you're writing a paper. I would take him again for his 553 class.",
        "course": "IS555"
      },
      {
        "index": 86,
        "rating": 4,
        "difficulty": 4,
        "comment": "As an IS major I have never had a better IS teacher! That is not to say it's easy, very challenging but worth it! A published author of these subjects he is incredably well informed! Get ready for A LOT of good reading. Not for the fate of heart, take only one of his great classes at a time. Stay away if only kinda interested in topics. Amazing!!!!",
        "course": "IS553"
      },
      {
        "index": 87,
        "rating": 5,
        "difficulty": 4,
        "comment": "Awesome teacher.  Extremely intelligent.  Learned alot.",
        "course": "IS201"
      },
      {
        "index": 88,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr, lewis is one of the most Intelligent Professors i had at Ohio State, He knows the material and i think his lectures are very interesting. He has an amazingly amount of information about what he is teaching.he is a fair grader, not easy but not hard.Expect to do a lot of work, but it is worth it, you actually will learn something.",
        "course": "INTST555"
      },
      {
        "index": 89,
        "rating": 1,
        "difficulty": 5,
        "comment": "GOOD CLASS BUT BAD TEACHER! The class is easy but he makes it difficult. He is boring lecturer.  At the end you will get an A but you have learned nothing. Make sure you bring a billow with you to the lectures and consider your self warned.",
        "course": "IS553"
      },
      {
        "index": 90,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Lewis knows the material but totally doesn?t know how to put it together in a fashion that students might fellow and understand. He is kind of arrogant professor and treats students as an ignorant people. The class is easy but he makes it difficult. I have got in his class an A- and as long as u are ready reading a lot and listening to hi",
        "course": "IS553"
      },
      {
        "index": 91,
        "rating": 5,
        "difficulty": 5,
        "comment": "I have taken three classes with Dr Lewis, and he  is amazing!  Ridiculously smart, and his classes are challenging but rewarding.  He assigns a lot of readings, but each has relevance in the grand scheme of each class, though you'll hear your classmates complain.  Take a class with him, talk with him; he's one of the best professors at OSU!",
        "course": "IS553"
      },
      {
        "index": 92,
        "rating": 3,
        "difficulty": 4,
        "comment": "I've never taken an intl stds course before, and pulled out an A. Don't let people scare you. You don't neeed a backround in this stuff. You need to be able to read a good amount of informaiton and be able to synthesize it to make points in your papers. He is EXTREMELY knowledgeable about this subject. I was a little intimadated, but learned a lot.",
        "course": "INTL553"
      },
      {
        "index": 93,
        "rating": 4,
        "difficulty": 5,
        "comment": "Extremely knowledgeable; makes you work hard for your grade, but once your done you realize how much you have learned.  Would recommend only if you are Int Stds, otherwise you might get disenfranchised.  In all he is the BEST teacher I've had here at Ohio State.  A+++",
        "course": "INT554"
      },
      {
        "index": 94,
        "rating": 3,
        "difficulty": 2,
        "comment": "He is not a very fair teacher.  When making an appointment to see him in his office, he has no consideration for the students scheduling and does not show up on time for his appointments.",
        "course": "HIST221"
      },
      {
        "index": 95,
        "rating": 4,
        "difficulty": 4,
        "comment": "Interesting material.  Make sure to read the assigned books to get the most out of it.  Papers were reasonable, but time-consuming.",
        "course": "IS555"
      },
      {
        "index": 96,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of my favorite classes so far, I would highly recommend.  He's very personable and conveys the subject matter well (in English!)  I'm not sure how tough I want to say he is--I read maybe 20% of what was assigned, payed attention in class, and got a B on each of my midterms and my final paper.",
        "course": "INTS555"
      },
      {
        "index": 97,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good class, good prof. If you want to get an A you'll have to probably really work for it, but if you're cool with a B+/A- or so, then it's very reasonable. In-class work is almost negliglible, but put some serious effort into your papers, or it will show and he will notice. The class is worth taking and very interesting.",
        "course": "IS553"
      },
      {
        "index": 98,
        "rating": 5,
        "difficulty": 3,
        "comment": "Another great class- WMD and tech. are clearly more related to his interests, but he does a fine job with the T&T material. You don't realize just how much you've learned until the end of the quarter. A lot of papers and reading, but the topics are highly interesting. Go to class, ask questions, talk to him during his OH...you won't regret it!",
        "course": "IS553"
      },
      {
        "index": 99,
        "rating": 5,
        "difficulty": 3,
        "comment": "Definitely a lot of work, but well worth it. I learned a ton in his class, and wasn't too interested in the subject beforehand.  Some of the readings and the technical parts of the lectures were dry, but on the whole, a fascinating subject.  Lewis really cares about helping his students and is very accomodating during office hours.",
        "course": "IS555"
      },
      {
        "index": 100,
        "rating": 5,
        "difficulty": 4,
        "comment": "As others have said - SLAVE DRIVER! But it's really worth it. You MUST carefully read 70+ pages per class. But the reading selections are fascinating. Papers are sometimes due on a weekly basis. But they really force you to think & grow. Very nice & caring instructor too. Loves discussion & questions. Would recommend for an otherwise light quarter.",
        "course": "INTST553"
      },
      {
        "index": 101,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "WDMTERRORISM"
      },
      {
        "index": 102,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very knowledgeable prof. Knows the subject thoroughly, and also helpful during office hours. I recommend him to anyone interested. Be prepared for a lot of reading, but it's definately worth it.",
        "course": "INTSTDS551"
      },
      {
        "index": 103,
        "rating": 4,
        "difficulty": 3,
        "comment": "Enjoyed his class.  He knew his subject very well and was able to integrate his own feelings into the class and explanations.  Let you know exactly what he wanted on the papers you just had to back it up.",
        "course": "IS555"
      },
      {
        "index": 104,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of my favorite professors at OSU. His teaching method taught me not only the course material, but how to truly study, analyze and interpret. I wish I had him earlier in my college career. What I learned from him may have helped me improve my grades in other courses. I still try to keep in contact with him for advice in my current profession.",
        "course": "IS553555"
      },
      {
        "index": 105,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely phenomenal professor. Assignments make you think, especially the final one. No tests, just papers. But it seems like the papers help you understand the material more than any test you might take. Definitely recommend him!",
        "course": "IS553"
      },
      {
        "index": 106,
        "rating": 5,
        "difficulty": 2,
        "comment": "Overall a good instructor when it came to the content of the class.  He is very arrogant and not very open to differing opinions.  He will straight up shoot you down in class if you raise an opposing point of view.  Not a hard grader if you do good work and seemed to respect people  who came to class and participated.",
        "course": "IS555"
      },
      {
        "index": 107,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is a bit arrogant but overall is a decent prof.",
        "course": "IS555"
      },
      {
        "index": 108,
        "rating": 5,
        "difficulty": 3,
        "comment": "he knows what he's talking about... he rocks",
        "course": "INTLSTUDIES55"
      },
      {
        "index": 109,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is pretty interesting.  Lectures can get a little dry sometimes, but he makes it interesting.  Lots of reading but if you keep up on it you should have no problem getting an A.  And it's not totally necessary to go to all the class's.",
        "course": "IS555"
      },
      {
        "index": 110,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hes cool as hell, just grading is harsh!",
        "course": "TERRORISM"
      },
      {
        "index": 111,
        "rating": 3,
        "difficulty": 5,
        "comment": "Not a very good class if you do not have a International Studies background.  It's a lot of work and a lot of the essays depend on previous knowledge.",
        "course": "IS553"
      },
      {
        "index": 112,
        "rating": 4,
        "difficulty": 3,
        "comment": "A LOT of reading in this class, so be prepared to read a 60-100 pages before the next class. Good thing is that his midterms and final are very interesting and they REALLY help you know the material. Also, he grades fairly easy, so it kind of balances the amount of reading that you do. Very good class overall and you learn a TON about national sec.",
        "course": "IS553WMD"
      },
      {
        "index": 113,
        "rating": 5,
        "difficulty": 3,
        "comment": "Intriguing. Lots of readings, but all were interesting and informative. The papers, even the final one, weren't too hard. There aren't a lot of guidlines for the paper, so he's open to whatever insights you have to offer. A very thoughtful professor.",
        "course": "IS553"
      },
      {
        "index": 114,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures were boring as hell and didn't have anything to do with the homework assignments, so the assigned work seemed HUGE to me. Weekly [short] papers in this class. He talks like a history professor but the class is not actually history, so it is confusing...",
        "course": "INTSTDS553"
      },
      {
        "index": 115,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have had him twice.  He is a great professor who has a genuine interest in teaching.  He is hard though; be prepared to work.  I would recommend this class to everyone.",
        "course": "IS553IS501"
      },
      {
        "index": 116,
        "rating": 5,
        "difficulty": 4,
        "comment": "The class was a lot of work, but well worth it! He knows his stuff and explains everything very clearly.",
        "course": "INTSTDS553"
      },
      {
        "index": 117,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy is awesome.  Take classes with him look him up.  When you're oogling over 3 books and 15 research documents at 4am trying to piece together the hardest paper you've ever written, you'll fully appreciate what it is to be a college student.  I love it.",
        "course": "INTSTDS501"
      },
      {
        "index": 118,
        "rating": 4,
        "difficulty": 4,
        "comment": "Teaches critical thinking, readings are very interesting!",
        "course": "INTST501"
      },
      {
        "index": 119,
        "rating": 4,
        "difficulty": 3,
        "comment": "Total history prof.  I can't stay awake to save my life.  Too many books and too many questions.  This guy is a SLAVEDRIVER!!!",
        "course": "553"
      },
      {
        "index": 120,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lewis is a ****.  he knows his stuff and his classes are very interesting.  Take some with this guy.  you won't be disappointed",
        "course": "IS501"
      },
      {
        "index": 121,
        "rating": 5,
        "difficulty": 2,
        "comment": "extremely nice and helpful. take-home midterms and final (papers). Questions are somewhat difficult but he helps as much as he can. FUN classes!!",
        "course": "IS501"
      }
    ],
    "SEI": [
      {
        "Subject": "INTSTDS",
        "Catalog": "3350",
        "Class Name": "Introduction to Western Europe",
        "Class Number": "23216",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "3.86"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "23159",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.42"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4701",
        "Class Name": "The Development and Control of Weapons of Mass Destruction",
        "Class Number": "15868",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.77"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "21791",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "35",
        "Rating": "4.09"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4550",
        "Class Name": "Bioterrorism: An Overview",
        "Class Number": "28242",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "26664",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.8"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "5195",
        "Class Name": "Selected Problems in International Studies",
        "Class Number": "22626",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "13891",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.8"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4701",
        "Class Name": "The Development and Control of Weapons of Mass Destruction",
        "Class Number": "13892",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "2194",
        "Class Name": "Group Studies",
        "Class Number": "34598",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.25"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4550",
        "Class Name": "Bioterrorism: An Overview",
        "Class Number": "22363",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "23178",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.45"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "24699",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.08"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4704",
        "Class Name": "A Global War on Terror? America's Response to the 9/11 Attacks",
        "Class Number": "35771",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4550",
        "Class Name": "Bioterrorism: An Overview",
        "Class Number": "28051",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "34914",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "19785",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.73"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3703",
        "Class Name": "Ethical Issues in the Information Age",
        "Class Number": "35500",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.5"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4701",
        "Class Name": "The Development and Control of Weapons of Mass Destruction",
        "Class Number": "20647",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.28"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3350",
        "Class Name": "Introduction to Western Europe",
        "Class Number": "30570",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "3.95"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "20231",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.19"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.4,
    "department": "International Studies",
    "firstName": "Ana",
    "id": "VGVhY2hlci0xOTM5MjE0",
    "lastName": "Puga",
    "legacyId": 1939214,
    "numRatings": 4,
    "summary_comment": "Professor Puga is known for her rigorous yet supportive approach to teaching, with high expectations that encourage active participation and thorough understanding of the material. While some students find her classes demanding, particularly due to extensive reading and strict attendance policies, others appreciate her lenient grading and willingness to help students succeed, often citing her as an easy professor who provides ample opportunities for extra credit.",
    "summary_comment_short": "Professor Puga is known for her rigorous yet supportive approach, requiring students to engage actively in discussions and complete substantial reading, though many find the workload manageable. Students appreciate her care for their success and the availability of extra credit opportunities, though some criticize the high cost of required materials and strict attendance policies.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took Dr. Puga's Spanish Literature class in Spring 2020. She had reasonable expectations, and she made an effort to make sure we understood the reading before we started analyzing. She does make you participate. There was a fair amount of reading, but it was doable. She graded leniently, and she definitely cared.",
        "course": "SPANISH3450"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor at OSU.  She makes you buy drama books worth $200 and you don't even use all of them.  Her class is so awful; all you talk about is how liberal politics is tied into melodrama.  AVOID THIS PROFESSOR AT ALL COSTS. Also, you are counted absent if you forget your  book or if you forget to print a 70 pg pdf",
        "course": "INSTDS2100"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "All you have to do is read and create discussion questions",
        "course": "INTSDS2150"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Ana Puga is a great professor to have for any GE. She is super \"free\" and easy-going. She WANTS everyone to do well in her class. If you do the readings before class and participate, you will be just fine. The quizzes are EXTREMELY straight forward if you write down what she says too. Tons of extra credit. Easy A, go to class. ",
        "course": "INSTDS2100"
      }
    ],
    "SEI": [
      {
        "Subject": "SPANISH",
        "Catalog": "4556",
        "Class Name": "Modern Spanish American Literature",
        "Class Number": "25726",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.25"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "4557.1",
        "Class Name": "Introduction to Latino Literature in the U.S.",
        "Class Number": "25629",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.5"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "4560",
        "Class Name": "Introduction to Spanish American Culture",
        "Class Number": "34779",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.1"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "4556",
        "Class Name": "Modern Spanish American Literatures",
        "Class Number": "22317",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.21"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "5660",
        "Class Name": "Seminar in Latin American Literatures and Cultures",
        "Class Number": "35290",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.67"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "5660",
        "Class Name": "Seminar in Latin American Literatures and Cultures",
        "Class Number": "21613",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "3732",
        "Class Name": "History of Performance II",
        "Class Number": "29387",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Theatre",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.09"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "7720",
        "Class Name": "Method: Performance Studies",
        "Class Number": "33641",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Theatre",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "7710",
        "Class Name": "Method: Historiography",
        "Class Number": "23824",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Theatre",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.44"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "3732",
        "Class Name": "History of Performance II",
        "Class Number": "23518",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Theatre",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "3.58"
      },
      {
        "Subject": "THEATRE",
        "Catalog": "7720",
        "Class Name": "Method: Performance Studies",
        "Class Number": "34480",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Theatre, Film and Media Arts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.29"
      }
    ]
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.4,
    "department": "International Studies",
    "firstName": "Alam",
    "id": "VGVhY2hlci01MzI2MA==",
    "lastName": "Payind",
    "legacyId": 53260,
    "numRatings": 32,
    "summary_comment": "Professor Payind is highly regarded for his passion and knowledge about the Middle East, which he shares through engaging guest speakers and detailed exam preparation. However, his lectures often include tangents, making the class structure less formal and potentially leading to an unengaging experience for some students. Despite this, many find the class relatively easy, especially for those with prior knowledge, and emphasize the importance of attending early to gauge his teaching style.",
    "summary_comment_short": "Professor Payind is highly regarded for his passion and knowledge about the Middle East, which he shares through engaging guest speakers and detailed preparation for exams. However, his lectures can be overly tangential, making the class less structured and sometimes easier than expected, with some students finding it difficult to retain significant information.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is very passionate about teaching and the middle east. He brought in great guest speakers from OSU for lectures about their area of expertise. He prepares you for exams by telling you what the possible essays may be about, so you can prepare ahead of time. I loved learning from Dr. Payind. ",
        "course": "INTSTD2200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loved this professor very passionate about the Middle East and very nice",
        "course": "INT245"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved learning from Professor Payind.  He was so knowledgable and i appreciated his class and looked forward to it. ",
        "course": "245"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Take this class for the professor, not the content. Payind cares a ton about the subject matter, but goes off on far too many tangents to really result in a meaningful class experience. Don't stress too much about the readings. Just look up different topics on Wikipedia before exams and you should be fine.",
        "course": "INTST2200"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "If you know about the Mid East you could probably pass w/o showing up. Class was just lectures, he is passionate but goes off on tangents. Try to get the general info &amp; you'll pass midterms. Ask him Qs after class so he gives a quick clear answer or he'll go on in class and forget your Q. Listen, take some notes, and show up to review day",
        "course": "INTST2200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Payind is the best professor I have ever had. He is so passionate about the Middle East and informing students about its history and current state. Likes to go on tangents and tell stories. The class consisted of 2 midterms and a final, all 30% of your grade. Don't buy the books, just take really good notes and you'll pass. TAKE THIS CLASS!!!",
        "course": "INTSTD2200"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class was very unstructured and pretty easy if you've taken a class or two on the Middle East before. He clearly knows a lot but isn't an effective lecturer. There are few assignments that make up your grade and he gives little to no feedback. It's easy but I didn't really learn much. People skipped a lot and you don't need the books.",
        "course": "NELC5645"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Payind's class was unexpectedly easy. I went into his class thinking it would be like other history classes where you have all of these random class assignments but it was the complete opposite. Go to class until the first midterm to see what kind of professor he is and then you can skip at least once a week. Returned the textbook after 1 week.",
        "course": "INTST2200"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Let me start of saying that Dr. Payind's personality as well as his actual teaching of the material have made me decide that I want to minor in International Studies of the Middle East. He is SO passionate about the Middle East, and is one of the smartest teachers I have ever had throughout my life. AMAZING PROFESSOR, AMAZING CLASS.",
        "course": "INTST2200"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Payind is a phenomenal professor, who clearly has an extensive depth of knowledge of the Middle East. He is very enthusiastic about conveying that information to his students so they may develop well-informed, intelligent perspectives on the current conflicts and interactions in the Middle East.",
        "course": "INTS245"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "the class was too easy. it's geared for people who know little to nothing about the middle east. dr. payind is a nice guy and very knowledgeable and passionate about the middle east",
        "course": "IS245"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "Brilliant guy, extremely knowledgeable about Middle East, but a bit scatterbrained. TA (Jennifer) always posts study guides for exams, definitely use them. Class moves fast and covers a lot of material, but worth it.",
        "course": "IS245"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Payind is a great guy, very passionate about what he teaches. Had a lot of guest speakers who were great, but kind of made making sense of the notes confusing. The TA Jennifer is great and is super helpful and knowledgeable also.",
        "course": "IS245"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Incredibly knowledgeable and passionate about his studies on the Middle East, and amazing professor!  His lectures and discussions acknowledge all perspectives, but he likes to impart on students the historical, cultural, and linguistic contexts of every topic.",
        "course": "IS645"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "One of the best teachers I have ever had at Ohio State. Even though attendance was mandatory, I enjoyed going to class. Understanding concepts and theories is a big part of the essay exams. He also has a great sense of humor!",
        "course": "INTST245"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Alam was one of the greatest professors I ever had. He has a passion for Middle Eastern studies and was fair and open minded in his views.",
        "course": "IS645"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "Prof. Payind is awesome, he knows the Middle East inside out. Occasionally a little unclear and distracted, but you'll love him all the more for it. Great sense of humor too. Had him for International Studies 245 and 645, no problems in either class. Highly recommended.",
        "course": "NELC645"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Payind is a good man, smart...well educated...and silly at times.  One of my favorite Professors at the Ohio State University.",
        "course": "INT245"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was awesome. A great introduction to the Middle East. But you have to have a sense of humor when you are in his lectures. Really knows what he's talking about and his TA Jennifer is great. The carmen site she has is really helpful.",
        "course": "INT245"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Payind know his material exceptionally well. He is a very knowledgable professor. His writing is a bit hard to understand, but his test formats are clear cut. Studying for them is hard..it's almost like pulling needles out of a hay stack. However, the last midterm and the final were graded pretty easy since they were difficult.",
        "course": "INTSTUD245"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor is very interested in course, willing to answer any questions. It's a bit hard to figure out what to study for the tests. Only takes attendance a few times a quarter. Writing is very hard to read.",
        "course": "INTSTDS245"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "great class. He is a very knowledgeable prof.  Knows more about the middle east than anyone.  Must take class!",
        "course": "INTSTDS245"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Payind is a great man, good source of help. I thought tests were a little tricky but, he gives you plenty of options on test format. All in all a good class:)",
        "course": "INTSTUD245"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really knows his stuff and is a great resource. You get to learn so much more than what the U.S. media might present in his courses.",
        "course": "245"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very smart on the subject.  Is very willing to help, but if you don't speak up he'll move on to another subject.  Wants people to know more then what you see on the news about the Middle East.",
        "course": "INTSTUD245"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good class, the teacher is an expert and very knowledgeable and helpful. The midterm and finals are straightforward. Dr. Payind is a brillant and nice man.",
        "course": "INT645"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Payind is an interesting man, he knows his stuff very well; he's very knowledgable. I learned a lot of important concepts from the class. The tests are easy if you just look over your vocab and notes.",
        "course": "INT245"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very knowledgable about past and current Middle East.  Can tell is interested in subject, always willing to answer questions.  Class interesting b/c other viewpts brought in from guest lecturers.  Writing is pretty difficult to read, goes too fast at end.",
        "course": "IS245"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "INT245"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 2,
        "comment": "He was a good teacher, interesting class.",
        "course": "IS267"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "An asset to Ohio State! This man is a wonderful professor!",
        "course": "245645"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "excellent teacher, great class- very interesting!",
        "course": "INTSTUDIE"
      }
    ],
    "SEI": [
      {
        "Subject": "INTSTDS",
        "Catalog": "2200",
        "Class Name": "Introduction to the Modern Middle East",
        "Class Number": "15863",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "2200",
        "Class Name": "Introduction to the Modern Middle East",
        "Class Number": "13887",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.17"
      }
    ]
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 3.1,
    "department": "International Studies",
    "firstName": "Tatyana",
    "id": "VGVhY2hlci0xNzY0NDc=",
    "lastName": "Nestorovamatejic",
    "legacyId": 176447,
    "numRatings": 57,
    "summary_comment": "Professor Nestorovamatejic is known for her rigorous grading standards and heavy reading assignments, making the class challenging but potentially rewarding. While some students found her lectures and class format engaging and appreciated her willingness to provide feedback, others criticized her teaching style as unclear and boring, suggesting that the class might be best suited for those deeply interested in the subject matter. Overall, her classes require significant effort and dedication to succeed.",
    "summary_comment_short": "Professor Nestorovamatejic is known for being a challenging grader with rigorous expectations, particularly in terms of citations and formatting, and often receives mixed reviews regarding her teaching style. While some students appreciate her detailed knowledge and engaging storytelling, others find her lectures and grading criteria confusing and her classes overly demanding.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "One of the worst professors I have had. Do not take her class she does not understand the material she is teaching. Honestly, if you do you would be better off doing the readings and not going. ",
        "course": "POLITSC4218"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr.Nestorova provided a nuanced perspective about Russian politics. She kept the class entertained by include silly images in the power point slides or tell us personal stories from her youth. ",
        "course": "POLITSC4218"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "There are several readings a week for this course and they are typically pretty heavy topics. She is a very hard grader (make sure font for presentation are +14pt font, every line is cited from the text, follows the format of the reading). She is willing to edit and help. TAKE ADVANTAGE OF THIS. I learned so much in this class! Definitely take it.",
        "course": "INTSTDS5801"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "The most difficult grader I've ever had. Gives extremely vague prompts for papers and then deducts points for not including the most specific things. Her lectures are boring and honestly you could have learned the same material just by reading a book/watching a documentary. Avoid at all costs.",
        "course": "INTSTDS2250"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Harsh grader. Is not clear enough about what she wants for essays. Difficult to succeed.",
        "course": "INTSTDS4251"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "If you are not interested in foreign affairs/history this is not a good class to take. This was the hardest GE class I've had to take. There's a lot of reading, a lot of papers, and she has no clear guide lines for her papers. The only way to do well on papers is to cite the books assigned as much as you can in papers.",
        "course": "INTSTDS2250"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "She knows a lot but does not communicate it clearly and rambles. Posts all slides online which you would be better off studying on your own but you have to go to class. Midterm and final are take home 5 page papers with a 5 page current event research paper. All rely on the chapters she assigns from various books. She doesn't grade them very easily",
        "course": "POLITSC4218"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 1,
        "comment": "Not a fun class. The content was repetitive and she doesn't lecture. You and your classmates create power points and do lectures on readings. You do carmen responses every day for homework. Though Children and War was an interesting topic, the class was boring and tedious.",
        "course": "INTSTDS5801"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "very very tough grader",
        "course": "INTSTDS4251"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Nestorova is a great professor.  She uses the lens of soccer to provide a deeper understanding of globalization and comes to each class excited to teach.  She takes a genuine interest if you are motivated to learn.  Taking another class with her in the future. ",
        "course": "4195"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "No \"midterms\" - just a few papers. You can tell she is really passionate about this area of study, especially since she is from Bulgaria. She knows her stuff and can communicate it very clearly. Would take again.",
        "course": "IS2251"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's great with language participation.",
        "course": "401"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Her lectures could get boring, but it didn't stop me from enjoying the class. She was very passionate about what she was teaching and, growing up in a Soviet Bloc country, was very knowledgeable. She may nitpick on the assignments, but that's not reflected by the overall grade. However, you have to know how to write a decent paper to do well.",
        "course": "INTSTDS2250H"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Nice lady but lectures are very boring and mostly on the reading that you already did. Tough grader. ",
        "course": "INTSTDS2251"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr Nestorova is a very sweet lady, accent is not too thick to understand, and I didn't try very hard and ended up with a B+. She basically gave us all the info she wanted to see in our papers, you just have to go to class.",
        "course": "INTSTDS4251"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is NOT  as difficult of a grader as everyone is saying. Yes, she likes to nitpick on details in essays, but it didn't reflect in the overall grade. It's college, you're expected to write a coherent paper and she wants you to cite your textbooks. She can be boring during lectures, but she is very knowledgeable.",
        "course": "INTST230H"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. N is definitely very passionate about her subject and knows a lot! For this class, it was very important to attend lecture,  because without it, you'd fail the exams. Frankly, she was a very tough grader-too tough for a GEC class on E. European history. If you attend lecture AND read the books (which I didn't) getting an A isn't hard.",
        "course": "INTST231"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 4,
        "comment": "Extremely tough grader, it makes you feel like you're in an English class. Do not expect to get high grades on her papers. This said she was one of my favorites, she knows her stuff and is passionate. Class can be long sometimes though.",
        "course": "INTST230"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "I absolutely loved this class. It wasn't easy, but it was really interesting. She really knows her stuff and she is very passionate about Russia's history. She is a very hard grader with really high expectations, but she is  more than willing to help if you approach her with questions. I would highly recommend her.",
        "course": "INTST230"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "I felt like I wrote some of my best papers for this class, but didn't get higher than a C on any of them. She is a very, very tough grader, but an interesting professor, and I'm sure she would explain anything you wanted her to.",
        "course": "INTST230"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 4,
        "comment": "She speaks very slowly which sometimes makes it very hard to understand what she is saying but she knows the topics very well and thoroughly goes into what the textbook deals with, which facilitates everything because there is really no need to read the textbook. She is an extremely tough grader.",
        "course": "INTST230"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 5,
        "comment": "If you take this class you better be good at teaching yourself. She's nice enough but definitely not helpful at all and she talks sssllllooowwwww. If it weren't for the subject this class would be AWFUL. She also grades very hard and is not remotely helpful. I wish I would have read about these review before taking the class. I Wouldn't have.",
        "course": "INSTD533"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 5,
        "comment": "She's not a bad teacher, she just wholeheartedly believes that only one or two students deserve an A- and that no one ought to get an A. Her expectations rise exponentially from paper to paper, but doesn't get any better at explaining the material or providing concrete examples. It's a good class, but a really tough ride.",
        "course": "IS533"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "This professor was very passionate about what she was teaching and was very helpful. I really enjoyed taking this class and feel as though I learned a lot. You'd be lucky to have her as a professor! She's the best!",
        "course": "INTST230"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "Although very informed on what she was teaching, she was horrible at getting it across to the students. her lectures were so boring i found it hard to even stay awake, let alone pay attention. her grading is absolutely ridiculously strict for no reason. she makes it clear whether she likes you or not and your grade will be based off that.",
        "course": "ITSTD230"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 3,
        "comment": "class was pointless. dont do the online readings it only applies to the final paper which is 2 prompts based off our readings. dont go to class at all. in projects make sure you have one powerpoint. and you watch time. the papers are extremely basic and easy. getting a B+/A- wont be hard at all. if anything it was a huge waste of 148mins.",
        "course": "IS533"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very uninteresting. She mainly just lectures about statistics and does not show many examples in a monotone voice.The only thing cool about the class is the books we read: Gommorah, The Natashas, and Mcmafia. You have a presentation with a few other classmates on a topic that interests you.",
        "course": "INTSTDS"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is a very tough grader and you have to get used to her style of teaching. If you are not super interested in the subject you will be bored. Her exams and paper are difficult so plan ahead. I did feel at times that if you did not give a &quot;phd&quot; worthy answer than she didn't give you a good score.",
        "course": "INTS230"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is worthless as a teacher. This class had a lot of potential but she killed all of it. Lack of content was astounding. My baby sister knows more about European crime. Lecture is deathly boring! Opinions contrary to hers are not welcomed at all. Those who disagree are punished in grades. This is a class for mindless drones only. Beware!",
        "course": "INST533"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 5,
        "comment": "I had her for 2 classes this quarter and this was the worse of the two.  She had no clear lesson plan and it was hard to pay attention.  It seemed like her expectations of the papers seemed to change when she graded it.  She assigned way too many books for each class.  Overall I would never take another class taught by her.",
        "course": "IS533"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class is pretty intense.  There are 3 textbooks assigned.  I only read them for the papers.  Make sure to go to every class because many times she discusses exactly what she expects to be written in papers and on exams.  She is a tough grader, but as long as you take good notes in class you should be fine.",
        "course": "INTST231"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "Way too much reading for a 200 level class. You really can't skip. It's a good idea to put specific details in your essays if you want a good grade. I got an A in this class but I studied so much for the exams it was ridiculous. It made me interested in Eastern Europe though.",
        "course": "INTST231"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 4,
        "comment": "Incredibly boring lectures, harsh grader almost to an extreme. Assigned textbooks are awful. Yes, she knows what she's talking about, but she rarely has anything interesting to say. Would avoid any more classes that she taught, wouldn't recommend her at all.",
        "course": "INTST231"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 4,
        "comment": "Not too bad of a class as long as you come to class.  I didn't open my text books except to write my papers.  They were extremely boring.  You really really need to study for the tests though.  And I think this class should be higher than a 200-level course.  She expects a lot.",
        "course": "IS231"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "This is an excellent class. The professor really knows her subject. Her lectures are clear and easy to understand. You are required to put forth effort to obtain a good grade but that's really not unreasonable for a college class. She is more than willing to take time to answer questions but does not allow students to dominate the lecture.",
        "course": "INTST230"
      },
      {
        "index": 36,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is a really tough grader!  Lectures are considerably long and boring.  The tests are essay and really difficult.  The books assigned (3) are terrible to read and a waste of money.",
        "course": "INTST231"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "INTST231"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great course. She doesnt grade as hard as others will have you think. She expects you to be competent, and if you arent, she'll stick it to you. I like her straightforward style and she definetely knows what she is talking about.",
        "course": "INT260"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very very tough grader, almost to a laughable extent. The book from Marples is too long, don't even bother buying/reading it. Her lectures are ok, she knows a lot about the subject, but can become boring over time. Doesn't seem very approachable.",
        "course": "INTSTUDIES230"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 5,
        "comment": "Horrible Teacher, I missed 1 class for a doctors appointment and she wouldn't even tell me what we'd done in class that day.  Ridiculous grader, and rescheduled our exam to 1 week early with almost no notice.  I will go out of my way to never take a class with her again.",
        "course": "HISTORY231"
      },
      {
        "index": 41,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible teacher, lectures for two hours straight, grades hard.. gives lots of information, so its hard to know what you need for the tests...boring..",
        "course": "INSTD201"
      },
      {
        "index": 42,
        "rating": 3,
        "difficulty": 5,
        "comment": "Lectures are interesting, but attending does not ensure a good grade.  I read and didn't miss a class and am praying for a C.  She is an *extremely* difficult grader.",
        "course": "INTSTDS230"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's an excellent teacher. There is a lot of assigned reading (3 books) but you only really have to read one (book report) if you attend all of her classes. All of the material on the tests are from lecture so skipping is not a good idea. She's a tough grader but if you attend class and take good notes you shouldn't have any problems.",
        "course": "INTSTDS230"
      },
      {
        "index": 44,
        "rating": 3,
        "difficulty": 4,
        "comment": "She is a really interesting person and tells good stories but she is also an extremely tough grader. You don't need to read the books if you go to all the lectures and take notes, but know specific details for tests.",
        "course": "INTSTDS230"
      },
      {
        "index": 45,
        "rating": 3,
        "difficulty": 2,
        "comment": "There's nothing from this class that i couldn't have learned from the book. She is extremely stubborn, so don't ever disagree with her. your grade will suffer- on our midterm only 3/54 people got above a 90 percent.",
        "course": "INTSTUDIES230"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class itself is pretty interesting and she does give a lot of facts and things that help give you an idea of what life was really like in the USSR...however, when she grades she is kind of harsh--she looks for very particular things when grading.  If you want an A you better learn exactly what that thing is.  Otherwise, good course.",
        "course": "IS230"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 3,
        "comment": "She does not accept any challenging opinions, even if they do have merit. Just because she is from Bulgaria, doesn't mean she grew up in the USSR; thus, I think that many of her opinions are formed by the books she's read and not from actual experience. So in my mind, it's not right to discount the life experiences of those who have  lived there.",
        "course": "INTSTDS230"
      },
      {
        "index": 48,
        "rating": 3,
        "difficulty": 3,
        "comment": "she made me interested in Eastern Europe!",
        "course": "INTSTDS"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 2,
        "comment": "AWESOME CLASS!  She really knows what she is talking about.  Often throws in bits of trivia and knowledge one would not normally think about.  Highly suggest the class!  Exams are fine as long as you study and write plenty to explain your answers.",
        "course": "INTSTUDYS230"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 3,
        "comment": "She really knows what she's talking about and is easy to understand.  Her knowledge is seemingly endless, which makes lectures fairly interesting.  The exams were tough, but not impossible if you attend lecture, take thorough notes, and keep up with studying.",
        "course": "INTLSTUD230"
      },
      {
        "index": 51,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is probably one of the most unrealistic graders on campus.  Really, give her exactly and more than what she wants out of you in an essay and you'll be lucky to pull off a C.  If possible, don't take any classes from her.  Terrible, boring, and strict.  Overall just a bad proffesor.",
        "course": "2008"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 4,
        "comment": "I'd have to say that it is true, disagreeing with her is fruitless.  Anyways, the course is difficult, but stimulating if you're up for a challenge. There is a lot of reading as well (3 books). If you take this class be sure to take notes and pay attention. Missing class a lot isn't a good idea.",
        "course": "INTSTDS230"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great professor, knows her stuff. Comes from the region, very wise in communist policies. She's tough, but it's well worth it. Make sure you read the small, white book and take a lot of notes, should prepare you for the exams the best",
        "course": "INTSTD231"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 4,
        "comment": "Pretty tough grading, good teacher though. Lots of reading, sometimes to real excess for a 200 level class.",
        "course": "INTSTD230"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 4,
        "comment": "Intelligent, good lectures.  Don't ever disagree with her, though, or your grade will suffer - even if you're simply voicing an opinion.",
        "course": "INTST"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very good teacher.  You can understand her and where she's coming from.  Make sure to do reading assignments and check with syllabus.  Just because she doesn't go over it in class, doesn't mean its off-limits.  I got a B- with a good amount of work",
        "course": "INTSTDS230"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 5,
        "comment": "She gives great lectures - very entertaining and fun to listen to, but she grades very very hard.  Coming to class and reading the text aren't enough to do well in her class.",
        "course": "INTST230"
      }
    ],
    "SEI": [
      {
        "Subject": "POLITSC",
        "Catalog": "4218",
        "Class Name": "Russian Politics",
        "Class Number": "23963",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Political Science",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.43"
      }
    ]
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 5,
    "department": "International Studies",
    "firstName": "Frank",
    "id": "VGVhY2hlci0yMDY2MjM2",
    "lastName": "Stratman",
    "legacyId": 2066236,
    "numRatings": 25,
    "summary_comment": "Professor Stratman is highly regarded for making his classes engaging and enjoyable, with a focus on interactive lectures and interesting discussions. He is known for being approachable, knowledgeable, and humorous, and while the material requires engagement and preparation, particularly through the required textbooks, his teaching style and fair grading policy contribute to a positive learning experience.",
    "summary_comment_short": "Professor Stratman is highly regarded for making his classes engaging and easy, with a focus on interactive lectures, interesting discussions, and accessible quizzes. He is known for being approachable, knowledgeable, and humorous, though students emphasize the importance of purchasing the textbook for consistent success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a great prof and made this class a lot fun and easy. There is decision posts and quizzes online. ",
        "course": "INSTDS3701"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "BUY THE BOOK! Questions on quizzes are literally taken word-for-word. You will NOT PASS if you do not have the book. Prof Stratman is very knowledgeable in his field and a nice guy. No papers for this class, just Carmen quizzes, discussions, and two exams. None are hard, but make sure you budget enough time.",
        "course": "INSTDS3701"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Stratman is very chill and an easy grader. All quizzes and exams are open book and very easy if you have the e-book. Interesting discussion board content and lots of different topics/current events discussed in lectures.",
        "course": "INSTDS3701"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is just absolutely amazing, he interacts with his students, is understanding, and he is hilarious.",
        "course": "INSTDS3700"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Stratman is an absolute G, he was my favorite professor from my entire college experience. I had him for homeland security and terror & terrorism. He is funny, approachable and highly knowledgeable about the course content. I recommend buying the textbooks online. ",
        "course": "INSTDS4700"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was so fair out of my league taking this class I don't know what I was thinking. However Mr. Stratman worked with me before class and I got an A. I suggest buying the online book vs actual book. I highly recommend him and I hope to take all of his classes. However this not a &quot;easy A&quot; you do have to show up and do the readings.",
        "course": "INTSTDS3700"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a really fun class! Prof Stratman is extremely knowledgable and his lectures were informative and hilarious. Weekly quizzes are open-note. The class relies heavily on the textbooks, but they're relatively cheap. I think this was a really great way to learn about something new without risking your GPA!",
        "course": "INTSTDS3700"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best international studies professors at Ohio State. I learned so many things during his lectures and enjoyed showing up to class. Make sure you have the textbooks. Only three things are not open book, and they are easy memorization. Will definitely be taking him again, so lucky to be able to have him.",
        "course": "INTSTDS3701"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "His Homeland Security class was easier than his terror and terrorism class, but both should be VERY easy A's!",
        "course": "INTSDS4700"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really great, get the ebook and its super easy.",
        "course": "INTSTDS3700"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class appears to be a step up from his other classes. You must read the book for his weekly quizzes, which are a good chunk of your grade. The exams are open-book, but you actually need to read before the day of. His papers aren't difficult, but you need to put effort into them. Very funny guy with great stories, so show up to class!",
        "course": "INTST4700"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Frank is very well respected and a great professor. He doesn't kill you with unnecessary homework and readings. I actually learned a lot in this class that was applicable to real life, and I genuinely enjoyed the class. Frank is HILARIOUS and is always making the class crack up. Also, he is attractive which is a bonus. 10/10 would take him again.",
        "course": "IS3701"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "The best stories ever. He has crazy relevant experience and will share that with you. If you don't come to class get ready for some \"heart burn\" because attendance is mandatory. But you'll want to come to class because it is so interesting. He'll accommodate you if necessary and is super accessible. 10/10 would take again.",
        "course": "INSTDS3700"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very accessible, great textbooks, great conversations, great lectures, great stories. Genuinely cares about the success of his students. Must take him. Best professor at Ohio State. You won't be disappointed. Show up, take interest, and you'll do great! No heartburn at all with him.",
        "course": "INSTDS3701"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "The absolute best. 10/10 would recommend. He has the real world experience that makes his lectures engaging. He has all the war stories you could ever want. Buy the books and you'll pass.",
        "course": "INSTDS3700"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "My 3rd class with him. Frank Stratman is the best instructor that I've had at Ohio State. His lectures are always relevant, easy to follow, and very enriching. You're expected to come to class, and be prepared to participate in discussions that pertain to the course material. No long nonsensical papers. Take his classes! Learn a lot & GPA booster.",
        "course": "INSTDS3700"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Frank Stratman was awesome. I really enjoyed his class. I learned a lot but without the stress. Easy online quizzes, open book tests, and a few easy short papers. Truly wants his students to do well, learn, and think for themselves. One of the best profs at OSU.",
        "course": "INTSTD4700"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Stratman is amazing! He has real world experience and a sense of humor that makes classes engaging. Unlike other classes, you are not overflooded with information that you will never use again, the subject and the way he presents it is applicable and useful. I am taking another class with him asap.",
        "course": "INSTDS3701"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Intro to Homeland Security was an easy and interesting class. Online quizzes can be taken as many times as you want, tests are open textbook and there's one group project. Lectures are interesting and relevant to current events. I plan on taking Mr. Stratman's Terror class in the fall.",
        "course": "IS3701"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Open book midterm/final makes it super easy, very interesting lectures and you learn a lot",
        "course": "INTSTDS3701"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Highly Recommended ... Great Professor ... Very respectful. Always go for his classes ",
        "course": "INSTDS3700"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Startman is one of the best professors I ever had. Very helpful, understanding, knowledgeable, respectful. Syllabus is very clear and very organized. Professor was very passionate about the materials. I would definitely take any of his classes and recommend his classes to my friends too. I benefited  a lot of this class and enjoyed every ",
        "course": "INSTDS4700"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very fair and helpful. Assignments were very easy and it was easy to get a 100 on exams as well. ",
        "course": "INSTDS4700"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Flexible and understanding. Easy to get along with and very helpful.",
        "course": "INSTDS3701"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Stratman is one of the best professors I have ever had. Respectful, Hilarious. Great Class. Clear materials. Gives feedback and willing to help. Would definitely take any of his classes. ",
        "course": "INSTDS4700"
      }
    ],
    "SEI": [
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "22188",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.57"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "22636",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.7"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "19554",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.5"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "19551",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "20211",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.91"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "20659",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.69"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "13682",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "5"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "13679",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "5"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "23842",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.4"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "24252",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.72"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3700",
        "Class Name": "Introduction to Intelligence",
        "Class Number": "19925",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "19922",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.86"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "26310",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.69"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "28998",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.68"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "26693",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.82"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "20229",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.91"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4700",
        "Class Name": "Terror and Terrorism",
        "Class Number": "30123",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "International Studies",
    "firstName": "Cindy",
    "id": "VGVhY2hlci0yOTY4Njg1",
    "lastName": "Jiang",
    "legacyId": 2968685,
    "numRatings": 1,
    "summary_comment": "Professor Jiang is highly regarded for her dedication to her subject matter and her students. Her teaching approach is primarily lecture-based with substantial homework assignments that are manageable. She successfully facilitated a unique semester-long group presentation project with international students, enhancing the learning experience.",
    "summary_comment_short": "Professor Jiang is highly regarded for her dedication to her subject matter and engaging teaching style. Her course includes a significant group presentation with international students, though it is lecture-intensive with manageable homework assignments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Jiang is an amazing professor. She cares about what she is teaching. The main assignment for this class is a group presentation done with students at a university in Mexico which was interesting to navigate. It was done over the course of the entire semester. Pretty lecture-heavy and there is a decent amount of hw but completely doable.",
        "course": "FR3054"
      }
    ],
    "SEI": [
      {
        "Subject": "FRIT",
        "Catalog": "3054",
        "Class Name": "The 21st-Century Skill: Intercultural Competence for Global Citizenship",
        "Class Number": "36352",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.77"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "International Studies",
    "firstName": "Hilary",
    "id": "VGVhY2hlci0yNzcyOTkx",
    "lastName": "Bussell",
    "legacyId": 2772991,
    "numRatings": 2,
    "summary_comment": "Professor Bussell is highly regarded for her dedication to her students and her teaching quality, with many recommending her classes. While some assignments can be lengthy, particularly later in the semester, her supportive approach and generous extra credit opportunities make achieving a high grade feasible. Students appreciate her engagement with class discussions and her overall positive influence on the learning environment.",
    "summary_comment_short": "Professor Bussell is highly regarded for her dedication to her students and her teaching quality, though some assignments can be lengthy. She encourages active participation and offers ample opportunities for extra credit, making it easier to achieve high grades.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I would take more classes w her if I could. She rlly cares abt her students and overall is a good teacher. Some assignments are rlly long but as long as ur paying attention to deadlines, you'll be fine. She gives plenty of extra credit so it's easier than u think to get a high A in this class. I would recommend taking it, even if you don't need it.",
        "course": "INTSTDS4850"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "A nice teacher that really appreciates students being active and participating in class discussions. A couple of assignments throughout the semester, but more of them are due towards the second half. I would take her class again. ",
        "course": "INTSTDS4850"
      }
    ],
    "SEI": [
      {
        "Subject": "INTSTDS",
        "Catalog": "4850",
        "Class Name": "Understanding the Global Information Society",
        "Class Number": "20794",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.89"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4850",
        "Class Name": "Understanding the Global Information Society",
        "Class Number": "26666",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.75"
      }
    ]
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4,
    "department": "International Studies",
    "firstName": "Jason Matthew",
    "id": "VGVhY2hlci00OTkzMDg=",
    "lastName": "Payne",
    "legacyId": 499308,
    "numRatings": 58,
    "summary_comment": "Professor Payne is known for his engaging and discussion-based teaching style, which many students find enjoyable and easy. He prioritizes participation over grades and is perceived as understanding and supportive of students' personal circumstances. However, some students have criticized his lack of timely grading, suggesting a need for greater accountability in this area.",
    "summary_comment_short": "Professor Payne is known for his engaging and discussion-based teaching style, which many students find enjoyable and easy, leading to high satisfaction rates. However, some students have criticized his lack of prompt grading and perceived lack of commitment, noting that he sometimes delays putting in grades until late in the semester.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is super easy! It is all discussion-based, which made the class interested, and I genuinely enjoyed going to class. Jason cares more about participation than actual grades, which I really liked! Highly recommend!",
        "course": "COMP1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jason is more interested in teaching/learning than grading. His classes cultivate interesting discussions that lead everyone (students and teacher included) to draw insights from the course materials and from each other. He's very understanding of students with unique or complicated lives outside of class. One of the better teachers I ever had.",
        "course": "COMP2281"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Although the class content was interesting and Jason allows us to lead the class with our own discussion, his lack of commitment does not deserve over a 2/5. We are now 3 weeks from the end of the semester and he still has not put in any grades. None of us know how we will end up in the class because he is too lazy to put in 5 grades.",
        "course": "COMP2281"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was a really easy A, and this is coming from someone who doesn't like science fiction. As long as you go to class most of the time and read parts of every book, you should be good to go. I would definitely take this class again.",
        "course": "COMPS2104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Just participate in class, think about the material and this is a great class",
        "course": "CS1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason was really an awesome professor. He is truly funny and cared about what he taught and made the class fun. He encourages talking and participation and makes you feel respected no matter your opinion. We had a few reflection papers and a midterm and final. Very easy, very interesting, I highly recommend.",
        "course": "COMP1100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "So funny and caring. Loved the topics that we covered and Jason was really nice and didn't really care about grades. As long as you do the papers and show up and participate you are guaranteed a good grade. Would definitely take again!",
        "course": "COMPS3608"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "such an intriguing man and class. easy A if you show up and involve yourself in discussion. He makes learning fun and I wish all teachers were as good as him when it comes to relating with the class and making us feel comfortable and inspired.",
        "course": "CS1100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really interesting discussions, would definitely take again. A great and super easy class. Three response papers (2 pgs), one midterm and a final - all typed at home.",
        "course": "COMPSTD1100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A!",
        "course": "CMPST367"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason is a wonderful teacher, he chooses short, interesting novels so students will actually read them. He's very laid back, and just enjoys having thoughtful discussions about the books, we even watched movies! He won't ever just call on you and make you talk. Fair and easy grader on the papers! Take Jason's class if you can! Coolest teacher ever.",
        "course": "COMPSTD3608"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Despite being skeptical during the first few weeks, I really enjoyed this class. The class was based off of reading we did for homework, but we essentially always ended up discussing relevant current events and I found it very interesting. Jason encouraged us to disagree and discuss our viewpoints in a respectful way and I feel I gained a lot.",
        "course": "COMPSTD1100"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "Jason was so laid back and funny.  He really didn't care about grades at all, he just wanted us to learn and discuss relevant topics.  The class was almost no work, and we only ended up writing 1 real paper.  He really cared about his students and wanted us to think for ourselves.  I would definitely take another class with him.",
        "course": "COMPSTD2367"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason is one of my favorite instructors! Started off having weekly quizzes but that didn't last long. 3 short response papers and a midterm and final paper. Talk in class for participation! We read for class and discussed it. Most of the class was just kids sharing their opinions on relevant topics in culture today. Very funny and cares a lot!",
        "course": "CS1100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really entertaining topics that he presents in a fun way. Most work done was to read a few short books and write papers. Funny guy that could give you a new perspective on just about anything. I would take any of his classes",
        "course": "COMP2281"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "He made a GE lit course enjoyable! Jason cares about his students and wants people to do well. The books were interesting and we discussed them thoroughly in class. He's very reachable and willing to help.",
        "course": "CS1100"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 1,
        "comment": "I've taken two courses with Jason, he's an inspirational professor who truly cares about learning and becoming a more intellectual and worldly student. The reading assignments are interesting and never too demanding. He's very laid-back and has almost no filter, which is very entertaining. I would definitely recommend him!!! Best prof I've had here",
        "course": "COMPSTD1100"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 1,
        "comment": "Funny guy. It seemed like grades were not important to him--discussing the material was, which was nice. If you really like film and literature, this is your class, because the discussions are interesting.",
        "course": "COMPSTD3607"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason is an awesome teacher and a really cool person.  His class is not difficult, the books you read are easy and usually enjoyable, and he works to make the discussions fun.  On top of that, he really reaches out to students and is always welcoming of conversations afteroutside of class",
        "course": "COMP2281"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy course. As long as you show up every class and participate!",
        "course": "236708"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Honest to God, the best professor I have ever had a class with. Shows up to almost every class wearing basketball shorts and even Grateful Dead t-shirts but the class is a semester long discussion on a great article. The readings are light and extremely interesting; wants you to do well in his class. Extremely helpful and easy to talk to ",
        "course": "CMPSTDS236708"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is a great professor, take him. He takes very long to grade assignments, but he really cares about his students and their thoughts on how class is going. For this film class, the films were okay not very good, but having him discuss them is great. Papers were not bad at all, easy class. Relaxed feel, great guy! Speak in class and you'll get an A",
        "course": "3607"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "We graded our own participation and quizzes. Attendance mandatory but he doesn't really pay attention. Papers are single spaced, watch out for that. An A is attainable, but it will be a boring and annoying one. He takes forever to grade work, if at all.",
        "course": "3608"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seriously such a great professor. A professor who wants his class to think for themselves. Class was all discussions, no notes. He is honestly my favorite professor of all time. I wish all professors could be like him, and college would be 1000000x better. Truly a GREAT man",
        "course": "AMERICANICONS"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class is fairly relaxed. Mostly just sharing ideas on topics assigned for reading. Wide variety of books assigned throughout the semester. Papers not graded until much after they're turned in.",
        "course": "COMPSTD2281"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you can possibly have him as a teacher, do it. Makes class enjoyable and you just get to relax and talk. Every class he just sat in fron of the room and we just casually talked about the books. Great teacher.",
        "course": "COMP1100"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "Best teacher I've had at OSU so far. Wants us to develop our own opinions rather than jam his thoughts down students throats (Like several other professors). Take his class!",
        "course": "COMP2367"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "This is the first time I have ever posted on this website, but I have never had a teacher like Jason Payne. This is a man who is committed not only to teaching young adults, but to helping them develop. His class discussion are thoughtful and riveting. The reading materials are interesting, and the assignments are reasonable. Take his classes!!",
        "course": "COMPS308"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's one of the most interesting profs I've had at OSU. Easy grader, but gave really thoughtful feedback on drafts. He is really committed to the process of teaching as well. All the material he gives is very easy to read but still good for opening discussion. Would recommend taking a class he is teaching.",
        "course": "CMPST367"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "I thoroughly enjoyed Jason Payne. He leads great class discussions, and doesn't let anyone say the obvious answer then lapse back into silence. There was lots of reading and the midterm made me want to pull my hair out, but he's an easy grader and mostly just wants a thoughtful response. I would highly recommend him.",
        "course": "COMP358"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jason did not hand back any graded work, but his opinions were very interesting and lead class discussions well. Just participate in class and you will get an A.",
        "course": "CMPST367"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jason Payne was a great teacher, he was very easy going and the workload was light.  I recommend taking his classes",
        "course": "CS308"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 3,
        "comment": "loved the books he assigned",
        "course": "COMPS330"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 1,
        "comment": "Discussions were great. But reading the entire book was never necessary. As long as you had a clue what the book was about you can jump into the conversation which always takes many twists and turns and still get participation points. Late to class, late grading papers, very opinionated and quick to put down other's views.",
        "course": "COMST597"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jason is very relaxed and easy-going. The class is based on discussion and reading. I liked all the books we read and movies we watched in class. He canceled class a few times, and was late handing things back, but he's willing to work with you if you have issues. I love this teaching style and enjoyed the discussions and the class.",
        "course": "COMP358"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 4,
        "comment": "jason is an atypical instructor to say the least. his demeanor is very relaxed (expect a lot of big dogs apparel and not a single tie--which i'm not knocking). there was a lot of reading, but it is very relevant. his discussions are great, and he knows the ins and outs of a lot of issues. he's lax about deadlines, which i like but isn't for all.",
        "course": "COMP597"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 2,
        "comment": "FILM STUDIES PEOPLE BEWARE: such a disappointment.  seems like a nice guy but i have never had a prof with more excuses.  cancelled class multiple times, cancelled a midterm and two papers.  maybe some people like that, but i don't like living in grade purgatory.  flirted an uncomfortable amount and chose creepy art films and racy novels.",
        "course": "COMST367"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 3,
        "comment": "Late, late, late. Late to class, late for grading, late for posting final grades. It's Saturday and I still have NO idea how I did in the class. His lectures were extremely interesting and the books/films he chose were fantastic, but I literally did not receive a single paper back until the last week of class.",
        "course": "CMPST358"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good class and instructor. The best discussion leader of all times. Very helpful, intelligent, and open minded. Pretty funny and laid back. Plays devils advocate but not too much to where it is annoying. Expects you to read but he picks worthwhile books.",
        "course": "COMP367"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was my favorite class of the quarter. He does play devil's advocate, but I liked it, it made me think about the other perspective. Class discussions are important, so do the reading. Books are interesting, doesn't grade too harshly. I highly recommend taking this class!!",
        "course": "CMPST367"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed this class.  great class discussions and worthwhile reading.  He does like to play devils advocate but respects everyones opinion.It is necessary to reaad the books to partispate but pays off.  I feel like i really learned a lot from this class and highly recomended it to my friends.",
        "course": "CMPST367"
      },
      {
        "index": 42,
        "rating": 3,
        "difficulty": 3,
        "comment": "Plays the devil advocate constantly.  Don't expect him to simply agree with you when you talk in class.  But, this challenges you to see the other side of your opinions.  You must be an in class talker!!!  I enjoyed the class overall.  No busy work.",
        "course": "CMPST308"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 3,
        "comment": "This guy is a total joke.  Unprofesional, ungly, unorganized and totally irrelevent.  He assigns around 7 or so books and expects the students to read them all.  If you want to be embarrased for your university and sit through this joke of a course, take Jason Payne.",
        "course": "COMP100"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "COMP367"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 1,
        "comment": "Recommended.  Class discussions were interesting and worthwhile. Assignments were super easy if you did the reading, which was also interesting and worthwhile.  I thought he graded very easily on the two main papers. He's easy to work with if you have a problem, too.",
        "course": "CS367"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wears a Big Dog hoodie and pajama pants to class on multiple occasions. Hilarious class, very easy. Loves discussion and keeps things interesting. Makes you think. I'd highly recommend him.",
        "course": "COMPS367"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 2,
        "comment": "good teacher",
        "course": "CS367"
      },
      {
        "index": 48,
        "rating": 2,
        "difficulty": 1,
        "comment": "Uncomfortable how much he flirts with students,  however, probably one of the easiest teachers.  Don't have to think too hard about any assignments, don't even really have to do the reading.  Come to class and try to say one thing to participate.  We were dismissed early every day.  He likes discussion more than assignments.  Course load is cake.",
        "course": "COMP301"
      },
      {
        "index": 49,
        "rating": 2,
        "difficulty": 2,
        "comment": "surprisingly unprofessional all around; not very challenging, not punctual with grades, he kinda flirts a little with the females; somewhat interesting, but also of no real use; ultimately disappointed",
        "course": "CSTDS308"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a very interesting class, and Jason was a very fair teacher. This class requires a substantial amount of reading. But the reading material is interesting.",
        "course": "COMPSTD308"
      },
      {
        "index": 51,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "COMPSTUDY100"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 2,
        "comment": "Liked him.",
        "course": "COMPSTDS358"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jason Was a GREAT teacher! I am soon to be a junior and he was my favorite professor ever! The class was not your typical learn how to write and be bored the whole class. I had it at 7:30 2 days a week and really never got bored. He discusses the books a lot and finds it more important to have interesting discussions than following a strict syllabu",
        "course": "ENGLISH110"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dont take this class if you dont like to read because you have to do a lot of it.  Class is spent doing group discussion.  He is knowledgable, but this was a writing class and he never mentioned a word about how to write a paper.",
        "course": "COMPSTD36701"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 2,
        "comment": "His class was very interesting and he showed interest in the material he brought to class, which always helps.",
        "course": "COMPSTUD358"
      },
      {
        "index": 56,
        "rating": 1,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "COMPSTDS358"
      },
      {
        "index": 57,
        "rating": 1,
        "difficulty": 3,
        "comment": "Possibly the dumbest professor on campus. Unorganized, gives preferential treatment to particular students, and just makes the entire class unpleasant. The class isn't too difficult though. Tons of books, but even if you do not read any of them you will make out with a B or C at worst.",
        "course": "COMPSTDS358"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jason was a GREAT teacher... extremely helpful, and very interesting.  if you dont like reading, dont take this class, but the books are easy and fun, and his classes are all talking about the books. very fun and approachable!!",
        "course": "COMPSTDS100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "International Studies",
    "firstName": "Rudolph",
    "id": "VGVhY2hlci0yNDA4ODQ1",
    "lastName": "Hightower",
    "legacyId": 2408845,
    "numRatings": 2,
    "summary_comment": "Professor Hightower is known for running his classes smoothly, particularly in remote settings, and is generally accessible to students. However, some find his instructions unclear and his final grades are often submitted late. Despite these issues, he is considered a good professor, especially during challenging times like the pandemic.",
    "summary_comment_short": "Professor Hightower demonstrated strong classroom management skills, ensuring smooth operations in a remote setting. However, his instructions were occasionally unclear, and he delayed final grades until nearly the end of the semester.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "I had Dr. Hightower in a remote class and he made the class run by smoothly, he didn't check the chat a lot though. I felt like he was pretty accessible but sometimes his instructions were unclear, however, he's still a good professor to have especially during a pandemic. Oh, but he left final grades until the day before the end of the semester.",
        "course": "PUBAFRS101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Rudy is incredible! I genuinely loved going to his class. His grading is fair, and the workload for the class is manageable. Rudy includes a lot of case studies and simulations in his class, which helps a lot if you are someone who learns through applied practice. He also genuinely shows he cares about engaging with students in the classroom.",
        "course": "PA3500"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2110",
        "Class Name": "Introduction to Public Affairs",
        "Class Number": "5937",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.13"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2110",
        "Class Name": "Introduction to Public Affairs",
        "Class Number": "5813",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.18"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "4011",
        "Class Name": "Public Affairs Capstone",
        "Class Number": "5796",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "3.85"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2110",
        "Class Name": "Introduction to Public Affairs",
        "Class Number": "34361",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "4011",
        "Class Name": "Public Affairs Capstone",
        "Class Number": "5919",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "4011",
        "Class Name": "Public Affairs Capstone",
        "Class Number": "34429",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.1"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5513",
        "Class Name": "Excel Basic Skills",
        "Class Number": "36683",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "3.63"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5513",
        "Class Name": "Excel Basic Skills",
        "Class Number": "36684",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "3"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5700",
        "Class Name": "Rebuilding Failed and Weak States",
        "Class Number": "6064",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.38"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5700",
        "Class Name": "Rebuilding Failed and Weak States",
        "Class Number": "6074",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "4.33"
      }
    ]
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.6,
    "department": "International Studies",
    "firstName": "David",
    "id": "VGVhY2hlci0xODk0ODI1",
    "lastName": "Winn",
    "legacyId": 1894825,
    "numRatings": 12,
    "summary_comment": "Professor Winn offers an easy class with minimal homework and a focus on his extensive life experiences, making the content engaging and memorable. Students appreciate his approachable nature and the practical insights he provides, though some find the lectures can be dry at times. The grading is relatively lenient, with mandatory attendance and open-note exams contributing to the ease of earning an A.",
    "summary_comment_short": "Professor Winn offers an easy class with minimal homework and a focus on engaging storytelling based on his extensive career experiences. His teaching style is highly regarded for making the content interesting and accessible, though some find the lectures can be dry at times.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Winn's class is very easy as long as you show up. I barely ever took notes and just listened to his stories and I got the easiest A ever. No homework and like two tests. He has insane stories from his career and it is super fun to hear about them all. You can tell this guy has done it all.",
        "course": "INTSTDS3701"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "IMO professor Winn is my favorite professor ever at osu. He is the sweetest man ever and just so nice. He wants you to pass and has super interesting content and stories since hes had a ton of different job experiences, one of them working for DHS. Please take this class. He will not disappoint!",
        "course": "INTSTDS3701"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Winn is extremely knowledgeable, &amp; bases his lectures on slides that are on the Carmen page. He relates the lectures to his life experiences which makes the class much more interesting! His exams are very reasonable, &amp; he believes that it's better to give you the resources &amp; have you know where to find an answer than just memorizing it.",
        "course": "INTSTDS3701"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mandatory attendance, open note/laptop quizzes (all the information needed is uploaded and accessible on Carmen). Go to class, listen to what he has to say and it is an easy A. Prof Winn is extremely knowledgable about Homeland Security. This class is worth taking, you will learn a lot about the country and its defense system.",
        "course": "INTSTDS3701"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class. Tests are open note/computer and the only other grades come from FEMA certifications, a participation grade for a group presentation, and class participation. Dr. Winn teaches his life experiences more than the actual material, but has a lot of good connections. Easy A, but don't expect to learn much.",
        "course": "INTSTDS3701"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very nice guy. Lectures can be dry and drawn out at times, but he is very knowledgeable in field of Homeland Security. No textbook, no readings. Tells lots of personal stories. Grade consists of midterm, final, attendance, FEMA certifications, and group project. Overall easy A, learned a lot.",
        "course": "INTSTDS3701"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good real world knowledge, full of information on the topic.  Brings in guest speakers to elaborate on certain careers.  Very easy class.",
        "course": "INTSTDS3701"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "I learned a lot, but his lectures are dry at times. He just talks all over the place, but seriously the easiest class I have taken. If you don't come to class your grade will drop, so show up. He takes attendance. Midterm was easy, can use notes and computer but still prepare. No book, no readings. Great guy to get to know and use as a reference.",
        "course": "INTSTDS3701"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof Winn is awesome! Easiest class I've ever taken. He takes attendance so you have to go to every class, but if you do, you'll get an easy A. Both exams you can use your computer and theres extra credit. He's a really nice man and is extremely knowledgeable about Homeland Security. Show up A. And theres no textbook! And no readings. Ever.",
        "course": "INTSTDS3701"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "He takes attendance each day, make sure you're there. His lectures are essentially stories from his long career in Homeland Security. VERY interesting man. Not a difficult class: Show up, listen, and you'll be fine. You can use notes and your computer during the exams because in the real world, \"You need to know WHERE to find the info you need\".",
        "course": "INTSTDS3701"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's an old geezer full of politics! Doesn't know how to use computer. ",
        "course": "3701"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Probably the easiest 3 credit hours you could ever earn. You can use your notes and computer mid-term and final. In addition to that he puts 10 extra bonus points on the exams. The class overall though was quite interesting. Mr. Winn loves what he does and is very knowledgeable about Homeland Security. I would definitely take this class again.",
        "course": "INTSTDS3701"
      }
    ],
    "SEI": [
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "25766",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.3"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "19550",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.23"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "23787",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.58"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "13678",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.53"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "26823",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.17"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "3701",
        "Class Name": "Introduction to Homeland Security",
        "Class Number": "19921",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.5"
      }
    ]
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.1,
    "department": "International Studies",
    "firstName": "Don",
    "id": "VGVhY2hlci0yMjQ2ODcw",
    "lastName": "Leonard",
    "legacyId": 2246870,
    "numRatings": 11,
    "summary_comment": "Professor Leonard is highly regarded for his genuine engagement with both the material and his students, making him a valuable resource for CRPLAN majors and minors. His lectures are engaging and lecture-heavy, though some find them dense and the lack of provided readings can be challenging. The class structure emphasizes participation and a group presentation, with exams that are time-pressured but graded fairly.",
    "summary_comment_short": "Professor Leonard is highly regarded for his genuine interest in the subject matter and his students, though his classes are largely lecture-based with limited interaction outside of mandatory group presentations and exams. The class structure can be challenging due to its heavy reliance on attendance and participation, and some students find the material and assessments demanding despite the professor's approachable nature.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great guy with a genuine investment in material and students.",
        "course": "CRPLAN4597"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Mandatory for CRPLAN majors/minors. 1/2 lecture 1/2 recitation. Readings are assigned, but they're never provided and they're never important. Some group work components. TAs grade in silence and obscurity. Hard to reach professors or TAs outside class. It is not taken seriously by either the professor(s) or students, fwiw.",
        "course": "CRP2110"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lecture-heavy, but lectures are engaging. The course is graded on participation/attendance, 3 exams, and a group presentation. Exams are a time crunch but graded fairly. Some readings are dense and he expects you to have them read for discussions each week. He cares about the subject matter and provides a fair view of neoliberalism/globalization.",
        "course": "CRP4597"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "So nice, interesting lecturer. Very personable and makes everyone feel respected.",
        "course": "CRP2110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Honestly, very very nice professor. His lectures felt like I learned nothing, yet learned a lot. There aren't any exams, just lots of papers. It is an easy A, and he's very understanding to issues outside of class.",
        "course": "CRP2110"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Leonard is laid back and offers genuine lecture material that is applicable. This class is basically completion grades, and you get to play Cities Skylines. He focuses on the importance of reflection and articulation.",
        "course": "CRP2110"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Leonard is a great lecturer, he has that charm. The content of CRP 2110 is interesting and the lab activities are fun and informative",
        "course": "CRPLAN2110"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Good prof, bad class. Intro class was poorly organized and had too many moving pieces. Also way way way to much emphasis put on playing a dang computer game.",
        "course": "CRP2210"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr Leonard is one of the very best teachers I've had at Ohio State. He listens and adjusts his lectures to the discussion of the students. He brought out the very best in the entire class and it was a privilege to learn from him. Compassionate and obviously learned.",
        "course": "CRP4597"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "Not recommended. There is no clear grading criteria for assignments (all of which are graded by an illusive TA). There are papers due once a week over readings that are incredibly long and in depth. You should take a few econ courses before attempting this! There are also lots of group projects.",
        "course": "CRPLAN4597"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "5 Pop quizzes for attendance. Amazing teacher with his personal research. I learned so much. He assigned multiple books. He is new to OSU in 2017. Amazing lectures. Some movie days. All relevant to creating a flowing historical story. Best class ive ever taken in terms of understanding the modern food system. Harsh test grader tho so do the reading",
        "course": "AEDECON2580"
      }
    ],
    "SEI": [
      {
        "Subject": "CRPLAN",
        "Catalog": "2110",
        "Class Name": "Creating Innovative Cities and Regions",
        "Class Number": "11299",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.64"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4950",
        "Class Name": "Professional Planning Skills Development",
        "Class Number": "10992",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.45"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "4714",
        "Term": "SU 20",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "2110",
        "Class Name": "Creating Innovative Cities and Regions",
        "Class Number": "7721",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "7723",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.77"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "4698",
        "Term": "SU 21",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "2110",
        "Class Name": "Creating Innovative Cities and Regions",
        "Class Number": "32601",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.42"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "32444",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.58"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4950",
        "Class Name": "Professional Planning Skills Development",
        "Class Number": "32592",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.52"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "2110",
        "Class Name": "Creating Innovative Cities and Regions",
        "Class Number": "26107",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.57"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "5997",
        "Class Name": "Planning in the Developing World",
        "Class Number": "35266",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.78"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "2110",
        "Class Name": "Creating Innovative Cities and Regions",
        "Class Number": "10834",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.4"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "10682",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.6"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "2110",
        "Class Name": "Creating Innovative Cities and Regions",
        "Class Number": "7788",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.1"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "7790",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.67"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "10654",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.78"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "5997",
        "Class Name": "Planning in the Developing World",
        "Class Number": "36976",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.57"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "5997",
        "Class Name": "Planning in the Developing World",
        "Class Number": "36977",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.67"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "2630",
        "Class Name": "Planning for Future Cities",
        "Class Number": "37207",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.69"
      },
      {
        "Subject": "CRPLAN",
        "Catalog": "4597",
        "Class Name": "The Global Environment in Planning",
        "Class Number": "7825",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Knowlton Sch of Architecture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.76"
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "International Studies",
    "firstName": "Magda",
    "id": "VGVhY2hlci0yNDg5ODAy",
    "lastName": "El-Sherbini",
    "legacyId": 2489802,
    "numRatings": 2,
    "summary_comment": "Professor El-Sherbini is perceived as unorganized and unclear in her teaching approach, leading to confusion among students regarding assignment requirements and deadlines. Students found the class structure chaotic, with varying syllabi and rubrics causing frustration. Overall, the feedback indicates a lack of substantive learning outcomes and a highly disorganized classroom environment.",
    "summary_comment_short": "Professor El-Sherbini is perceived as unorganized and unclear in her teaching approach, leading to confusion and frustration among students regarding assignment requirements and deadlines. Students report that they did not gain any practical knowledge from the course and found it to be poorly structured with an overemphasis on presentations without substantive instruction.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Although I could tell Magda is kind and wanted us all to learn, she was very unorganized and unclear about requirements and dates for assignments. We received different syllabi and different rubrics for the same assignments which was confusing and frustrating. I didn't learn anything I can use in the future.",
        "course": "INTSTDS4850"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "This is the worst class I have ever taken. Professor El-Sherbini was terribly unorganized. I didn't learn anything and I never knew what was going on. We did presentations every single day and she never taught anything.",
        "course": "INTSTDS4850"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 2.8,
    "department": "International Studies",
    "firstName": "Young-Bae",
    "id": "VGVhY2hlci0zNzY4MDg=",
    "lastName": "Hwang",
    "legacyId": 376808,
    "numRatings": 51,
    "summary_comment": "Professor Hwang is known for his lecture-heavy teaching style, which can make classes challenging to stay engaged in without thorough note-taking. Despite some students finding his approach dry and difficult to stay focused during, many appreciate his depth of knowledge and passion for the subject matter, noting that attendance is not strictly enforced. Overall, while his exams are manageable with attention, some students suggest there might be better options for general education requirements.",
    "summary_comment_short": "Professor Hwang is known for his lecture-heavy teaching style, which can make classes challenging to stay engaged in without active note-taking. Despite some students finding his classes difficult and lectures unengaging, many appreciate his depth of knowledge and willingness to help outside of class, though his exams are manageable with attentive study.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Extremely lecture heavy its pretty much the entire course so take good notes because powerpoints dont help. I fell asleep many times in class. Had required readings although I never did them and I passed. Exams are manageable if you pay attention well enough but if youre taking this for a GE, theres probably a better option.",
        "course": "INTSTDS2050"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "He does not allow students to use tech at all, yet he uses his use of technology as a power move. He thinks it's a good analogy for his course materials. He only wants you to agree with how he teaches materials. Every class you miss is 3% off your grade. Most difficult professor I have dealt with when it comes to students with mental illness.",
        "course": "INTST2050"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hwang was a great professor. A little lecture heavy but the material is very interesting. The final paper topic is your choice and he is always open to meet outside of class if you have questions or want to discuss your paper proposal. If he taught other classes I would definitely take them.",
        "course": "INTSTDS5050"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Go to his review sessions and ask questions about the study guide and generally you will do well if you review the powerpoints afterwards. He likes to write things on the board, so I highly recommend sitting where you can see the words. Many people just bs his class and don't pay attention to lecture.",
        "course": "INTSTDS2050"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Hwang is pretty freaking amazing. He's got a great sense of humor and is passionate about his teachings. And he'll give you short readings to get to on your own time. He's a fair grader. I swear to God, if you come to class, take a few notes, and read the required readings, you'll leave this class with a %100. Too easy.",
        "course": "INSTDA2050"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Hwang is a highly informative and you will learn a lot from him. However, his lectures are rather long and dry, which makes it hard to stay focused the whole class. Attendance is not necessary at all. He is very helpful and always willing to talk to students after class. Graded on 2 exams and 1 big paper project",
        "course": "IS5050"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Hwang was an interesting lecturer with a deep background in his course material. He was exceedingly knowledgeable in the topics he taught, and he provided a large array of supplementary readings for further coherency. His lectures always surprised and interested me, and the exams were not as difficult as I expected. Made me love history!",
        "course": "INTSTDS2050"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Really great professor. Loved his approach - he presented theories in order to get us thinking and develop our own views. Taught history as it should be - presented clear-cut facts BEFORE going on to interpretation, so it was nice to see no revisionist history sap. Grading was a bit stringent, but the knowledge gained was definitely worth it.",
        "course": "INTST2050"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "Professor Hwang is definitely a nice guy, although his lectures are pretty confusing. Take good notes and this class shouldn't be too hard to pass.  There are no long papers (or papers at all), but he does give out pop quizzes, which he sometimes warns you about the class before. My main tip would be to know the Chinese characters!!",
        "course": "INTSD2050"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Hwang is a delightful lecturer. He's a tad overly fond of metaphors for structuring his points and he is rather too lenient of a graderdoesn't write challenging enough exams. But while this was only an intro course, the scopestructure of it was excellent and his knowledge and approach to the relevant topics was wonderful! Great class!",
        "course": "INSTDA2050"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "I took this class just for an extra Gen Ed.  I regret it because now i have a W from withdrawing from this class.  Very long readings.  The lectures are incredibly boring and they just don't make sense.  He uses examples but when it came to the midterm it was nothing like what he had talked about.",
        "course": "INTSTDS2050"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "I read a few comments (about how this prof gets off topic) here before enrolling, thinkin that I'd get over it bc I'm a korean student too like him. Turns out that I have NO IDEA what hehis ppts trying to say- he hardly talks about the course materials. Recommended readings suddenly become required right before the exam. Never. Take. Him. Ever.",
        "course": "INTSTDS2050"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "There are 3 pop quizzes, 2 extra credit assignments so your grade depends on the midterms. They were pretty tough if you didn't attend his lectures or study with the study guide. The lectures are boring and sit towards the front because he writes on the board. As long as you attend the lectures and read the supplemental readings, you should be fine",
        "course": "2050"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 1,
        "comment": "Pretty easy class. He gets off topic really easily, but makes great comparisons to different topics. Test were pretty easy, you just have to do the required readings and fill in the blanks. Pretty interesting teacher",
        "course": "INTSTDS2050"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Amazing class and an amazing teacher. A lot of comments on this site say that he was terrible, but they are all for his intro class. I took all 3 of his classes, and felt that he was a very informative and as long as you're not an idiot he is easy to follow and you can learn a lot. He is entertaining and a pleasure to have as a teacher.",
        "course": "INTSTDS5051"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Although I did receive a lower grade than expected, he was a good professor. A little difficult to understand, but he knows what he's talking about and he makes topics relevant and interesting. Don't miss class and take notes and you'll be fine.",
        "course": "INTST2050"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "His lecture is sometime unclear because he is not a native speaker. but if you attend all classes, you can get a good grade easily. You don't need to read so much requirement readings.",
        "course": "INS201"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 2,
        "comment": "Very unclear.  Jut rambles most of the time then you get tests with nothing he talked about on them.  Worst essay grading scheme ever.",
        "course": "INTSD201"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "Terrible teacher. Teaches his opinions and talks about nothing of relevance in class and his arguments have HUGE holes in them. Bashes on Gordon Gee any chance he gets. Grades &quot;competitively&quot; so you are based off of everyone in the class instead of your own work. Don't take this class. You will regret it.",
        "course": "INSTD201"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 3,
        "comment": "So boring. Off topic. All-mixed-up Unclear lectures. A 5-6 page book review paper about 2 books(outside sources)",
        "course": "INTST201"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "Hard to understand. Off topic. Biased. Good man, wished things were more clear though.",
        "course": "ISO21"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 2,
        "comment": "He's a nice guy and is intelligent, but his class is moreso a forum for his opinions than anything.  While I don't mind the fact he espouses views different than some of mine, I don't like the fact that he presents his views as fact and shoves them down people's throats. Not to mention, many of the views he presents have huge factual holes in them.",
        "course": "IS201"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 4,
        "comment": "Avoid teacher if possible. Doesnt speak english very clearly. TEst and quizzes-you will have to basically memorize the reading because there will be an excerpt and you have to fill in the blank word. If you ask him for help-well there is no point. Notes are useless",
        "course": "IS201"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easiest teacher ever. All you have to do is go to class and take lecture notes. he doesn't have any tricky questions on both exams. great professor!",
        "course": "INTST201"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 4,
        "comment": "Hwang is an excellent teacher. His lectures may drone on about one subject/get off topic for a long time.  He clearly is teaching a lot of his opinion, which is fine. Don't get mad, and recognize that everyone is biased. Tests are a little confusing. I enjoyed the class a lot.",
        "course": "IS201"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor ever.  Waaaay better than most teachers at the school",
        "course": "IS201"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 2,
        "comment": "makes no sense... my notes were a source of entertainment to my friends. would talk about moses... i went about 4 times and got a b+. waste of a class.",
        "course": "ITSTD201"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 1,
        "comment": "Four words: do not take him. He is so spacey and does not follow any kind of coherent notes. The quizes have weird quotation questions that are difficult. Take someone who like to engage students, rather than just rant to them.",
        "course": "IS201"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 1,
        "comment": "Attendance is &quot;mandatory&quot;, with loopholes.  If you can follow in class, you should do fine on exams, because they're structured so you really only have to know about one topic out of any he discussed.  All over the place with notes, and got off topic.  Kind of interesting, though.  Not what I expected.",
        "course": "INTST201"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 1,
        "comment": "Hwang is a nice guy, but his teaching skills are very below average. This is the type of person who would be great sitting in a reasearch lab and writing books on international studies but should not be lecturing and teaching students.",
        "course": "IS201"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Hwang knows his materials very well. He is an extremely intelligent man in regards toward international and domestic affairs. I truly enjoyed his classes. Students who are dissatisfied with his teachings tend to be ignorant or ethnocentric. I plan to take a class with him in the near future.",
        "course": "INDSTS"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 1,
        "comment": "Hwang is a nice man. However, he barely lets anyone speak in his class and tends to drone on about things. His notes are not organized and it can be very frustrating to deal with. He is an easy grader, but its not worth it. Find someone else to take.",
        "course": "INTL201"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 2,
        "comment": "He was a good prof but he can be very hard to understand. Lectures are only 90 minutes but it seems like 3 hours. He is really boring.",
        "course": "INTST201"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Hwang is a very interesting and clearly intelligent person.  However he veers off topic constantly, uses rediculous metaphors to explain complex ideals and spends much of the class discussing irrelevant topics.  Do the readings and go to class, but prepare to be frustrated.",
        "course": "INTSD201"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 1,
        "comment": "He is very long winded, does not let students voice their views and is very unclear. Avoid if you plan on learning something.",
        "course": "IS201"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 1,
        "comment": "This is a really easy class,however, Hwang is at times very frustrating. His notes are terrible and there are so many arrows its hard to follow. 90 percent of what he says is &quot;america is going down the drain&quot;. He also is extremely opinionated and doesn't let anyone participate. Extremely long winded, but easy A..if youre willing to put up with him",
        "course": "INTL201"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor with VERY interesting views! He made lecture very great and encouraged participation. Questions came with great answers. Review sessions were very helpful. Even with the accent, he was easy to understand. I hope to take another class with him.",
        "course": "POLIS597"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 2,
        "comment": "Well, I am a student from Korea, so there was absolutely no probelm for me understanding his accent. Beginning of the quarter, I had difficulties organizing my notes,,but after taking the first exam, I understood what he wanted. Hes a very nice guy and I really liked him as a person too. So Overall REALLY recommend him!!!!!",
        "course": "POLSC597"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very intelligent, knew the material extremely well.  Sometimes goes off subject a bit on rants.  But, if you come to class and take notes, you will do very well in his class.  Exams are very straightforward.",
        "course": "PS597"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 1,
        "comment": "A little disorganized and hard to follow sometimes, but hes a good guy.  He also gives easy exams and even gave make-ups for his pop quizzes.  His accent is not bad at all.",
        "course": "PS553"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 3,
        "comment": "Extremely intelligent, so it kind of gets in the way if you take an intro class like 201. If you actually know a bit about economics and political science before you take the class it's more interesting. he's funny and not a hard grader. However, chalkboard writing and notes are really confusing...lots of arrows...all over the place..",
        "course": "IS201"
      },
      {
        "index": 42,
        "rating": 3,
        "difficulty": 4,
        "comment": "Poli Sci major here, class was informative, his accent is not really that bad. To me, his exams were a pain. They were a different format every time, very little room for error. It's true that he never stops talking, will go on even after the end of class while people are leaving.",
        "course": "PS245"
      },
      {
        "index": 43,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took this guys class a while ago but absolutely loved it! Wish he taught more upper level Poli Sci courses. The accent took a little while to get used to but wasn't too bad. Studying for first test was hard but once you figure out what he wants its not bad at all. Sorry to see so many others haven't liked him - he was one of my favorites!",
        "course": "POLISCI553"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 3,
        "comment": "I understood him but what he talked about and what was in the book were totally different! But I had fun!",
        "course": "POLISCI245"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very difficult to understand. I am a poly sci major, so I typically enjoy anything political, but I dreaded coming to this class.  Handouts mean nothing without time spent in class.  Taking notes is a necessity (if you can understand him).  Tests are composed of several essays, normally verbatim from lectures.",
        "course": "PS245"
      },
      {
        "index": 46,
        "rating": 3,
        "difficulty": 3,
        "comment": "Interesting, knowledgeable. I could understand him most of the time, I learned a lot about the history of global relations. He's looking for an interest in the material, your attention and an attempt to explain what you've learned in the exams and papers.",
        "course": "POLSCI245"
      },
      {
        "index": 47,
        "rating": 2,
        "difficulty": 3,
        "comment": "thick accent, never stops talking.  notes are hard to follow.  his handouts mean nothing to the untrained eye. tests relatively easy.  i fell asleep involuntarily.",
        "course": "POLISCI245"
      },
      {
        "index": 48,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "INTSTD201"
      },
      {
        "index": 49,
        "rating": 2,
        "difficulty": 4,
        "comment": "This guy is obviously very smart and well-informed.  Unfortunatley its hard to know what hes talking about most of the time because he has a heavy accent, a soft voice, and his handouts are extremely nonsensical.  I worked my ass off and came out with a B",
        "course": "INTLSTDS"
      },
      {
        "index": 50,
        "rating": 3,
        "difficulty": 3,
        "comment": "He's a little hard to understand sometimes, but he can be very, very funny. The subject matter is a little dry also, but from time to time it can be fairly interesting. He's a good guy, but don't expect to participate much. He talks alot.",
        "course": "INST201"
      },
      {
        "index": 51,
        "rating": 2,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "INTSTD201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.1,
    "department": "International Studies",
    "firstName": "John",
    "id": "VGVhY2hlci0xODk0MTYz",
    "lastName": "Carlarne",
    "legacyId": 1894163,
    "numRatings": 9,
    "summary_comment": "Professor Carlarne is highly regarded for his brilliance and passion for teaching, though his classes can be challenging due to extensive reading and weekly quizzes. His lectures are engaging, often supplemented with simulations and activities, and he is known for his thick British accent and sense of humor. Students appreciate his willingness to clarify assignments and provide additional support via email.",
    "summary_comment_short": "Professor Carlarne is highly regarded for his brilliance and passion for teaching, though his classes can be challenging due to extensive reading and weekly quizzes. Students appreciate his engaging and often humorous teaching style, despite some organizational issues and the need for expensive equipment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took both INTSTDS2800 and INTSTDS4802 taught by Dr. Carlarne. He is brilliant! 2800 requires an expensive handheld device to take the quizzes, if Carlarne knew about online options perhaps this could be replaced. 4802 is reading and writing heavy but will really prepare you for other upper level course work.",
        "course": "INTSTDS4802"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "AGGRESSIVE BRITISH. Like so British, his accent, fashion, and mannerisms are so enjoyable. More seriously, he's very passionate about his course and has a very good understanding of what he's teaching so his explanations are good. In class, he requires you to buy a $60 handset to take his reading quizzes once a week, 3 of which he drops.",
        "course": "INSTDS2800"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Funny guy and tries to get through lectures to get to activities. A big group project at the end of the semester, but you're assigned a group first week. I did a little over half of the readings (quizzes on most readings, not bad) and extra credit and was fine. He just wants you to get it. Sit towards the front, he mutters jokes under his breath.",
        "course": "INSTDS2800"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "He's a great guy. The class itself is pretty disorganized, but is not difficult. Quizzes in class over every reading that are relatively easy, and both the midterm and final are all multiple choice. Assigns group projects but really tries to make the class interesting. Good class overall.",
        "course": "INSTDS2800"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Awesome guy. Thick British accent. Insanely brilliant. He does a lot of simulations in the class and quizzes are weekly.",
        "course": "INSTDS2800"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Carlarne was one of the funniest professors I ever had.  Every class was a joy. He's a Brit who has tons of experience in the field of Peace Studies, and knows a lot of activists.  His lectures are straight forward and tests are memorization-based. There are group projects, but all of them are very simple.  Very helpful. Would take again.",
        "course": "2800"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class was extremely interesting and Professor Carlarne aided with providing immense experience. Sometimes his assignment directions were a bit unclear and his explanations during class were of no help, but with a simple e-mail he would clarify. He keeps the class interesting and tries to confine lectures so we can do other activities. ",
        "course": "2800"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor I have ever had here at OSU.",
        "course": "2800"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Carlarne is one of the best professors anyone could ask for.  The class is a bit organized and altogether too easy to keep a student's interest throughout the entire semester, but the content and knowledge of Dr. Carlarne is fascinating.",
        "course": "INSTDS2800"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.5,
    "department": "International Studies",
    "firstName": "Rudy",
    "id": "VGVhY2hlci0yMzYwOTA4",
    "lastName": "Hightower",
    "legacyId": 2360908,
    "numRatings": 6,
    "summary_comment": "Professor Hightower is highly regarded for his engaging and humorous teaching style, making complex topics accessible and enjoyable. Students appreciate his availability and clear expectations for assignments, which helps them achieve high grades. His classes are described as interesting and rewarding, though some note that attending lectures is crucial for full understanding, as the textbook can be dry.",
    "summary_comment_short": "Professor Hightower is highly regarded for his engaging teaching style and ability to make complex topics interesting. Students consistently praise his clear expectations and supportive approach, though they note that active participation is key to success in his class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Rudy is a great teacher and super funny. The class had a fair amount of projects, but even though they were time consuming, they were interesting. Modeling data is fun! He is willing to meet with you if you need too! Ask him about his background because it is wild! You should attend class because the textbook, while helpful, is boring.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great prof. I took the class online but had it been in person i would have learned more. He is a great professor though!",
        "course": "PUBAAFRS2110"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Hightower is awesome! He makes class interesting and is very specific as to what he expects on assignments. Listen to him, and you'll have no problem securing an A in his class.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Hightower was a great professor. The class isn't hard so long as you put in some effort. Make sure you read and come to class prepared as he loves to call randomly on students. Overall-would recommend!",
        "course": "PA3500"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great guy and an incredibly interesting course!",
        "course": "PA3500"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hightower is a great teacher and makes class interesting.",
        "course": "INTSTDS5700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 2.2,
    "department": "International Studies",
    "firstName": "Randall",
    "id": "VGVhY2hlci0xNjk2NzE0",
    "lastName": "Romero-Aguilar",
    "legacyId": 1696714,
    "numRatings": 3,
    "summary_comment": "Professor Romero-Aguilar is widely regarded as a challenging and demanding instructor, with many students finding his lectures and assessments difficult to navigate. Several commenters noted his strict grading policies and lack of availability outside of class, while others described him as dismissive and unhelpful when students sought additional support. Overall, his teaching style appears to be highly polarizing, with some finding his approach too rigid and unaccommodating.",
    "summary_comment_short": "Professor Romero-Aguilar is widely regarded as a challenging and unhelpful instructor, with students citing his difficult grading, lack of availability after class, and insensitivity to students' needs as significant issues. In contrast, his teaching methods are seen as overly simplistic, making it hard for students to achieve good grades despite the supportive and friendly nature of the professor himself.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "This guy was terrible.  He speaks to soft to hear and has a thick accent.  He does not help out after class, EVER!  He does not care about his students grades.  And he is very childish about little things that bug him.  He is an extremely hard grader and impossible to work with.  Absolutely the worst professor I've ever had and I am graduating now",
        "course": "AEDE538"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "I though Randall was great. He valued learning, not grades, and made time to help me with the material. I definitely worked my tail off studying for his exams, but he is still a thorough teacher, and a really nice guy. Definitely one of my favorite teachers.",
        "course": "AED597"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was impossibly hard. His lectures are simple, but his tests and homework are so complicated it's almost impossible to get a good grade. He's a nice guy, but not sympathetic to any problems. He doesn't hold office hours and when I said I needed help, he said I should just read the slide again.",
        "course": "IS597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 3.4,
    "department": "International Studies",
    "firstName": "Kamoludin",
    "id": "VGVhY2hlci04MDk1ODc=",
    "lastName": "Abudllaev",
    "legacyId": 809587,
    "numRatings": 8,
    "summary_comment": "Professor Abudllaev is knowledgeable about his subject matter and provides insightful answers to questions. However, his lectures are often described as boring and difficult to follow due to excessive use of PowerPoint slides and a lack of clear organization. Despite the ease of the class, students find the teaching style to be ineffective for engaging with the material.",
    "summary_comment_short": "Professor Abudllaev is knowledgeable about the subject matter and provides insightful answers to questions, but his teaching style is largely criticized for being boring and disorganized, with many students finding the lectures difficult to follow and unengaging. Despite this, the class is generally considered easy, with some students noting the midterms are straightforward.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "SO boring but the class is easy. so many power points that i started bringing other work to class. The midterms are pretty easy though.",
        "course": "IS4525"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Incredibly disorganized. Slides have so much information on them that its impossible to read all of it before it is changed.  mumbles through lectures with no discernable lesson plan. Knowledgable but not skilled as a teacher",
        "course": "INT501"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Easy class, but be ready to sit through power points all class every class",
        "course": "IS501"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "I had the 501 section on Central Asia (most of the 'stan countries). The class was incredibly boring, and I never paid attention. The readings are terribly disorganized. They're not put in any particular order and have several page numbers written on them. I gave up after he handed us a 60 page packet of readings held together with a paper clip.",
        "course": "INTST501"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Knows A LOT about the subject matter and has a lot of insight. Anytime you ask a question he always has the answer. The lectures...welll....painfull..I would rather pound my head against the wall.",
        "course": "IS501"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "Boring lectures but good insights and easy class...very interesting guy",
        "course": "CHECHNYA"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "IS551"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "This course was about Central Asia, interesting class. He is from that area himself so he has a great knowledge about the material, very nice guy! lectures are boring but Easy class.",
        "course": "INTLSTDS501"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.2,
    "department": "International Studies",
    "firstName": "Kelechi",
    "id": "VGVhY2hlci0xNDQ4ODQ2",
    "lastName": "Kalu",
    "legacyId": 1448846,
    "numRatings": 3,
    "summary_comment": "Professor Kalu is highly regarded for his passion and ability to challenge students to think critically, making his courses both demanding and rewarding. Students find his material challenging but deeply valuable, citing significant learning gains despite the difficulty. However, some find his classes demanding in terms of reading and writing, with exams requiring substantial effort and preparation.",
    "summary_comment_short": "Professor Kalu is highly regarded for his passion and ability to challenge students to think critically, making his classes both engaging and demanding. His courses require significant reading and effort, but students find them deeply rewarding, citing substantial learning gains despite the difficulty.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "One of the BEST profs I've had at OSU. He is passionate about the topic which makes class more interesting. He also challenges you to critically think- something not always required in courses. The readings are required, but manageable with basic time management. Dr. Kalu is very helpful and worth taking!",
        "course": "IS515"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is one of the smartest people I have ever met in my life, his classes are difficult...but it's worth it. I have learned more from him than most other professors combined. Read, go to lecture and pay attention and you should do well.",
        "course": "AAAS515"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Class is hard.  Professor makes you read A LOT of boring crap then just wants you to tell him what you learned from the readings but doesn't explain anything clearly.  Does not give notes.  Writes various words on the board but thats it.  Exams are all essay based, wrote 8 pages for the midterm!! and there is a 10page paper due as well.boring & har",
        "course": "INSTD250"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "International Studies",
    "firstName": "Alexandre",
    "id": "VGVhY2hlci0xMzY0MzU=",
    "lastName": "Pantsov",
    "legacyId": 136435,
    "numRatings": 10,
    "summary_comment": "Professor Pantsov is highly regarded for his exceptional knowledge and passion for his subject, making his lectures engaging and memorable. Students consistently praise his enthusiasm and ability to captivate the audience, noting that his classes are never dull and are deeply informative. His teaching approach emphasizes active participation and thorough preparation, though students advise coming to lectures and studying diligently to succeed.",
    "summary_comment_short": "Professor Pantsov is highly regarded for his exceptional knowledge and passion for his subject, making his lectures engaging and memorable. Students consistently praise his enthusiasm and ability to captivate the class, though some note that preparation and attentiveness are crucial for success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "You get it, yeah? -This dude rocked!",
        "course": "I2050"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "To say that Dr. Pantsov knows his material would be a gross understatement. I have never before meet anyone with such an interest in a topic combined with a true fire in sharing it with others. The man is truly brilliant, and he's also a great guy. You will WANT to go to his lectures. A great teacher, not just a professor. Study the study guide.",
        "course": "INT530"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good at holding attention, very passionate when he speaks. Great accent, and a funny guy!",
        "course": "IS235"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "If you have a chance, you really must take this class. Pantsov is interesting, passionate, and extremely intelligent. There is never ever a boring moment, and most importantly, you learn so much over the course of 9 weeks.  Tests are hard and you need to know your stuff, but if you pay attention and take notes, you'll find it's well worth it!",
        "course": "INTSD531"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "great",
        "course": "INTSD235"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "I went to one class because I couldn't understand his Russian version of English. If you go to class, I heard he is the type who loves to call on people randomly, so know your material. You can easily get an A in this class if you have a good memory and the ability to BS an essay.",
        "course": "INTSTDS235"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Enthusiastic prof who's very excited by what he teaches.  His voice isn't monotone-a definite plus for a night class. He gives a study sheet with 10 essay questions and identifications. Too bad you don't know which question you would get on the test. Take good notes and don't fall asleep, that helps in memorizing 4000 years of Chinese history.",
        "course": "IS235"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very animated.  Definitely go to lecture and do readings.",
        "course": "INTSTD235"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is never boring.  I recommend you not miss any classes- the tests are hard, but fair.  Dr Pantsov is very, very interesting and willing to help where he can.  Go to office hours if you need to.",
        "course": "INTST235"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof's animation keeps the tempo up; don't miss class.",
        "course": "IS235"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2,
    "department": "International Studies",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xNTQ4Njg1",
    "lastName": "Yosha",
    "legacyId": 1548685,
    "numRatings": 2,
    "summary_comment": "Professor Yosha has an unconventional teaching style that can be off-putting, frequently veering into tangents unrelated to the course material. Despite this, students acknowledge his kindness and find value in the easy A grade they receive. Overall, his effectiveness as a teacher is questioned due to the limited depth of learning provided in his classes.",
    "summary_comment_short": "Professor Yosha has an odd teaching style that often veers off-topic, which some students find frustrating despite his efforts to be helpful. Overall, however, his approach results in easy grades, though many feel they could have learned less effectively through self-study.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Sort of agree with the previous poster but wouldn't be quite as harsh. I still learned from him but his teaching style is definitely pretty odd. When he lectures he frequently goes off on weird tangents that aren't at all related to the course material. Not what I thought I signed up for but he's a nice guy and I got an easy A so no hard feelings",
        "course": "INTSTDS2050"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "He was not a good teacher. He means well and is a sweet guy, but I could have learned more by reading the article on Wikipedia about Globalization than in his class.",
        "course": "IS356"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.3,
    "department": "International Studies",
    "firstName": "Matthew",
    "id": "VGVhY2hlci05NjU1NzI=",
    "lastName": "Donald",
    "legacyId": 965572,
    "numRatings": 12,
    "summary_comment": "Professor Donald is highly regarded for making his class engaging and relevant, particularly through discussions of current issues. His open-book tests and quizzes make the material accessible, though some find the content and lectures somewhat disconnected from the assessments. Overall, his courses are considered easy but rewarding in terms of learning.",
    "summary_comment_short": "Professor Donald is known for his engaging and relevant teaching style, often discussing current issues and using open-book tests and quizzes, making the class accessible for Information Systems majors. His lectures are generally considered easy, with minimal required preparation outside of reading the books, though some find the material lacks depth and relevance.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very interesting class. Talks a lot about current issues. Open book tests and quizes. Great for IS majors.",
        "course": "IS300"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Good Class, Very interesting teacher. One of the best classes ive been to was when the FT. Hood shootings happened. He is very passionate about the issues. the tests are at home/open book so they arent very hard, but most of the lectures have nothing to do with the book or the tests. Its pretty much common sense. For S&I students its a must take.",
        "course": "INTST300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is the bomb. He is so cool and he really keeps class interesting. His class is really easy, but you do learn a lot. I'm going to miss him next quarter!",
        "course": "IS300"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "This guy rocks! Took him in the summer. Attendance not mandatory but classes are interesting. Being a sociology major, its nice to finally take a class that is actually interesting and relevant.",
        "course": "INT350"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "i didnt like the class. it was easy, but you need the books in order to pass the take home exam. the book are like $100+. so it wasnt worth it. only graded 5 times. honestly if you want to learn take anita bucknam. its an easy course that makes your brain lazy. he spend most of his time relating to ex army guys. i felt like i wasted my time.",
        "course": "IS300"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really good guy, lots of interesting storied.  Very easy, I wish he had actually taught more...he relies more on students to keep the class going. Extremely cool!",
        "course": "IS350"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class but you still have work to do and you learn a lot. If you take it and you give presentations do not look at your slides. Besides that it is really easy.",
        "course": "IS350"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class is extremely easy. Two tests all quarter and both were take home. One paper that has to be like 3 pages and a small presentation. Piece of cake.",
        "course": "INTST300"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy, laid back class. Attendance not mandatory. Graded on take-home exams, 3 pg paper and a presentation. The book is online on google.books so no need to buy it. If you need an easy A, this is it.",
        "course": "IS300"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class ever, death by power point but Mr. Donald is an awesome teacher",
        "course": "INTST300"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Such a great teacher. Not hard at all, but you still learn a ton. His experience in the military really helps with understanding the class, as he makes many references to it while trying to explain a point. I would take his class again in a heartbeat!",
        "course": "IS350"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I think this teacher mainly teaches military science classes for ROTC, he seemed to already know most of the ROTC students in the class. He is pretty laid back and accomodating if you have scheduling conflicts. The class has as lot of reading, but if you go to class he will reitterate everything that you need to know from the reading. As far as hom",
        "course": "INTST350"
      }
    ],
    "SEI": []
  }
]