[
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.1,
    "department": "Italian",
    "firstName": "Giuliano",
    "id": "VGVhY2hlci0yNDgyOTQw",
    "lastName": "Migliori",
    "legacyId": 2482940,
    "numRatings": 38,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "terrible class, very time-consuming workload, if you are looking for an easy GE DO NOT TAKE. ",
        "course": "ITALIAN2055"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Migliori is very passionate and interested in environmental humanities and if you mirror that enthusiasm you'll do very well in the class and get a lot out of it. If you go in not interested hoping to sit in the back and just push through a GE class I wouldn't suggest it. But, if you interact and participate the class should be easy.",
        "course": "ITALIAN3001"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very good for an introductory Italian class. He was very excited and obviously knew how to do his job quite well. It's a lot of homework and participation but its all pretty structured and he understands what we have to di in order to learn. Don't expect the class to be easy, but if you keep up with what he wants you to do you'll be better for it.",
        "course": "ITALIAN1101"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "I love the positive energy & effort that Prof. Migliori brings to each session. He helps with pronunciation and participation and engagement is heavily emphasized. But, the textbook implemented in class is horrible, there are so much untranslated text. Be prepared for a heavy workload with many weekly projects, if you can keep up, you should pass.",
        "course": "ITALIAN1101"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Migliori was interesting as he is actually from Italy, however, the course required an excessive amount of work which took away from the enjoyment of the class. In addition to watching the films outside of class, there is also a lot of reading followed by a large assignment load. Do not take this if you are looking for an easy GE class.",
        "course": "ITAL2055"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really enjoyed the class! The workload's not bad, the assignments aren't difficult + he randomly hands out bonus points. You do have to have your camera on and stay engaged + they're super slow at posting grades. If you want a minimal work GE credit I wouldn't recommend, but if you have any interest in media studies and mafia films it's worth it!",
        "course": "ITAL2055"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "It is currently April 3rd, an assignment from January 24th has not yet been graded as well as a large amount of other old assignments. That tells you everything you need to know. ",
        "course": "ITAL2055"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Don't take this class as a way to earn easy credits for a GE. Weekly readings and videos that are horrendously boring, mandatory attendance and participation in extremely boring lectures, and assignments that are due right before class instead of later in the day. Somehow this is my most stressful class even with core classes for my major. ",
        "course": "ITAL2055"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "The lectures were simple and the readings weren't too bad... you just have to be prepared to write. This class was more time consuming than I thought, mostly because there were weekly movies that were over two hours, but he is very passionate about what he teaches and it will give a new insight to Italian culture.",
        "course": "ITALIAN2055"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "I was excited for mafia movies, but this course makes the content pretty boring. Lectures don't really have much content to them, just complete the weekly tasks and I could understand everything. Movies, quizzes, and reflection posts happen almost weekly, but I got used to them. Not a very hard class, but it could've been more engaging. ",
        "course": "ITALIAN2055"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 2,
        "comment": "Mafia Movies was a boring class. Movies were long (some 3+ hrs) and mostly in Italian. Each movie came with a ton of reading assigned (~30 pgs). Material was not engaging. Lectures were dry. Grades took FOREVER to come in, 2 month old assignments are just now getting graded. However, graders hand out tons of extra credit if you write well. Easy A.",
        "course": "ITALIAN2055"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "So much unnecessary work. There is like 5 hours of just hw and studying required every week for this class. Its stupid how much he wants you to look into everything. He's nice but don't take this class its not interesting.",
        "course": "ITAL2055"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "This professor knows his stuff and makes it clear that you will have to earn your grade. There are a lot of papers, but it should be expected with a film studies class. Attend the zooms, watch the films, and do the work and an extra credit or two and you'll get an A.",
        "course": "ITALIAN2055"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "the class is overall dumb. lots of work. expect to have to think and analyze. assessments aren't that bad, as for quizzes you'll get 2 attempts so you can first see the questions and copy paste them onto a doc and then spend time finding the answers in the readings for your first attempt. its easy to get a good grade, however don't take class",
        "course": "ITAL2055"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 5,
        "comment": "Its not an extremely diffcult class but it does come with an extremely heavy course load. Be prepared to write...A lot.",
        "course": "ITAL2055"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mafia movies was a little more work than I expected, some of the films suck and you have to do readings to do well on the quizzes. The exams are also a lot of work. Giuliano isnt the best lecturer but you don't have to pay attention during the zooms. Easy GE course to get an A though.",
        "course": "ITALIAN2055"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "The workload for this GE is intense. Hope you get an easy TA, there is so much busy work and writing, and the midterms are these massive multi prompted essays. If you try hard you can get an A, but it is a very time consuming class. Analyzing the heck out of an old 2 hour Italian movie every week is such a pain. He is a nice, smart guy though. ",
        "course": "ITAL2055"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 2,
        "comment": "Class was not difficult by any stretch of the word, however the workload was very, very time consuming. Dr. Migliori is a wonderful and passionate professor, however the same cannot be said about some of his TAs. The grading is very unclear, and be prepared to lose points for not explaining enough when they give a very small word count. ",
        "course": "ITAL2055"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class sucks",
        "course": "ITAL2055"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Despite not knowing anything about film, I found this easy. Two attempts on every quiz, so you can look at the questions, answer them, and then go back and copy and paste your answers. Didn't enjoy all films/series, but for a 4 week class, worth it. Dr. Migliori is very caring and expects students to participate.",
        "course": "ITALIAN2055"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor is great.",
        "course": "ITALIAN2053"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class does require quite a bit of time with watching the movies and writing discussion posts. If you don't mind being forced to watch movies you'll like it. Some are really good and some are really boring.\nTake home exams just require buckling down for a few hours and pounding it out.\nTextbooks are required but I got a B just guessing things.",
        "course": "ITAL2055"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst GE I have ever taken. You have to watch a 1-2 hour movie twice a week and take a ridiculously hard quiz on them. Two midterms that are HELL each one took me over 4 hours to complete. DO NOT TAKE THIS CLASS IF YOU WANT A SEMI-ENJOYABLE SEMESTER! It is simply not worth it I would not recommend this class to my worst enemy. ",
        "course": "ITALIAN2053"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 3,
        "comment": "VERY time consuming. 2-3 hours of a movie/show to watch per week and a discussion post and quiz. Many movies are completely in Italian making it more difficult. 2 midterms and a final which you have a week to complete. A LOT of extra credit opportunities. In my opinion its easy to do well, but would not recommend. Easier GE options available  ",
        "course": "ITALIAN2055"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "A lot of people complain about this class, but I really enjoyed it. People took this class as a joke, but it covers two GE requirements, so it is obviously gonna be a bit tougher. If you actually love film and what goes into it, this is a great class for you. Professor Migliori and his TA's love the subject and love talking about it.",
        "course": "ITALIAN2055"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class absolutely sucks. I took it for a fun, easy and interesting class for a GE and most definitely regret it. By far one of the hardest classes ive ever taken. Get ready to watch 3+ hour movies in a foreign language as well as endless hours of readings only to take a quizzes that are beyond vague and almost impossible to do well on.",
        "course": "ITALIAN2055"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 5,
        "comment": "THIS IS NOT AN EASY CLASS- DO NOT TAKE JUST FOR THE CREDIT You will be assigned hours of reading and expected to watch the 3+ hour movies twice. You are expected to speak on film techniques used in the films- not the films themselves. Taking this class gened was the worst mistake. 5+ hour readings, boring movies, weekly quizzes, discussion posts,",
        "course": "ITAL2055"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "He speaks Italian",
        "course": "ITALIAN2055"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 4,
        "comment": "I absolutely HATED this class. I am a biology major and there was so much more work than my science classes. Its easy to get an A but you have to do a discussion post, watch a 3hr movie, and take a quiz all in the same week. The lectures are completely pointless I slept through all of them. Just dont take this class.",
        "course": "ITALIANA2055"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 3,
        "comment": "We have to watch 3.5 hour movies (or multiple episodes of TV shows) every week with most of them being in Italian with bad English subtitles that just don't line up. Surprise: its not JUST watching the Godfather and Goodfellas, there's old boring films that make you want to sleep and the class is a waste of time.",
        "course": "ITALIAN2055"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 3,
        "comment": "I originally took this class as an easy Gen Ed. The content is not difficult by any means, but it is much more time-consuming than I expected. You are required to watch long (up to 3 hours) movies or multiple episodes of a TV series every week just to take a short quiz and discussion board. Attendance is graded. The midterms are take home.",
        "course": "ITALIAN2055"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hes a really nice professor, but the class is really time consuming. I wont sit here and say that the class is hard, because its not, but there is a lot of work that you have to do. Youre gonna watch a movie, do a discussion post, do readings, and take a quiz every week.",
        "course": "ITALIAN2055"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Migliori is a great professor and this class is very entertaining. He also give extra credit at the end of every week which is super easy. I definitely would take his class again.",
        "course": "ITALIAN2053"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "Decent amount of work outside of class: long readings, watching the movies, discussion posts, and quizzes over each film that you must do to be prepared for the lecture. Listen and take notes during the lecture since the midterm and final were over discussions in class. He doesn't post the recordings or PPs after! Lots of extra credit! Very fun guy",
        "course": "ITALIAN2053"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "Giuliano is so sweet! By far the best professor Ive had at OSU. He is extremely helpful and engaging during class but he does expect you to be prepared and know the material before every lesson. He is kind and understands that students do have other classes which I think many professors ignore. There is a ton of nightly homework though!",
        "course": "ITALIAN5101"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was my TA for Italian Film. He was great at promoting discussions in recitation sections and explaining concepts. Graded quizzes and tests fairly, as long as you had good support for your answers you got credit. Would definitely take again.",
        "course": "ITALIAN2053"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 4,
        "comment": "Super nice and funny professor. It's really obvious he cares. The only issue I had with this class was it had way too much homework for a class that isn't for most students' major. Be prepared for a lot of outside work.",
        "course": "ITAL2102"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 4,
        "comment": "There are a lot of homework assignments for this course that count as the majority of your grade, so don't take this course if you can't dedicate your time to it.",
        "course": "ITAL2102"
      }
    ],
    "SEI": [
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "23201",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "4224",
        "Class Name": "Survey of Italian Literature",
        "Class Number": "34096",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "29886",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "54",
        "Rating": "4.69"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2055",
        "Class Name": "Mafia Movies",
        "Class Number": "22179",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "28",
        "Rating": "4.89"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2055",
        "Class Name": "Mafia Movies",
        "Class Number": "34887",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "239",
        "Rating": "4.38"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "34557",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "30",
        "Rating": "4.33"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2055",
        "Class Name": "Mafia Movies",
        "Class Number": "19254",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.68"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2055",
        "Class Name": "Mafia Movies",
        "Class Number": "27803",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "184",
        "Rating": "4.17"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "29961",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.84"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "19301",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.03",
        "Class Name": "Italian III Blended",
        "Class Number": "29685",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.64"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2055",
        "Class Name": "Mafia Movies",
        "Class Number": "29692",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "73",
        "Rating": "4.12"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "27919",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "29177",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.8"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "4225",
        "Class Name": "Italian Identities",
        "Class Number": "36124",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.1,
    "department": "Italian",
    "firstName": "Dana",
    "id": "VGVhY2hlci0xMTAxMDQ2",
    "lastName": "Renga",
    "legacyId": 1101046,
    "numRatings": 55,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good lectures.  Good speaker.  Interesting lectures. ",
        "course": "ITAL2053"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "great choice of examples and films",
        "course": "ITAL2055"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Not the best... and being forced to buy her textbook just adds insult to injury",
        "course": "ITAILIAN2055"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Made class harder than it had to be. Lot of busy work. Lectures weren't relevant to class material",
        "course": "ITA2055"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Overall amazing professor",
        "course": "ITAILIAN2055"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "You will have to do more work for this class than your actual major courses. I have never had to write more for a gen ed class. If you are looking for an easy A this is not it.",
        "course": "ITA2055"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lots of extra credit and not too hard. The films are very interesting and this was one of my favorite classes. The readings are repetitive and a little boring; I dont think they add much to the class. I like the way she really incorporates the TAs into the class too because their opinions are very helpful.",
        "course": "ITA2055"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 2,
        "comment": "Assigns way too much work for a Gen Ed course. Emphasizes too much on gender topics in the mafia and ignores everything else. We had to watch the movies ahead of time, then we had two lectures during the week that would drag on as they often were longer than the movie itself.",
        "course": "ITAL2055"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class was incredibly easy. Movies and shows are interesting except for a few of them. Attendance is a large part of your grade so just show up to class. Exams and quizzes were very easy. Quizzes included questions from the movies and extra readings but you could do them without reading very throughly. Had over 100 for most of the semester.",
        "course": "ITAL2055"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Make sure your are ready to read and watch movies. Dana is super sweet and nice and is a great teacher. She really cares about what she is teaching",
        "course": "ITAILIAN2055"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent teacher, however class is a good amount of work, mostly reading and writing",
        "course": "ITAL2055"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class I've ever taken. It was online but it was more work than it is when it's in person. So much extra credit its literally hard not to get an A. Watch movies weekly outside of class with a quiz on them. You have to read 2 textbooks for the quizzes, certain parts, but I never read and I have a 98 right now. The class is super interesting",
        "course": "ITAL2055"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's an amazing professor who has a ton of knowledge on mafia movies. The grading is lenient, and the work isn't too hard. Just be prepared to watch 2-4 hours of film/tv a week plus some readings. Quizzes and tests are straightforward as long as you watch and read everything assigned.",
        "course": "ITAILIAN2055"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mafia movies was the easiest class I've ever taken and also one of the most interesting. If you enjoy watching movies and want an A and would like to learn even a little bit about Italian stuff that this is a great class.",
        "course": "ITAILIAN2055"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "She really cares about students and willing to help, a really good and kind professor, went to her office hour before and it was really helpful. I recommend to the class even if you are international student, films are inspirational.",
        "course": "ITA2055"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Yes, she gives a lot of reading for a GE but it's so easy to get an A in the class. I didn't read very thoroughly or take a lot of it in but I still got over a 100% just by going to all the classes and doing extra credit, which there are a crazy amount of opportunities for.",
        "course": "ITAILIAN2055"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "There is a lot of assigned homework (watching movie and then lots of reading) but I only ever watched the films because that's what was discussed in class. There were weekly quizzes and so many extra credit opportunities that you could make up not doing the reading by doing extra credit. More work than expected for a GE but still very interesting!",
        "course": "ITAL2055"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anybody who claims that this class is hard simply doesnt know how to interpret movies and quality TV. Not many assigned readings and they arent even that important. I have 115% in this class right now. Dana is fantastic and will teach you a thing or two even if you feel your an expert on mafia movies. One of the most passionate youll find!",
        "course": "ITA2055"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "My specific dislikes for Dana are that she schedules quiz windows too short and you only get 10 min to take a 10+ question quiz, over 50% of the movies we watched weren't in English so you had too read for 2.5 hours, speaking of reading assignments there is a lot for this class. I feel that Dana makes this class more miserable than it shouldve been",
        "course": "ITAL2055"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great.",
        "course": "IT2053"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Watching the films were definitely fun. Dana and the TAs are all so helpful with everything. Definitely able to make personal friendships with them. The readings are for people who want to get like perfect scores for the class. A lot of xtra credits were available so don't worry about bad quiz grades.",
        "course": "ITAL2053"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "So easy, easy A take any of her classes and you can get an A without watching movies",
        "course": "ITAL2053"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 4,
        "comment": "For this class to be easy you have to do a TON of work. Weekly time: 2-3hr movie, 60 pages of reading, and 4 hrs of class. The test and quizzes are straight memorization of Italian terms and very specific details. The only plus is that there is a ton of extra credit enough to bring a high c up to an A. If your looking for minimal work don't take.",
        "course": "ITAILIAN2055"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class you will take. There is a ton of extra credit. All of the quizzes have EC as well as the exam and there is even EC for each movie with a written assignment. She puts on the schedule to read from 2 different books, when you only need to read from Renga. Need to show up to lecture, but you do not need to pay attention.",
        "course": "ITAILIAN2055"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very easy, tells you exactly what to study, and gives out lots of extra credit. Just show up, do your work, and its an easy A.",
        "course": "ITAL2053"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 1,
        "comment": "As long as you show up to class, you will get a decent grade. Just make sure you read the review sheets she makes, because there will never be a quiz question that wasn't mentioned on the guide. Minimal effort. Just a little reading. Takes about 20 minutes of effort per week (assuming you don't want the movies like me). Easy A. Very kind prof.",
        "course": "IT2053"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fun class. Funny teacher. Nice movies. Easy quizzes (if you follow study guide).",
        "course": "IT2053"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved her lectures! You can feel her passion for Italy and lectures are exciting. You'll have a quiz every week: follow her study guide and you will have no trouble. TONS of extra credit on quizzes, papers, participation, and outside events. She tells you exactly what to study, study it and you will succeed. Ended with a 120%",
        "course": "ITAL2055"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's an amazing lecturer and she's really nice. Each time you raise your hand to talk, whether its a question or a comment it's an automatic (.5) added to your attendance grade each time, read emails about quizzes answers are usually there, the movies are great and she's very approachable and will work with you if struggling fun class",
        "course": "ITA2055"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 4,
        "comment": "Please, for the love and sanctity of your own life, don't take this unnecessarily hard and burdensome class.  Oh I know what you're thinking, Godfather sounds fun! Goodfellas sounds fun! Wrong.  The only thing I found amazing about this class was how she managed to suck all of the fun out of these movies.",
        "course": "ITA2055"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 1,
        "comment": "Weekly quizzes on the movies and reading assignments, but she sends out a study guide with literally everything that will be on the quiz. Tests are the same just longer. Just watch the movies and look up what she wants you to know from the readings. Never paid attention in lecture. Not sure why everyone complains about it, this is the easiest class",
        "course": "ITA2055"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "She does not realize that majority of her students are there to take a GE.  She assigns way too many readings for a cinema class.  Every week you are expected to watch at least one movie, most being over two hours long.  She offers a ton of EC, but that is on top of a boat load of work.  If you're looking for an extra easy class to add THIS ISNT IT",
        "course": "ITA2055"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 5,
        "comment": "She gives entirely way too much work for the class this is. On top of already possibly having 12+ credit hours of classes, this class requires readings in books, readings online (usually 20-25 pages) then requires watching a movie that is on average two hours long. I would expect this from a course that is necessary for a major but not a GE course.",
        "course": "ITALIAN2055"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fabulous.  Wonderful.  Best teacher.  Expert in field.  Writes great books.  Researches subject matter in Italy.  Strongly recommend.  Go prepared to have fun, and learn new things.  Tons of visual aids.  Extra credits by the boatload.  You will never forget this professor.   She is never boring.  She is kind.  She also makes a fashion statement.",
        "course": "ITA2055"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is very enthusiastic about the material which makes the class interesting.  Lots of extra credit opportunities, but up to you to take advantage of. Be prepared to watch the movies and read in order to do well on quizzes and exams.",
        "course": "ITAL2053"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class is relatively easy but requires a lot of out of class time. Weekly movies that are 2-3 hours long, accompanied with several 10 page readings. Tests are all fill in and short answer. Harder than it needs to be for a GE but still doable.",
        "course": "ITALIAN2053"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 4,
        "comment": "The class is entirely opinionated. You watch movies outside of class and are required to attend lengthy lectures of her standing in front of the class telling you what she thinks of the movies. Tests are anything but multiple choice and seems extremely pointless since it is a GE for most students. Very unexciting and nonfactual class.",
        "course": "IT2053"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wonderful.  Excellent.  Inspirational.   ",
        "course": "ITALMOVIES"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class is an easy GE if you study for the tests and do the extra credit.",
        "course": "ITALIAN2053"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 1,
        "comment": "Really cool class. Take advantage of the extra credit. Even if you get a C- on every exam if you do all of the extra credit you would get an A. On top of that she also curves the class on an individual basis. I barely did any of the readings but she does discuss them in class so pay attention. Tons of readings but definitely recommended.",
        "course": "ITA2055"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 2,
        "comment": "So much EC that you could probably miss every actual point in the class and still get an A off of extra credit. I never did her required readings and only watched the films and I will still get an A. attendance is mandatory. Kinda boring to listen to but such an easy GE.",
        "course": "ITAL2055"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "There is a lot of reading for the class. You have a quiz every class except when you have a midterm or writing assignment. The readings are actually interesting. The lectures are interesting. there are a lot of movies to watch some are long most are good. There were no surprises on the midterm or any of the quizzes plus she emails study guides! A+",
        "course": "ITAILIAN2055"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class.  Interesting movies to critique.  Mix of movies always different, yet somehow always have connecting themes.  Cinematic techniques breathtaking.  Professor's explanations astounding.  National and historical politics quite an interesting background to plotlines.  Subliminal erotic innuendos an interesting expansion of backgrounds.",
        "course": "ITAL2023"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is easy. Quizzes are straight forward but you do have to watch a two hour movie every week and do some extra reading. Lots of extra credit opportunities. very good instructor.",
        "course": "ITAL2023"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 1,
        "comment": "Italian Cinema was a great class. There are a lot of extra credit opportunities. Professor Renga makes it interesting and thoroughly explains the films. You do have to put in time each week to watch a film and read outside of class. A little time consuming but easy nonetheless.",
        "course": "IT2053"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great.   Mafia movies, Godfather trilogy, Sopranos.",
        "course": "2550"
      },
      {
        "index": 47,
        "rating": 2,
        "difficulty": 4,
        "comment": "Entirely too much content and reading for one semester. Exams and quizzes are all short answer, fill in the blank, not one multiple choice. Be prepared to memorize many italian terms and names that sound the same. Would NOT suggest.",
        "course": "ITAL2055"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class was extremely interesting but I was not the biggest fan of her teaching style.",
        "course": "MAFIACINEMA"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent professor.  Very interesting subject matter.  Not originally my favorite genre, Italian Mafia Movies, but I grew to appreciate the culture and history.  I even realized that there are Italian-made Mafia movies, as well as American-made Mafia movies.  This is a very interesting, well-organized class.  Brava to Professor Renga!!!",
        "course": "ITALMAFIAMOVI"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 2,
        "comment": "Italian movies.  Excellent insights.  She truly loves her subject, and tries hard to instill the same appreciation into her students.  Remember her.  She is a delight.",
        "course": "ITAL107"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "I am surprised that she doesn't have more (positive) ratings. Dana is amazing! I loved her course design, her style, her personality and felt I learned so much and grew as a scholar. I also appreciate her clear writing style, which, unfortunately, is rare in academia. I loved this class. She is the best prof in FRIT!",
        "course": "IT8602"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is great! Though i was not interested in Italian before i took the class, she made me know more about this great country and become into it. She gave us a lot of extra credits to pass the course. Each class we had a quiz, but it was not hard at all if you prepared well! Take her class!",
        "course": "ITAL100"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easily one of the best professors I have had at OSU. Makes attendance mandatory if you want to pass the class but attending lecture easily prepares you for exams and is made very interesting. I highly HIGHLY recommend taking a class taught by here.",
        "course": "ITAL2053"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very interested in the subject matter.",
        "course": "ITLN221"
      },
      {
        "index": 55,
        "rating": 4,
        "difficulty": 3,
        "comment": "Though it was only an Italian Cinema class. If you take this class you will not be disappointed as she provides an interesting look into italian history as well as comparitve studies of history and film. She is incredibly helpful to her students and always shows up looking very professional, yet attractive.",
        "course": "ITAL221"
      }
    ],
    "SEI": [
      {
        "Subject": "ITALIAN",
        "Catalog": "2055",
        "Class Name": "Mafia Movies",
        "Class Number": "34093",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "248",
        "Rating": "4.57"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "Italian",
    "firstName": "April",
    "id": "VGVhY2hlci0yNDQ2OTYz",
    "lastName": "Weintritt",
    "legacyId": 2446963,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very considerate and understanding of everyone in the class. The coursework was not too difficult, but there were many texts to read. ",
        "course": "FRIT3054"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "April is incredibly supportive of learning and made me excited to show up to class. Overall the workload is not too much considering you are learning a new language, but keep in mind you do have to do work outside of class and studying is necessary. I am DEVASTATED that I cannot take her class next semester!!",
        "course": "ITL1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's awesome, it's a challenging class as any foreign language class will be, but Weintritt makes it the best experience possible. Would take again, would recommend anyone else to take Weintritt as well!",
        "course": "ITALIAN1103"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Weintritt is a lovely, caring professor that wants her students to succeed in learning the Italian language and culture. The majority of the lecture is in Italian at a normal pace and you are required to participate and communicate back, so certainly a step-up in intensity from previous courses. However, she grades generously.",
        "course": "ITALIAN1103"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was so bad, don't recommend taking. It was so pointless and repetitive and you had to have the exact wording she had for a quiz answer or you don't get full credit. ",
        "course": "FRIT3054"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "April was amazing! She speaks only Italian in class, so it is difficult, however, she was always willing to clarify anything if you asked! \nShe was quick to respond to my emails and was always so caring when I spoke with her. Fair grader and an amazing person - I'm going to miss my Italian classes with her.",
        "course": "ITALIAN1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had her for both 1102 and 1103. By far my favorite professor. Very understanding, grades fairly. Lots of online homework but it was pretty easy. I loved the class and her. Ill miss her Italian classes.",
        "course": "ITALIAN1103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "April is the absolute best professor I've ever had. I had her for 1102 and 1103 and would definitely take more classes with her if I had the chance. Attendance is mandatory (you're allowed a couple skips per semester) but April makes class engaging and fun. She's very understanding and actually cares about her students. Highly recommend",
        "course": "ITAL1103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely love Professor Weintritt. She cares so much about her students and is an amazing teacher. She is considerate with homework and tests. Had her for 1102 and 1103 and would take more with her if I could. In class, she speaks only in Italian and you have to follow, but if you need something clarified with something, she's eager to help.",
        "course": "ITAL1102"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors. It was definitely more difficult than my previous class, but April Weintritt was always willing to work with students and always made me excited for lecture. One time I was mentally not doing well and accidentally missed the timeline for an exam, and she let me take it with no time limit. Very considerate, she's great",
        "course": "ITALIAN2"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "April is a wonderful teacher. The class was fast paced and there was a lot of homework every night but it wasnt checked so you could get away with not doing it. She is very considerate and kind as well",
        "course": "ITALIAN3223"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "By far the greatest Italian Professor Ive had. Most previous professors have been rude and impatient, but Professor Weintritt has been very understanding and truly shows a concern for her students. The class is fast paced and can be tricky, but if you show up to class consistently and make an effort youll do fine.",
        "course": "ITALIAN1102"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class is kind of fast paced, definitely a lot if you're new to the language. Weintritt is very helpful, engaging, and positive in class and outside of it. like any language class participation is part of your grade, but there's lots of opportunities every class to get points.",
        "course": "ITL1102"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cares about each student's success and takes personal interest in your performance in the class. Very understanding and forgiving, and makes lessons interesting and fun.",
        "course": "IT3223"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "April is probably my favorite professor Ive ever had, and Im not even a foreign language major. She is caring, accommodating, helpful, funny, and overall very fair in how she grades. The class was tough, but you should expect that from OSUs foreign language department. I couldnt have imagined taking this class with any other professor!",
        "course": "ITALIAN1102"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "April is one of the best foreign language professors I have had, and I have had many. This class was challenging for me and I considered dropping it at the beginning; but, April talked to me and convinced me that I was going to be fine. She was always available to help and willing to give feedback. I definitely recommend taking a course with her.",
        "course": "ITALIAN5101"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "April is very energetic and passionate about her job. I was not a great student and am poor at foreign languages, but she was always very encouraging and helpful. Very accessible outside of the classroom and will give favorable grading and breaks to you if you show up to office hours. Not a laidback prof but you could find MUCH worse language profs",
        "course": "ITALIAN1102"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "April is extremely friendly and caring. She's funny and great at teaching. She has a clear passion for her job.",
        "course": "ITALIAN5101"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "Good luck.",
        "course": "ITALIAN1103"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "April is a must-take professor. She cares so much about her students, makes every class something to look forward to, and makes a lot of the difficult topics very easy to learn. 10/10 one of the best professors I have ever had definitely take if you are able to.",
        "course": "ITALIAN1103"
      }
    ],
    "SEI": [
      {
        "Subject": "FRIT",
        "Catalog": "3054",
        "Class Name": "The 21st-Century Skill: Intercultural Competence for Global Citizenship",
        "Class Number": "38013",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "43",
        "Rating": "4.7"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.03",
        "Class Name": "Italian II Blended",
        "Class Number": "25500",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.86"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3332",
        "Class Name": "The Sounds of Italian",
        "Class Number": "34095",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.02",
        "Class Name": "Italian II Hybrid",
        "Class Number": "33478",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "17",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3223",
        "Class Name": "The Regions of Italy",
        "Class Number": "33484",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.95"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103",
        "Class Name": "Italian III Blended",
        "Class Number": "34870",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "17",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2102",
        "Class Name": "Contemporary Italian Society",
        "Class Number": "13899",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "17",
        "Rating": "4.76"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "19459",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "19461",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.03",
        "Class Name": "Italian III Blended",
        "Class Number": "27793",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.03",
        "Class Name": "Italian II Blended",
        "Class Number": "29958",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1198.71",
        "Class Name": "Italian on the Ground",
        "Class Number": "35027",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.36"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "19301",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "28894",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2102",
        "Class Name": "Contemporary Italian Society",
        "Class Number": "35657",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "3.33"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1198.71",
        "Class Name": "Italian on the Ground",
        "Class Number": "30139",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.5"
      }
    ]
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4.5,
    "department": "Italian",
    "firstName": "Michela",
    "id": "VGVhY2hlci0yNjE1Njk4",
    "lastName": "Bertossa",
    "legacyId": 2615698,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Italian 2055. Class is pretty interesting, she is super nice as well. TA's are ok. They all care about students and want everyone to do well. Grading can be a bit difficult at first but if you listen to the feedback they give you your grades will reflect that. Make sure you like movies as well because there is a lot of watching and examining. ",
        "course": "1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof Bertossa is a great teacher. She is from Italy so at first (as an easily intimidated freshman), I was scared due to how little English is spoken in this class. But, I found this made my Italian so much better. Being encouraged to speak it at all times helped me grow immensely. She is so sweet and very devoted to helping her students learn.",
        "course": "1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Stefani",
    "id": "VGVhY2hlci0yNzU5MDA5",
    "lastName": "Scimeca",
    "legacyId": 2759009,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Stefani is definitely one of the best professors I have ever had. Her lectures are amazing, and she is just a vivacious person. Attendance is mandatory. You will lose points off your final grade for each additional absence you have from the 'grace' period. Show up to class and be ready to participate. Stefani makes class fun and easy to participate",
        "course": "ITAL1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Stefani for Italian 1102 and she was amazing, surely my favorite professor I've had. One of the very few professors who was genuinely caring. The class is a little homework heavy but nothing too substantial. Definitely recommend her to anyone looking to take 1102.",
        "course": "ITAL1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Stefani for Italian 1102 and she's awesome! Very caring and wants students to succeed. Lots of Connect homework and quizzes but classes are engaging.",
        "course": "ITAL1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Stefani is the best! So nice and helpful, I was dreading taking a language but it turned out to be my favorite class of the semester thanks to her.",
        "course": "ITAL1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fabulous professor! I can't wait to take more Italian thanks to her class! Grazie !",
        "course": "ITAL1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.6,
    "department": "Italian",
    "firstName": "Jonathan",
    "id": "VGVhY2hlci0yMzI5ODY3",
    "lastName": "Combs-Schilling",
    "legacyId": 2329867,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "RUN!!! Had him for Italian 1102. His first time teaching the language and god was it awful and a hilarious train wreck. We had 5 midterms, a final, speaking exams, etc. He graded none of it lmao. He knew he was terrible, so he gave everyone an A because he only graded two assignments in total from first week of class. Screwed for Italian 1103 now. ",
        "course": "ITALIAN2051"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took 1102. He cares about every student and wants everyone to succeed. While he did fall behind in lectures and is very slow to grade, he is very accessible for help and prioritizes the learning of the language. He is very funny and respectful, and is willing to be very flexible to accommodate anything you may need. Absolutely take his classes!",
        "course": "ITALIAN2051"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Combs-Schilling was an amazing professor. He turned something that I had absolutely no interest in into something really fun! He is extremely passionate about his work and is super nice and understanding. 12/10 would recommend this class to anyone looking for the GE requirement. Not too much work at all. Just a lot of reading and a few papers",
        "course": "ITALIAN2051"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "By far my favorite professor at Ohio State. The class is very lecture heavy with weekly quizzes, but he is the best lecturer I've ever had. If you do the readings and share your thoughts, you will thoroughly enjoy the class. In addition, Dr. Combs-Schilling is extremely outgoing and still keeps in touch with my entire class from over a year ago!",
        "course": "ITALIAN2051"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing teacher!!",
        "course": "ITALIAN2051"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome teacher.",
        "course": "ITALIAN2051"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best class I've taken at OSU. He is very passionate about teaching and made what should have been boring topics extremely interesting. Attendance is mandatory, but he makes going to lecture worth it. There is a lot of reading (shocking because it's a literature class), but it's extremely manageable and you are often allowed to skip chapters.",
        "course": "ITALIAN2051"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is an amazing professor and is super passionate about what he takes. He is also very understanding in course load. If it's too much he'll shorten. He is more interested in the class than following a rubric. Excellent!!!",
        "course": "ITALIAN3051"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Taking his class was so refreshing. He's very passionate about teaching and shows it by making sure all of us understand how past history has influenced literature travel. 100% recommended. He encourages everyone to go to his office hours and is always happy to help",
        "course": "ITALIAN2051"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "I didn't really care for Italian literature until taking this class. Jonathan is extremely passionate about it. Lectures were long for me, but he makes it interesting by getting the class involved. Two papers and A LOT of reading. Pay attention in class and you can get away with not reading. Also participating in class is rewarded with bonus.",
        "course": "ITALIAN2051"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great! Is clearly super passionate about the subject he is teaching and is well knowledge on it. He was very approachable and is constantly encouraging the use of his office hours . His lectures were genuinely interesting and you basically learned anything and everything you needed to know for quizzes just by listening.",
        "course": "ITALIAN2051"
      }
    ],
    "SEI": [
      {
        "Subject": "FRIT",
        "Catalog": "8602",
        "Class Name": "Comparative French and Italian Studies",
        "Class Number": "25511",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.33"
      },
      {
        "Subject": "FRIT",
        "Catalog": "8602",
        "Class Name": "Comparative French and Italian Studies",
        "Class Number": "28362",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2051",
        "Class Name": "Fictions of Italy: Medieval and Renaissance Literature and Society",
        "Class Number": "23732",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "4.91"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3798.01",
        "Class Name": "The Italian City",
        "Class Number": "18810",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.95"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3051",
        "Class Name": "Italian Romances",
        "Class Number": "27419",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3798.01",
        "Class Name": "The Italian City",
        "Class Number": "18778",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3051",
        "Class Name": "Italian Romances",
        "Class Number": "21541",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.97"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3798.01",
        "Class Name": "The Italian City",
        "Class Number": "18904",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2051",
        "Class Name": "Italian Journeys",
        "Class Number": "35360",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.72"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3051",
        "Class Name": "Italian Romances",
        "Class Number": "27370",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.91"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3220",
        "Class Name": "Italian Culture Through the Ages",
        "Class Number": "34983",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3798.01",
        "Class Name": "The Italian City",
        "Class Number": "18832",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.27"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "4224",
        "Class Name": "Survey of Italian Literature",
        "Class Number": "35659",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.03",
        "Class Name": "Italian II Blended",
        "Class Number": "29175",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.83"
      }
    ]
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.5,
    "department": "Italian",
    "firstName": "Demetrio",
    "id": "VGVhY2hlci0yNTQyMzAy",
    "lastName": "Antolini",
    "legacyId": 2542302,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Antolini is somewhat shy, but always very friendly and always willing to help students learn! I like his lecture style where participation is encouraged, but not necessary. Also, I enjoyed hearing his stories about living in Italy and sharing cultural differences. The textbook quizzes are difficult, but you will not regret taking his class! ",
        "course": "ITALIAN1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "amazing amazing amazing!!!! he is so so nice and understanding. he truely wants his students to do well he is awesome ",
        "course": "ITALIAN1101"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Signor Antolini is a caring teacher. He is laid-back and relatable. He available often outside of his class for questions and is good with emails. He is an decent teacher, but nothing spectacular. Most of the learning consists of doing the homework and reading the textbook, and then practicing speaking in class.",
        "course": "ITALIAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Had him for Italian 1101.03 and he was the best. Super chill and relatable. He cares about his students and want you to succeed. Highly recommend.",
        "course": "ITALIAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Italian",
    "firstName": "Lauren",
    "id": "VGVhY2hlci0yNjA2MDIy",
    "lastName": "De Camilla",
    "legacyId": 2606022,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent.  Well-qualified.  Exceedingly kind and caring.  Creative.  Friendly.  Intelligent.",
        "course": "ITAL2055"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "nice person and very kind ",
        "course": "ITAL2055"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Lauren is a nice person. Attending class seemed like hanging out with a friend. She never created that Professor - student boundary. She was not very organized to say the least. You basically have to work for everything. This was supposed to be a fun class, but stress took the fun out of it. The powerpoints will not be available on Carmen.",
        "course": "ITAL2055"
      }
    ],
    "SEI": [
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "23240",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.27"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2102",
        "Class Name": "Contemporary Italian Society",
        "Class Number": "19565",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 3.9,
    "department": "Italian",
    "firstName": "Ted",
    "id": "VGVhY2hlci0xMzg0MDc0",
    "lastName": "Emery",
    "legacyId": 1384074,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Took Modern Media with him. He made activities packets to go with the movies, focused on vocabulary, grammar and discussion questions. Interesting films, and my Italian improved a lot.",
        "course": "ITALIAN3332"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Worst Professor Ive had. Takes pleasure in making fun of students in a condescending manner. Called me out in front of the whole class for making a mistake on one of the homework assignments. Literally hated coming to his class.",
        "course": "ITALIAN1101"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Ted is a bad instructor, and what makes it worse is that he thinks that he's a great instructor. I can't recommend taking classes with him",
        "course": "ITALIAN1103"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Seemed like a great guy at first, but often called students out in front of whole class to humiliate them. Homework is done through textbook. Tests are pretty easy and lets you retake if you do bad, great class, but instructor not so much.",
        "course": "ITALIAN1101"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "prof Emery knew the subject matter and was professional about it, he was a tremendously hard grader, and sometimes unprofessional. I felt he had a personal vendetta against me, which I never say about professors. Week and week I was trying to put more work into the class, and he kept giving me poor participation points when I was doing the most.",
        "course": "ITALIAN1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Emery is my favorite professor that I've had in college even though I have never really liked foreign language classes. He makes class interesting and is generally lenient.",
        "course": "ITALIAN1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ted is an amazing professor! I had him for Italian 1101 and he made the class interesting and very easy to get an A in.",
        "course": "ITALIAN1101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you have to take Italian please take Prof. Emery. He is the sweetest professor I've ever had. He truly knows how to effectively teach and he cares about his students. If you need help, he will gladly help. I do not have any complaints about the class or his teaching methods at all.",
        "course": "IT5101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I cannot say enough good things about Professor Emery. You can tell he cares so much about the subject matter and about all of his students. Besides that, his teaching style is great. He makes things easy to follow and, if you have problems catching on, he makes himself available almost every day if you need extra help. Such a great teacher!",
        "course": "ITAL1101"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Prof Emery is the best language teacher I have ever had. He is so enthusiastic and you can tell he loves teaching and wants us to do well.  He is a fair grader, and as long as you come to class and do homework passing with a decent grade is easy. Seriously would take every italian class with him if I could.",
        "course": "ITALIAN1102"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Emery is the best OSU Italian teacher. He is so helpful, knows what he is talking about, and he cares about you learning. Do the work and study and you will pass. I would take all my Italian classes with him if I could.",
        "course": "ITALIAN3332"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Emery is extremely enthusiastic about Italian, and made me love the language even more than I already did. He is very willing to help and makes participating in class fun. ",
        "course": "1101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor, extremely knowledgeable, energetic, and always ready to help his students. His class is definitely more demanding than some other language professors, but I learned a ton and still really enjoyed going to class every day. He does expect you to understand the topic to be covered in class before each class, so prepare.",
        "course": "ITALIAN1102"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Emery was the only professor I had for the Italian series (1101-1103) who made it completely not fun and made me feel like I hated to go every day. He calls on you even if you don't know the answer a question. He's extremely smart, but I felt like I was in a graduate course half the time because it was such an intense and fast paced class.",
        "course": "ITALIAN1102"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "He did not behave professionally and almost always had something negative to say when people volunteered to speak. It was not encouraging. Most activities felt drill-like, were useless and a waste of time and I felt I had to do all the work on my own at home. He speaks well, is learned and entertaining, but I did not enjoy the way he taught.",
        "course": "IT5101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Mr. Emery is one of the best professors at OSU. He keeps you challenged, but if you genuinely want to learn Italian, his methods work very well.",
        "course": "ITALIAN1103"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent professor!  He is incredibly knowledgeable of the subject.  He's very kind and always willing to help.",
        "course": "ITA402"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor. Great at teaching - he's funny and entertaining. If you study and are decent at speaking Italian, you should do well. However, the class is taught almost completely in Italian so this may trip some people up.",
        "course": "ITAL104"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof Emery can be intimidating first but I found him to be extremely helpful and knowledgeable. He really cares about teaching the material and is always charismatic and pleasant.",
        "course": "ITALI102"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Emery is a highly educated and extremely talented professor.  You may be slightly intimidated by him, but don't be!  His classes are very informative and should be taken if you really want to learn the language (believe me, you'll most definitely learn!).  His lessons are fun as he tries to keep things both interesting and informative.",
        "course": "ITA425"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ted Emery is a quality prof. He does cover a lot of material during class and expects you to do your homework, but do not be intimidated. If you attend class and try, you will get a descent grade. I am not an Italian major and he always understood this and helped me when I needed it. He is also very approachable in office hours.",
        "course": "ITAL425"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "I think Prof. Emery is a great teacher. While he does try to get you to figure things out on your own, he can tell when you just don't know and will help. He cares a ton about his students and goes to the trouble of making study guides for each test and giving you a sample final exam to practice. No other teachers do this. Take Prof. Emery.",
        "course": "ITAL103"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mr. Emery is not a difficult teacher, but in an effort to make you understand the material, he tries to make you figure it out on your own, causing frustration and confusion.",
        "course": "ITA102"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "He is not necessarily difficult, but expect tedious and unhelpful work in and out of class. Class is typically too fast to grasp the concept, yet too slow that you check the clock constantly (and you will never get out early or on time for that matter). He has an attitude that's &quot;his way or the highway.&quot;",
        "course": "ITA401"
      }
    ],
    "SEI": [
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "26022",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "26023",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "26024",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "26025",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "36577",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "36579",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "36580",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "26030",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "26031",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "28456",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.2"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "29236",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "29238",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "33481",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "28457",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "29241",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "23525",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "24044",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "36430",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102",
        "Class Name": "Italian II Blended",
        "Class Number": "34864",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102",
        "Class Name": "Italian II Blended",
        "Class Number": "34867",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.6"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.03",
        "Class Name": "Italian III Blended",
        "Class Number": "34556",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2102",
        "Class Name": "Contemporary Italian Society",
        "Class Number": "13693",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3222",
        "Class Name": "Modern Italian Media",
        "Class Number": "36508",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "3.31"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Samanta",
    "id": "VGVhY2hlci0yMzE1ODkx",
    "lastName": "Buffa",
    "legacyId": 2315891,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Samanta for Italian 1101 and she was amazing. She was extremely understanding and genuinely wants you to learn and understand the language as well as having fun doing so. She is very funny and upbeat which a lot of professors seemingly lack. If you have the choice I would take her in a hearbeat.",
        "course": "IT1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was really good about getting everyone to participate and by the end of the semester, I really felt that I understood three semesters worth of material and could have a conversation relatively easily without struggling. She explains concepts really well in terms of the language itself.",
        "course": "ITALIAN5101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Caring, accessible, and funny professor. Always prepared, willing to answer questions. I looked forward to every class. Truly helped me learn Italian. Overall, an excellent professor.",
        "course": "IT1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Italian",
    "firstName": "Harry",
    "id": "VGVhY2hlci0yNjIzNzc2",
    "lastName": "Kashdan",
    "legacyId": 2623776,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Do not take this class for a GE way too much work it is not worth was recommended to take by another professor because they couldn't fill the class and there is a reason for that. Participation is too much of the grade and you have discussions every week from books that you have to buy. The exams are huge written response questions. Do not take.",
        "course": "FRIT2061"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Way more work than a 3 credit hour GE should be do not take this class if you aren't going to come to lecture and participate. You should have to expect to have a couple of hours of reading each week of different books that you have to buy for the course. The grading on the weekly discussion posts is poor and unfair the feedback given is bad.",
        "course": "FRIT2061"
      }
    ],
    "SEI": [
      {
        "Subject": "FRIT",
        "Catalog": "2061",
        "Class Name": "Mediterranean Food Culture",
        "Class Number": "29790",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "47",
        "Rating": "4.43"
      },
      {
        "Subject": "FRIT",
        "Catalog": "3053",
        "Class Name": "The Black Mediterranean",
        "Class Number": "35465",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Jonathan",
    "id": "VGVhY2hlci0yNzU4NTM4",
    "lastName": "Mullins",
    "legacyId": 2758538,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I only took this class to fulfill a GE requirement, but it quickly became one of my favorites, thanks in part to Professor Mullins. His lectures are very interesting and engaging, and his in-lecture discussions will really make you think. If you study, his exams are a breeze. Just be ready to write. He also gives out a good amount of extra credit.",
        "course": "ITA2056"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is extremely easy if you put the time into it. It's not too much work but definitely takes time to watch the movies. He is an amazing professor and doesn't force you to answer if you don't want to talk. The lecture is very engaging and I would totally recommend this as a GE!",
        "course": "ITA2056"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Mullins is understanding, kind, &amp; always available for help. I would recommend this class to anyone because if you show up, watch the movies, complete the easy assignments, and take good notes it's not hard at all to get an A. The exams are heavily weighted: good if you miss other work, bad if you don't know the material. 10/10, just study!",
        "course": "ITA2056"
      }
    ],
    "SEI": [
      {
        "Subject": "FILMSTD",
        "Catalog": "7001",
        "Class Name": "Advanced Theory Seminar: Methods and Applications",
        "Class Number": "33399",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Film Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "3.8"
      },
      {
        "Subject": "FRIT",
        "Catalog": "8602",
        "Class Name": "Comparative French and Italian Studies",
        "Class Number": "37110",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.2"
      },
      {
        "Subject": "FRIT",
        "Catalog": "8601",
        "Class Name": "Theory and Practice",
        "Class Number": "37343",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2056",
        "Class Name": "Love and Difference on the Italian Screen",
        "Class Number": "23517",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.33"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2053",
        "Class Name": "Introduction to Italian Cinema",
        "Class Number": "22433",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "35",
        "Rating": "4.49"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3798.01",
        "Class Name": "The Italian City",
        "Class Number": "35249",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.47"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2056",
        "Class Name": "Love on the Italian Screen",
        "Class Number": "37205",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "49",
        "Rating": "4.82"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2056",
        "Class Name": "Love on the Italian Screen",
        "Class Number": "37211",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "4225",
        "Class Name": "Italian Identities",
        "Class Number": "24370",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.85"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2056",
        "Class Name": "Love on the Italian Screen",
        "Class Number": "28387",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "49",
        "Rating": "4.65"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "4223",
        "Class Name": "Italian Cinema",
        "Class Number": "35359",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "5194",
        "Class Name": "Group Studies",
        "Class Number": "35457",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "3798.01",
        "Class Name": "The Italian City",
        "Class Number": "18832",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.69"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "2056",
        "Class Name": "Love on the Italian Screen",
        "Class Number": "30006",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.47"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "4225",
        "Class Name": "Italian Identities",
        "Class Number": "36124",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "4"
      }
    ]
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Mattia",
    "id": "VGVhY2hlci0xNDQ0MTgy",
    "lastName": "Beghelli",
    "legacyId": 1444182,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely fantastic professor. By far the most fun I've ever had in an Italian class (and probably in any college class). This is the only class I've ever done all the reading for for the whole semester. Really engaging, funny, and all around a really nice guy.",
        "course": "ITAL3640"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "What a great guy. He has lots of energy and a great sense of humor. He makes sure that everyone of his students feel comfortable with the material and is very approachable. The class is very straightforward, just do the work and you will be fine. On the last day he made us all Tiramisu! Whatever he is teaching, take his class!",
        "course": "ITAL231"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's the best. All you need to know.",
        "course": "ITAL231"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "All the rumors are true, Mattia is the best.  Very energetic, funny, and friendly.  He wants his students to learn and he is a great teacher.",
        "course": "ITALIAN231"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mattia is awesome!! He is super funny but still extremely helpful at the same time. He moved our class along faster than the other sections of Italian 101 but it wasn't overwhelming. He is the best teacher I've had at U of M and a fantastic start to my Italian career!",
        "course": "ITAL5"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome teacher! He is really funny and VERY helpful. He truly wants you to succeed. Unfortunately for us, he has left OSU to pursue his doctorate degree.",
        "course": "ITAL103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. He's hilarious and genuinely cares about teaching. Just do the online homework, study, participate in class, and you'll be fine.",
        "course": "ITAL102"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mattia is the best Italian teacher you will find. If you can take a class with him, do it. I promise you that you will not regret it. Not only will you learn Italian but you will have so much fun doing it.",
        "course": "ITAL103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Mattia for both 102 and 103, and he is truly the best teacher I have had at Ohio State. I've never had an instructor more willing to help and ensure you understand the material. It's hard to believe this was his first year teaching, because he's so unbelievably natural in front of a classroom, not to mention, full of energy and jokes.",
        "course": "ITA103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Christina",
    "id": "VGVhY2hlci0yMDk0Mzkw",
    "lastName": "Steele",
    "legacyId": 2094390,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great, genuine teacher. She clearly wants her students to learn and is thorough with her lessons. She sets her students up well for the next level they will take. Would definitely recommend taking her for Italian!",
        "course": "ITALIAN1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved taking Italian with Christina Steele. She is an amazing professor that genuinely cares about getting her students to learn the language. I felt thoroughly prepared for the next level of Italian after taking her class.",
        "course": "ITALIAN1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was super great. She made Italian extremely easy and she genuinely wanted us to learn the language. I wish she was more easily accessible outside of class, but that's really my only complaint.",
        "course": "ITAL1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was such an amazing teacher and even persuaded me to go beyond 1103 and become an Italian minor. She was available at all times, willing to work with you, helpful, and very caring. I would recommend her to anyone and would definitely take again. Her grading is fair and she really cares about her students and their performance in her class.",
        "course": "ITAL1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's one of the best professors I have had at Ohio State. Her classes are very well organized and she makes sure we all understand the material before proceeding. There is homework every night, however it really does help in the long run with quizzes . I highly recommend her class if you're looking to take Italian at OSU!",
        "course": "ITAL1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is the most amazing teacher I have had in the language department at osu. She is always trying to help us learn better and is available anytime and anywhere to help her students. I would recommend her to anyone!",
        "course": "ITAL1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Christina was the best professor I have had at OSU. She is nice, helpful and hilarious! She wants her student to learn and incorporates a lot of learning aspects so Italian does not become stressful!",
        "course": "ITAL1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.6,
    "department": "Italian",
    "firstName": "Anna-Anita",
    "id": "VGVhY2hlci05OTY5MzI=",
    "lastName": "Cesnjevar",
    "legacyId": 996932,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst college experience to date. If you arent somehow an expert in the language good luck. She belittles, she demeans, she focuses all of her attention on students that already grasp the material. She will not work with you if youve had any illnesses or fall behind instead she constantly encouraged me to drop. She shames and discourages.",
        "course": "FREN1101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had her for BCS 2104 and she's a really good professor that tries her best to make class fun and interesting. For BCS we had a couple of Midterms and a final along with two oral presentations. If you have the chance to have her as a professor, I suggest taking it.",
        "course": "BCS2104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took her class as a CCP student, I'm 15. She genuinely cares about the class and is extremely kind. She grades tough but fair, and sometimes it felt like she treated the class like middle school, but overall I really enjoyed her class. She is completely willing to spend time helping you understand things you don't. There's lots of homework though",
        "course": "ITALI101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Strict, but she genuinely cares about your understanding of Italian. She makes you speak everyday whether you want to or not, which ended up really helping for the tests/exams/essays. She tries to do different activities and keep everyone engaged, but almost always went over the time limit for class.",
        "course": "ITALI101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is a very good teacher. A little strict (expects you to come prepared), but that's not a bad thing. Tries to make class fun. The Italian department makes the quizzes and final, but she does a good job of preparing you for them. Time management isn't her strength though. Went over the allotted time seemingly every class.",
        "course": "ITALIAN1101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Anna is the best language teacher I've ever had. Her class itself is a lot of work but she doesn't expect perfection and is willing to help you understand the material. She is very enthusiastic and lively, and truly cares about her class.",
        "course": "ITAL1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's a great teacher and offers to help with whatever time she can manage with her busy schedule. She doesn't expect you to be a master in Italian, grades accordingly, is fair and clearly teaches what will be tested on. If you don't understand something she will go over it with you and explain it in other ways so that you can. Very lively and kind",
        "course": "ITAL103"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Probably the most frustrating prof I've had in school.  She does care about her students.  But is completely unreasonable. Assigns long tedious homework assignments that don't help. Hard to understand. Doesn't consider what's best for the student.  Treats students like they're in Junior high. Avoid if you can. ",
        "course": "ITAL103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "The best!",
        "course": "ITAL103"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "too worried about herself",
        "course": "ITAL103"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "VERY helpful. Enjoyed both of my classes with her. Speaks over 6 languages, and is wonderful with Italian. Tough but fair grader and will take time out to help you if you are struggling. Use her office hours if you're having trouble. Overall, wonderful teacher and would love to take a class with her again.",
        "course": "ITALI101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Italian",
    "firstName": "Fabiana",
    "id": "VGVhY2hlci0xNzAzMjAy",
    "lastName": "Graziani",
    "legacyId": 1703202,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Expects inexperienced Italian students to know the language. Does not explain material, and gets annoyed when one does not understand the language the way she does. Tough grader. Would not take again.",
        "course": "ITAL101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Who better to teach the Italian language and culture than someone from Italy? Well, Fabiana is Italian and an excellent teacher. She will go out of her way to make sure you understand Italian. Even after taking 101, and Fabiana was not my teacher anymore, she still offered to help me with Italian. She makes learning Italian fun! She's the best!",
        "course": "ITAL101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Italian",
    "firstName": "Calvin",
    "id": "VGVhY2hlci0xODgxNzAy",
    "lastName": "Beckley",
    "legacyId": 1881702,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great instructor! Makes class easy and fun, very relatable.  Gives a lot of partial credit, tests are not too bad.",
        "course": "ITALIAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Honestly, the greatest language teacher i ever had. He was funny and could relate because he's pretty young, barely older than us, but he also got the material across and joked around with the class. I was hate foreign languages but he helped out a lot. He's a great professor (easily my favorite), so put forth some effort and you'll be good.",
        "course": "1103"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Best teacher I've ever had. Very helpful and entertaining. Makes class fun and he's easy on the eyes which doesn't hurt.",
        "course": "ITALIAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.9,
    "department": "Italian",
    "firstName": "Sara",
    "id": "VGVhY2hlci0yMDk2OTQ3",
    "lastName": "Rossini",
    "legacyId": 2096947,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Sara! She was such a good teacher and made learning Italian very easy. I loved going to class and seeing her and sometimes her dog, Lily, who she liked to bring to class. There is homework every night, but that's characteristic of every Italian class. She is a very easy grader as long as you pay attention. Would highly recommend.",
        "course": "ITALIAN1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Sara was the best for Italian 1101. She is really snarky and spent a lot of time making fun of us, but it was because she loved us. She randomly would give us extra credit, but she still graded carefully and made it clear what she wanted.",
        "course": "ITALIAN1101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easily one of the best professors I have ever had, and I was her in the first Italian class she had ever taught. Loves what she does and is excited to interact with and help students. Friendly and silly. Very understanding and will provide you extra time to complete an assignment if needed. Tests are accurate representation of what we do in class",
        "course": "ITALIAN1101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Sara was super nice and made me enjoy her class even though I normally hate foreign language classes",
        "course": "ITALIAN110101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.8,
    "department": "Italian",
    "firstName": "Anna",
    "id": "VGVhY2hlci0xOTc0ODQ3",
    "lastName": "Bobbio",
    "legacyId": 1974847,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Anna for two semesters and I loved her. I developed a really great relationship with her and she was willing to write a letter of recommendation for a scholarship I was applying for.",
        "course": "ITAL110201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anna was great!!! Very caring and always willing to help. Offered extra credit sessions where you converse in Italian for 15 mins. Quizzes were very fair. Teminos were very fair. Very personable. I would take her class again in a heartbeat if I could!",
        "course": "ITAL110201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love her, great professor",
        "course": "ITAL110201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Annagiulia is the best ! She made class so fun and so enjoyable that I never wanted to skip, even though it met at 8am every morning :-( I would love to have her for another class.",
        "course": "ITAL110201"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "A very nice person. She's sweet, approachable, and makes discussion fun. And cute!",
        "course": "1101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Allora... I really enjoyed Anna's class! That really says a lot, I took this at 8 AM. You need the book every day, and there's a lot of homework, but she made the class as fun as she could for 8 in the morning. As for the tests, they're pretty easy for the most part, but the final is pretty rough. Not really hard, but crazy long.",
        "course": "1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.7,
    "department": "Italian",
    "firstName": "Lindsay",
    "id": "VGVhY2hlci0xNjM0NTI0",
    "lastName": "Barrie",
    "legacyId": 1634524,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love Lindsay!! she's the best Italian prof I've had so far at osu. pretty chill and laid back, laughs a lot during class and never makes you feel dumb",
        "course": "ITALIAN1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cool lady. Class is pretty straight forward and pretty lenient. Expect to speak Italian everyday. Just try in her class and Lindsay will have your back.",
        "course": "ITA1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Speaking Italian is a requirement. She is easy to understand, and will not embarrass you if you make a mistake. Temini are a requirement on every exam. She grades these generously as long as you are consistent with tenses. The class is a lot of fun. It's easy to attend class in the morning.",
        "course": "ITAL103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great, funny and connected me with study abroad",
        "course": "ITALI101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was an excellent professor.  Very funny and she is extremely helpful and understanding.",
        "course": "ITAL101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.2,
    "department": "Italian",
    "firstName": "Carla",
    "id": "VGVhY2hlci0xMjI4NzA2",
    "lastName": "Wysokinski",
    "legacyId": 1228706,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "My class was a hybrid. Half online/half in class. So basically I got an A. Which if you do the math, I didn't deserve. I should have had a B+. She rounds up usually about half a letter grade. She's a good teacher. Not much to say for a foreign language class. You have to work to do well and show up to class.",
        "course": "ITALIAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's a great teacher, no matter what class you have her for. You will work in her class, but because of it you do become a better speaker; reader, writer of the language.",
        "course": "ITA104"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Carla was awesome! She made class so much fun and she doesn't grade hard. Her quizzes are easy at first, and they get a little more difficult as the quarter goes on. But overall, she was a great teacher. Take this class with her! She's super fun and loves to teach.",
        "course": "ITAL202"
      }
    ],
    "SEI": [
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "26026",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "26028",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "26029",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "36074",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.25"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "36581",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "36582",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "28455",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "3"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "29229",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "29230",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "29232",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "29233",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "33480",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "29242",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "35483",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "22525",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "22526",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "22524",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "24047",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "24048",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "23527",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "36422",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "36424",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "22576",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "23355",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "23356",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "2.67"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "22577",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.57"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "23363",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "22578",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "23367",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "23368",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "26952",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "3"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "37936",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "3"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "26670",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "26955",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "26956",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "28219",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "28211",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1101.71",
        "Class Name": "Italian Distance Learning I",
        "Class Number": "28750",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "28755",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1102.71",
        "Class Name": "Italian Distance Learning II",
        "Class Number": "34996",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "28756",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "ITALIAN",
        "Catalog": "1103.71",
        "Class Name": "Italian Distance Learning III",
        "Class Number": "28757",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "French & Italian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Italian",
    "firstName": "Loren",
    "id": "VGVhY2hlci0xNzU1OTI3",
    "lastName": "Valterza",
    "legacyId": 1755927,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Professor Valteza was a really nice teacher. He was quite involved with his lecturing. It's impossible not to get an A in his class.",
        "course": "LIT2051"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Had about 2 tests/quizzes and one paper the whole year. he does attendance by having you write the answer of a \"daily question\" funny and witty and really helpful",
        "course": "ITAL2051"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is an easy professor, and I actually enjoyed going to his class. You need to participate, but he makes it easy to do that. Tests are very easy as long as you study a little bit for them. I would definitely recommend him for any italian class he teaches!",
        "course": "ITL3223"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Camilla",
    "id": "VGVhY2hlci0xMTEzNDI4",
    "lastName": "Zamboni",
    "legacyId": 1113428,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. Assigns a consistent yet manageable workload, which is necessary for learning a new language.  All expectations are very clear and if you just do the work and she will give you an A. She is very energetic, engaged, and enthusiastic about sharing the Italian language. She is very kind and alway willing to help.",
        "course": "ITAL101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a great instructor. Very interested in teaching and helping out her students. Communicated subject matter clearly. One of the best Italian teachers I've had. I recommend her if she is available!",
        "course": "ITAL104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ITAL101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Camilla does her best to keep the class interesting, and can easily relate to her students on a level that can leave you laughing each class. She is also very good on explaining when you make a mistake, and not moving on until she's sure you understand.",
        "course": "ITAL102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.1,
    "department": "Italian",
    "firstName": "Sandro",
    "id": "VGVhY2hlci05NTg1OTk=",
    "lastName": "Sessarego",
    "legacyId": 958599,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "great prof!",
        "course": "SP401"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sandro is great! The class was interesting: we talked about the World Bank, FMI, NAFTA, etc. If you need help, he is always available. I recommend this professor:)",
        "course": "SPAN406"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "easy class, but does not bring a whole lot to the table. the class didn't seem to take him seriously. do all of the homework.  very nice guy though.",
        "course": "SPAN406"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great TA, very helpful y guapo.",
        "course": "SP401"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hes cool.",
        "course": "SPAN401"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Sandro is by far the worst Spanish teacher I have ever had. He did not bring anything to the table as a teacher and simply skimmed over his useless PowerPoint presentations every single class. I never learned anything useful from him. I got a decent grade in the class because I studied for the tests, did the homework and never missed a class.",
        "course": "SPAN404"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Sandro is a very good teacher, and really made Spanish pronunciation interesting. Tests aren't too hard, and we have a good review before them. He collects the homework but you get the points if you've done it, and its very easy. I would HIGHLY recommend this professor. Oh, and he's very attractive  :)",
        "course": "SPAN404"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sandro is very nice and very helpful.",
        "course": "ITAL101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great TA.  Overall the class was a lot of fun.  Sandro is a laid back, down to earth guy who is a pleasure to be around.",
        "course": "ITA101"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "ITA101"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "ITA101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3,
    "department": "Italian",
    "firstName": "Charles",
    "id": "VGVhY2hlci03NzY3ODQ=",
    "lastName": "Klopp",
    "legacyId": 776784,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "His classes are completely boring and useless. He speaks about what he cares, which is not what is helpful for us. He's nice and kind, but very egocentric and self-centered,never lets students talk and always intterupts students while they're talking!",
        "course": "ITA628"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Class was interesting.  He was kind of harsh with you at times if you got something wrong.  Funny guy though-",
        "course": "ITAL202"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really wants students to do well and is always there if you need help. He's also really enthusiastic about his class and his tests are pretty easy.",
        "course": "ITAL420"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I thought that he was very interesting and informative, and that he is really concerned that students do well in his class. He even offered to buy my whole class a cup of coffee after class one day so that he could get to know us better. How can you not like that&#63;",
        "course": "ITAL420"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He does not explain things well, his tests are impossible, It was the worst class that I took in my 4 years at OSU.  He does not care about his students and just babbles on the whole entire class time and it has nothing to do what is on the exams.",
        "course": "152"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class was really interesting and he gave alot of info. on Italy that really kept me interested in the class. You read a****load of books and doesn't really go over any of them in class. His tests were alright but you have to be prepared in that class and make sure you go to class regularly!",
        "course": "ITALIAN152"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Italian",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0xNDQ3ODY4",
    "lastName": "Titer",
    "legacyId": 1447868,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lizzy is a great professor! She explains everything really well and is really energetic when she teaches",
        "course": "ITAL101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Italian",
    "firstName": "Eleonora",
    "id": "VGVhY2hlci0xMjA0MzU1",
    "lastName": "Boscolo Camiletto",
    "legacyId": 1204355,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great, easy to understand and a native speaker of Italian. Learned a lot with her!",
        "course": "ITAL102"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "IT101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.8,
    "department": "Italian",
    "firstName": "Audrey",
    "id": "VGVhY2hlci0xMjU4MjQ3",
    "lastName": "Martinko",
    "legacyId": 1258247,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really like Audrey. I had her for Italian 102 and 103 and it looks like she'll be teaching my 104, which is awesome! She's so nice and helpful. Learning a new language can be intimidating but she makes it fun!",
        "course": "ITAL103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Adriana is the most fun and helpful teacher I have had here at OSU.  She makes the material so interesting and easy to understand.  She is a great resource and will go far out of her way to help her students.",
        "course": "ITAL102"
      }
    ],
    "SEI": []
  }
]