[
  {
    "avgDifficulty": 3,
    "avgRating": 3.4,
    "department": "Jewish Studies",
    "firstName": "Naomi",
    "id": "VGVhY2hlci0yMzAxNTQx",
    "lastName": "Brenner",
    "legacyId": 2301541,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I was in HEBREW 3705, but there was not an option to choose that course. \n\nProfessor Brenner was very intentional with her feedback on assignments, which made it easier to improve the final project and paper. The lectures were always engaging and she allowed the class discussions to be heavily led by the students. I would definitely recommend her!",
        "course": "HEBREW3704"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Had for Hebrew 3705, but it wouldn't let me select that. Professor Brenner is great, my only complaint is that we had a final paper, final project, and final exam during the University's allotted time. This is overkill for a GenEd class imo. I would definitely just try to find another class.",
        "course": "HEBREW3704"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Brenner clearly conveys course material and is an exceptionally kind, knowledgeable, and inspirational woman. The class structure typically went something like this: short intro lecture, then break into small peer groups to discuss, then come back to the main class to wrap it up. Easy A if you participate in class and read the stories",
        "course": "NELC1125"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Brenner is so caring and intelligent. Her video lectures are very informative and they will help you a lot with your weekly assignments. She is very easy to communicate with, and is very understanding and flexible when it comes to due dates. As long as you reach out to her, preferably prior to deadlines, she will work with you.",
        "course": "HEBREW3245"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "The class is very easy but the professor herself makes it hard to get through the class. She is Jewish and shows her pro-Israeli and anti-free Palestine attitudes toward the class. She was a little racist towards students - mixing up students of color's names. Cares a lot about & records participation. One midterm, one final, and one essay project.",
        "course": "NELC1125"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really enjoyed Professor Brennan's lectures. She has a very clear speaking voice and is never monotonous. Her written comments on my work were encouraging and her criticisms helpful.",
        "course": "HEBREW3704"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Brenner provides very interesting material and does not grade too hard. This online class is made up of recorded lectures, short weekly discussion boards, short weekly writing assignments, mastery quizzes, and two projects. If you watch the lectures and do the reading you should have no problem getting an A. ",
        "course": "HEBREW3704"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "Way too much for a GedEd class. I'm a full-time RN, and I just want to tell this professor that the LAST thing I want to do is subjectively interpret the bible, art, etc. Some of the material is inappropriate in my opinion. I took this course hoping to learn, but all it is is heavy abstract thinking. I'd drop it if my scholarship wasn't affected",
        "course": "HEBREW3704"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Israeli Film, Asynchronous, Art GE. Overall, a very interesting class that goes over film, Israeli history and a variety of Israeli films, 1 movie per week. Consistent workflow with a midterm and final projects. Asthe class was asynchronous Professor Brenner worked to accommodate students as muchas possible by hosting in-person and zoom discussions",
        "course": "JEWSHST3245"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took this class for my history GE and it was ridiculous. WAAAYYY too much work, do not take if you're looking for an easy GE. Work is graded extremely subjectively and she has some sort of an issue with giving out 100%s, even if you follow her rubrics to an absolute T. Would not recommend.",
        "course": "JEWSHST2201"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Everything in this class in graded subjectively. If she doesn't like your argument, you won't get a good grade. For a gen ed, it is way too much reading and writing.",
        "course": "JWSHSTDS2201"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "She's a nice person, but gives ridiculous homework assignments. This includes a cooking assignment, which is not the easiest thing for a college student living in a dorm. She also keeps students a few minutes after class ends. It would be nice if there was more consideration of our time. If you're looking for an easy gen ed, avoid her class.",
        "course": "JEWISHST2201"
      }
    ],
    "SEI": []
  }
]