[
  {
    "avgDifficulty": 3,
    "avgRating": 3.4,
    "department": "Jewish Studies",
    "firstName": "Naomi",
    "id": "VGVhY2hlci0yMzAxNTQx",
    "lastName": "Brenner",
    "legacyId": 2301541,
    "numRatings": 12,
    "summary_comment": "Professor Brenner is known for her engaging lectures and intentional feedback, which helps students improve their assignments. She encourages student-led discussions and provides clear, informative materials. However, some students find the workload excessive, particularly the combination of a final paper, project, and exam, and have concerns about her teaching style and potential bias.",
    "summary_comment_short": "Professor Brenner is known for her engaging lectures and intentional feedback, which helps students improve their final projects and papers. Her teaching style encourages student-led discussions and provides clear, structured class sessions, though some students find the workload, including multiple assignments and exams, to be excessive for a general education class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I was in HEBREW 3705, but there was not an option to choose that course. \n\nProfessor Brenner was very intentional with her feedback on assignments, which made it easier to improve the final project and paper. The lectures were always engaging and she allowed the class discussions to be heavily led by the students. I would definitely recommend her!",
        "course": "HEBREW3704"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Had for Hebrew 3705, but it wouldn't let me select that. Professor Brenner is great, my only complaint is that we had a final paper, final project, and final exam during the University's allotted time. This is overkill for a GenEd class imo. I would definitely just try to find another class.",
        "course": "HEBREW3704"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Brenner clearly conveys course material and is an exceptionally kind, knowledgeable, and inspirational woman. The class structure typically went something like this: short intro lecture, then break into small peer groups to discuss, then come back to the main class to wrap it up. Easy A if you participate in class and read the stories",
        "course": "NELC1125"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Brenner is so caring and intelligent. Her video lectures are very informative and they will help you a lot with your weekly assignments. She is very easy to communicate with, and is very understanding and flexible when it comes to due dates. As long as you reach out to her, preferably prior to deadlines, she will work with you.",
        "course": "HEBREW3245"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "The class is very easy but the professor herself makes it hard to get through the class. She is Jewish and shows her pro-Israeli and anti-free Palestine attitudes toward the class. She was a little racist towards students - mixing up students of color's names. Cares a lot about & records participation. One midterm, one final, and one essay project.",
        "course": "NELC1125"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really enjoyed Professor Brennan's lectures. She has a very clear speaking voice and is never monotonous. Her written comments on my work were encouraging and her criticisms helpful.",
        "course": "HEBREW3704"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Brenner provides very interesting material and does not grade too hard. This online class is made up of recorded lectures, short weekly discussion boards, short weekly writing assignments, mastery quizzes, and two projects. If you watch the lectures and do the reading you should have no problem getting an A. ",
        "course": "HEBREW3704"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "Way too much for a GedEd class. I'm a full-time RN, and I just want to tell this professor that the LAST thing I want to do is subjectively interpret the bible, art, etc. Some of the material is inappropriate in my opinion. I took this course hoping to learn, but all it is is heavy abstract thinking. I'd drop it if my scholarship wasn't affected",
        "course": "HEBREW3704"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Israeli Film, Asynchronous, Art GE. Overall, a very interesting class that goes over film, Israeli history and a variety of Israeli films, 1 movie per week. Consistent workflow with a midterm and final projects. Asthe class was asynchronous Professor Brenner worked to accommodate students as muchas possible by hosting in-person and zoom discussions",
        "course": "JEWSHST3245"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took this class for my history GE and it was ridiculous. WAAAYYY too much work, do not take if you're looking for an easy GE. Work is graded extremely subjectively and she has some sort of an issue with giving out 100%s, even if you follow her rubrics to an absolute T. Would not recommend.",
        "course": "JEWSHST2201"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Everything in this class in graded subjectively. If she doesn't like your argument, you won't get a good grade. For a gen ed, it is way too much reading and writing.",
        "course": "JWSHSTDS2201"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "She's a nice person, but gives ridiculous homework assignments. This includes a cooking assignment, which is not the easiest thing for a college student living in a dorm. She also keeps students a few minutes after class ends. It would be nice if there was more consideration of our time. If you're looking for an easy gen ed, avoid her class.",
        "course": "JEWISHST2201"
      }
    ],
    "SEI": [
      {
        "Subject": "HEBREW",
        "Catalog": "3245",
        "Class Name": "Israeli Film & Society",
        "Class Number": "34177",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.88"
      },
      {
        "Subject": "HEBREW",
        "Catalog": "3704",
        "Class Name": "Women in the Bible and Beyond",
        "Class Number": "33221",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "22",
        "Rating": "4.95"
      },
      {
        "Subject": "HEBREW",
        "Catalog": "3245",
        "Class Name": "Israeli Film & Society",
        "Class Number": "34207",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.59"
      },
      {
        "Subject": "HEBREW",
        "Catalog": "3704",
        "Class Name": "Women in the Bible and Beyond",
        "Class Number": "33378",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "21",
        "Rating": "4.81"
      },
      {
        "Subject": "HEBREW",
        "Catalog": "3245",
        "Class Name": "Israeli Film & Society",
        "Class Number": "27560",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.75"
      },
      {
        "Subject": "JEWSHST",
        "Catalog": "2201",
        "Class Name": "Introduction to Jewish Culture, Thought, and Practice",
        "Class Number": "34213",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.92"
      },
      {
        "Subject": "JEWSHST",
        "Catalog": "3245",
        "Class Name": "Israeli Film & Society",
        "Class Number": "34178",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.83"
      },
      {
        "Subject": "JEWSHST",
        "Catalog": "3704",
        "Class Name": "Women in the Bible and Beyond",
        "Class Number": "33219",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "15",
        "Rating": "5"
      },
      {
        "Subject": "JEWSHST",
        "Catalog": "3245",
        "Class Name": "Israeli Film & Society",
        "Class Number": "34210",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.88"
      },
      {
        "Subject": "JEWSHST",
        "Catalog": "3704",
        "Class Name": "Women in the Bible and Beyond",
        "Class Number": "33379",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "JEWSHST",
        "Catalog": "3245",
        "Class Name": "Israeli Film & Society",
        "Class Number": "27562",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.71"
      },
      {
        "Subject": "NELC",
        "Catalog": "1125",
        "Class Name": "Stories of the Middle East and South Asia",
        "Class Number": "34214",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.94"
      },
      {
        "Subject": "NELC",
        "Catalog": "1125",
        "Class Name": "Stories of the Middle East and South Asia",
        "Class Number": "27566",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Near Eastern Languages/Culture",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "34",
        "Rating": "4.53"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.7,
    "department": "Jewish Studies",
    "firstName": "Lynn",
    "id": "VGVhY2hlci0yMDc2NzI0",
    "lastName": "Kaye",
    "legacyId": 2076724,
    "numRatings": 5,
    "summary_comment": "Professor Kaye is highly regarded by many students as an excellent and knowledgeable instructor who encourages active participation and thorough engagement with the material. While some find the workload demanding and the class structure rigorous, particularly emphasizing the importance of participation, the consensus is that her dedication to student success and clear grading criteria lead to meaningful learning experiences and satisfactory grades.",
    "summary_comment_short": "Professor Kaye is highly regarded for her dedication and knowledge, with many students praising her engaging teaching style and high expectations. She emphasizes active participation and thorough preparation, which, while demanding, are seen as essential for academic success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kaye is one of my all time favorite professors. Theres a lot of homework, but that is only fair since it was a 5000 level course, and it was still very manageable. Youre required to participate, but shell make sure everyone gets a chance to speak multiple times per class. Shes overall a great professor who cares about her students success.",
        "course": "HEBREW5100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Didn't learn a whole lot but she is a nice professor. Tries to grade fairly. Make sure you speak up in class or else you will get a poor participation grade.",
        "course": "JEWHST2201"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Don't take this class. This was probably the most boring and useless class I've ever taken. Didn't learn anything. I still got a good grade, but she basically makes up your grade at the end of the semester and I know several people got burned. Attendance is part of your grade but you don't get any points by showing up to class. Must participate",
        "course": "JEWHST2201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Kaye is an amazing professor. However, don't expect to go into this class, sit in the back,  be quiet, and get an easy A. She requires participation and WILL call on you if you do not actively participate. I feel like I've learned so much from this class. Work hard, listen to her advice, participate, and you'll get a good grade.",
        "course": "HEB2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Kaye is probably my favorite professor. She is extremely knowledgable, and makes you interested in the subject! She instructed my second writing GE. Her class required a lot of homework, but it was well worth it. If you are willing to put in hard work, she is a good professor for you. She gave me great feedback.",
        "course": "HEBREW2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.8,
    "department": "Jewish Studies",
    "firstName": "Michael",
    "id": "VGVhY2hlci0yMDA0MTc5",
    "lastName": "Biggerstaff",
    "legacyId": 2004179,
    "numRatings": 4,
    "summary_comment": "Professor Biggerstaff excels in faith-based and ancient history classes, offering extensive knowledge and multiple perspectives while maintaining high standards and availability. However, his courses can be demanding, with long lectures and challenging exams, though he is highly recommended for those deeply engaged with the subject matter.",
    "summary_comment_short": "Professor Biggerstaff excels in faith-based and specialized subjects like ancient history and Jewish studies, providing extensive resources and support while challenging students effectively. However, his courses can be demanding with long lectures and tricky exams, and may not be as interactive or recommended for general education credit.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Biggerstaff is wonderful for any faith based class, bringing in lots of perspectives and being extremely helpful and available to all students. If you are at all interested in ancient history or Jewish studies, he is an amazing resource for those ends. He certainly forces you to work, but is straightforward with exams and quizzes.",
        "course": "HEBREW2703"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Michael is very passionate and knowledgeable about teaching, and if you are taking a class where you really are interested in learning the material, he really nurses that well. He is very very nice and is always more than willing to meet with people or groups. Very reliable and interesting. Learned a lot from this class.",
        "course": "HEBREW2700"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "For a GE course, the workload is excessive. He knows the material like the back of his hand, but his lectures are long-winded, exams are tricky to study for, and the class is not very interactive. I would hesitate to recommend this course or instructor.",
        "course": "2700"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "I appreciated Mr. Biggerstaff's passion for the material. However, this was one of the most difficult courses I have taken in my four years at OSU, which was unexpected, given that this is only a 2000-level course. I would not recommend this course (with this professor) to anyone with a full course load or little interest in the material.",
        "course": "HEBREW2700"
      }
    ],
    "SEI": []
  }
]