[
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.8,
    "department": "Journalism",
    "firstName": "Dan",
    "id": "VGVhY2hlci0xNzY5NjU=",
    "lastName": "McDonald",
    "legacyId": 176965,
    "numRatings": 80,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "It's online, so he pushes for you to watch the lectures. I watched them in clumps when I had  time/felt like it, but you could probably get by without as long as the material makes sense. For my class there was only three assignments, all essays. The exams were also essays, and you had a lot of time to get it done. Pretty easy class.",
        "course": "COMM1101"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "This was an online class and TAs grade heavy they look for specific things and aren't always clear on what they want from you. His online lectures are really boring! I've fallen asleep several times and had to re-watch things:/ the assignments and grades are worth so much exams (250pts) & you have one assignment worth 150 if you can avoid, do so!!",
        "course": "COMM1101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "So this was an online class, there was two exams that were just papers, extremely easy. And three assignments that were just subjective. Easiest class I've taken at OSU and he seems like he loves the class.",
        "course": "COMM1101"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "McDonald was a hilarious guy, and his assignments were pretty easy. Plus he gives out TONS of extra credit. However, his tests are astronomically unreasonable. The material on the tests did not match up with anything we studies on the slides or in the book. I'm pretty sure he told our class that he took the final himself and got a 79%,",
        "course": "COMM1101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Lots of endearing dad jokes. Great class.",
        "course": "COMM1101"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dan is a nice guy with a dorky sense of humor, but he makes an otherwise easy class hard to get an A in.  If you are not a Comm major and just looking for an easy A like I did, you shouldn't pick this class.  He had 3 writing assignments, and I couldn't get higher than an 86 no matter how hard I tried.  Lectures are also pretty boring.",
        "course": "COMM1101"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dan is a nice guy. He really wants to help his students do well. He gives a lot of extra credit, but in the end, it doesn't do much. He has three writing assignments, 10 videos you have to watch and do questions, and two exams (a midterm and a final). The final is not cumulative & each exam has a take home portion (paper) & you have a week to do it",
        "course": "COMM1101"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "He's a nice guy who gives A TON of extra credit. But, his lectures are usually boring and make you sleepy. The class is easy to skip because full notes are posted online. The lectures and lecture notes are simple and easy to follow along with, but the exams are very detailed and specific. There's a big disconnect between his lectures and his exams.",
        "course": "COMM1101"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "McDonald is a nice and hilarious lecturer. However, his lecture style was very unorganized and unhelpful. His test are unreasonable as well. He tells you to study the lecture slides, then the test ends up being over material that was never mentioned in class.",
        "course": "COMM1101"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great teacher! Don't need to show up to class. Notes are given online. The test in class was tough. Definitely read your book and notes before the test. The written part of the test is take home. Other then that really easy. ",
        "course": "COMM 1101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took this class online, and it was set up as every online class should be. The deadlines weren't flexible, however, you had all the dates laid out for you from the start and they were perfectly spread out. Only four exams and four assignments due I believe. Any questions I had, Mcdonald responded attentively to each and every email. Great and easy!",
        "course": "COMM1101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class online, and I would highly recommend it. It's an easy A and a GE with very minimal work. Three assignments and two exams. The TAs are especially helpful. The deadlines on assignments varied from the syllabus, so WRITE ALL THE DUE DATES DOWN.  The book is also helpful for reference during exams. Relatively interesting course too.",
        "course": "COMM1101"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "The lectures are all posted online and therefore not mandatory to attend. There were 3 exams and 3 assignments and those are the only grades for the class. I missed one part of one assignment and it severely hurt my grade. ",
        "course": "COMM1101"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very knowledgeable and enthusiastic.  Makes plenty of endearing bad jokes and you could feasibly pass this class with minimal attendance",
        "course": "1101"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good lord this class is a joke.  A's for days.",
        "course": "3163"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "Super confusing. He is an extremely nice guy, but had tons of issues understand what I needed to study for an exam. He still is adjusting to the switch from quarters to semesters. If the textbook was better, it would have been super beneficial. Take this course him online, so you can replay concepts because he moves really fast in live lectures.",
        "course": "COMM1101"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "the tests are OPEN NOTES, OPEN BOOK. if people say he's hard they were probably busy snapchatting during lecture rather than writing things down. mcdonald is almost too easy, he went painfully slow sometimes. but if you need an easy A for a class, he's perfect",
        "course": "COMM1101"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "The questions on the exams have to do with the most minor things he talked about during lecture. Most of the questions are little things that are unimportant to the subject matter being taught. He is, all in all, a horrible professor. Stay away from his class if at all possible. He rambles in lecture about nothingness.",
        "course": "COMM1101"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 2,
        "comment": "Go to lecture because about 20% of the exams have questions you would only know if you went to lecture. He posts lecture outlines and  pdfs on carmen, but his lectures contain additional info. He tends to go quickly through slides with information that will be on exam. Try to write everything down on all slides. Anything on the slides is fair game.",
        "course": "COMM101"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class is not an easy A at all. The assignments are definitely easy A's but the exams are next to impossible as he does not teach well at all and his exams are very wordy and confusing. Do not expect a walk in the park. It's not fun or easy.",
        "course": "COMM101"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "I aced this class with ease, and he's a very nice and funny guy, but to be honest, it just seems like he doesn't give a crap. He ends classes sometimes an hour and fifteen minutes early, pretty much tells you what's gonna be on exams and grades projects very easily. If you're looking for an easy A, he's perfect, if you're looking for substance, no.",
        "course": "COMM463"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "His lectures are somewhat dry but, he is hilarious. There's not much to get out of the class to begin with and he keeps lessons short. The class has a 2 hour time slot and most classes last an hour. I suggest going to class as he puts lecture items on the tests. The few short required papers are somewhat off topic, but do the work and you'll pass.",
        "course": "COMM101"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 1,
        "comment": "I am a graduating senior and this class is the most horribe class I've ever taken at OSU. He is disorganized, off topic, and dry. If you want an easy A take this class, but don't expect to learn anything. It is like Mr. Magoo is running the lectures. Total waste of time.",
        "course": "COMM101"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class to get an A in but u will gain nothing after this class is over. Go to class b/c sometimes he adds stuff to the online notes durng lecture that appear on exams. He always ends class early(about45 mintues to an hour). There are papers that have nothing to do with the class, but if you meet the length requirements, then U get full credit.",
        "course": "COM101"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easiest course I've had in a while. Just go to lectures and you'll get an A in the class. I never even opened the book, so don't bother. Tons of Xtra credit points available (about 40 points). Good teacher and good GEC to get an A in.",
        "course": "COMM101"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor lectures about things irrelevant to the topic. test questions often pertain to things about him, which no one thinks to write down because they seem pointless at the time. his test questions have more to do with what was said in class than the notes posted or than the book. write down useless facts and details in lecture. GO TO CLASS",
        "course": "COMM101"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 2,
        "comment": "Professor McDonald's lectures can be difficult to follow and very dry, but he means well and he is willing to help if you meet with him. I had him for Comm 101 as well, this class was easier and more interesting. The lecture material was boring but the group project was interesting. I would take his class again.",
        "course": "COMM463"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "I liked this class and the prof. He likes to make suttle jokes throughout lecture. I felt bad for him at times though because no one really laughed at his jokes. So be nice and laugh! Lectures can be boring but his unexpected comments are fun. I would go to class b/c he will put questions on the exams that you will only know if you were there.",
        "course": "COMM101"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "Not as easy as some of the earlier reviews make it seem. As long as you put effort into assignments, you should get full credit on them. Tests require a lot of memorization. There's a lot of XC opportunities, be sure to take advantage of them. Go to class because he adds a lot to the notes and those tend to show up on the tests, Good prof though",
        "course": "COMM101"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 3,
        "comment": "Averages on exams were C's - so not a walk in the park. Notes were vague and he would test over really stupid, irrelevant things at times. You can earn ~4.5% extra from EC. The lectures were generally sort of interesting. He cares about students so APPROACH him early if you need help. TA's are sort of useless.CI Assignments - Like everyone gets 100",
        "course": "COMM101"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 3,
        "comment": "The lectures aren't all that exciting but if you have the right sense of humor, you'll be laughing at him the whole time. The papers you write are easy, just meet the required length. There are tons of extra credit opportunities. The tests are kind of hard because people can submit their own questions so some are easy and some are rediculous.",
        "course": "COMM101"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "Funniest teacher I have ever had! I go to class just for all the jokes he cracks. I look forward to his class which is more than I can say for any of my other professors. Easy class, easy tests, just have to go to class so you dont miss any extra notes or laughs!",
        "course": "COM101"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Offers extra credit. Entertaining lectures.  Funny guy. Helpful. Lets every lecture out early. Notes are online.",
        "course": "COMM101"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 4,
        "comment": "Grade based on three exams and some busywork, but tons of extra credit available. Exams way more difficult than they should be for this course... it's a freshman class, so you're being set up to fail. Do the extra credit and study for the exams. Happy with my grade, but what a waste of time. Professor boring and utterly useless.",
        "course": "COMM101"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "COMM101"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "Real easy, cracks jokes throughout class, goes through notes quickly, you're out of class within an hour most of the time, love him!!",
        "course": "COMM101"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 1,
        "comment": "nice course, pretty easy although sometimes my attention span is short and i would miss little things that would show up on the exam.  his sense of humor is one-of-a-kind...i would tell my friends to go in to one of his lectures for just a few minutes just to get a laugh. very easy, just go to class, take notes-no book reading necessary",
        "course": "COMM101"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is a great teacher, and easy too.  The tests were made up of notes that he gives you as well as things said in class.  He tells you exactly what will be on the exam during lectures, so it is definitely a good idea to go.  He makes it interesting with a slap stick type of humor.  All in all a good easy A class.",
        "course": "COMM101"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class seems like a drag, but it's really worth it in the end.  He is hillarious in a very dry way and you get out of class really early! The exams are easy, he offers a lot of extra credit...it's really easy to get an A! He's awesome...he kind of reminds me of Billy Madison/Adam Sandler! Take this class with him!!",
        "course": "COMM101"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great, easy class",
        "course": "COMM101"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dry humor but he's funny and entertaining. He lets you out of class early. Didn't use the book much and tests are mainly over his lectures from class. He's a cool teacher.",
        "course": "COMM101"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very funny in a lame-joke kind of way. The class was supposed to last over 2 hours, but he usually only made us stay for 45min-1hr. Don't be fooled into never going to class, bc a lot of the test questions are things he says in class, that are impossible to know if you didn't attend. You might as well go, what else do com majors have to do&#63;",
        "course": "COM101"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher - very short but entertaining lectures. All you have to do is look at lecture notes to do well on the exams. A class to take if you need to GEC but don't want to work very hard and at the same time enjoy yourself. Few assignments, all easy.",
        "course": "COMM101"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. McDonald is awesome!! Exams are easy, gives plenty of x-credit, has assignments that are really easy for a good amount of points, and puts the notes on the internet. I do recomend you go to class, because he does include a few questions on midterms/finals that you will only know if you were there. Plus he tells you what to know for the tests.",
        "course": "COMM101"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 1,
        "comment": "eASY CLASS JUST PRINT OUT LECTURES AND READ THEM BEFORE  CLASS IF YOU CAN. HE MAKES A LOT OF JOKES AND AND IS VERY HANDS ON IN HIS LECTURES SO ITS NOT A COMPLETE SNORE. MAKE SURE YOU READ THE NOTES BEFORE YOU TAKE THE EXAM AND THE BOOK DOES HELP ALTHOUGH YOU WONT HAVE TO READ MUCH FROM IT.",
        "course": "COMM101"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "great teacher, not to mention EASY. lets you leave extremely early. notes are printed out, easy to follow, and are consise. Tests are easy. If you are taking Comm 101 and hes teaching HES YOUR MAN.",
        "course": "COMM101"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 1,
        "comment": "just print the notes off of carmen and stay awake during class and you'll be fine. his exams were easy if you studied the notes and at least read over the chapters a little. he's hilarious and always ended the class about an hour early. the paper's were the easiest i've done in college and he gives out a good amount of extra credit.",
        "course": "COMM101"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 3,
        "comment": "pretty funny guy but his test can be a challenge.  if you read the book im sure you will do fine.  lectures can be boring but are really helpful.  the papers are really easy!",
        "course": "COMM101"
      },
      {
        "index": 49,
        "rating": 4,
        "difficulty": 3,
        "comment": "good prof! Really don't need to go to class, Just read lecture notes and the parts of the book that he told us too. He gave 4% extracredit too!",
        "course": "COMM101"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 1,
        "comment": "Professor McDonald's Comm 101 class was really easy as long as you go to class most of the time. You'll get full credit on both of his papers if you simply follow the instructions provided. Also he offered 4% points of extra credit.",
        "course": "COMM101"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really funny in a really goofy way.  Lectures were kind of boring, but nothing to difficult and he always lets class out early.",
        "course": "COMM101"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 2,
        "comment": "great class, I recommend taking it. Don't buy the book just share with someone else. Tests are easy if you go to class...he usually says what will/won't be on the exams. He always lets class out an hour early!!",
        "course": "COM101"
      },
      {
        "index": 53,
        "rating": 1,
        "difficulty": 3,
        "comment": "If u r a guy, then u will likely do well in this class.  A lot of useless facts that he basically regurgitates (sp&#63;) and wants u to memorize. He posted notes the night before and basically read them to u the next day.  I actually bought the book...which was completely useless! Just come to class and don't overthink it!  It's a real no brainer!",
        "course": "COMM101"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's funny in his own dorky way and seemed genuinly interested and good at his area of study. It's not really necessary to go to lecture all the time, but I thought it helped since he puts a lot of &quot;Professor McDonald said...&quot; on his exams. Minimal book use... find someone to share with.",
        "course": "COMM101"
      },
      {
        "index": 55,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is pretty funny on occasion but some of the lectures are sleepers...especially the ones that he gives you all the notes for anyways.  [Hint: He gives all the notes for all the lectures]",
        "course": "COMM101"
      },
      {
        "index": 56,
        "rating": 3,
        "difficulty": 2,
        "comment": "I think he's over-rated. I didn't see him caring that much, or making things all that clear. Took student-submittioned questions and put them on the tests, which was kind of a pain in the ass.",
        "course": "COMM101"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 1,
        "comment": "The easiest class I've taken.  My only problem is that he shows way too many examples during lectures.  Other than that, he's a great professor",
        "course": "COMM101"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 1,
        "comment": "This guy is simply the best teacher at any university period. Talk about a man that cares about his students he is the real deal holy field!",
        "course": "COMM101"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "COMM1636"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class is really easy to begin with, but he makes it even easier by taking all the notes for you. You print them out at home and take them to class. Sometimes, he'll even tell you to circle something, which means it's on the test. The best part is &quot;Ask the Professor&quot; at the start of each class. He makes class fun.",
        "course": "101"
      },
      {
        "index": 61,
        "rating": 4,
        "difficulty": 1,
        "comment": "BORING class, but McDonald is really weird, really nice, and really funny, so it's at least tolerable.  Class is easy, though-- print notes at home, go to class, listen to prof read the notes to you, leave about an hour early.",
        "course": "101"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kept my attention which is a very difficult task! Haha",
        "course": "COMM101"
      },
      {
        "index": 63,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very nice guy, easy class. Gives lots of extra credit opportunities..also continually makes jokes. The lecture isn't boring at all cause he's so random -- probably why he kept my attention.",
        "course": "COMM101"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 1,
        "comment": "He puts notes online which makes it easy to study if you dont go to class. Class is only twice a week and he usually only keeps you for about 45 minutes to an hour. 3 tests which are extremely easy if you go to class and not too bad even if you dont go. Gives students a couple opportunites for extra credit. Really funny guy, easy to approach.",
        "course": "COMM101"
      },
      {
        "index": 65,
        "rating": 3,
        "difficulty": 3,
        "comment": "I didn't do as well in the class as I thought I would.  His exams are easy if you read the notes and attend class.  He likes to put a lot of &quot;Professor McDonald said this in class...&quot; type questions on the exam.  There's no book for the class, there's extra credit available, and there's a mini group project you have to do.",
        "course": "COMM101"
      },
      {
        "index": 66,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is really easy, and he gives a lot of easy extra credit. Class is fairly entertaining and laid back, but sometimes it could use some more structure. Just follow the notes and you'll be good.",
        "course": "COM101"
      },
      {
        "index": 67,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very easy. Prof. McDonald is a funny guy, so go to class for a good laugh. If you do that and read the notes, you'll get an A.",
        "course": "COMM101"
      },
      {
        "index": 68,
        "rating": 3,
        "difficulty": 1,
        "comment": "I went to this class three times.  I went to get the syllabus, to the first review and to the extra credit day and I got an A in the class.  All you have to do is read the lecture notes and make sure you know absolutely everything on those lecture notes and you'll get an A.",
        "course": "COMM101"
      },
      {
        "index": 69,
        "rating": 5,
        "difficulty": 1,
        "comment": "Hillarious, engaging, pretty easy. Makes what otherwise would be a boring GEC/major requirement, makes it entertaining.",
        "course": "COMM101"
      },
      {
        "index": 70,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class as long as you read the notes and go to class. Professor is helpful and gives lots of extra credit opportunities. Like others have said, he's hilarious, but only because he thinks he's funny and really is not.",
        "course": "JCOM101"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 1,
        "comment": "i like going to this class, real easy if you pay attention and get the notes.  really nice, likeable guy because his humor isn't that humorous.  overall, i highly recommend him/this class",
        "course": "JCOM101"
      },
      {
        "index": 72,
        "rating": 5,
        "difficulty": 2,
        "comment": "Funny guy! Easy, but go to class. He shows a lot of movies and gives extra credit but you wouldn't know about them if you didn't go.",
        "course": "JCOM101"
      },
      {
        "index": 73,
        "rating": 5,
        "difficulty": 2,
        "comment": "guy is crazy...",
        "course": "101"
      },
      {
        "index": 74,
        "rating": 2,
        "difficulty": 1,
        "comment": "I wanted to shove my pencil in my eyeball every time I went to that class. Therefore, I never did. Take the notes online. I do recommend going to class, if you can stand his terrible sense of humor, because he does put questions on the test from movies.",
        "course": "101"
      },
      {
        "index": 75,
        "rating": 4,
        "difficulty": 2,
        "comment": "most considerate teacher i have ever had.  class is pretty easy.  he tells you excatly what is going to be on the exams. funny guy.",
        "course": "JCOM101"
      },
      {
        "index": 76,
        "rating": 4,
        "difficulty": 1,
        "comment": "This guy is hillarious bc he is not hilarious but you gots to give him credit bc he tries so hard ... just look at the notes on line and go to class at least once a month and you will pass with a B minimum",
        "course": "JCOMM101"
      },
      {
        "index": 77,
        "rating": 4,
        "difficulty": 1,
        "comment": "Go to class, he explains everything that will be on the exam.",
        "course": "JCOM200"
      },
      {
        "index": 78,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "JCOM"
      },
      {
        "index": 79,
        "rating": 3,
        "difficulty": 1,
        "comment": "Not as funny as he'd like to think he is. Easy class- not boring to say the least. Overall, very decent class.",
        "course": "JCOM101"
      },
      {
        "index": 80,
        "rating": 3,
        "difficulty": 2,
        "comment": "His jokes are not funny.  Print the notes off the internet and skim the book and you should be fine.  The short papers are very easy to BS.",
        "course": "JCOM101"
      }
    ],
    "SEI": []
  }
]