[
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Korean",
    "firstName": "Makayla",
    "id": "VGVhY2hlci0yOTg0MjIz",
    "lastName": "Cherry",
    "legacyId": 2984223,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "All of the Korean professors are fine. They're super understanding  bc and patient and as long as you put some form of effort in, you'll get most of the points. Just know there is a LOT of homework, and you will not do well in class if you don't do the textbook readings. ",
        "course": "1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Korean",
    "firstName": "Yeonjin",
    "id": "VGVhY2hlci0zMDYxODM2",
    "lastName": "Yun",
    "legacyId": 3061836,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Yun is a sweet lady and very enjoyable to have!",
        "course": "KOREN4101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.6,
    "department": "Korean",
    "firstName": "Yonsoo",
    "id": "VGVhY2hlci0yNjM2Mjc3",
    "lastName": "Kang-Parker",
    "legacyId": 2636277,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely LOOOVEEE Kang ssn. She's so incredibly kind and caring and makes sure you feel comfortable. Honestly she has mom vibes. But don't skip class, you will fail. ",
        "course": "KOREAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Kang-Parker is an amazing Korean teacher! I took Korean for two semesters for fun and she really makes sure that you enjoy learning the language. A few caveats are that this class requires you to study the language every day as you would either have to speak the Korean in class (ACT class) or do a vocabulary or grammar (Fact class)!",
        "course": "KOREAN1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is an awesome teacher! For the class, be prepared to study every day. There is some sort of dialogue to memorize, a vocab quiz, or grammar quiz every day in class. It sounds like a lot, but you get used to it quick. This goes for K1101-1103.",
        "course": "KOREAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kang ssn is my favorite teacher. She does so much to help her students succeed. I always look forward to her class.",
        "course": "KOREAN1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I've been a student of Professor Kang's for 3 semesters now and she is truly a great person who genuinely cares about students. As long as you have studied and are clearly trying your best, she will be lenient. She's always open to help, in or out of class. She's very kind which lessens anxiety during lessons. I'm happy to have her as my professor!",
        "course": "KOREAN1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Kang is a genuinely nice person and a great professor! She clearly cares about her students and wants us to learn as much Korean as we can. She's very lenient on the ACT grading, as long as you try your best. I found her explanations of grammar points easy to understand. She's always happy to spend extra time answering Korean questions.",
        "course": "KOREAN1102"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Knag ssn is a nice person; she just does not know how to teach. The way she teaches grammar is by reading slides that you can find on the kleartextbook website. ACT classes, she doesn't know how to deliver what she wants you to say. Korean at OSU focuses on getting graded every day on speaking(anxiety alert) rather than learning Korean",
        "course": "KOR2021"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.8,
    "department": "Korean",
    "firstName": "Han Gil",
    "id": "VGVhY2hlci0yNDkxMDAz",
    "lastName": "Kim",
    "legacyId": 2491003,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Kim is a great instructor &#8212; he's informative, goes into more depth about complex grammar, and is proactive about answering questions. He's also really funny at times. However, his ACT classes are nerve-wracking. He isn't mean or anything, but he'll put you on the spot and doesn't really offer any help as you struggle to answer something.",
        "course": "KOREAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Kim ssn is one of the few (Korean class) professors that truly cares about their students learning progress. Get ready to be challenged at his act classes! However, he is very helpful outside of the class. My advice is to ask him to explain grammar to you after class because the way he explains is very easy and clear.",
        "course": "KOR1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really good professor. Out of the four professor we had for this course, he was easily my favorite. Humorous, but makes sure you are learning while also being just a really personable guy. Homework isn't too bad, considering it's a language course and requires consistent study. Lenient grader.",
        "course": "KOREAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mr. Kim was an enjoyable professor-while maybe a little strict at times. He wanted his students to truly understand and embrace the concept of learning the Korean language. He is also a very humorous instructor and good at communicating answers. I really enjoyed having a class with him.",
        "course": "K1102"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is very funny guy. Love teaching his student i think...... He speaks korean with Busan dialect which is funny but he tries very hard to speak normally which is very good. I hope other student enjoy his class since it is very interesting and interactive.",
        "course": "KOREAN1101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Han Gil is a funny guy who cares about his students learning Korean. Like really, really cares. He sometimes grades a little harsh and is sometimes intimidating, but all in all, he's a good teacher. Also, if you get on his bad side, he might roast you in front of the class for not having a girlfriend.",
        "course": "KOREAN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Korean",
    "firstName": "Hyun Jin ",
    "id": "VGVhY2hlci0yOTg0MjIy",
    "lastName": "Lee-Miller",
    "legacyId": 2984222,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lee sonsangnim is one of the best professors at OSU. She is very clear and very knowledgeable. Any question you have, she will always have an answer to it. She grades extremely fairly and will always help you to understand if you need clarification or make a mistake. ",
        "course": "KOREAN2102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.2,
    "department": "Korean",
    "firstName": "Pil Ho",
    "id": "VGVhY2hlci0yMTk4ODI4",
    "lastName": "Kim",
    "legacyId": 2198828,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. Kim's classes are very lecture heavy, however hes a very easy grader. If you enjoy learning about Korean history and culture this class is perfect. Personally, I greatly enjoyed it, however some of my friends who had no interest in learning about the topic thought it was boring.",
        "course": "KOREAN2231"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Mr. Kim was a good professor, but his lecture style can be quite boring. I'm unsure if this is a fault of the material or his presentation of such, but regardless it made coming to class feel like a chore. He gives detailed quizzes, so be ready to remember the dates and small details from the assigned stories. I'd recommend different lit for GE req",
        "course": "KOREAN2451"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great and interesting time in class! A pretty lecture based class with some reading and occasional viewings, but nothing too crazy. Love Kim as a professor, he is knowledgeable in the material and is not afraid to show a bit of sass. Highly recommend, even for non-Korean studies students! Attendance counts, quizzes are not difficult if you study!",
        "course": "KOR2231"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "He didn't make study guides or tell us what the planned quizzes were gonna be on, so we had to guess. Having pop quizzes made this even more difficult. Take really detailed notes during his lectures, or you will not do well. The class was ok on an interesting-ness scale. The group project was fun, the class would be better if it was less quizzes.",
        "course": "KOREAN2231"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really great Korean professor. If you are minoring, majoring, or even just taking Korean you will definitely have him at one point. Incredibly intelligent and helpful. Out of all the Korean teachers he is the hardest grader and has the highest expectations of the students, both in language and culture classes.",
        "course": "KOREAN2231"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.5,
    "department": "Korean",
    "firstName": "Danielle",
    "id": "VGVhY2hlci0yNjA4NTMw",
    "lastName": "Pyun",
    "legacyId": 2608530,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Pyun is hands down one of the best professors as OSU and I feel very lucky to have her as the head instructor for my major. She's incredibly kind and funny, and genuinely cares for her students. She's lenient and good at explaining concepts you don't understand. She organizes the whole Korean program, which must be hard but she excells!",
        "course": "KOREAN1102"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Ms. Pyun is a great person and truly cares for her students, but the lectures in Elementary Korean Culture were mind-numbingly boring. Many, including me, would show up and half-listen while completing other classes' homework. Almost all the testing content came from readings, so the lectures seemed pointless.",
        "course": "KOREAN2231"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "As a continuation of Korean 1101, Ms. Pyun was great in keeping students engaged with the language with useful feedback, cultural context, and a caring environment. She genuinely wants her students to succeed and will work with you if you need additional help.",
        "course": "KOREAN1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "With the Korean 1101 class, we had four professors. Pyun was by far my favorite as she showed a passion for teaching and taught in a way that allowed you to have fun while learning the basics of Korean. She gave great feedback and cares immensely for her students' success.",
        "course": "KOREAN1101"
      }
    ],
    "SEI": []
  }
]