[
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.2,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Lauren",
    "id": "VGVhY2hlci0yMzUyNjI5",
    "lastName": "Edwards",
    "legacyId": 2352629,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Edwards rocks. Period. Shes incredibly smart and always open to hearing what her students have to say. Her lectures are fantastic, even at 8am. Id love to take more of her classes! Not a lot of homework!",
        "course": "CRPLAN3500"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "I really liked this class, but didn't love the way the online content was structured. She heavily emphasized participation and dinged us heavily if we didn't have our cameras on during Zoom sessions. She also was hard to reach via email and didn't answer any emails I had on the course. She is super super passionate, kind, and knowledgeable",
        "course": "CRP3500"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "I loved this class. Professor Edwards was pretty cool she expects you to do your work and participate during class. I loved this classes content and it helped me choose city planning as my major!",
        "course": "CRPLAN3500"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very kind person to have as a professor. Lots of discussions and readings, but this class is a solid choice for anyone looking into planning or social justice.",
        "course": "CRPLAN3500"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "She cares a lot about her students, her subject matter, and the city of Columbus. I took this as a GE, and it was my favorite class. It's incredibly easy with a take-home midterm and a group final project. You do have to attend the class for points, but it's well worth the while!",
        "course": "CRPLAN3500"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors! She's so knowledgable &amp; makes a boring class really interesting and fun, and I've learned a lot. One of those profs you wish you could hang out with outside of class. Attendance is mandatory. There readings due once a week, and reflections due every other week, with a take home midterm and a presentation as a final.",
        "course": "CRPLAN2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.3,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Karla",
    "id": "VGVhY2hlci0yNjI3ODQ4",
    "lastName": "Trott",
    "legacyId": 2627848,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Feedback seemed good and plenty in the beginning but she would flip flop and forget the feedback she gave. Instructs you to do one thing and then berates you for doing it the next class period. It seems like this studio was stuck between giving freshmen creative freedom and strict guidelines. There were NO grading criteria laid out.",
        "course": "ARCH2310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I really liked this class, but being online made it a lot different (3 hour zoom course). There were three projects that weren't too difficult, but you had to put a lot of time in each of them. Karla and the GAs were always there to give feedback and were very helpful. She seemed to genuinely care about her students and the course in general.",
        "course": "ARCH2310"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The only thing I want from Karla Trott is to be able to Trott right out of her class",
        "course": "ARCH2300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Justin",
    "id": "VGVhY2hlci0yMzUyNjMz",
    "lastName": "Goodwin",
    "legacyId": 2352633,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "The level of difficulty depends on your experience with the programs. The tutorials are short &amp; not very helpful, so you kinda just figure it out on your own. They spend A LOT of time helping one person, which sucks when they only help like 5 people and there are 35 others waiting. It sucks but I learned A LOT of valuable information overall.",
        "course": "CRPLAN2600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 2.5,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Jesus",
    "id": "VGVhY2hlci0xMDY1MjEw",
    "lastName": "Lara",
    "legacyId": 1065210,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Jesus is knowledgeable of planning and is an ok guy . He can be rude to students and does not give good feedback. His class had a lot of reading and it never really connected to the presentations. The projects he assigned werent specific enough, but he held students to a high standard regardless.",
        "course": "CRPLAN3500"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "The rudest person I have ever met",
        "course": "CRPLAN3500"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "Overwhelming amount of assignments, along with very long readings. I don't believe he lectured once. The class is very discussion based. Somebody is giving a presentation of some sort almost every week. I don't think I learned anything. Very stressful",
        "course": "CRPLAN6430"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "He takes his job way too seriously. He expects everything to be done to his liking, and his opinion was always the correct one. He would call students out if their answers were wrong in class. His slides didn't really say anything and were mish-mashed together from previous lectures. Also, we had A LOT of reading. Overall a bad professor.",
        "course": "CRPLAN2210"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Extremely heavy reading for a 3 credit hour class, tests heavily on things that are explicitly said not to be on exams. Unhelpful and vindictive. Awful.",
        "course": "CRP3100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Tons of readings and presentation, tough grader. Take attendance every class Slides never uploaded, and are mainly consist of pictures so you can't understand by yourself.",
        "course": "CRPLAN2210"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. Lara expects a lot out of you but it's worth it. His material is interesting and it's very clear that he knows so much about it. Doing the readings for every class is pretty important but will help you participate in the way he expects you to.",
        "course": "CRPLAN2210"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interesting guy, he's been everywhere and done everything. You have to take a lot of notes and there are not many points in the class so you have to do good on the few assignments, but a great class over all. My first CRP class and I loved it, and him.",
        "course": "CRPLAN2210"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class was tough. 4 reaction papers, 3 papers making one giant project, another group project, and a final. Lots of readings every night that you MUST be prepared to talk about in class. He pushes you to work hard, he is kind of intimidating but you learn a lot as long as you focus and do your work. Do NOT skip class, your grades will suffer.",
        "course": "CRP2210"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not a good class. Did not learn anything, professor was unhelpful.",
        "course": "CRPLAN3500"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "I would not recommend this class. He does not have clear objectives for the assignments, and makes the students teach. Lots of reading, and he is specific on the exams (even though he said he wouldn't be). Not very nice either, and uses his old lectures that don't connect to the readings or what we're doing. Difficult to understand sometimes, too.",
        "course": "CRPLAN3500"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great addition to the landscape architecture program!!!Professor Lara was not only hot, but brilliant. His knowledge of urban design was impressive. He presented material in a clear, precise and manner. Best studio project so far. He is refreshing, something landscape architecture studies desperately needs!",
        "course": "LARCH457"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "You'll work hard but learn a lot...great prof! one of the best design studios",
        "course": "LARCH457"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 4,
        "comment": "A bad addition to the school. Asks you to find things on your own instead of giving you a blanket of info first. also does not discuss the readings that have been assigned, just gives quizes. students learn more from discussion, not quizes. During desk crits he never gave me ideas on my design, just says to do more or give more detail.",
        "course": "LARCH457"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.4,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Mattijs",
    "id": "VGVhY2hlci0yNDgxMjA4",
    "lastName": "Van Maasakkers",
    "legacyId": 2481208,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took CRP 3300 which was not listed. He is a VERY smart guy, and is very willing to help. Lectures can be hard to follow, and sometimes he is hard to understand because of the advanced language he uses. Tons of reading. Great professor, tough class.",
        "course": "CRPLAN2110"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Nice guy, lots of small group discussion, easy grader if you follow the rubric. Gives feedback in Carmen comments after every assignment. Only bad part of the class is the MULTIPLE 1-2+ mile walks FOR EVERY UNIT so you can \"see the city\" and they never end where they start so you have to find (fund) your own way back",
        "course": "CRPLAN2110"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "I actually had him for 3300, not 6400. I disliked this class. Expectations were always unclear yet he was a very tough grader. Grading was super nitpicky, I always received points off for minor things not mentioned in the rubric. It is almost entirely group work so if your group is bad good luck getting a good grade. ",
        "course": "CRPN6400"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "CRP 3300. Half of the class is focused on a group project with high expectations and minimal guidance. He is willing to talk to you and help, but does contradict himself frequently. Midterm is very difficult. This is one of the harder classes for the CRP major. He does a good job of making class relevant to real life. ",
        "course": "CRPN6400"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "You hear horror stories about the difficulty of the midterm, and it isn't as bad as you think it is. The class is interesting and he brings in guest lecturers throughout the first half of the class. The lab is fine, but can be unforgiving if you are new to the software used. Extra Credit isn't much, but any little bit helps.",
        "course": "CRPN6400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Gala",
    "id": "VGVhY2hlci0yODY0ODQ5",
    "lastName": "Korniyenko",
    "legacyId": 2864849,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cares a lot about her students and is always willing to accommodate different needs. No assignments are super challenging and she is always willing to help. One midterm, and a final project/paper. Optional fieldtrips to cool places around Columbus. Sometimes lectures can be a little boring, but overall a great class. ",
        "course": "CRP2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Korniyenko is highly recommended. The course consists of highly engaging lectures, of which note-taking is crucial for assignments. There are write-ups peppered throughout and an individual semester project in the background (so, no final exam). She is super responsive, helpful, and passionate about what she does.",
        "course": "CRP2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Korniyenko is an incredibly knowledgeable professor who will go out of her way to ensure everyone gains something from the course. She knows that everyone comes from different academic backgrounds and will provide resources to help students grow as individual learners, rather than just to meet the requirements for the class.",
        "course": "CRP2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Saba",
    "id": "VGVhY2hlci0zMDEyODU2",
    "lastName": "Maleki",
    "legacyId": 3012856,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was very nice and supportive. She helped me greatly during class activities and always constructively commented on my assignments. ",
        "course": "CRPLAN-2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.2,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Harley",
    "id": "VGVhY2hlci0yOTc1MTA0",
    "lastName": "Etienne",
    "legacyId": 2975104,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Etienne is a very intelligent professor and clearly knows what he's talking about, but he would rush through every single lecture just for an entire day of class each week to be devoted to needless discussion. The textbook is also not needed at all. The lecture slides are either ripped straight from it or are not even mentioned. ",
        "course": "CRPLAN2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Etienne is such a smart and likable guy, his lectures are very informative, however it can feel a little rushed sometimes. He did not give many grades but the quizzes/final we did have were online and open note so it was not of much concern. He has been very helpful when I have asked him questions and he is funny too.",
        "course": "CRPLAN2000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best prof I've had here at OSU. Very passionate, experienced, and knowledgeable about his field and it shows in his lectures. Assignments are engaging and real world applicable. Available outside of class and very helpful. I switched out of the CRP program but would def take a class with him again.",
        "course": "CRPLAN2000"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof. Etienne is very intelligent, and very passionate about city planning. His lectures were always engaging, but sometimes his instructions were unclear and expectations were too high for an intro class. Great professor, would take again, but sometimes difficult.",
        "course": "CRPLAN2000"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Etienne is a super intelligent guy, but that also means he's super busy. It's hard to catch him outside of class and it often takes him a bit to post files/grades. Other than that, show up to class and participate in discussions, he seems to like creating personal connections with his students. Overall, he's a great guy and professor!",
        "course": "CRPLAN2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "Justin",
    "id": "VGVhY2hlci0yODE3NjI1",
    "lastName": "Parscher",
    "legacyId": 2817625,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Justin Parscher provides interesting lectures which would be far better if they were offered in-person. Because of the online structure and repetitive assignments the class becomes pretty boring near the end of the semester, saved only by the fact that once you earn 93 points you aren't required to complete anymore assignments. ",
        "course": "LARCH2600"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Justin is the only person who could make the history of Landscape Architecture entertaining. Every lecture was interesting and engaging and he cares about his students on a personal level, as well! Excels as a studio professor and as a lecturer. No notes, I would take him for every class if I could!",
        "course": "2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.7,
    "department": "Landscape Architecture & Regional Planning",
    "firstName": "John",
    "id": "VGVhY2hlci0xMDM0NzQ4",
    "lastName": "Simpson",
    "legacyId": 1034748,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Really interesting course, not at all what i expected. Simpson is a super nice guy, albeit a little arrogant. Class discussion was stimulating and lead well, first project was completely superfluous and a little unfair, hated the reading assignments. Otherwise easy.",
        "course": "LARCH597"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Convoluted lectures. Takes forever to make a point. Very passionate about subject. Uses own books for class. He is easy to fall asleep to, even sitting in the front row. I fell asleep every class and then stopped going. No need to read the books, as long as you go to recitation.  I do not recommend.",
        "course": "ENR367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "A very knowledgeable and passionate professor.  Go to class, his stories and opinions are worth hearing even if they are not always on the exams.  Recommended!",
        "course": "ENR367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lecture is just Dr. Simpson talking. It's fascinating, but he wanders in his speech so it doesn't always cover everything on the tests... for that, you need his book. Don't get the other two he wrote; you won't need them. Recitation is a joke; you'll write about 4000 words the whole quarter. Fascinating class!",
        "course": "LARCH367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great class. The writings are very easy, and the papers are graded fairly. One midterm which was easy and we were told what to review, very clear on what will be on the test. Not interested at all in Landscape Architecture, but this turned out to be one of my favorite classes. Professor Simpson is a great lecturer, great choice for 2nd Writing GEC!",
        "course": "LARCH367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "I just took this class Spring Quarter 2008 and it was so hard, the most involved class I have ever taken in 3 years of college, unless you love history and the outdoors I would not take this. I busted my ass with 2 papers 8 quizes, 6 in class writtings, and a in class debate. Along with a miderm and a Final and got a C. DO NOT TAKE THIS CLASS!!!!!!",
        "course": "LARCH367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor. Loves what he teaches.",
        "course": "LARCH367"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor! Made a topic that I could not be less interested in fun and tolerable! He was very passionate and knowledgable about the topic that he was teaching. Dr. Simpson was very honest about the course, attendence is not mandatory and the class can be passed with a high grade without going often -- Dr. Simpson makes most of his lectures av",
        "course": "LARCH376"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "took this class a year ago as a GEC and still one of my favorites at the university.  very animated and makes the topics fun and interesting",
        "course": "LARCH367"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very interesting lecture material.  A lot of writing for recitation, but it is a second writing class.",
        "course": "LA367"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "All of prof. Simpson's notes are online..the only time i opened the book was when i was assigned exam questions to look up (which are given in the syllabus)..easy A if u do the work",
        "course": "LARCH367"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "As a Natural Resources student I expected to like this class more. Bored me to death with so many details. Don't take this in winter, the outdoors walks can be brutal! Recitation is just like a separate class.",
        "course": "ENR367"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "very animated during his lectures, keeping you interested to what he had to say",
        "course": "LARCH367"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really interesting to listen to.  Exams are easy if you just study.  Recitation is like a second class.  There is work involved in the class but it isn't hard.  Just do it and you will get an A",
        "course": "NATRES367"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "I enjoyed the class. In lecture he goes over the same material in the books but it is nice to hear it twice. You should go to class just to hear the types of words he uses because that is helpful in the exams. The exams were easy if you studied. Recitation is like a second class but I enjoyed the readings and the papers. This class makes you think!",
        "course": "LARCH367"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Knows what he's talking about. Lectures are boring (don't need to go to them). Rec. are easy. Easy 2nd writing option to take. Highly recommended!!!",
        "course": "LARCH367"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "I felt Simpson was an entertaining, insightful, and very well spoken professor.  He was very willing to help, and was fun to interact with during class.  That's coming from the guy who in any other class is sleeping in the back row.",
        "course": "LARCH367"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 5,
        "comment": "mega hot!!!",
        "course": "LA367"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 2,
        "comment": "The recitation part of this class is not bad but the lectures are shear torture.  The good thing is though that only about ten kids actually go to them so they are not necessary to pass.  Do yourself a favor and dont buy his books.  You wont open them.",
        "course": "LARCH367"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "A little overly enthusiastic, pretty liberal outlook, extremely easy",
        "course": "LARCH367"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 3,
        "comment": "Has an environmentalist view point that he uses to judge which students will do well versus those who will do average. Is very opinionated and standoffish towards helping those he has personality differences with.",
        "course": "LARCH567"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 3,
        "comment": "Somewhat biggoted and snooty but doesn't teach a hard course. A little too strict on grading for such leniancy in class.",
        "course": "LARCH597"
      }
    ],
    "SEI": []
  }
]