[
  {
    "avgDifficulty": 3.1,
    "avgRating": 4.2,
    "department": "Law",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0xNTUwMjY=",
    "lastName": "Cole",
    "legacyId": 155026,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. Recommended that I take her class by my former boss and was so happy to be randomly placed with her for 1L torts. She is so engaging. Believes in cold-calling from day one but she helps you get to the answer rather than trying to embarrass you.",
        "course": "TORTS"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really a great teacher.  Crystal clear.  Takes the time to make sure students know the material.  The problem is that come exam time, the smallest of nuances will separate the students since she makes sure everyone has such a great grasp.  Looked to supplements for an edge, middle A-.",
        "course": "TORTS"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class is a TON of work. Also, she is a very harsh grader and would only give A's to half of the students in a class of only 8 people. Do not take this class if you're looking for an easy A to pad your grades.",
        "course": "ISSUEADR"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's amazing...nice...all around GREAT prof!",
        "course": "MEDIATION"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "BEWARE!  This professor totally screwed me over, costing me my class rank.  She based a huge percentage of our grade on a single quiz (which was almost incomprehensible it was so badly written), barely any on our 15-HOUR out-of-class negotiation project.  She is immature and not to be trusted.",
        "course": "ADR"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "HOT"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher-- a rare bird in the law school.  Kind and caring.  I learned a lot.",
        "course": "TORTS"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Law",
    "firstName": "Cesar",
    "id": "VGVhY2hlci0yNzcyMDc5",
    "lastName": "Garcia Hernandez",
    "legacyId": 2772079,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "His 1L torts focused more on his interest area than torts and was poorly tailored to learning outcomes for 1Ls. Cold calls from the text, endnotes, and footnotes. He mocks students in front of the class and is unavailable for sufficient assistance or feedback. The impression is that he does not enjoy teaching or students.",
        "course": "Torts"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.6,
    "department": "Law",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0xMjAyMjg=",
    "lastName": "Dressler",
    "legacyId": 120228,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Dressler is AMAZING! I would 100% take his class again. He is kind and compassionate, and remarkably knowledgeable of Criminal Law. He focuses a lot of attention on alternative hypos to help you understand the material, and he is very available to students. If you put the effort into his class, you WILL succeed. ",
        "course": "CRIMLAW"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved having professor Dressler in class and he is extremely knowledgable when it comes to anything criminal law (he literally wrote the book and the treatise) and is so organized and clear. Kept me interested during lecture at 8:30 am, if you want to do well on exams I'd highly recommend using the treatise",
        "course": "CRIM101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Literally wrote the book! Super duper nice and very helpful during office hours and questions. What a gem! So caring, respected, and intelligent.",
        "course": "CRIM101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "He wrote the book. Literally.",
        "course": "CRIM101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "GREAT professor. He does a wonderful job of explaining a very confusing subject matter, it is clear that he is passionate about what he does. He is also very fair- if you read, go to class, participate in class and on TWEN you'll be fine. Not an easy A, you have to work, but definitely worth it. ",
        "course": "CRIMPRO"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "This guy  wrote the book on criminal law. Personality-wise the guy is so nice. But vanity is his one flaw. His casebook is the most self-referential acamedic publication I've ever read. The course is pretty much \"dressler according to dressler\". Follow his program and you'll be fine. Stay away from critical discourse, even when he asks for it.",
        "course": "CRIMLAW"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "He knows what he's talking about. Very organized. Remember to post and vote on TWEN. Always read for class and DO NOT BE LATE. He's kind of intimidating but tells you exactly what you need to know for the exam.",
        "course": "CRIMLAW"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "What a great teacher, on the ball always, kept me interested at 8:30 in the morning, which is something.  Lots of work and expects a lot of you, but you get your money's worth.",
        "course": "LAW533"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "Interesting class and he teaches well, however he has several personal flaws that are annoying: He is full of himself. Also, if you have his small section expect to be required to come to class an hour early whenever he deems it necessary (and get no days off for it). Plus you'll have to post and read a messageboard regularly on your own time.",
        "course": "CRIMLAW"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good at bringing out the important aspects of the law. Very organized and clear in his delivery and even has some humorous stories to go along with his teachings. Test was fair and educational.",
        "course": "CRIMPRO"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 5,
        "comment": "Focuses on the policy, but gives you enough black letter law to do fine on the exam.  Told us exactly what the exam would be on, and allowed basically open notes test.  Fairly tough on you when called on.",
        "course": "CRIMLAW"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "LAW"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "A real classroom presence. Great lecturer, he can be very full of himself and he is a TOUGH grader. You have to be very committed to get an A. If your not into CrimLaw, it'll show and you'll be getting a B/C most likely.",
        "course": "CRIM"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "tough grader, but amazing educator",
        "course": "CRIM101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Law",
    "firstName": "Steven",
    "id": "VGVhY2hlci0yODg2NDMy",
    "lastName": "Huefner",
    "legacyId": 2886432,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very active and fluid lecturer, able to break down complex legal theory and topics into easy to understand bits that ensure you understand the method behind the madness. Can also challenge student's thoughts and answers sometimes. Him and Prof. Raadschelders teach the class jointly and make a great pair",
        "course": "PA3210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.7,
    "department": "Law",
    "firstName": "Creola",
    "id": "VGVhY2hlci0xMjMzMDg5",
    "lastName": "Johnson",
    "legacyId": 1233089,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The last 3 ratings were clearly from the professor (2 on the same date and all with similar tone) - this is the kind of person you're dealing with. She is a nice person but is far too intense, hard, and unforgiving. This class is the workload of at least 2 classes and you will be filled with anxiety during class. DO NOT TAKE, YOU WILL REGRET.",
        "course": "SECURED1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Don't believe the previous comments. The UCC's Article 9 is difficult, boring, and dense! Yes, there are several quizzes in the class, but the quizzes are designed to help us understand the nuances of Article 9. If I were you, I'd go with Professor Johnson! Please do not believe the rumors because it will be detrimental to your education!",
        "course": "SECURED1"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Johnson is an awesome professor that gets a lot of slack because the way she teaches or the material. However, please do not believe what other say about because she is truly is awesome and caring. The material is dense. The subject matter is hard. However, if you come to class prepare, she will try to break it down the best way she can!",
        "course": "SECURED1"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Johnson changed my life. She operates differently than other profs bc of that, she gets misunderstood. Generate your questions& email her before class, especially where things are unclear. Catch her after class/ walking to her office. She is invested in your success. Having her increased my GPA in my other classes bc of her guidance.",
        "course": "CONTRACTS1"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS. She gives multiple quizzes for each class, gives an insane amount of reading, expects you to know every single little detail of the reading, aggressively and constantly cold calls, and will be downright rude and disrespectful to students. Her teaching style is manic, chaotic, and high-pressure. AVOID, AVOID, AVOID. ",
        "course": "SECURED1"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Whatever you do, DO NOT TAKE THIS PROFESSOR. You have to learn the law, and then you are tested on the law in her mind. She writes her own multiple choice questions which are 75% of your grade with not enough time to do them. Frustrating after working hard all semester to get screwed over by her obscure questions. Again, AVOID at all costs.",
        "course": "SECURED1"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "bad bad bad",
        "course": "CONTRACTS1"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.6,
    "department": "Law",
    "firstName": "Doug",
    "id": "VGVhY2hlci00MjQ4OTk=",
    "lastName": "Berman",
    "legacyId": 424899,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor. Will legitimately just speak at you for the entire class, but does it in an engaging way. Very passionate about criminal law. Would recommend. Very clear expectations on how to do well.",
        "course": "CRIMINALLAW1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "I went to law school thinking \"the one thing I definitely do not want to do is criminal law!\"  I had Doug Berhmann for criminal law my very first semester and it changed my life.  I ended up taking every criminal law course that I could and am now a successful criminal defense attorney.",
        "course": "CRIMINALLAW"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "This guy is just TERRIBLE.  Wastes time, asks stupid questions of the students all the time, doesn't teach.  Just comes to class and shows youtube videos.  This guy shouldn't be able to teach ANYWHERE.",
        "course": "CRPRO101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Berman is hilarious and a nice break from the typical law professor's class room.  Of course, some didn't agree and actually petitioned the Dean to have him replaced mid-semester.",
        "course": "LEGIS1"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "LEGIS1L"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Berman loves to hear himself speak, so you only get called on maybe twice a semester.  His lectures are clear, and he reviews key points at the beginning of each class.  Only down side is that he often goes over the time limit for the class.  His exam was long, but very fair.  He is approachable and cares genuinely about your education.",
        "course": "CRIMINALLAW"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very enthusiastic and humorous.  Very lenient on-call system.  Does not require you to know a lot about the case facts for class, just the law and policy.  Laid back and makes class fun in general.  Tests are take home, but word limited and relatively e-z",
        "course": "CRIMPRO"
      }
    ],
    "SEI": []
  }
]