[
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.6,
    "department": "Law",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0xMjAyMjg=",
    "lastName": "Dressler",
    "legacyId": 120228,
    "numRatings": 14,
    "summary_comment": "Professor Dressler is highly regarded for his exceptional knowledge of Criminal Law, as evidenced by his authorship of key textbooks in the field. Students praise his kindness, availability, and ability to make complex topics engaging, though some note his lectures can be detailed and require significant effort. Overall, he is seen as a dedicated and effective teacher who demands commitment but rewards it with thorough understanding and success on exams.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Dressler is AMAZING! I would 100% take his class again. He is kind and compassionate, and remarkably knowledgeable of Criminal Law. He focuses a lot of attention on alternative hypos to help you understand the material, and he is very available to students. If you put the effort into his class, you WILL succeed. ",
        "course": "CRIMLAW"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved having professor Dressler in class and he is extremely knowledgable when it comes to anything criminal law (he literally wrote the book and the treatise) and is so organized and clear. Kept me interested during lecture at 8:30 am, if you want to do well on exams I'd highly recommend using the treatise",
        "course": "CRIM101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Literally wrote the book! Super duper nice and very helpful during office hours and questions. What a gem! So caring, respected, and intelligent.",
        "course": "CRIM101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "He wrote the book. Literally.",
        "course": "CRIM101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "GREAT professor. He does a wonderful job of explaining a very confusing subject matter, it is clear that he is passionate about what he does. He is also very fair- if you read, go to class, participate in class and on TWEN you'll be fine. Not an easy A, you have to work, but definitely worth it. ",
        "course": "CRIMPRO"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "This guy  wrote the book on criminal law. Personality-wise the guy is so nice. But vanity is his one flaw. His casebook is the most self-referential acamedic publication I've ever read. The course is pretty much \"dressler according to dressler\". Follow his program and you'll be fine. Stay away from critical discourse, even when he asks for it.",
        "course": "CRIMLAW"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "He knows what he's talking about. Very organized. Remember to post and vote on TWEN. Always read for class and DO NOT BE LATE. He's kind of intimidating but tells you exactly what you need to know for the exam.",
        "course": "CRIMLAW"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "What a great teacher, on the ball always, kept me interested at 8:30 in the morning, which is something.  Lots of work and expects a lot of you, but you get your money's worth.",
        "course": "LAW533"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "Interesting class and he teaches well, however he has several personal flaws that are annoying: He is full of himself. Also, if you have his small section expect to be required to come to class an hour early whenever he deems it necessary (and get no days off for it). Plus you'll have to post and read a messageboard regularly on your own time.",
        "course": "CRIMLAW"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good at bringing out the important aspects of the law. Very organized and clear in his delivery and even has some humorous stories to go along with his teachings. Test was fair and educational.",
        "course": "CRIMPRO"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 5,
        "comment": "Focuses on the policy, but gives you enough black letter law to do fine on the exam.  Told us exactly what the exam would be on, and allowed basically open notes test.  Fairly tough on you when called on.",
        "course": "CRIMLAW"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "LAW"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "A real classroom presence. Great lecturer, he can be very full of himself and he is a TOUGH grader. You have to be very committed to get an A. If your not into CrimLaw, it'll show and you'll be getting a B/C most likely.",
        "course": "CRIM"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "tough grader, but amazing educator",
        "course": "CRIM101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4.2,
    "department": "Law",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0xNTUwMjY=",
    "lastName": "Cole",
    "legacyId": 155026,
    "numRatings": 7,
    "summary_comment": "This professor is highly regarded for her engaging teaching style and clarity, though some warn of her rigorous grading and the substantial workload. Students describe her as both supportive and demanding, with one warning of potential pitfalls in grading practices. Overall, she is seen as an excellent instructor but with significant challenges.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing professor. Recommended that I take her class by my former boss and was so happy to be randomly placed with her for 1L torts. She is so engaging. Believes in cold-calling from day one but she helps you get to the answer rather than trying to embarrass you.",
        "course": "TORTS"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really a great teacher.  Crystal clear.  Takes the time to make sure students know the material.  The problem is that come exam time, the smallest of nuances will separate the students since she makes sure everyone has such a great grasp.  Looked to supplements for an edge, middle A-.",
        "course": "TORTS"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class is a TON of work. Also, she is a very harsh grader and would only give A's to half of the students in a class of only 8 people. Do not take this class if you're looking for an easy A to pad your grades.",
        "course": "ISSUEADR"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's amazing...nice...all around GREAT prof!",
        "course": "MEDIATION"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "BEWARE!  This professor totally screwed me over, costing me my class rank.  She based a huge percentage of our grade on a single quiz (which was almost incomprehensible it was so badly written), barely any on our 15-HOUR out-of-class negotiation project.  She is immature and not to be trusted.",
        "course": "ADR"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "HOT"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher-- a rare bird in the law school.  Kind and caring.  I learned a lot.",
        "course": "TORTS"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Law",
    "firstName": "Cesar",
    "id": "VGVhY2hlci0yNzcyMDc5",
    "lastName": "Garcia Hernandez",
    "legacyId": 2772079,
    "numRatings": 1,
    "summary_comment": "The professor's teaching quality is poor, as his 1L torts course deviated significantly from standard learning outcomes and emphasized his personal interests over essential legal concepts. Students report that he frequently cold calls from obscure sources and mockingly addresses them in class, while being unhelpful when it comes to providing adequate assistance or feedback. Overall, there is a clear sense that he lacks enthusiasm for both teaching and engaging with students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "His 1L torts focused more on his interest area than torts and was poorly tailored to learning outcomes for 1Ls. Cold calls from the text, endnotes, and footnotes. He mocks students in front of the class and is unavailable for sufficient assistance or feedback. The impression is that he does not enjoy teaching or students.",
        "course": "Torts"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.6,
    "department": "Law",
    "firstName": "Doug",
    "id": "VGVhY2hlci00MjQ4OTk=",
    "lastName": "Berman",
    "legacyId": 424899,
    "numRatings": 7,
    "summary_comment": "Doug Berhmann is a passionate and enthusiastic professor known for his engaging teaching style, even when he speaks extensively during classes. Students appreciate his clear expectations and approachability, though opinions vary, with some finding his teaching methods effective and others criticizing his approach as ineffective or overly focused on himself.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor. Will legitimately just speak at you for the entire class, but does it in an engaging way. Very passionate about criminal law. Would recommend. Very clear expectations on how to do well.",
        "course": "CRIMINALLAW1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "I went to law school thinking \"the one thing I definitely do not want to do is criminal law!\"  I had Doug Berhmann for criminal law my very first semester and it changed my life.  I ended up taking every criminal law course that I could and am now a successful criminal defense attorney.",
        "course": "CRIMINALLAW"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "This guy is just TERRIBLE.  Wastes time, asks stupid questions of the students all the time, doesn't teach.  Just comes to class and shows youtube videos.  This guy shouldn't be able to teach ANYWHERE.",
        "course": "CRPRO101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Berman is hilarious and a nice break from the typical law professor's class room.  Of course, some didn't agree and actually petitioned the Dean to have him replaced mid-semester.",
        "course": "LEGIS1"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "LEGIS1L"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Berman loves to hear himself speak, so you only get called on maybe twice a semester.  His lectures are clear, and he reviews key points at the beginning of each class.  Only down side is that he often goes over the time limit for the class.  His exam was long, but very fair.  He is approachable and cares genuinely about your education.",
        "course": "CRIMINALLAW"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very enthusiastic and humorous.  Very lenient on-call system.  Does not require you to know a lot about the case facts for class, just the law and policy.  Laid back and makes class fun in general.  Tests are take home, but word limited and relatively e-z",
        "course": "CRIMPRO"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.7,
    "department": "Law",
    "firstName": "Creola",
    "id": "VGVhY2hlci0xMjMzMDg5",
    "lastName": "Johnson",
    "legacyId": 1233089,
    "numRatings": 7,
    "summary_comment": "Professor Johnson is highly respected by some students who find her caring and invested in their success, despite the challenging workload and dense material. However, many students warn against taking her class due to its intense and high-pressure nature, frequent quizzes, aggressive teaching style, and difficult assessments. Overall, her class is described as extremely demanding and potentially detrimental to those unprepared for its rigors.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The last 3 ratings were clearly from the professor (2 on the same date and all with similar tone) - this is the kind of person you're dealing with. She is a nice person but is far too intense, hard, and unforgiving. This class is the workload of at least 2 classes and you will be filled with anxiety during class. DO NOT TAKE, YOU WILL REGRET.",
        "course": "SECURED1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Don't believe the previous comments. The UCC's Article 9 is difficult, boring, and dense! Yes, there are several quizzes in the class, but the quizzes are designed to help us understand the nuances of Article 9. If I were you, I'd go with Professor Johnson! Please do not believe the rumors because it will be detrimental to your education!",
        "course": "SECURED1"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Johnson is an awesome professor that gets a lot of slack because the way she teaches or the material. However, please do not believe what other say about because she is truly is awesome and caring. The material is dense. The subject matter is hard. However, if you come to class prepare, she will try to break it down the best way she can!",
        "course": "SECURED1"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Johnson changed my life. She operates differently than other profs bc of that, she gets misunderstood. Generate your questions& email her before class, especially where things are unclear. Catch her after class/ walking to her office. She is invested in your success. Having her increased my GPA in my other classes bc of her guidance.",
        "course": "CONTRACTS1"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS. She gives multiple quizzes for each class, gives an insane amount of reading, expects you to know every single little detail of the reading, aggressively and constantly cold calls, and will be downright rude and disrespectful to students. Her teaching style is manic, chaotic, and high-pressure. AVOID, AVOID, AVOID. ",
        "course": "SECURED1"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Whatever you do, DO NOT TAKE THIS PROFESSOR. You have to learn the law, and then you are tested on the law in her mind. She writes her own multiple choice questions which are 75% of your grade with not enough time to do them. Frustrating after working hard all semester to get screwed over by her obscure questions. Again, AVOID at all costs.",
        "course": "SECURED1"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "bad bad bad",
        "course": "CONTRACTS1"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Law",
    "firstName": "Steven",
    "id": "VGVhY2hlci0yODg2NDMy",
    "lastName": "Huefner",
    "legacyId": 2886432,
    "numRatings": 1,
    "summary_comment": "The professor is an excellent lecturer, known for his ability to simplify complex legal theories and topics, ensuring students thoroughly understand the underlying concepts. He actively engages students, challenging their thoughts and answers to foster deeper comprehension. Together with Prof. Raadschelders, they form a highly effective teaching duo.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very active and fluid lecturer, able to break down complex legal theory and topics into easy to understand bits that ensure you understand the method behind the madness. Can also challenge student's thoughts and answers sometimes. Him and Prof. Raadschelders teach the class jointly and make a great pair",
        "course": "PA3210"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "3210",
        "Class Name": "Civics, the Making of Law, and the Development and Implementation of Public Policy",
        "Class Number": "36363",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.91"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3210",
        "Class Name": "Civics, the Making of Law, and the Development and Implementation of Public Policy",
        "Class Number": "6364",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.86"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Law",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0xMzU5MzYz",
    "lastName": "Cooke",
    "legacyId": 1359363,
    "numRatings": 1,
    "summary_comment": "Based on the available student comments, there are no specific insights into the professor's teaching quality or methods.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "CIVPRO"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Law",
    "firstName": "James",
    "id": "VGVhY2hlci00MjQ4ODc=",
    "lastName": "Meeks",
    "legacyId": 424887,
    "numRatings": 3,
    "summary_comment": "This professor is highly regarded for his approachable and kind demeanor, though his teaching style is quite traditional. He does not call on students in class, instead relying on volunteers, and emphasizes the importance of remembering case names for the final exam. His assignments, particularly the take-home exams which are challenging, are preferred by many students over in-class tests.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Anti-trust. Very friendly, very old-school. In this class, didn't call on people--got volunteers. Doesn't care if you don't know the answer in class. I hated the textbook. Fairly big reading assignments. He's very sweet and kind of quiet.",
        "course": "ANTITRST"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Remember case names! You will lose a lot of points on his final if you don't despite what he tells the class prior to the exam.",
        "course": "TORTS1L"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best.  Does not call on people in second and third year.  Also has take home exams.  These are challenging, but I prefer them to the stress of an in-class exam.",
        "course": "TORTSETAL"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.5,
    "department": "Law",
    "firstName": "Steven",
    "id": "VGVhY2hlci0xMzY3NzUx",
    "lastName": "Martin",
    "legacyId": 1367751,
    "numRatings": 1,
    "summary_comment": "The professor for Accounting for Lawyers is effective in providing detailed instruction but requires students to have a foundational understanding of the subject matter. His approach can be challenging for those without prior knowledge, and while he offers assistance, his demeanor can come across as somewhat arrogant and unsympathetic to students who struggle to grasp the material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Accounting for Lawyers. If you don't have an interest, background, or prior understanding of accounting or finance, this class is incomprehensible. Do not believe that you can figure it out without prior knowledge. He was helpful when I met with him. He's a little arrogant, and not sympathetic when you don't &quot;get&quot; something. I dropped it.",
        "course": "ACCTLAW"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Law",
    "firstName": "Donald",
    "id": "VGVhY2hlci0xMzY3NzYw",
    "lastName": "Tobin",
    "legacyId": 1367760,
    "numRatings": 1,
    "summary_comment": "This professor is widely regarded as one of the best in Income Tax Law, known for his exceptional teaching quality, availability, and enthusiasm in the classroom. He effectively uses various teaching methods to ensure understanding and has significantly boosted students' confidence in the subject matter. Students highly recommend him.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Income Tax Law. Among the best teachers I've ever had. Very sympathetic if you don't understand, very available to help, enthusiastic and engaging in class, uses variety of teaching methods, very knowledgeable...nothing but great things to say. Highly recommended. Before, I feared tax law: there was difficult parts, but he was a great instructor.",
        "course": "TAXLAW"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Law",
    "firstName": "Martha",
    "id": "VGVhY2hlci04NTE5MDE=",
    "lastName": "Chamallas",
    "legacyId": 851901,
    "numRatings": 3,
    "summary_comment": "Martha Chamallas is highly regarded for her exceptional teaching quality, with many students praising her engaging approach and supportive demeanor. However, some students have criticized her for perceived bias, noting that she favors certain individuals in the class, which can affect grading.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was just fantastic in every way, Martha Chamallas is a saint",
        "course": "WRITI1"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "One of the most BIASED teachers that I have ever had.  She tends to favor certain people in the class.  If you are one of those, then you will do well.  Unfortunately for me, I was not one of them",
        "course": "WRITI1"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is really laid back and tries hard to engage students.  Just follow her instructions and comments.  We had to write a memo and brief.",
        "course": "LEGALWRITING"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.9,
    "department": "Law",
    "firstName": "Peter",
    "id": "VGVhY2hlci03NDA5ODA=",
    "lastName": "Swire",
    "legacyId": 740980,
    "numRatings": 6,
    "summary_comment": "Professor Peter Swire is highly knowledgeable in his field of Legal Aspects of Business and makes the material engaging, though his tendency to ramble can detract from the learning experience. Students find him approachable yet sometimes condescending, and opinions vary on his effectiveness in the classroom, with some noting his lack of substantive knowledge on certain topics. Overall, participation and effort are key to success in his classes.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Peter Swire likes to talk. A lot. He is pretty knowledgeable of the subject he taught (Legal Aspects of Business), but when he doesn't know, he just rambles on for 5 minutes, not answering a thing. Easy B if you participate and work relatively hard. Don't ask about his work with the POTUS, he will never stop talking",
        "course": "MGT2106"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "I participated in Prof. Swire's Washington Program a couple of years back (he teaches professional responsibility and cybersecurity when he conducts the program).  He's generally pretty nice and I also agree with other posters that he is also very smart.  However, when you are with him he does make you feel inferior and he clearly has a liberal bia",
        "course": "LAWWASH"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "P.S. was excellent and communicated the material very clearly.  Complaints about joint and several liability are unfounded -- of course there's studying that must go on outside of class.  He made the class entertaining and was very knowledgeable about the subject matter.",
        "course": "TORTS"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "He didn't seem to know anything about the material; i guess that's the beauty of the Socratic method - you can go thorugh the whole semester making other students do the teaching",
        "course": "TORTS"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Oh c'mon.  Petey's not so bad.  He's a little full of himself, but he's a smart guy who actually, demonstrably CARES about his students.",
        "course": "CYBERLAW"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "This was the worst class in my first year of law school. not only did this prof. talk about himself constantly (he had worked at the White House under Clinton as some sort of head of privacy), but he did not know shi** about what he was talikng about. He tried teaching us Ohio joint and several liability and he could not do it...got us all confused",
        "course": "TORTS"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.4,
    "avgRating": 2,
    "department": "Law",
    "firstName": "Sanford",
    "id": "VGVhY2hlci0xNTUwMjE=",
    "lastName": "Caust-Ellenbogen",
    "legacyId": 155021,
    "numRatings": 18,
    "summary_comment": "The professor is highly knowledgeable and often praised for his sense of humor, making class enjoyable. However, many students find his lectures challenging to follow and sometimes confusing, suggesting that additional resources like supplements are necessary. Despite the difficulties, some students have achieved excellent grades and consider him one of the best teachers they have encountered.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "He means well but he's really hard to follow. Definitely buy the Freer supplement early in the year and refer to it often!",
        "course": "CIVPRYELL"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Really knows the material and teaches it in small, specific doses.  Sometimes feels like he is hiding te ball, but at the end of each unit he provides you with material to sum it up, so if you stick with it, you'll get it.  He is delightfully funny which makes class enjoyable.  Worked hard, high A.",
        "course": "CIVPRCIVP"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is very confusing. I found him nearly incomprehensible. I got all As first semester, except for a B in his class. He's funny and people say that he knows what he's talking about. Sure, but that doesn't mean he can teach.",
        "course": "CPRO507"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "He really knows what he is talking about cares about teaching students. However, the whole class is was taught a level over my head and I was very confused until the very end.",
        "course": "LAW507"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Loved him and his sarcastic sense of humor. I know he gets mixed reviews but if you get his sense of humor, you're think he's great.",
        "course": "LEGIS1L"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "I got a 98/100 on his final exam but Caust-Ellenbogen is the very definion of why tenure should be abolished. This is a professor who stopped caring long ago. One of the laziest professors I have ever had.",
        "course": "FEDCT01"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "The material seems simple enough, but come exam time, just don't know what he is looking for. Make sure to talk to him way before the same to scope him out.",
        "course": "CIVPRI"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "It takes a special kind to like this guy, but if you are that kind of person, than this will be the best class you will ever take.  Caust-Ellenbogen is hands down one of the best teachers I have ever had...no question.  I have 2 friends that also took the class that agree.",
        "course": "CIVPR1"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "The guy stopped caring about teaching a long time ago. Expect to spend 2 hours reading a night for the class, but then skip over half the material with a &quot;I trust you learned what you read&quot;. Right. I guess your salary is optional if we're capable of learning it ourselves then, right&#63;",
        "course": "LEGISLATION"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "His stories were funny, but he is a tough teacher.  He is also very lazy and does not give you access to his handouts and refuses to use TWEN.  His exam was hard, but he identified the issues that needed explanation.  He was pretty helpful during his office hours.",
        "course": "CIVPROI"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Somehow I got an A from the worst professor in the world.  One of the worst people in the world too.",
        "course": "LEGISLATION"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 3,
        "comment": "SUCKS!  Enough Said!",
        "course": "LEGISLATION"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class was the worst educational experience I have ever had.  People who like him are those who go to law school b/c they thrive on competition and the &quot;adversarial&quot; nature of the profession. If that's what you love, so be it, but it was hell. Mercifully pulled a high B and hated every minute.",
        "course": "CIVPROPUREHELL1"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "Has a complicated and deep way of stating things.  Hard to follow sometimes.  Seems bored with the material (understandably).  Can be pretty strict about knowing case facts when you are on call.  Still I think he is better than Wilson for CivPro though.",
        "course": "CIVPRO2"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Difficult course to teach and make interesting.  I found him to be extremely approachable, if you take the time to make an effort to do so...only a reasonable expectation.  we're all adults here now...he won't hold your hand, but will help as needed.",
        "course": "CIVPROI"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "PURE HELL- thank God it's over--",
        "course": "CIVPROI"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "The exam was pure evil.",
        "course": "CIVPROII"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "Arrogant, insulting, chauvinist.  Refused to acknowledge students outside of the classroom.  Points out that he won't even send his own son to this University.  Refused to meet with students to go over final exam.  Called prior class  morons.",
        "course": "CIVPROI"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Law",
    "firstName": "Cinnamon",
    "id": "VGVhY2hlci0xNzc3NDEx",
    "lastName": "Carlarne",
    "legacyId": 1777411,
    "numRatings": 1,
    "summary_comment": "Professor Carlarne is well-organized and clear in his teaching, ensuring students are prepared for class calls, though he emphasizes the importance of keeping up with a substantial amount of reading material, particularly cases in torts.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Carlarne is is well organized and pretty clear. You'll know when you're on call, but keep up with the reading (there's a lot of cases in torts).",
        "course": "TORTSYELL"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 3.3,
    "department": "Law",
    "firstName": "Dale",
    "id": "VGVhY2hlci0yODY5NTQ=",
    "lastName": "Oesterle",
    "legacyId": 286954,
    "numRatings": 16,
    "summary_comment": "The professor is highly regarded for his expertise and practical insights into business and law, though some students find his lectures challenging and his grading tough. He is described as brilliant, tough, and highly competent, pushing students to excel and preparing them for real-world practice. However, his teaching style can be confrontational and he occasionally strays from the course material, which some find off-putting.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "I had this professor years ago at Cornell and he was fair. He definitely had a particular viewpoint but he was also reasonably new so I would not expect him to have the analytical skills to explain both sides. But outside of class, he was  nasty, rude and unsupportive. I have never been treated as disrespectfully by anyone.",
        "course": "CORPORATIONS"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent on so many grounds. Provides practical advice on business procedure in class. Updates the law, student-focused professor. Uses precise business & law terminology in class (helps with interviews). Lectures about value, up & coming fields in business law, and feeding your family. Readily accessible outside class. Highly Recommended.",
        "course": "MA7224"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best Professor at Moritz. Brilliant, highly competent, tough, and cares about his students. Emphasizes the practical. Prepares his students for the realities of practice. Refreshingly blunt and honest. He expects a lot from his students and pushes us hard. His classes are not for the thin skinned or the lazy. Best teacher I've ever had.",
        "course": "LAW1"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "Took every class he taught at Cornell including negotiations.  he graded tough but fair.  I thought he was one of the top professors at that school which was loaded with top professors (Irv Younger, Faust Rossi, Gary Simson, Allan Gunn, and Kevin Clermont)",
        "course": "NEGOT2L"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best at Moritz.",
        "course": "BA600"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 5,
        "comment": "best prof ever.",
        "course": "LAW797"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Decent teacher.  He's great for teaching the basics of business and finance, but does a poor job sticking to the course material.  Sometimes he'll spend an entire class talking about a side-subject, and then whiz through the course material in the last five minutes.  The exam is closed book and it's a huge amount of material, so the exam is tough.",
        "course": "BA"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "Means well. Deliberately inflamatory and prone to choosing token representatives of various view points for manufactored arguments.  Hugely knowledgeable on the subject - what may be desribed as tangents are actually always directly related to an aspect of business law.  His approach is not for the thin-skinned but his classes are well worth it.",
        "course": "BA206"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "One of the best professors at the law school by far. Students may not like him b/c he believes in capitalism (gasp), but for a course on business law you'd be foolish not want a business lawyer like Oesterle to teach you. Oh yeah, Oesterle's class discussions alone make it worth getting up in the morning to go to class...he's f*cking hilarious.",
        "course": "BASECT"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Had him for BA too.  Never had a business class in my life and I got through it.  He wants you to be dangerous (i.e. good), and he teaches that way.  Don't try to argue with him, though.",
        "course": "MA"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 5,
        "comment": "Exam was fair, professor cares about students, rightfully expects the best from them.",
        "course": "BA"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "BA"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst Teacher here, hostile, condescending, incapable of sticking to the topic at hand. The test was horrible too; It focused on an EXTREMELY narrow topic - might as well not have bothered going to class. Avoid at all costs.",
        "course": "BA"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful.  Terrible professor.  Can't explain worth crap.  Take his classes ONLY if you have a business background.\r \r He:\r Hates Ohio Law\r Hates anything left of the FAR right\r Hates Judges\r Loves business students (who are no where near as bright as Oesterle thinks)\r \r He is just an angry, bitter, li",
        "course": "BA"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "MA797"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "Pompous would be the best word to describe him.  Continuous themes: I'm smarter than judges; Ohio law is stupid.  Mostly a course in finance and not law.",
        "course": "BA"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 3.6,
    "department": "Law",
    "firstName": "Charles",
    "id": "VGVhY2hlci0yMzgwOTM=",
    "lastName": "Wilson",
    "legacyId": 238093,
    "numRatings": 13,
    "summary_comment": "Professor Wilson is highly effective at teaching Civil Procedure, known for his challenging and rigorous approach, including frequent cold calling and demanding exams. While many find his classes intense and demanding, he is widely respected for his thorough knowledge and ability to push students to excel. However, his teaching style can be polarizing due to his sometimes abrupt and argumentative nature, and some students find his political comments and perceived lack of listening skills off-putting.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Wilson is the man when it comes to Civil Procedure. But let's be clear: he's probably the most challenging law professor at Ohio St. Wilson isn't afraid to put you on the spot in class. He's a relentless cold caller. No method to his madness. He'll go right down the row until someone says something somewhat intelligent...",
        "course": "CIVPRO1"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "I enjoyed the reading, work & topic but the professor... WOAH! He can't hold a conversation bc he can't listen to others. He also makes politically inappropriate comments (spouting his person beliefs) that r perception-based/personal, not factual. While some political points I personally agreed w many students were offended. Cares but serious ADHD.",
        "course": "EDULAW"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 5,
        "comment": "Education Law. BIG assignments (50pages). Class was discussion-based and didn't go over reading at all-just expects you to engage in the convo using the reading. He acts like a discussion is only successful if people are arguing. Sometimes fails to listen to students-interrupts their thoughts by yelling his own. He's nice, smart, passionate.",
        "course": "EDUCLAW"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 5,
        "comment": "Will help you learn the material but can be a **** in class.  I think the man is OCD on some things",
        "course": "CIVPR501"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great professor.  Although he's a little tough, he helps you learn the material as well or better than any other teacher in the school.",
        "course": "LAWCIVI"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 5,
        "comment": "Wilson wants students to get stuff right; he doesn't hesitate to tell you if you are wrong, to write extremely tough exams, to grill you mercilessly in class, to pose endless hypotheticals.   This, combined with his occassional tendency to be dogmatic about small points (&quot;Justice x CLEARLY meant a in saying s.&quot;) might lead some to mislabel him cock",
        "course": "CIVPR101"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "The guy is egotistical and way too full of himself. Learning is not worth sitting through this guy's class",
        "course": "CIV2"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best teachers I've had. Some don't like him b/c he demands so much and a lot of students are to coddled. If you get him expect to spend a lot of time studying, but its worth it in the end.",
        "course": "CIVPRO"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Tough inside class, but personable and helpful outside.  I am confident our class learned more than any other section.  A good way to break in law school as a 1L",
        "course": "CIVPROI"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst exam I've ever had.  Plus every year he waits until the end to tell you it will be multiple choice, with penalties for wrong answers.  Often tells people they are wrong before hearing the rest of their answer, and is occassionally mistaken.",
        "course": "CIVPRO"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 5,
        "comment": "demanding but good. really knows his stuff",
        "course": "CIVPRO"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "Challenging and demanding, but extremely well prepared, with a sincere interest in making sure students understand the material",
        "course": "LAW"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "horrendous teacher.  seems highly unprepared for class.",
        "course": "CIVPRO1"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Law",
    "firstName": "Deborah",
    "id": "VGVhY2hlci04MTEwNjU=",
    "lastName": "Merritt",
    "legacyId": 811065,
    "numRatings": 2,
    "summary_comment": "Professor Merritt is highly regarded for her exceptional teaching quality, known for being clear, engaging, and humorous. Her co-authored textbook is praised for its clarity and usefulness. Students also commend her innovative use of clickers in class, which enhances engagement and keeps them attentive.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Merritt is outstanding. She's clear, funny, and engaging. The textbook, which she cowrote, is easy to follow and extremely helpful. Don't pass up the opportunity to take a class with her while you're at OSU.",
        "course": "EVID603"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Merritt is awesome; she really knows her stuff and was the first to start using those clickers where you vote on things during class; I wish every prof would use them - they makes it so much easier to stay awake",
        "course": "EVIDENCE"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.8,
    "department": "Law",
    "firstName": "Art",
    "id": "VGVhY2hlci0xMjQ1MTA=",
    "lastName": "Greenbaum",
    "legacyId": 124510,
    "numRatings": 6,
    "summary_comment": "The professor is generally well-intentioned but struggles significantly with teaching civil procedure effectively. His lectures are confusing and poorly structured, leading students to rely heavily on self-study for clarity. Despite being described as a nice and entertaining person, his approach to teaching complex legal subjects is widely criticized for its inefficacy.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Good god. He really needs to get with the times. He is terrible at teaching civil procedure. He makes things unnecessarily complicated. The structure of the course is by far the worst possible thing I've seen from ANY professor. It's absolute chaos. It's maddening. It's infuriating. I wanted to gouge my eyes out. More value from burning money.",
        "course": "CIV2"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "The guy is funny and very nice, but not cut out to teach a complex subject. He just doesn't present the information clearly. Kind of like a guy that knows all the rules but forgot how hard it was to learn them. Expect to be confused after every class and teach it to yourself using supplements come exam time like everyone in our class did.",
        "course": "CIVPRO"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Avoid this professor.",
        "course": "CIVPRO"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "nice guy, a bit tightly wound but he knows it and has a sense of humor",
        "course": "CIVPRO"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "An entertaining lecturer, he seems likea guy you'd want to get to know. However, he can be a little mean/standoff-ish 1-on-1. It is my opinion that he is jockeying himself to eventually be the Dean someday, which might not be a bad choice.",
        "course": "CIVPRO"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "really wants to help students",
        "course": "LAW"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.3,
    "department": "Law",
    "firstName": "Daniel",
    "id": "VGVhY2hlci04MTEwNjc=",
    "lastName": "Chow",
    "legacyId": 811067,
    "numRatings": 7,
    "summary_comment": "The professor is widely regarded as ineffective and unhelpful, with students citing issues such as lack of response to inquiries, poor exam preparation, and a focus on irrelevant details. Class sessions are described as dull and unengaging, with little additional value beyond the required reading. While a few students found the professor competent in the classroom, many noted significant challenges in seeking further assistance or clarification outside of class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I've ever had in my life. Doesn't respond to student inquiries, no exam review, questions on final were about irrelevant details, and a long list of other complaints. This professor should not be allowed to teach law school exams. Has no idea how to teach or test the law.",
        "course": "LAW7677"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Chow is one of the better professors at Moritz--you need to generally ask questions directly after class rather than during office hours. Also, like any law class, you actually need to read the laws/statutes and treaties to pass the class. Oh, and reading the textbook that coincidentally Chow wrote, might also help you do well on the exam..",
        "course": "IBT7230"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Good teacher in class, but not that friendly outside of it. Often pretends he is not in his office even when he is.",
        "course": "LAWCHIN"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very dull and didn't add much to the required reading. Expects that you have memorized the assigned statutes and treaties during class discussions. Not friendly to talk to outside of class. Had no clue what I was supposed to take out of the class, other than memorize the treaties, etc.",
        "course": "IBT101"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "It's obvious he doesn't enjoy teaching. Pretty much just read right out of the book to us the entire class. Not helpful at all and gets really irritated if you actually go to his office hours (assuming he even bothers to show up). Worst professor I've ever had.",
        "course": "PROP101"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Good professor in class, but don't you dare try to visit him after class or ask for help with anything.",
        "course": "CHNESBUS"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "pretty dull, occasionally makes a joke or two. Watch out for the exam!! he likes to test on the old stuff: contingent remainders, rule against perp. etc. - blech",
        "course": "PROPERTY"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 3.9,
    "department": "Law",
    "firstName": "Larry",
    "id": "VGVhY2hlci05NzcxNzY=",
    "lastName": "Garvin",
    "legacyId": 977176,
    "numRatings": 6,
    "summary_comment": "Professor Garvin is highly knowledgeable and demanding, effectively teaching Contracts with a rigorous, closed-book exam format that challenges students to master the material thoroughly. He is appreciated for his clear organization, sense of humor, and availability during office hours, though his teaching style can be daunting due to strict policies on no laptops and comprehensive exams. Student feedback varies, with some finding his methods effective despite the difficulty, while others find them overly harsh and unhelpful.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's a great guy, and I enjoyed the class. But man, some of his quirks (no laptops, closed book tests) can make this class daunting. And it's hard for him to keep on track, which is great and not as great",
        "course": "CONT000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Stereotypical law school prof! All about the socratic method, but he's brilliant and knows his material. He keeps the class interesting and on your toes. And you'll learn it. Buy the Farnsworth supplement and use it! He's obsessed with it and thus, so should you!  What he teaches is what he tests. IRAC the heck out of those exams!",
        "course": "CONT000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Garvin knows Contracts backwards and forwards, and he knows how to teach it.  He's very funny.  He's pretty formal in class, but more relaxed in office hours.  Very helpful supplement and optional on-line quizzes.  The exams are brutal, and closed-book is no fun.  Overall, a great class, but be prepared to work.",
        "course": "CONTRACTS"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great class.  Demanding, but you learn Contracts, both theory and law.  He's very funny.  Well organized.  Very, very hard exam -- closed book, except for the UCC.  Somewhat formal in class, very approachable outside.  Knows Contracts backwards and forwards.  I'd take him again.",
        "course": "K503X"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very challenging, but also very clear (if you did the reading), well organized.  Great sense of humor.  Knows Contracts cold.  Tough exams, but generous grader.  Easy to talk with after class.  I look forward to taking him for other classes.",
        "course": "K503X"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible. No clarity whatsoever. The only upside is you'll probably never get called on if your classmates volunteer.  His exams are closed book which is ridiculous since Contracts is a year long class.  He'll provide you with his own UCC. AVOID!!",
        "course": "CONTR1L"
      }
    ],
    "SEI": []
  }
]