[
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Elena",
    "id": "VGVhY2hlci0yNzkxMzg0",
    "lastName": "Vaiksnoraite",
    "legacyId": 2791384,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Elena was amazing. participation isn't a set measurement (just show up & maybe talk a little.) Interesting concepts but ALOT of papers (the bulk of the grade.) I'm Ukrainian & during the invasion, she was understanding and compassionate to my situation & let me make up a few things. she graded my final kinda hard but I did blow it off ngl. ",
        "course": "3371"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.5,
    "department": "Linguistics",
    "firstName": "Damayanti",
    "id": "VGVhY2hlci0yNjY1Mjcw",
    "lastName": "Tiwari",
    "legacyId": 2665270,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Damayanti is the worst professor at communicating that I have ever had. She tells you to do an assignment one way and then counts it wrong. I can tell she is very smart but some smart people should just not be teachers. She is horrible at explaining things and my GPA suffered for it. Will never take any of her classes again if I can help it.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Damayanti was a really good teacher when it came to explaining different linguistic content, but when it came to homework and quizzes, she would often throw curveballs in that we had never talked about before in class. She was a really hard grader when it came to the Problem Sets we had to do and the homework. Overall, very kind but a hard class.",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Carly",
    "id": "VGVhY2hlci0yMzI2ODQ2",
    "lastName": "Dickerson",
    "legacyId": 2326846,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "There are weekly readings before each class and each class is based on discussions around those readings. I hardly ever did the readings and stopped showing up to classes but still got an A on my participation grade. There is a semester long research paper but if you follow the rubric, it is an easy A. Carly is so sweet and really passionate.",
        "course": "LING2367"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Carly is extremely nice, and cares about what she is teaching. When I fell behind in class, she was extremely accommodating and helpful. Genuinely cares. Reading the textbook was not really critical for understanding, but she would get frustrated if no one read it. She is a fan of projects and essays, so you do have to put considerable effort in.",
        "course": "LING3603"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Carly explains all of the lecture material clearly. The majority of the class focuses on a project which requires you to interview someone outside of class and do a 2-page write-up every week. In addition to this, you've got to read the textbook in order to do well on the midterm and final. A decent amount of work, but doable if you put in effort.",
        "course": "LING3603"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Class was kind of boring. She nice though. Theres a semester long project where you have to find a language consultant which is tedious and a 2 page paper is due weekly, with a presentation and final paper at the end. Shes not a tough grader though and if you do your work and go to class youll most likely pass.",
        "course": "LING3603"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interesting class, very good teacher , cares about her students a lot and will take time to explain again and again if someone needs it. Very enjoyable class and caring teacher!",
        "course": "LING3603"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Carly is a good instructor and has a lot of papers in her class, but she is a fair grader. She is accessible outside the classroom and gives good suggestions and feedback. Really enjoyed having her and hope to have her again",
        "course": "LING3603"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Really interesting course if you like foreign languages and linguistics. The bulk of your grade is a language consultant assignment which is someone who you have to interview every week about their native language and write 2 pages on that week's topic, but she gives you a rubric for each one. Also she expects that you read for each class",
        "course": "LING3603"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "I wasn't very interested in the course topic but I thought Carly was overall a pretty solid teacher. As long as you put in effort on the essays you'll probably do good in the class.",
        "course": "LING3603"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2.8,
    "department": "Linguistics",
    "firstName": "Noah",
    "id": "VGVhY2hlci0yMTI0NjU4",
    "lastName": "Diewald",
    "legacyId": 2124658,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "This man is not only boring and cringely unfunny, but just overall a rude and disrespectful. His class set up on carmen is so hard to navigate and unclear. I am an engineering student and took his class as a gen ed and he is the worst professor I&#39;ve ever had. Avoid this man as he seems to care little about his students.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Noah is subtly hilarious. He genuinely wants to help, but often seems to struggle with explaining material to non-majors and people who are extremely lost. The class is extremely easy for people who have a slight background, but for new people and non-majors, it's a little difficult. He seems to expect everyone to be a ling major",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class was an extremely easy A. Skim over the textbook before tests and your basically guaranteed a high A. Noah is a decent teacher but very dry.",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "I got As on his tests, but the class was so terribly boring and it was hard to motivate myself to go because class wasn't essential to learning, but you have to go because he assigns homework in class and doesn't post it on carmen, and he gives participation points every day.",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0yNTQ4MTM4",
    "lastName": "Conner",
    "legacyId": 2548138,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great! Lenient on deadlines, supportive with work, and very relatable.",
        "course": "LING2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was great! Extremely approachable and very excited about the class. She gets to pick most of the topics taught and theyre very engaging. Shes very good at connecting the ideas to the readings.",
        "course": "LING2367.01"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really liked her. She's been one of my favorite professors that I've had so far. Her lectures were always entertaining so they were fun to go to. She also explained the criteria for her assignments very well so it was easy to know what you had to do for them. She also was very nice and relatable.",
        "course": "LING236701"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Katie is the most caring professor I've had and was willing to help me out when I really needed it. I highly recommend her class, most readings aren't for a grade so you can afford to miss a couple, but SHE CAN TELL if you don't do them. If you demonstrate that you aren't blowing off her class, she will reward you highly. LOVE HER",
        "course": "LING236701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.5,
    "department": "Linguistics",
    "firstName": "Willie",
    "id": "VGVhY2hlci0yMzczMDgx",
    "lastName": "Cheung",
    "legacyId": 2373081,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Had him for 3802 as well. He has an easier time explaining most of these concepts and does a lot better with the smaller class sizes. The final is a group research project.",
        "course": "LING3802"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lots of homework assignments, but theyre all fairly easy/straight forward. He can be hard to follow at times and gets confused on how to word things. Hes great in office hours and tries to make sure everyone understands whats going on",
        "course": "LING3801"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "The best part of this class is the clear rubric. Willie is a great guy and really knows his stuff, but is often disorganized and seems to struggle to convey what he means. Outside of class, he is far better 1 on 1 and I highly recommend going to office hours if you struggle at all. His humor made the class a lot of fun to attend",
        "course": "LING3801"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "He knew the topic well, but was confused as to how to explain it at times. Can def tell he is a grad student. He does his best to be super helpful though and is pretty funny. Will work with you to help make sure you get the points as long as you are showing you are trying",
        "course": "LING3801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Vedrana",
    "id": "VGVhY2hlci0xMTMwODk5",
    "lastName": "Mihalicek",
    "legacyId": 1130899,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "She chooses target students she doesn't like. I went from being nominated for a writing award at my previous college, to failing her class when I transferred here (fall, 2015). P.S., I did still graduate. But she gives no helpful feedback and I found it impossible to understand what she wanted or her critique. Very rude to just me in lecture, too.",
        "course": "LING236702"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Vedrana is a very solid professor. She is very knowledgable about her topic. However, I took this class for a GE and I had way too much work for it being a GE. You will learn a lot, but also work a lot.",
        "course": "LING236702"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Vedrana is hilarious and great with the content. Classes were engaging and participation is expected. Also amazing for students who need academic accommodations due to disabilities. That being said, the lack of a midterm means that you go into the final just about blind to how it will be. I think I would have gotten an A if there was one...",
        "course": "LING2000H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "very fulfilling lecture and Dr. Vedrana is hilarious",
        "course": "LING2000"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Vedrana is clearly very knowledgeable about all the material she covers, and is willing to help you. Attendance is not mandatory, but you've got to go to understand what's happening. Homework is easy to get full-credit on. The midterm and final exam are take home, but can be tough. Make sure you don't fall behind or you'll be completely lost.",
        "course": "LING4200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely loved this professor. She really cares about you understanding the material and the lectures were very engaging. If you're struggling with the material, she's very approachable both after class and during office hours.",
        "course": "LING2001"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Vedrana is tough but hilarious. Attendance isn't mandatory, but you will know literally nothing if you don't go to class because the textbook is more for exercises than course content. Homework is graded based on completion, but there are no other assignments except the midterm and final so it's important not to miss any homeworks.",
        "course": "LING4200"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you need to take LING 4200, please dont take her class. Textbook is required but not useful. Her lecturer does not relate to topics in the textbook. However, you need to buy textbook because some assignments are based on the textbook. Assignments are not graded base on accuracy but completion. Never answer your questions clearly!",
        "course": "LING4200"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Fantastic teacher. She did a great job connecting logic principles to linguistics and real-world scenarios. I would recommend this class to everyone, even non-linguistics/computer science majors.",
        "course": "LING2001"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is amazing. Homework is not graded based on accuracy. As long as you try hard, she'll help you a lot. She always makes the contents fun. I had no background of logic class but it was totally fine. Exams are also reasonable and I got very good grades on all of them.",
        "course": "LING2001"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Vedrana was my favorite professor! Even though this was a GE writing class, I learned so so much about linguistics and advertising and found it so interesting! She chose great content and readings and gave great feedback on every assignment! Shes really funny, too, and likes talking to students about their interests. My writing really improved!",
        "course": "LING236702"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Vedrana is a great teacher, I took the course for a GE and it was actually pretty interesting. Clear communication matters in class, even if that means occasional colorful language if it can better get the message across. She even reads through everything you say on assignments, big or small (even participation grades), which is oddly cool.",
        "course": "LING236702"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you do what is asked of you you will get an A in her class, at least in the one I took. Many online quizzes based off of reading, but they are only out of 10 points. She also gives extra credit to supplement your quiz grades. For large assignments like papers she is very clear about what she wants and gives feedback on your rough draft.",
        "course": "LING236702"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Vedrana is an amazing professor, in my opinion. Even as an online class I felt the same level of attentiveness as I would from any other professor. Extremely clear when she takes points off an assignment, and manages to make the material interesting and fun.",
        "course": "LING2000"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Vedrana was a great instructor!! Very ready to help with any and every little curious question that our small class had!! Felt like she was a bit nervous in the beginning but really opened up throughout the semester! She made me love BCS even more by her passion and her awesome clarification!",
        "course": "1103"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 4,
        "comment": "Vedrana makes learning enjoyable. Attendance is not exactly mandatory but it's in your best interest to show up to every class and participate. Although it seems like quite a workload for 3 credit hours at times, I really learned a lot.",
        "course": "236702"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 5,
        "comment": "VERY tough grader. Took off nearly 20 points on my first paper for \"minor mechanical errors\" that weren't so \"minor\" after all. Also not clearVERY vague on any comments made on assignments. My biggest issue was her grading though. She will tell you she is a super easy grader. She is lying.",
        "course": "LING236702"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "This is the first class that I have ever struggled in. I am actually good at writing, but she doesn't grade for writing. DON'T TAKE if you are going to skip because she's mean about that and holds it against you. She is okay at teaching, but she grades way too harshly for no reason and she's one of those people that secretly wants you to fail...",
        "course": "236702"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had her for Language of Advertising to fulfill my writing GE. Definitely not what I was expecting. Doesn't grade according to how you write, but focuses more on content. Also is a tough grader. Read the material. Grades some stuff for participation. BE THERE FOR THOSE DAYS THAT ARE WORTH 5% OF YOUR GRADE. Yeah I felt those days were really stupid",
        "course": "LING236702"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Vedrana is certainly one of the best and most pleasant professors to work with. Responds to emails fast. Class required reading and online quizzes afterwards that weren't too difficult. Lots of extra credit and easy completion points. Approximately 20% of the grade was from easy completion assignments for just showing up. **HIGHLY RECOMMENDED!!!**",
        "course": "LING459702"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was my favorite class ever. Vedrana made the material fun. She was funny and came across as smart and professional. I never missed a class. She is also stunningly gorgeous and it will be hard to take your eyes off of her. The homework was graded for completion and there were 3 problem sets which were actually graded for correctness. No tests.",
        "course": "LING2001"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Vedrana is really a good teacher and nice person. The class is easy because she gives a lot of extra credits. And for other parts it's just the same as other writing classes, not too hard. Really learned a lot of interesting things.",
        "course": "LING236702"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Vedrana's great. She's got a great sense of humor and she's always willing to help you out and doesn't make you feel like an idiot. She had us watching newsclips and reading movie reviews, which was awesome. She kept us away from the stupid textbook and kept class interesting. Definitely learned a lot, and looking forward to taking 407 with her.",
        "course": "SRBCR405"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is intelligent and passionate. She has a cool accent and is mercifuol. She'll help you a lot during office hours and makes herself approachable.",
        "course": "LING280"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Vedrana is very smart and extremely helpful instructor! Material itself is very difficult, but she tried to explain simply for students to understnad easily. Her office hour is almost always beyond that. Even quite over time, she did help every student until they got it! Those who did not go to her office hour did complain a lot.",
        "course": "LING280"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "Immature Instructor, deals students like rival roommates. Pro arguments! \r Worst teacher plus hard course, what will you expect&#63; I m sure you guessed right!",
        "course": "LING280"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "GREAT! Yes, Linguistics is like learning a new language, but honestly, if you show up to class and pay a tiny bit of attention you'll get an A. There's NO final and NO textbook! You get tiny homework assignments everyday that are graded on completeness, not correctness, and 4 alright assignments that are your &quot;tests.&quot; DEF take it for a math class!",
        "course": "LING280"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "Nice person, hard class. Linguistics is like learning a new language so be prepared to study like you're learning a new language. It takes a lot of studying, homework due each class, and problem sets that are not too bad if you understand. Seemed to be happy to find time to see you at office hours. The class is like math and foreign language, weird",
        "course": "LING280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Bjoern",
    "id": "VGVhY2hlci0yNDMyMzk3",
    "lastName": "Koehnlein",
    "legacyId": 2432397,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Took Phonology with Professor Koehnlein my first semester at OSU, it was a great class. The structure was lecture heavy and at times quite challenging but Professor K was always helpful in office hours and gave really good feedback. The final was super easy after having taken intensive notes all semester (open note/open book).",
        "course": "LING4300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Bjoern! He's super passionate about linguistics and it shows. There's a lot of reading assigned to prepare for lectures, both of which can be dry at times, but he's a really funny guy and I loved his german accent so that kept me interested. He's really helpful, super easy grader, and all around it was a great intro to linguistics.",
        "course": "LING2000H"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Bjorn is really passionate about linguistics but lectures were boring and he goes on a lot of tangents that were funny but not really conducive to the class. Spent a lot of time reviewing concepts from previous classes which was weird for an honors class. Hes a really great guy though and likes to have fun and interesting discussions.",
        "course": "LING2000H"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Koehnlein is a solid professor. Attendance doesnt matter as long as you turn in the (few) assignments in Carmen. He is not a particularly tough grader. He does have an accent and speaks rather quickly and I did have trouble understanding him at times.",
        "course": "LING2000H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Donald",
    "id": "VGVhY2hlci0xOTEyNDYz",
    "lastName": "Winford",
    "legacyId": 1912463,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Winford is an absolute legend in his field and if you are lucky enough to take a course with him I think you'll find that he is such a great mentor. He is easy to engage with, truly interested in what you have to contribute, and really drills all waves of sociolinguistics into you with the MASSIVE amount of reading materials he assigns.",
        "course": "LING5601"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3,
    "department": "Linguistics",
    "firstName": "Micha",
    "id": "VGVhY2hlci0yMzcyMDcz",
    "lastName": "Elsner",
    "legacyId": 2372073,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "While the lecture does get a bit dry and easy to get lost in sometimes, it's easy enough to pick up the general idea that's trying to be communicated, and he's more than willing to stop and explain things as needed. The class is incredibly easy, and there's loads of extra credit opportunities on top of that (median 96% w/o EC). Would take again.",
        "course": "LING3801"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Made sure, or at least tried to give everyone a good grade. More of a critique of 3801 than him but the final projects are an insane amount of work and the quizzes require a ton of reading. This class was a lot more work than anticipated. His lectures are pretty boring but he also tries to give students answers to exams if they show up for review. ",
        "course": "LING3801"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hands down one of my favorite classes. As long as you showed up, put in the effort to do the homework, and actively helped in the group projects you got an A. The midterm is a bit scary, but as long as you can do the homework you can do the midterm. Professor Elsner is a great and funny guy, he cares about the students and wants to help them.",
        "course": "LING3801"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Was very close to dropping the class. Micha is extremely boring and like other raters have said, a terrible communicator. He also makes the female students feel very uncomfortable and is genuinely creepy. Would highly recommend you dont take this class.",
        "course": "LING5802"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I very much disagree with other comments. I loved Micha! He is knowledgable, approachable outside of the class, and witty. Would recommend taking his course but be ready to work and learn a lot.",
        "course": "LING5802"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very difficult to listen to and not good at teaching the material. Would recommend getting another professor if at all possible.",
        "course": "LING3502"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is quirky but very knowledgable and willing to help. As long as you turned in your hw on time he gave you the rest of the semester to go back and correct what you missed in order to get full points on everything. Super interesting and had alot of fun. Textbooks are not necessary at all.",
        "course": "LING3502"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Unless you genuinely enjoy linguistics, I would not take this course. If you love linguistics, perhaps you could find it interesting but I dreaded being in class because of how boring and dull it was. Micha is really awkward and not the most likable guy.",
        "course": "LING3502"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved Micha! He's a kind of an awkward guy but I found it very endearing, and he actually is super funny/witty. He's very knowledgeable but also admits when he doesn't know something. There's a lot of work on the semester-long project but he walks you through it and lets you resubmit for more points. Very helpful, nice, super nerdy. 10/10.",
        "course": "LING3502"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Elsner is engaging and personable. He does a good job explaining topics, and admitting when things are outside his scope of expertise. His lecturers are interesting, the grading of assignments is clear, his feedback is excellent, and most assignments can be resubmitted for more points.",
        "course": "LING3502"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "Regret enrolling in this course and was very close to dropping it. Micha's lectures are difficult to sit through as he is a very bland and awkward lecturer. He is clearly extremely anxious talking in front of people and is not a good communicator. Somewhat knows what he is talking about but is terrible at explaining concepts and teaching.",
        "course": "LING8800"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Would not recommend. He is very awkward and lacks any sort of confidence when teaching. To make matters worse, he is very dull when describing the course material and is not good at explaining anything. A lot of unnecessary work for a gen ed course as well.",
        "course": "2000H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Ian",
    "id": "VGVhY2hlci0yODc3Nzcz",
    "lastName": "Cameron",
    "legacyId": 2877773,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's awesome!!! Best instructor ever!!! I was lost at the beginning because I'm non-linguistics major but he helped a lot, explaining everything clearly when I asked. After a few weeks, I was able to get pretty good grades. ",
        "course": "ling3901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cool guy, super nice. Knows the course might be tough for non-linguists so gives review that might be boring to people who've taken ling2000. HW is pretty clear and tests are easy. Read the textbook and you will ace them. All around clearly knows his stuff and is willing to talk about things more in-depth during office hours or after class. ",
        "course": "ling3901"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really fun and engaging lectures. Homework is given once every two weeks or so and is graded honestly and fairly. Exams and quizzes are easy if you pay attention, do the readings (for quizzes), and take good notes. ",
        "course": "ling3901"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 3.5,
    "department": "Linguistics",
    "firstName": "Jungmin",
    "id": "VGVhY2hlci0xNjY1MzYy",
    "lastName": "Lee",
    "legacyId": 1665362,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Jungmin is super sweet; she really tries her best to engage everyone in her class, even if we don't respond. Her lectures can be kinda boring, but honestly I didn't pay attention and still got an A in the class. She is also a really easy grader which was awesome.",
        "course": "EDUTL5468"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "Her accent is really strong, often hard to understand what she is saying.",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Her accent is pretty thick at times, but she realizes this and is not offended if students ask her to repeat. She is very helpful, and as long as you attend classes (which became mandatory halfway through the semester), the class is a very easy A. Plenty of extra credit is offered.",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love her class. She was reasonable when it comes to quizzes, homework, and just about everything else in class. She is very kind and helpful.",
        "course": "LING2000"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Hard to understand at times, but she is always willing to explain.  If you come to class, it should be an easy A as she is very helpful.  Not the best at putting grades in on time so that can be frustrating.  But class is interesting and easy.  Highly recommend.",
        "course": "LING2000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "good",
        "course": "LING201"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Jungmin's English skills are sometimes nearly incomprehensible, but if you ask questions she really tries to help you understand her meaning. She knows her stuff, but seems to be a little intimidated by teaching - but this was only her first time teaching. Maybe she'll get better with time&#63;",
        "course": "LING200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Shontael",
    "id": "VGVhY2hlci0yNDgxMjgy",
    "lastName": "Elward",
    "legacyId": 2481282,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Honestly one of the best professors I have ever head. I highly recommend taking any one of her classes as she truly cares about her students and is always willing to help.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Shontael is super nice and friendly. She doesnt have much hw(only 4 electronic hw for the whole semester) and quizzes(maybe 1 for each chapter sheve taught). As long as you do the discussion posts for every chapter and participate class, pretty easy to get good grade. She always have 2 classes time leading you to go through the hw. Super helpful!",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 2.4,
    "department": "Linguistics",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xNDE3Njc0",
    "lastName": "Phelan",
    "legacyId": 1417674,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "this class was ok until we reached the &quot;research project&quot; weeks. I have no interest in linguistics research &amp; it was so incredibly boring. the expectations for this project were ridiculous. quizzes were unnecessarily detailed. note taking was a pain for the online lectures - need to know every single thing he says! take something else",
        "course": "LING3701"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "His online LING 3701 class is SO unorganized, making it impossible to find assignments, quizzes, etc. He uploads quizzes 2 days before they are due. Lazy grader. Doesn't grade anything until the end of the semester. AVOID his classes like the plague.",
        "course": "LING3701"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "I really just made an account to warn others to NOT take his online section of ling 2000. As others said below, he comes off as arrogant. Does not post videos that have accompanying assignments until Wednesday or Thursday when they are due SUNDAY. Does not ever word questions clearly on quizzes/tests and has high standards for an INTRO level class",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "A very bad decision. The class changed to online three days before classes started, and all the other sections were full. He fails you on most every quiz, doesn't show you what you did wrong, and is virtually inaccessible. I know he is passionate about Linguistics, as I can tell in his lectures, but for the sake of your grade... take another class.",
        "course": "LING2000"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "The course was changed to online at last minute. He is very long-winded and the microphone he uses for lectures is poor quality. The Carmen page is EXTREMELY unorganized and expectations are not very clear for assignments. He makes quiz questions unnecessarily difficult with confusing wording. Content is cool, but he is not the move.",
        "course": "LING3701"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Stay away from this online classes. His lectures are actually really good and helpful but the website they on is outdated. Homework is all over the place too, assignments are hard to find so are directions. If you havent taken an online class before - beware. Cant wait until sunday to do everything. It's not a hard class if you have good discipline",
        "course": "LING2000"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Other than being rude and disrespectful he is also arrogant. Files are all over the place, can't tell what is what or where to start what to read and what not. Seems like he is either file hoarder ( you've seen those shows on TV - this is just as bad case of file hoarding and utter mess ) or playing 'hard to understand.' Either way ,just don't.",
        "course": "LING3701"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't take this online, especially in the summer. He didn't consider how much material he shoved at us in such a short amount of time. Not a great lecturer either. It was pretty awful.",
        "course": "LING3701"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Stay Away",
        "course": "LING3701"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Amazing online class. The guy who took LING 3701 obviously didn't put in the time for this class. It was amazingly interesting, Mike was dedicated and wanted everyone to succeed even though it was online, and if you're not a complete idiot you will be just fine. May Term classes shove 16 weeks of work into 4, of course it was a lot of material.",
        "course": "LING3701"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "NEVER take this class online. It will be the death of you. He wasn't that great of a teacher either. This was one of the worst classes I have ever taken in my entire college career.",
        "course": "LING3701"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Mike is a great teacher who wants to help his students. His lectures are engaging and fun. Quizzes can be tough, and one must read the book. This class requires work, but is definitely worth it.",
        "course": "3701"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Mike is a great instructor. Very generous on grading, gives points back, has a curve on the exam, and really wants you to succeed and get a better grade. No midterm, just one final, 2 LOCs, 1 large experiment, and around 15 discussion boards.Textbook can be downloaded online. Class isn't too difficult. Hope to have him again. Highly recommended!",
        "course": "LING3701"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really nice guy, Attendance was mandatory, but he made the class easy and interesting. Quizzes weren't too hard, homework assignments were easy. Textbook is definitely needed, but it was easy to read and helped a lot.",
        "course": "PSYCH371"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Antonio",
    "id": "VGVhY2hlci0yMTA1NTM1",
    "lastName": "Hernandez",
    "legacyId": 2105535,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Antonio is a pretty good lecturer!The homework is slightly difficult and he is a pretty tough grader, but he gives great feedback for future homework and exams. He gives pop reading quizzes and expects students to read the book for lecture discussions. READ THE BOOK! He makes the class interesting even if you're not in the major. Highly recommend.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 5,
        "comment": "Pretty tough grader. You have to read a lot and have pop quizzes over assigned readings randomly which are pretty difficult. He gives good feedback though and is willing to help you! Not a bad class, just not my favorite",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "You can miss a few classes or be late a few times, but don't make it a habit. He expects you to read your textbook, but homework & tests are 100% passable by looking at his online notes and the notes you take in class.  A bit of a tough grader on homework, but gives great feedback so that you don't mess it up on quizzes and exams.",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Everything is pretty upfront in the syllabus. You can miss class on occasion, but don't make it a habit. He puts all the lecture notes online, so only take notes that aren't on the slide!",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Linguistics",
    "firstName": "Iskra",
    "id": "VGVhY2hlci0yNDYxNjc4",
    "lastName": "Iskrova",
    "legacyId": 2461678,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "We wasted at least 20 minutes a class having &quot;tech issues&quot;. Our first quiz she waited until handing it out to let us know that we had to be able to spell complex medical terms with no mistakes or we would lose points. She would introduce new sounds and then tell native speakers of a language with that sound they were speaking wrong. Just don't.",
        "course": "LING4100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Lifeng",
    "id": "VGVhY2hlci0yNDA4NzU3",
    "lastName": "Jin",
    "legacyId": 2408757,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lifeng is a great lecturer, I enjoyed his class a lot. The material was very interesting. The course had a few large projects that were annoying and involved, but that has nothing to do with the instructor. He graded leniently.",
        "course": "LING3801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Linguistics",
    "firstName": "Bjorn",
    "id": "VGVhY2hlci0yMTI2MjA1",
    "lastName": "Kohnlein",
    "legacyId": 2126205,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Bjorn is really passionate about linguistics but the lectures are boring and he goes on a lot of tangents. Theyre funny, but not really conducive to the class. We spent a lot of time reviewing things from past classes which was weird for an honors class. Readings for every class but I never did them and got by fine. Hes a really great guy though!",
        "course": "LING2000H"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Super awesome guy. Very knowledgable and passionate about phonology. Subject matter is a bit abstract, but he does a relatively good job of explaining it in a way that students could understand. His explanations and lectures are sometimes a bit wordy and difficult to understand, but he's super helpful and accessible outside of class. Great guy!",
        "course": "LING4300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.8,
    "department": "Linguistics",
    "firstName": "Evan",
    "id": "VGVhY2hlci0yMDA0Njk3",
    "lastName": "Jaffe",
    "legacyId": 2004697,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's a really nice guy who's willing to help and answer questions. Encourages class participation and gives good feedback on the homework. I wasn't great at the course material and still managed to get an A with a bit of work. He's really flexible and I would definitely take him again if I could!",
        "course": "LING3802"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "very disorganized and does not clearly communicate his expectations for the course.  I would never recommend anyone taking a class with this guy unless you like being lulled to sleep during lecture and paying for it later when he tears your homework and papers to shreds. ",
        "course": "LING3701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 2.7,
    "department": "Linguistics",
    "firstName": "Jordan",
    "id": "VGVhY2hlci0yMzAwMTQ3",
    "lastName": "Needle",
    "legacyId": 2300147,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "He goes on tangents sometimes and takes a little too long in reviewing previous assignments, which causes issues in learning new material. He's gotten a lot less awkward as a instructor compared to the other review and very accessible outside of class. Lenient grader as well! Solid class for Linguistics Majors or people who like logic stuffs.",
        "course": "LING2001"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Easily distracted during lectures and takes too long going over homework or reviews (in one two hour class we spent only half an hour on new material), but he's a good deal less awkward than I expected based on the other review. Still needs to improve a lot imo, but has improved greatly and gets a recommendation, especially for Linguistics majors.",
        "course": "LING2001"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "TERRIBLE terrible terrible teacher. Incredibly rude and awkward. Made me very uncomfortable multiple times. I would not recommend him to anyone. He creates an environment where it is impossible to learn, and he should look at changing his profession so he does not have to work with people.",
        "course": "LING2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Byung-Doh",
    "id": "VGVhY2hlci0yNjQ4MzMy",
    "lastName": "Oh",
    "legacyId": 2648332,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Byung-Doh is AMAZING. He is EXTREMELY flexible (can turn in homework any time till end of semester). However, codebreaking can be very time consuming and difficult, which can make homework a slog, especially the group work. That said, Byung-Doh is probably the most caring professor I've ever had. He listens to students and acts on their concerns.",
        "course": "LING3801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.8,
    "department": "Linguistics",
    "firstName": "Kiwako",
    "id": "VGVhY2hlci0xODk1MTE2",
    "lastName": "Ito",
    "legacyId": 1895116,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Ito lectures usually the whole class. Grade is based off of quizzes, a few homeworks, and a final group project. The material isn't difficult, but I didn't find it very interesting. Dr. Ito knows what she's talking about and will call on people randomly in class. I never bought the textbook.",
        "course": "LING3701"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Ito expects participation from everyone and will call on you randomly, so make sure to show up and have a passing understanding of the materials for the day. She referred to the text book on occasion, but there were no assignments on it, and she posted the relevant experiments online anyways.",
        "course": "LING3701H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "The online course resulted in my failure to remember deadlines, but her interest in the material was great and made it very interesting. The interaction of the class was also helpful to learning. Homework and quizzes were easy. Very strong mastery of English language, so barriers don't really exist.",
        "course": "LING3701"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "There are little quizzes everyday and they can be really confusing due to the wording. However, she genuinely cares about making sure you understand the lectures if you are lost, and she gives plenty of extra credit opportunities.",
        "course": "LING2000H"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is awesome! My favorite Professor this semester. Although quiz every class, if you do the reading then they are simple. Readings are like 4-5 pages article and is not hard for me even as an international student. Her lecture is interesting and funny, and I think it's great for her as a foreigner to teach linguistic because she is multilingual.",
        "course": "2000H"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "I like her. She lectures well but a little too quickly. We spend at most two lectures on topics, so sometimes we don't get to go in-depth enough. Quizzes can be worded in a confusing way sometimes but they're not too difficult and reasonable. Regardless, I'd recommend her! Nice presence and fun class over all.",
        "course": "LING2000H"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Easy class to pass, grades come primarily from quizzes that aren't difficult, just worded to be tricky. Wouldn't recommend if you're looking for a thorough understanding of the material, she moved very fast through everything and her lectures were hard to follow and not very engaging/interesting",
        "course": "2000H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Favorite professor at OSU hands down! Loved going to each and every class. Kiwa is so down to earth and I loved the way she gave silly illustrations to explain concepts; it made it easy to remember content for sure! I loved how the format was such that I could just learn about phonetics without having to deal with any unnecessary pretentiousness :)",
        "course": "LING4100"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "One of my favorite professors at the university. A fun easy class and I wish to take more with her. Careful though, the quizzes are not necessarily difficult, but the wording is sometimes confusing. However, no midterm and no final, plus very minimal reading and homework! She's very passionate and a great mentor.",
        "course": "LING2000H"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not a strong professor, her style of constant quizzes is a poor way to get topics accross, and strange take in on papers was frustrating. All the criticism on here is well-based, really wish I hadn't taken her class.",
        "course": "2000H"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "I just wanted to say that all the negative feedback that this professor is receiving--while perhaps understandable--is excessive. If you put in the work, show up, and read what's required, you will do well. 2 papers (2-3 pages double spaced), easy quizzes if you study. The class isn't a layup, but it's more than doable. Work hardand you'll enjoy it",
        "course": "2000H"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst professor I had all semester, honestly. Cold, not helpful, and seemingly takes off points wherever possible. Constant quizzes are excessively difficult and confusing, (LONG) papers are somehow even worse. If you need this class, take it with someone else, if you're thinking of this for a GE... don't.",
        "course": "2000H"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "The quizzes I really liked because it is way easier to study for than a normal long exam. I just felt like if I would've taken it more serious I would've got an A in the class instead of a B.",
        "course": "PSYCH3701"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was a good introductory course into linguistics. However, the quizzes that Kiwa gave were often ambiguous and confusing, making it difficult to get good grades on them. Kiwa gives out a lot of extra credit, which is nice, but I think most students would prefer to have easier quizzes than random extra credit assignments.",
        "course": "LING2000H"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class provides a chance to learn the basic components of speech development, perception and production, and I would not have wanted a different instructor. Kiwa is patient, knowledgeable, and willing to accommodate to students of all academic disciplines. I looked forward to class everyday, and I intend to take her classes in the future! :)",
        "course": "LING2000H"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "No midterms but gives 20 total quizzes (10 reading myth quizzes, 10 course concept quizzes) that are 6 questions each but not cumulative, class gets easier throughout the semester so don't be discouraged if you don't do well on the first several quizzes",
        "course": "LING2000H"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "She's a sweetheart. It's clear that she really genuinely enjoys teaching. She is a relatively new professor, and sometimes that inexperience shows, but she is really passionate about the material and about helping students. One of my favorite professors.",
        "course": "LING2000H"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 3,
        "comment": "She was nice and the lectures weren't boring, just confusing at times. You have quizzes about twice a week that are annoying and nit picky, however there wasn't any tests and she offers a lot of bonus points. She doesn't really follow the syllabus dates for quizzes so come to class. There's a lot of class and group discussion. Overall she was meh.",
        "course": "2000H"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 3,
        "comment": "She wasn't a terrible professor, but I missed class the first two days of the semester from my Grandpas funeral. She was pretty unforgiving towards me after that. I had to beg for help and when I asked for it she didn't seem willing or happy to help. It wasn't that I was lazy, I was just struggling and she wasn't willing to understand. ",
        "course": "LING2100H"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ito Sensei is truly an expert in her field. Her lectures were very balanced; they didn't seem too formal yet were perfect for creating an environment where students could truly learn what was covered. I really enjoyed her enthusiasm and sense of humor as well. She was extremely patient and had higher yet realistic expectations of the students.",
        "course": "2000H"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Kiwa is really professional in her field, however, the lectures were often unclear, making the class confused about many of the topics and theories. Many quizzes and lots of extra credit (raised my grade by 15% with extra credit). She knew that some people were struggling but wanted us to succeed and pass the class. Very generous,strongly recommen",
        "course": "LING4100"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "I love her! She's so nice and she's good at explaining the topics. It's easy to understand the material and apply it to the quizzes, which are short and straight forward. Homework isn't hard, just takes some time. No final too, which was nice. Easy to approach and not intimidating. Once she brought us cookies! It was nice.",
        "course": "LING2000H"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "My favorite class this semester. Very interesting. Dr Ito cares a lot about student participation, and is enthusiastic in getting students thinking about the topic.",
        "course": "LING3701H"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "Subject matter was interesting. The only reason I hated her class so much was because I felt like I was being treated as a child. She assigned our textbook the first day of class and we could only order it online. She responded saying: \"I guess you'll just have to catch up when you get it.\"",
        "course": "3701H"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kiwa is an amazing professor. She knows her subject inside and out, and teaches it extremely well, through lots of class interaction. Her class was my favorite this semester, and I can't wait to have her for two classes next semester.",
        "course": "LING2000H"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "A great professor who is genuinely interested in her field, and also in her students' understanding of the course material. Always willing to answer questions and she will go find out the answer if she doesn't know it. A joy to have her two semesters in a row now.",
        "course": "LING2000H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Cory",
    "id": "VGVhY2hlci0yMzAxOTM4",
    "lastName": "Shain",
    "legacyId": 2301938,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cory is a great lecturer. You will need textbooks for Ling2000, as all the homework comes from them. But it's decently easy stuff and Cory is pretty great at explaining. Sometimes he does talk in circles but he usually figures it out and corrects himself if need be. Class is always interesting. Definitely would have him again!",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Singlehandedly responsible for me changing my major - I am now a linguistics major! He is straight forward about what he expects and always willing to take the extra time to help you understand what we're doing in class. He even helped me with topics in linguistics outside of our class in the specialization I'm interested in. Solid A- as a prof.",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "he was single handedly responsible for making me change majors. i was excited for linguistics until i took his intro class. he's a know-it-all who teaches like the students already know the curriculum by heart. he's a tough grader but almost every single one of his assignments have mistakes. he marked me absent for being 5 minutes late..",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.2,
    "department": "Linguistics",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0xODY2ODAx",
    "lastName": "Plummer",
    "legacyId": 1866801,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Literally THE best, most respected, most honorable, most professional, most honest, most recommended, most noble, most talented, greatest instructor at this era.",
        "course": "CSE3521"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Andrew Plummer is incredibly disorganized. This course is poorly planned, poorly organized, poorly covered. Tuition should be reimbursed until OSU decides to take the design of this course seriously.",
        "course": "CSE3521"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "He's really helpful, but he uses the most complicated formulas to explain simple things like median and mode. Labs were pretty basic, mostly told you exactly what you needed to do. Labs focused on R coding but exams didn't use it at all, had to know how to do things by hand for test",
        "course": "LING2051"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Marie ",
    "id": "VGVhY2hlci0yMDAyODY1",
    "lastName": "Marneffe ",
    "legacyId": 2002865,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I won't say she is not a good professor, so I give 5 for her. I rate 4 for the difficulty, that's not to say this class is unacceptable difficult, but it's for sometimes I cannot get her grading criterion. I believe all homework is created by herself then sometimes you are not sure what she's asking or what points she's expecting from you.",
        "course": "LING5801"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "The subject matter is DRY but Marie is just wonderful. You can tell she really loves what she does and helping us learn. She is always available to help you understand and more than willing to answer any questions. No midterm, take home/open book final. She was tough on grading, but only because she would go over and help fix it if you asked her.",
        "course": "LING4400"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marie is one of the best professors at OSU - Linguistics. You can tell by attending her lectures that she loves to teach. She is also very particular about Homeworks and tasks assigned to the students. Start early and you will never have problems with the Homework. She also has office hours if you need help with anything. Great sense of style too!",
        "course": "LING5801"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed having her as a professor. Very passionate about her work. She's very clear on the homework assignments (and even spells it out for you and gives you ample opportunities to ask questions). The  material she expects you to learn is pretty straightforward. No textbook, so you have to go to class.",
        "course": "LING4400"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Personally loved her as a person and professor! One of my favorite linguistics professors at OSU so far. Very tough grader, but you will learn a lot from her. Really respect her for her passion in her work. Very easy to get along with too. I personally found the lectures super insightful and fascinating as well.",
        "course": "LING4400"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "Doesn't care whether you understand the material or not. Would constantly go to her for help/clarification, but she just pointed out the fact that my answers were \"flat out wrong\".  Lectures are boring. Talks about a topic, then never mentions it again until the homework. VERY harsh grader. She also expects you to teach yourself w/o a textbook...??",
        "course": "LING4400"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Marie is a great teacher.. The one thing I dislike is she grades harshly. Some points off on one question could potentially tank your grade on the homework and final. I would go to her for help but would still be confused.",
        "course": "LING4400"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Marie is a great teacher. She knows what she is talking about and shows enthusiasm for the subject. The one thing I dislike is she grades harshly. Some points off on one question could potentially tank your grade. on the homework and final. I would go to her for help but would still be confused.",
        "course": "LING4400"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Marie's enthusiasm for her subject is infectious, and she provides excellent notes for every lecture. One thing I loved was her insistence on critically analyzing the current diagnosticsviews and tying in relevant applications to her lectures. The hwfinal are fairly challenging but definitely manageable, and she's great fun to learn from!",
        "course": "LING4400"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "If you read the lecture notes and use them when doing assignments, you'll do alright.  Sometimes her questions are harddon't have a good answer, and sometimes she grades kind of harshly.  Overall not the best, but not a hard class.",
        "course": "4400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.5,
    "department": "Linguistics",
    "firstName": "Cynthia",
    "id": "VGVhY2hlci0xMzgyNzM3",
    "lastName": "Clopper",
    "legacyId": 1382737,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Clopper is absolutely fantastic. She is organized, communicates and lectures clearly, and is truly invested in her students' success. She is always accessible and is just a wonderful person and professor. 11/10.",
        "course": "LING5101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Clopper's class was amazing. The directions for assignments were always super clear, so if you show up to class and learn how to do what the assignments cover, getting a good grade is a breeze. She's great at explaining material several ways, and seems to genuinely care about her students.",
        "course": "LING2051"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Clopper was a really nice lady with a good sense of humor. She's a good teacher that knows what she is talking about as is willing to help. However, I found her class painfully boring and tedious. A lot of work with Excel and R coding. No tests or quizzes, just homework and group projects. Not my favorite class but she made it bearable.",
        "course": "2051H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's great--really helpful and knowledgeable, and things just sort of make sense the way she explains them.  Class wasn't too hard, but likely would have been much harder with someone else.",
        "course": "2051"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Clopper, like many other professors in the linguistics department at OSU, is truly an expert in her field. Her strong research background shows in the way she teaches 2051H. Ling 2051, though tough, was very informative, and it can help the student who wishes to pursue research. I personally enjoyed her sense of humor, and she was very helpful.",
        "course": "2051H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Occasionally tough with grading, but kind and helpful. Very clear and willing to explain things more than once if something is unclear.",
        "course": "LING4100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Tough as nails grading, but at least you know you'll be trained well. Make sure you're an expert at APA because she'll take points off for the smallest error. Grade is based on 12 quizzes and 8 labs, I think.",
        "course": "LING4100"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 1,
        "comment": "Such a boring class. But it's also super easy. The most effort I usually put into my work was using my calculator and using copy and paste.",
        "course": "LING286H"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Made the class fun and interesting. Looking at language at math concurrently in a new way. Very clear, helpful professor. Strongly recommend.",
        "course": "LING286H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Daniel",
    "id": "VGVhY2hlci0yMzYxMjY3",
    "lastName": "Puthawala",
    "legacyId": 2361267,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best teacher I've had so far at OSU. Daniel is super funny, knowledgeable, and caring. His lectures are engaging too. I took LING3801 with him as a major elective; it's the most fun I've ever had in a class. Highly recommendhe won the Ling Dept. grad student teaching award last semester for a reason.",
        "course": "LING3801"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Daniel is a great professor, &amp; the class I took with him (3801) is fun &amp; interesting. He gives great lectures &amp; has an engaging, laid-back teaching style. There's plenty of opportunities to earn points, so it's not hard to get an A. The group projects at the end are a lot of fun, and there's no final He's also very handsome and has a great dad bod",
        "course": "LING3801"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very funny and easy to understand professor and in general a fun class. Though be wary: when it gets to picking a group, they are for the whole semester, so try to scout out people who are going to show up for class and are willing to put in some effort, don't just pick the people you sit next to like I did.",
        "course": "LING3801"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Daniel is an amazing teacher that keeps class interesting and fun; I guarantee you will enjoy sitting in lecture with him. The class itself is the most unique and fun experience I have ever had in any class at OSU. I will not spoil too much, but the class is themed around a &quot;fictional&quot; (?) world. The group projects at the end are very fun and easy.",
        "course": "LING3801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.9,
    "department": "Linguistics",
    "firstName": "Ivan Daniel",
    "id": "VGVhY2hlci0xMTA2NTUz",
    "lastName": "Hovermale Jr.",
    "legacyId": 1106553,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "DJ is definitely the best professor I have ever had. He really cares about your success inside and outside of the classroom. He keeps the entire class entertained with useful information and there is never a dull moment. The way he teaches and presents information makes the concepts easy to learn and understand as long as you listen in class.",
        "course": "IS460"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "A personal favorite professor in all of undergrad. I don't know if he's still there but if he is, take his classes. No attendance policy but you WANT to be there. Easy A but you still learn whether you like it or not.",
        "course": "LING101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "DJ is a fantastic teacher. He did everything that he could to make the class as fun and interesting as possible. If you have space in your schedule to take this class, TAKE IT. It's fantastic.",
        "course": "LING484"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "You have to experience his class to believe it.  This is an extemely busy man who always has time for his students.  To say he has a sense of humor ia akin to saying that Beethoven understood music. He does a lot of group work, which reults in creating bonds among students.  Even better if you're a Rowlings or Tolkien fan (unfortunately, I'm not).",
        "course": "LING484"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "DJ is AMAZING and HILARIOUS!  He always manages to make class fun and uplifting, even when a concept is hard to grasp.  He makes sure everyone understands before moving on and makes himself available to students outside of class.  He plays Russian techno during our &quot;breaks&quot; in class and has enciphered &quot;clues&quot; all over to  make the class more fun!",
        "course": "LING484"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is an AMAZING instructor, by far one of the best I have ever had. Period. Show up for class, and actually try, and he will bend over backwards to help you succeed. Plus, he's hilarious.",
        "course": "LING484"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "DJ was one of the most amazing teachers I've had so far! He made class a lot of fun, and had you actually learning without even realizing it. He also enjoys telling stories about his times in Russia, and they're always funny. Plus, he's a cutie. (: Highly recommended!",
        "course": "LING170"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "DJ was the &quot;TA&quot; for this class, but he might as well have been a professor of linguistics because he is just so good.  I loved every minute of his teaching.  He and Julie McGory taught this class together and it was fantastic.  My only regret is that this highlight was so early in my colelge career.  Highly recommended.",
        "course": "LING170"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "This course will blow your mind.  DJ immerses you in the spy world.  You really feel like a spy keeping and stealing secrets for an entire quarter.  Even though you are working your butt off you don't realize it because it is so much fun. I wish DJ taught all of my classes.",
        "course": "LING484"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great teacher and guy. He does take things on a bit lower level than necessary, but maybe I felt that because breaking the codes was easier for me than others. His tests are a little tricky, but open book/note, so just read and you should be fine. He really engages you. You should have an interest in analytical things to do well in this class.",
        "course": "LING484"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "DJ is the best teacher I've had, ever. Point blank. Best class. He has a great head on his shoulders, very respectful. He does throw in a few jokes that are controversial, but they are clean and very funny. Love his teaching style, very helpful. He isn't 'easy', not hard, but that is subjective. And he's great to look at. Just saying. :o)",
        "course": "LING484"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is by far one of the most amazing teachers I've had here at OSU.  He is SO SO SO willing to help you and take the time to explain things you don't understand.  If he taught more classes here I would absolutely take them.",
        "course": "LING201"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "DJ is a great teacher, my only complaint is that many times, he makes you feel like you are in kindergarten. Probably due to the young age of his children, he enjoys using ridiculous anecdotes and childish examples. He enjoys making his hands talk like puppets...",
        "course": "LING201"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "DJ is an awesome teacher.  He made class interesting w/youtube and games that helped us learn the chapters.  He is extremely available to meet for help outside the classroom. One of the best teachers I've ever had & loves teaching.  This course is very basic and fundamental, but I know the material after the weekly homework and quizzes. Perfect!",
        "course": "LING201"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "LOVED THIS CLASS! This was the only class that I was actually excited to go to, and hated missing it. DJ will go tho great lengths to make sure you understand the material. Take him because he will make you love the class!!!",
        "course": "LING201"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "DJ is probably the coolest guy ever, he wasn't even my teacher...or even my ta for that matter, he filled in a few classes and still helped met he entire quarter through the class to earn an A. Absolutely awesome guy, I could not recommend a better teacher.",
        "course": "LING484"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Just a follow up to the last comment.  I was in the same class.  He's easy because you understand his stuff and he tells you what you will get tested on.  The work doesn't seem like work either, because he relates this boring subject to real life to make it interesting. If you have to be bored though, at least he's kinda cute.",
        "course": "LINGU201"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Never in my life have I had a teacher as dedicated to the students as DJ. The time he invested into our classes to make linguistics interesting was incredible. He is going into computer linguistics, but I wish he were going into teaching. Our nation could use more teachers like DJ.",
        "course": "LING201"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had DJ for ling 201 last spring, and I just found out he's teaching again.  Take his class if you want a fun, easy A.  Highly recommend it for GEC or major/minor.  You'll learn a ton, have minimal homework after the 3rd week, and his quizzes/tests are easy.",
        "course": "LING201"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best teacher I've had.  I looked forward to this class every time.",
        "course": "LING201"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was my favorite class so far in college.  I looked forward to going to class, and I honestly was sad to see it end.  The review for the final was a cool Jeopardy game.  It really helped me remember stuff.  I recommend this class for anyone who wants to learn and get a good grade.",
        "course": "LING201"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "The most amazing teacher I have had in a loooong time!  He was so funny and made everything about linguistics (not the coolest subject in the world) interesting! if you screwed something up really bad, he'd let you redo it or give you extracredit stuff to do. he brings cookies in on peoples birthdays, and shows cool youtube stuff! AWESOME TA!!!!!!!",
        "course": "LING201"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is interesting, but kind of hard sometimes. I missed the firs two classes because I added late, but DJ is really helpful during office hours. There is a quiz and a homework every week, which gets old, but he does give study guides for them usually.  I would take this class again.",
        "course": "LING201"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a cool class. We learned about how codes were used throughout history and how to make and break codes.  The assignments were a little hard, but DJ was very helpful.  He spent like 2 hours helping me break a code for one of the assignments. He's pretty funny, too. No final, you design a code as a group and another group tries to break it.",
        "course": "LING484"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.6,
    "department": "Linguistics",
    "firstName": "Brian Daniel",
    "id": "VGVhY2hlci00MTg4MDM=",
    "lastName": "Joseph",
    "legacyId": 418803,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took the course online during covid and was physically abroad. Professor Joseph did basically everything you can imagine a professor can do at his best to help. Probably the biggest name in the ling department and also the biggest heart.",
        "course": "LING5901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Can't express how much I love and admire Brian. Genuinely the most knowledgeable guy, super dorky and funny! Even though it was a high-level class and he's been in the field for many years, he isn't too hard on students and mostly just cares that you're making an effort and engaging with the material. Also, emails back right away even if its a wknd",
        "course": "LING5901"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really nice professor, if he saw you make an effort, grades generously even if you were wrong. Hard to follow sometimes, he can get abstract or go off track easily. Has weekly assignments that are worth a low number of points so it helps students. In tune to student's mental health, dropped assignments from the syllabus when we got overwhelmed.",
        "course": "LING5901"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Joseph is awesome! He is very flexible and great about answering any questions outside of or after class.",
        "course": "EEURLL5627"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I was a terrible student in Dr. Joseph's class but he still did everything he could to help me. I was a linguistics major when I took this course, but I was clearly out of my depth with this material. Brian wants his students to do well and I think that's really important and he would even check in with me when I had missed class.",
        "course": "LING5901"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Pretty funny guy. But feedback wasn't always helpful. Content given via traditional lecture-based approach, so class was really dry at times. Brian was easy to follow in class mostly, but it seems to me that he focused more on grading rather than making sure we could apply the content on our own. Mixed feelings overall, but not the biggest fan.",
        "course": "LING5901"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Brian is a great professor. He is extremely helpful and answers emails very fast with lots of help and information. He has a phD from Harvard which makes me look up to him as a Linguist. The course is quite demanding but he'll help you and occasionally let you revise the homework for points. Not easy and not for everyone!Hope to have him again tho!",
        "course": "LING5901"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Brian is a great professor.  He definitely is an expert in his field.  He is a very generous grader and does not require attendance, and I felt bad because he seemed hurt when people didn't take his class seriously because of this.  Very nice guy, loved his T-shirt du jour!",
        "course": "LING597"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I believe this class is called Ling301 now.  Needless to say Brian is an awesome teacher.  Great with people loves his work and loves teaching it to us.  As long as you go to class and pay some minor bit of attention then you should do just fine with him.",
        "course": "LING311"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is one of the best professors I've ever had.  He really wants students to succeed, and I wish I could have him for every class.",
        "course": "LING59701"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "His class was very interesting, and I would recommend it to ANYONE, not just linguistics majors.  Brian is extremely nice and loves helping his students.  He's more about learning than grades, but he's not a difficult grader at all.  And he knows WAY too much about everything Greek!",
        "course": "LING59701"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Joseph takes a very cooperative approach to learning",
        "course": "LING59701"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Joseph is knowledgable and helpful. His depth and breadth of knowledge is amazing! You will definitely enjoy any class you take with him.",
        "course": "LING59701"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "He has a habit of going off on tangents so it's not always easy to keep one's notes organized, but other than that he's a very good teacher.",
        "course": "LING792"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is very nice and understanding, interesting lecturer. Tells little funny stories and jokes sometimes. Good guy.",
        "course": "LINGUIST"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 2.5,
    "department": "Linguistics",
    "firstName": "Rexhina",
    "id": "VGVhY2hlci0yNjMxNDU1",
    "lastName": "Ndoci",
    "legacyId": 2631455,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not reply to emails in a timely manner&#65292; Grant a low score to the thesis but provide no comments or explanations. ",
        "course": "LING3605"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Don't reply to e-mails.\nDon't respect students' works.\n",
        "course": "LING3602"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class is fully asynchronous so there are a few pre-recorded lectures alongside two assignments every week. She is very willing to answer questions and emphasizes her office hours whenever possible. Every assignment is given clear, timely, and encouraging feedback. Best professor to have for an asynchronous class.",
        "course": "ENG3271"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Posts 4-5 lectures a week up to 2 hours long that you have to watch in order to catch maybe 3 questions asked for weekly credit. questions are extremely unclear 50% of the time. the content setup is extremely unorganized and overwhelming. ",
        "course": "LING3602"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very harsh grader of group analysis work and final project\nhard to understand\nheavy writing assignments\ndid not learn anything i could apply to the real world",
        "course": "LING3602"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Such a hard grader. So much to read and so many writing assignments. Don't take this class if you're looking for an easy gened bc it'll screw ur gpa",
        "course": "LING3602"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "You read a lot of research papers in this class. Each paper is followed by a discussion in class. It can seem like a little too much sometimes but she is super relaxed and offered our class several extensions for papers!",
        "course": "LING3602"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Ndoci (call her Gina!) is a great Professor. She is very accessible for questions and is always willing to work with you. The course I took with her, LING3602, is extremely reading-intensive, however. She asks you to read a lot of scientific papers (that she provides), which you should prepare for each class. Other than that, she's great!",
        "course": "LING3602"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2,
    "department": "Linguistics",
    "firstName": "Philip ",
    "id": "VGVhY2hlci0yMDAzMDkz",
    "lastName": "Whitman",
    "legacyId": 2003093,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you don't want to spend focus and workload, lost points, don't ever take his class.\n\nRead other feedback from previous students",
        "course": "EDUTL5902"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "-unprofessional and unprepared\n-awful feedback and inconsistent with what he talked previously\n-unclear instruction and blamed students for bad homework\n- PEASE avoid this bad instructor   ",
        "course": "EDUTL5902"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Almost the whole class think his grading is strict and nonsense.",
        "course": "EDUTL1902"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad Bad Bad&#65281;",
        "course": "EDUTL1902"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He'll give you a very low grade with apologies.......",
        "course": "EDUTL1902"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "If u wanna a F GOOO for it !!!!!!!",
        "course": "EDUTL1902"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "The same paragraph gave me full marks in the draft, but low marks in the final version. The teacher did not correct the homework carefully, the requirements of the homework were very unclear, the emails were not answered in time. Even if you tried your best, he would not care. If you don't want your grades to look bad, please don't take his course.",
        "course": "EDUTL1902"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "The class is full of roll call questions and group discussions. Lots of writing in class. You can lose a lot of points because of small mistakes or omissions in your homework!",
        "course": "EDUTL1902"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing Professor ",
        "course": "EDUTL5902"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "IF you don't finish attendance assignments, he will punish you.",
        "course": "EDUTL5902"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "At certain points in the lesson he is unclear so make sure to ask questions if you are confused. He is laid back and kind of lulls you into a false sense of security  but at the end it gets harder than the first semester and more confusing. Definitely ask for help and do work with other people instead of by yourself.",
        "course": "LING2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.3,
    "department": "Linguistics",
    "firstName": "Ellen",
    "id": "VGVhY2hlci0yNDI3NDky",
    "lastName": "Dossey",
    "legacyId": 2427492,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She does a great job in fostering a caring atmosphere for her students. I learned more in this class in one month than some of my other core classes the entire semester. You have to write a few essays but she does a great job with everything. ",
        "course": "LING3605"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Prefer not to mention the course name. Her class is not fun at all. The courseload is generally okay but the whole course is insanely TEDIOUS. She never attempts to build connections with her students. She's gotten no passion for teaching. All that she has done in class is walk through the presentation. This is the class I feel the sleepiest. ",
        "course": "LING2051"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Her lectures were very well-organized and easy to digest! She helped me out a lot during office hours too and was very encouraging in general. Some of the quizzes were a bit tough, so don't wait until last minute to study! Most of the content was from the slides, but read the textbook just in case as well. Try to start your final paper early, too!",
        "course": "LING2701H"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Dossey went out of her way to make this a tough class. She would never record, as it was our responsibility to take accurate notes since it was basically like being in-person (it's not). Quizzes were given with material she would cover after the quiz. Slides were generic and vague, important info was given verbally so not recorded. 0/10",
        "course": "LING4100"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I would describe Professor Dossey as a solid professor. She's accessible if you need her and I would suggest asking questions about the labs. She usually will prompt you towards the right direction! While I would say the lectures are a bit boring, the material is interesting and the labs are *almost* fun! You should attend class/office hours.",
        "course": "LING4200"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Ellen is a very accessible teacher and is always ready to help you without making you feel stupid. Coding and linguistics can be hard for a beginner, but she takes it slow, while still making you work to keep up. Her slides are uncluttered and easy to read, just like her. She gives ample time for labs, homeworks, and questions! (they can be tough!)",
        "course": "LING2051"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Ellen is great. The class itself is a breeze, and she's incredibly informative when it comes to R and Praat. If you don't show up, you're going to struggle and she'll be less likely to help you. But if you show up and struggle, she will go above and beyond to help you out. Pay attention, and you really shouldn't struggle",
        "course": "LING2051"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "It is a very difficult class, and it's boring.",
        "course": "LING2051"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 5,
        "comment": "This course is very difficult. She is a tough grader. This course is really not a shui ke.",
        "course": "LING2051"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Prerna",
    "id": "VGVhY2hlci0yOTEyNDk3",
    "lastName": "Nadathur",
    "legacyId": 2912497,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor",
        "course": "LING5401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Ashwini",
    "id": "VGVhY2hlci0yMzE5MDE4",
    "lastName": "Deo",
    "legacyId": 2319018,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Even though this was a class (Linguistic History of India) that had never been taught before, Dr. Deo created a syllabus that not only provided a comprehensive survey of a massive topic, but was also interesting, funny, dynamic, and multidisciplinary. I would strongly recommend taking one of her classes if possible.",
        "course": "LING4400"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Deo's subtle sense of humor made an otherwise dry class worthwhile. At times it felt like she was repeating herself and taking a long time on the easier material and skipping through the harder material, but she is willing to help outside of class.",
        "course": "LING4400"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very kind and clearly passionate about teaching. The subject matter was pretty dry but she has a subtle sense of humor that's endearing. She grades in a very meticulous way, but she does her best to be clear about what she's looking for. A very good professor.",
        "course": "LING4400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Barry",
    "id": "VGVhY2hlci0yOTc3NjQy",
    "lastName": "Baker",
    "legacyId": 2977642,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Barry is incredible. Very caring & wants his students to succeed. Zoom lectures are pretty boring, but they are helpful when learning IPA because he clarifies a lot that the textbook doesn't. He has two big transcription projects, but he is pretty lenient & an easy grader. He responds to emails exceptionally well, which I didn't think was possible.",
        "course": "SPHHRNG3320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.6,
    "avgRating": 2.6,
    "department": "Linguistics",
    "firstName": "Robert",
    "id": "VGVhY2hlci01MzM2OTI=",
    "lastName": "Levine",
    "legacyId": 533692,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Levine is wayyy too advanced for teaching this class. Only 4 assignments which your whole grade is based on. Told me I was doing work correctly but then gave me a 0. He only uses his own slides and doesn't explain the basics. Don't recommend.",
        "course": "LING4200"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Professor Levine seems to be teaching at a graduate level to undergraduate students. The only sources of information we had to learn was from him and his slides. The class had no prerequisites for math or logic but it was used throughout the whole class. This class dove straight into advanced topics. I do not recommend taking this class.",
        "course": "LING4200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prf. Levine is incredibly knowledgeable and is able to give feedback on any project undertaken. He takes special interest in students' projects who come to his office hours/meet with him outside of class. If you struggle with something, he will help you out as long as you make some effort to meet with him.",
        "course": "LING4780"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "He's okay but too smart.  He didn't provide anything to go off but his slides (not even notes, let alone a textbook) and would frequently get off-topic, barely covering what he'd eventually test you on.  Assignments required creativity, but only creativity he agreed with.",
        "course": "LING5202"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Horrible class, bad professor. Super nice guy who is willing to help and is passionate about his subject, but horrible at explaining what he means. Only readings are written by him, so they are just as difficult to understand. Took this to get out of math. If i had to do it again, I'd just take math. Test avg: 50s-60s. Worst grade I've ever gotten.",
        "course": "LING280"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "Mr. Levine seems nice and tries to help, however, the material is extremely difficult to follow and understand.  Average on the midterm was in the 60s. He tells us to read his PDF files which he wrote, so they're just as useless as the lectures. There are 7 grades total: 3 homeworks, a midterm, 2 homeworks, and a final. Too smart to teach undergrad",
        "course": "LING4200"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "No textbook. Posts notes online. Uses metaphors which sometimes relate to complex subjects like quantum physics. I got an A in the class, but I always turned in the assignments, midterm, and final unsure how well I'd do because I never felt sure that I knew what he was asking us to do. Really eager to help, he just doesn't do it well.Openbookexams!",
        "course": "LING4200"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "Overall, pretty good prof. Like others said, his lectures are sometimes hard to follow but if you keep him on task and ask questions he'll come back to subject. I had him at 8:30am and had to bring coffee because you really have to pay attention to do well. It was challenging, but I learned a lot. Only take his class if you are up for a challenge",
        "course": "LING502"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 5,
        "comment": "Do not take this class as a GEC. Way too hard for a gen ed class. He is willing to help but grades very hard and doesn't explain things very well. Not worth the time or frustration.",
        "course": "LING280"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is pretty awful...if you're looking to skip math and take this instead, just take the math class. Class average for the midterm was a 46, and the TA is really pompous. Unless you're planning on going to all office hours and putting in an insane amount of work, just skip it. Prof Levine is a nice guy, just too smart to teach undergrad.",
        "course": "LING280"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not a good class. Most people take it for a math/logic GEC. From the very first lecture, 90% of students were completely lost. There is no textbook. Only reading is citation-free blog posts  by the professor that are just as cryptic as the lectures. Just take a math class! Midterm class avg was 45% for a 280 level class.",
        "course": "LING280"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "If the below comments were honest, they would say the class is hard & leave it at that.  Certainly, it is hard (about 5/35 dropped it), but Mr. Levine himself is excellent.  He has a ton of passion and made class a joy to attend.  Of those who stuck with it, 2 or 3 had minor complaints & the rest of the class loved it (I saw the anon. evaluations)",
        "course": "LING601"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible lectures, assignments, and tests! I regret taking this class, very difficult and useless material. Avoid at all costs!",
        "course": "LING601"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ridiculously difficult homework assignments.  Run of the mill tests.  Lectures tend to have nothing to do with either.  Grades linguistics majors much easier than non-linguistics majors.",
        "course": "LING502"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class got whittled down fast because the first few days he used analogies to astrophysics and quantum theory... which is what everyone can relate to, right&#63; It was a ridiculously hard class but if you stick with it, it's not too bad. I don't know if I actually learned anything about syntax but I think he gave up on our class.",
        "course": "LING502"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "He would give really confusing, hard-to-grasp lectures and assignments, but then the tests were pretty easy (open-book/notes) and didn't relate much to class material.  I can't say I learned a lot about syntax in this class, but part of that is probably due to my own lack of interest in the subject.",
        "course": "LING502"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "I think he was pretty great. The class itself wasn't all that phenomenal, but I had a death in my family and a grandma with cancer whom I had to visit frequently in the hospital; because of those hardships I probably missed about 4 classes and 1 midterm. He was so understanding and compassionate and ready to do anything to accomodate me. Great man.",
        "course": "H201"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "This man may have been the worst professor I've ever had.  This is why senority sucks!  This man has no distinct teaching style, and his monotone voice makes you want to fall asleep.  Not very helpful, and over all a very poor teacher.  I would not recommend this professor for anyone.",
        "course": "LINGUISTICS201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Emily",
    "id": "VGVhY2hlci0yOTAxNDI0",
    "lastName": "Napoli",
    "legacyId": 2901424,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is super kind, funny and engaging. She goes off on a lot of random tangents, but they are entertaining. Fair amount of assignments outside of class, but nothing too difficult. She's very knowledgeable in linguistics, and is happy to answer questions and give alternative assignments/extensions if you need them. I would definitely take her again!",
        "course": "LING3701"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Emily makes this class fun and easy. The lectures were really interesting and she does a good job of making the material relevant to our lives. Fair amount of assignments, but as long as you put effort in you will do fine. There are weekly quizzes for attendance purposes, so make sure to be there for most of those. Exams are super easy.",
        "course": "LING3701"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor! Overall her class is pretty easy and it's not very heavy when it comes to work. The lectures themselves are quite interesting and she makes it pretty relevant to our current lives. The homework assignments and exams are easy and I never had to worry about my grade in this class. I would definitely recommend! ",
        "course": "LING3701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Kevin",
    "id": "VGVhY2hlci0yOTg5MTQz",
    "lastName": "Lilley",
    "legacyId": 2989143,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kevin is a very funny and caring teacher. I took this class to fulfill a random requirement I was missing the semester before graduation and the class was really enjoyable. He definitely grades some things pretty particularly but none of the assignments were too difficult. His version of exams \"Big Quizzes\" were very easy to complete. ",
        "course": "PSYCH3371"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.4,
    "department": "Linguistics",
    "firstName": "Becca",
    "id": "VGVhY2hlci0xODA2MDU0",
    "lastName": "Morley",
    "legacyId": 1806054,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her Ling class is extremely difficult if you are a non-Ling major. Material is not difficult but her grading is when you are basically figuring everything out on your own. Lectures are question based, with zero structure. She is nice, but not helpful. She teaches a freshman class at a graduate level. Would not recommend taking her courses.",
        "course": "LING4100"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "The class is very frustrating because it's so vague. There are few assignments and no exams which can be nice, however, the grading is very confusing and inconsistent. There are no written instructions or rubrics and all the directions are given during class in the first five minutes. Lectures are very dry.",
        "course": "LING3701"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took LING3701 online with Dr. Morley last semester. I felt like she was unapproachable and kinda dismissive. Along with that, she randomly started grading everything way harder later in the semester with little to no explanation. Also, assignments were more difficult than they seemed and the instructions were extremely unclear. Do not recommend.",
        "course": "LING3701"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst professor ever! Avoid her if you can. Very inconsistent expectations, confusing, tough and sporadic grader. Very smart but a horrible teacher. Lectures are hard to follow and unhelpful.",
        "course": "LING3701"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "The content of her course is not difficult at all. But she grades unfairly based on personal preferences. You will likely end up with a really bad grade if for some reason she doesn't like you. She doesn't have a clear grading system and she doesn't explain what she wants. Avoid her if you can, or you will likely hate linguistics in general.",
        "course": "PHONOLOGY5301"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "You want to go to class. It moves very quick and there is a large project at the end of the semester that requires all of the in class exercises. You will work for this grade, but Becca is very willing to help and encourages you to form your own opinions. Make sure you get good partners to help, a good group can make or break your grade.",
        "course": "LING4300"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "She was nice and funny but didnt have much structure for the class. It was easy, with no exams and minimal homework - shouldve been an easy A. Unfortunately, she graded sporadically and didnt put everything in Carmen so my final grade was a B+ but in Carmen I had a 95% so just be aware of that.",
        "course": "LING2000H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Morley makes you work hard, but she's fair. She makes you build things up from the basics before you can take anything for granted. If you work hard, come to class, and pay attention, you'll do fine in her class. Her expectations are clear and while it'll require a lot of work, if you put in the effort, it ends up being worth it.",
        "course": "LING4300"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Morley is super knowledgeable about what she teaches (which is enjoyable), but sometimes her lectures can get dry. She's great at answering questions and explaining tricky concepts, but it was tricky to know how she'd grade assignments. Make sure to elaborate on all answers for a shot at full credit. She appreciates effort.",
        "course": "LING4100"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "A bunch of non-Linguistics majors taking a GE class with Becca turned out to be a disaster. While she's a respectable person, she was unable to teach to our level and would not answer questions for help; no midterms was nice, but the rest of the class was a disaster like I said.",
        "course": "LING2051"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very approachable. But beware of group projects. Dont let them screw your grades.",
        "course": "LING4300"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her explanations were confusing and hard to understand. I felt that the lectures were not helpful. Also, she is not very approachable.",
        "course": "PHONOLOGY5301"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have had. She does NOT prepare for classes. All she does in class is answering questions, and if there are no questions, she begins talking about her personal experiences. Did not learn ANYTHING(literally)from her. Basically learned everything myself. Never replies to your emails. Do not recommend her.",
        "course": "PHONOLOGY"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "GREAT PROFESSOR! She is very informed and likes to help students with work. Go to her office hours, she's very receptive.",
        "course": "LING5301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Conner",
    "id": "VGVhY2hlci0yNjk3Mzgz",
    "lastName": "Rouillier",
    "legacyId": 2697383,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class was a lot of work, but I think that goes for all second-level writing courses. Nobody likes doing long projects that involve big papers, but he kept it spread out so that it wasn't overwhelming. The content of the class was very interesting and he kept it fun. Some of the assignments are tedious but you get through it.",
        "course": "LING2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.3,
    "department": "Linguistics",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xOTI0MjEx",
    "lastName": "White",
    "legacyId": 1924211,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Good introduction to language and computers. Grading is a little picky but it is more than offset by the generous extra credit on every assignment. You will probably get bored if you aren't actually interested in language and computers but can be interesting if you are.",
        "course": "LING3802"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is passionate about the subject and has some pretty cool in class activities. Lots of extra credit on homework and exams. That said, some lectures are tedious to sit through. Grade is based on 2 exams, a final essay, homework, in-class activities, and extra credit at home quizzes.",
        "course": "LING3802"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Easy class to pass, but I'm not sure what I learned. It kind of felt pointless and all over the place. He was usually nice enough, but sitting in that class was painful. Plus, I finished with a 103%, and yet he still called my last essay &quot;a disappointment&quot; despite giving me an A on it and my A in the class.",
        "course": "LING3802"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "I couldn't really tell you what I learned in this class. Tended to just talk about a lot of computer science jargon that you won't understand if that's not your major. Wasn't really helpful for linguistics majors.  ",
        "course": "LING3802"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Great teacher, maybe a little dry sometimes but he really knows what he's talking about. Gives extra credit on every assignment. Very nice",
        "course": "3802"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "I took Michael for LING 3802 and I would not recommend taking him. His lectures are long, his grading is hard and he doesn't answer your questions. His homework directions were very confusing ending up costing students points. In my opinion he is very disorganized and isn't teaching to help students succeed. Avoid taking Michael. ",
        "course": "3802"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Clint",
    "id": "VGVhY2hlci0yMjI4MTI2",
    "lastName": "Awai",
    "legacyId": 2228126,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Clint was one of the best professors i've had. I love how he talks so much about his background and how he was as a person. Super funny and supper passionate. Overall a great dude and I would take another one of his classes if I could. ",
        "course": "LING3601"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awai-Jennings was the best professor I've had in my career at OSU, HIGHLY recommend for any courses!",
        "course": "LING3601"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "A great instructor, and really helped me with my disability accommodations. ",
        "course": "LING3601"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Clint is absolutely amazing! He was always super understanding in any circumstances you communicated and was very flexible when you needed it. As long as you show up to class and try to participate a little, participation is easy, and the homework and final paper was very straightforward, and he gave great feedback for both.",
        "course": "LING3601"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Clint is hands down the best instructor I've ever had. He's so passionate about the material and explains it in an easily comprehendible way. A genuinely kind and likeable person AND he shares great Linguistics memes! The class was very interesting and easy but if you do struggle, he is more than willing to help. Highly recommend!!",
        "course": "LING3901"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is an amazing professor who brings you food from Hawaii and is very relaxed. He is so nice and would do anything to help you. If you can you should take this professor in any course that he teaches!",
        "course": "LING2000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is the best professor I have ever had. Accessible before, during, and after class, I cannot recommend him enough. He knows his stuff and he makes sure you do, too. He connects everything to his Hawaiian heritage and everyone was there for it. He would bring in food and demonstrations. I would take every class he taught if I could",
        "course": "LING3601"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is easily one of the best professors I have ever had. He goes above and beyond to make sure that you understand the material. He encourages the class to email him with questions and responds right away. He has such a warm and caring personality and he creates a great environment that makes you look forward to his class. Also a great cook!",
        "course": "LING3901"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is one of my favorite professors I've had. His class is super engaging and personable, and he genuinely wants every person in the class to succeed. He made the course content interesting and also shared some great linguistics memes and Hawaii language and culture facts. If you can take a class with him, DO IT",
        "course": "LING3901"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is one of the most genuine professors that I've ever had. He's hilarious, always willing to help students, and knows the material very well. He is very engaging and makes the material fun and easy. This is the only class to which I look forward everyday.",
        "course": "LING3901"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awai is one of the most authentic and empathetic instructors I've ever had! He is genuinely excited to share his love for historical linguistics. It's hard NOT to like this class. He created a positive environment, never condescended us, and folded in elements of his Hawaiian background when it was appropriate.",
        "course": "LING3901"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "He really cares about whether you understand the material and is always willing to meet outside of class and office hours. He makes lectures as enjoyable as possible, knowing full well that this class isn't the most riveting. Show up, ask questions, stay after if you're still confused, and you'll pass with flying colors.",
        "course": "LING3901"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is awesome! He really cares about his students and wants you to do well in the class, so he makes himself readily available through email and office hours. The class is organized really well and the expectations are clear. He is from Hawaii so you learn a lot of cool authentic stuff, and he makes yummy treats to eat on exam review days :)",
        "course": "LING3901"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interesting material and lectures. Discussion in class is super fun. He has a unique sense of humor.  And he's from Hawaii so he has tons of examples in Hawaiian pidgin language. Overall highly recommended!",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.2,
    "department": "Linguistics",
    "firstName": "Ila",
    "id": "VGVhY2hlci0xNjE4MTY4",
    "lastName": "Nagar",
    "legacyId": 1618168,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "TBH, she wasn't even my real teacher, and she became our temporary teacher because my real teacher had to leave for a family emergency. She taught us random things that I had no idea about and then also would make us speak in Hindi when we hadn't even learned that. I wish she would've slowed down on how much information she was giving us.",
        "course": "HINDI101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Not a bad class. Her lectures are ok--sometimes confusing, but as long as you make an effort on the lecture questions, you'll be ok. Readings are dry but their material is not heavily tested. Films are ok--they get a little better as the class goes along. It's an easy class, and I learned a lot. Not a cakewalk. But if you make effort you get an A.",
        "course": "SASIA3625"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Honestly, she wasn't bad at all. I would recommend if you like working at your pace. Just that there are lectures and reading, but I never read anything until the quizzes and lectures have questions. not a tough grader.  ",
        "course": "SASIA3625"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unforgiving professor, the workload is terrible for a 3 credit class. The movies, lectures, and material are insanely dry and boring. Every week there are 3 lectures that are way too long and her commentary contributes to nothing. She loves to hear herself talk. She is also a very rude professor and has no sense of mercy if a student messes up",
        "course": "SASIA3625"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Normal amount of work for an asynchronous course, but the group projects are absolute nightmares. I had trouble communicating with my group so I reached out for help/guidance. Instead of replying back to me personally, she \"solved\" it by emailing the entire group with a threat to take points from all of us if she heard of anymore issues from us. ",
        "course": "SASIA3625"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Too much work for a 3 credit class that most people take just to fulfill a GE. There was 3 lectures of about 30 minutes each every week, and she expected us to watch 3 hour long Bollywood movies to participate in the questions. Her directions for the group projects were unclear and instead of clarifying, she was just passive in the grading. ",
        "course": "SASIA3625"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Nagar was great! There were 3 weekly online lectures (10-20 mins) with 1-2 questions to answer in them. There were a few quizzes, all extended response. Then two group projects. Pretty stress-free and not crazy difficult. She does give a lot of material at once on top of a weekly movie which was annoying, but the assignments-a breeze.",
        "course": "SASIA3625"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS IF YOU THINK ITS GONNA BE A CAKEWALK.",
        "course": "SASIA3625"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "This is too much work for a 3 credit class. First, you are given five lectures, each 30-50 minutes long, and have free responses for each of them. Always go for the word count maximum because they take points off for not being engaging. Projects are time-consuming and just overall too much work! Find another GE because this took up a lot of time.",
        "course": "SASIA3625"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "It's spring break and I'm doing some crack group project because of her. Enough said.",
        "course": "SASIA3625"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 1,
        "comment": "She sucks. I thought the class would be fun and an easy A but I literally have more assignments from this boring class than from my major core classes. For some reason she's stuck in the 70s because all the movies you're supposed to watch (1-2 a WEEK) are from then. Wiki summaries>>\nAlso her accent is annoying and fake (I say this as an Indian)",
        "course": "SASIA3625"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "Took SASIA 2220 and she was great overall. You have unlimited time for the quizzes and tests from the time they open till they close, so you can exit out and resume whenever. Didn't watch any lecture videos or do readings until the quizzes and exams and always got a 100%. ",
        "course": "SASIA3625"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "She seems like a nice lady but the workload is horrible. The movies were hours long and the lectures were about average but along with movies and readings it was a lot of work to go through. If you are looking for something easier than this is NOT the class for you. again shes nice but the workload is horrible and I wouldnt reccomend. ",
        "course": "SASIA3625"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "It is the middle of the semster and this class is too much. The amount of readings and lectures shes posts along with movies is way too much. Last week we had a 2hr and 30 min movie along with readies and 3 lecture videos. She is doing way too much for GE and honestly if you want an easy A this would not be the class for you. I regret taking her",
        "course": "SASIA3625"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such a nice professor. So passionate about Bollywood films and what she does! Amazing professor, probably my favourite this semester.",
        "course": "SASIA3635"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "It's a super boring class with super dry content, really horrible, poor quality, it's painful for me to do the homework and especially painful for the quiz and the final exam. For the final exam, you need to write 500 words for each one. If you are looking for an easy A, take the theater class.",
        "course": "NELC3625"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is an easy A class however I have two complaints. The material we covered, in my opinion, was not interesting nor engaging. Secondly, the final has 5 questions to which the answers to have to at least be 500 words. This is unreasonable because the answers would be about 300 or less words.",
        "course": "NELC3625"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Ila she is so sweet. I took her online for the history of South Asia and I honestly learned a lot. The quizzes are very simple and you get unlimited time to do them. Interesting assignments that are actually interesting to do. Easy grader and a really sweet woman overall.",
        "course": "NELC3620"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is fun and enjoyable! You just have to watch the lecture videos, take notes, and then summarize your notes each week for the short responses. I'll be honest, I didn't watch any of the films, just read the Wikipedia plot summary, and I got all 10/10s. The movie clips I did watch were fun, and I learned a ton about Bollywood. Easy A!",
        "course": "NELC3625"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 2,
        "comment": "I felt that a lot of lectures were unclear and that she wasn't very accessible or interested in helping students, and most of the assignments were just regurgitation. However, because of that, this class is a super easy A so I can't really complain much about it, but I felt like I didn't learn much actual useful information.",
        "course": "NELC3625"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ila Nagar is the BEST professor at the Ohio State University. I am taking her course online. All you have to do is listen to weekly lecture and watch weekly Indian movie and write a reflection based on certain week. You will have to make one podcast on a movie. If you want A take in Culture and Diversity take this course. I love this professor.",
        "course": "NELC3620"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor.",
        "course": "HINDI101"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class material is fun and easy, but it seemed incredibly easy to get away with not watching the movies, not watching the lectures, and not doing the reading because the class was online. I personally did most of the aforementioned and found the class to be easy and entertaining. She's a good professor who really cares and the class is easy.",
        "course": "NELC362502"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "Ila taught me so much about life in South Asia. She incorporated multiple countries and social groups and aspects of the culture, and while there was a lot of reading it was manageable and interesting, interspersed with other media like films. She also gave generous extra credit opportunities! Ila is great!",
        "course": "NELC3620"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 1,
        "comment": "She is amazing--completely hilarious personality. As long as you stay on her good side and do not abuse the times she lets you skip, you will be fine",
        "course": "HINDI104"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome, if you want to learn a language but dont know which one, take hindi, you will learn a lot and she is absolutely awesome!",
        "course": "HINDI103"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "Excellent!",
        "course": "HINDI101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Laura",
    "id": "VGVhY2hlci0yOTg4MDAx",
    "lastName": "Siragusa",
    "legacyId": 2988001,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor for Italian 1101. There is a good amount of online homework but that is to be expected for a 4 hour course where 1 hour of that is to be completed online asynchronously. Very nice person and very funny, you really can't ask for a better professor as a beginner in the language. Do the work, attend class, and you'll be perfectly fine.",
        "course": "IT1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the nicest teacher I have ever had and she truly cares about the success of her students. It is a lot of group discussions, a couple easy papers, and one long paper instead of an exam. She offers extra credit if you are in need and is a pretty easy grader. ",
        "course": "LING3605"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "The sweetest woman! She is very caring and passionate about what she does. As long as you put effort in and are respectful, you will do just fine! :) She responds quickly to emails and loves to hear about your day!",
        "course": "LING3605"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Laura is so caring and understanding to all her students. One of the sweetest professors! Attendance is worth a small portion of your grade, but she mainly cares about you just putting the effort in for her class.",
        "course": "LING3605"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Might be one of the only professors who genuinely wants all their students to do well in their class. She's lenient on deadlines so please take advantage of any opportunities she gives you. She doesn't grade harshly and is overall a \"student's teacher\". Not to mention she's the kindest person ever.",
        "course": "LING3605"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Angelica",
    "id": "VGVhY2hlci0zMDQ5NzY2",
    "lastName": "Aviles-Bosques",
    "legacyId": 3049766,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ms. Angelica was a fun professor. She is very accomodating and personable both in lectures and office hours. ",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Jingyi",
    "id": "VGVhY2hlci0yNTcyNTcx",
    "lastName": "Chen",
    "legacyId": 2572571,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Took her when she was a graduate student. Clear expectations; straightforward and easy intro class. High participation and completion emphasis. Lectures can be dry at times, but never too heavy in material. Seems like she's still finding her grove in teaching, I hope to see her confidence and passion grow as the years go by. ",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Jingyi was a good instructor. I didn't participate much in lectures and mostly did homework, but the most important part was the practice problems at the end of each lectures. They would be very similar to the ones on exams. She is an easy grader as well and approachable for questions.",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "A good resource for students. She was very informative during lectures and gave us ample opportunity for practice. It was a pleasure taking this class!",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Chens class was very good. We studied lots of intro linguistics topics; for each, we had 1 homework assignment plus 1 mini-paper about a textbook chapter. She always answered e-mails fast, and graded most assignments within hours/days. Some subjects were a little confusing, but she did her best to explain them clearly. Recommended!",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Emily",
    "id": "VGVhY2hlci0zMDQ5NTU1",
    "lastName": "Sagasser",
    "legacyId": 3049555,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "My top notes are that LING 2001 with Emily doesn't have that many assignments outside of exercises, so doing well in the heavier weighted assignments is crucial. Expect this class to be more mathematics-like in its theory and approach. Problem sets are key. Smaller class, ask questions. Emily is always willing to explain and guide you. ",
        "course": "LING2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.8,
    "department": "Linguistics",
    "firstName": "Chris",
    "id": "VGVhY2hlci0xNDE5NzU0",
    "lastName": "Worth",
    "legacyId": 1419754,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing teacher and so funny. Makes everything relate to the subject matter. Easy but only if you go to class. Remembers everyone's name and if you ask for help will put in so much effort to help you understand the material. Stayed with students all night and even will take calls over the phone to walk students through problems. I recommend him!",
        "course": "LING280"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "super easy class if you understand even the slightest bit of math. super clear professor funny too. made a legit effort to learn peoples names and make class fun. No textbook which is nice on my wallet too",
        "course": "LING280"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Chris was awesome. He made a really boring class interesting. Make sure you go to class or you will be absolutely lost. No tests just problem sets worth 200 points a piece (600 points of the 1000 point class). These are graded for correctness. And you MUST go to class in order to do well on them. He's awesome though and VERY helpful.",
        "course": "LING280"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "he saved my life!!!",
        "course": "LINGABA"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Fun GEC. He made it really interesting. He is really helpful and funny.",
        "course": "LING280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Linguistics",
    "firstName": "Zack",
    "id": "VGVhY2hlci0yMDIxOTg4",
    "lastName": "De",
    "legacyId": 2021988,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible professor.. do not recommend. Not helpful at all, teaches course curriculum incorrectly and then when students get questions wrong on the exams by answering the questions how he taught them he will respond that you should have known he was wrong through textbook readings. There is only two exams, a midterm and a final with homework often.",
        "course": "2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.2,
    "department": "Linguistics",
    "firstName": "Deborah",
    "id": "VGVhY2hlci0xOTYyMDA5",
    "lastName": "Morton",
    "legacyId": 1962009,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Morton is great!The class itself is quite easy to do well in if you have some experience with linguistics (and the first 2-3 weeks will be a tad boring, but stick it out and it gets fascinating), but she's very helpful and understanding towards students wo prior linguistics study. She's very engaging and her lecturesgrasp of the subject is ace.",
        "course": "LING3901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She seems really into it.  Sometimes she's weird about grading and doesn't give the impression that she's super knowledgeable.  The class was hard if you haven't taken linguistics before and easy if you have, and she is definitely incredibly helpful.  Textbook only helpful as a reference.",
        "course": "3901"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Morton is by far the most helpful teacher I've come across. I took an upper level linguistics course with no knowledge of this subject at all, so it definitely took a lot to get used to it. She was amazing at helping and even met outside her office hours for help. Don't have to read, get a cheat sheet for midterms, and have a take home final. ",
        "course": "LING3901"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.8,
    "department": "Linguistics",
    "firstName": "William",
    "id": "VGVhY2hlci0xOTM2NzY1",
    "lastName": "Schuler",
    "legacyId": 1936765,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "There is a lot of reading for every class meeting. You must post on a discussion board before every meeting, so the reading is mandatory. The lectures were very confusing, lots of abstract modeling that he doesn't even test you on. He's very direct about tests, so you can still do well in the course and not completely understand every concept.",
        "course": "3701H"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Assigned a lot of reading, but most if it was easy and interesting; asked that you comment on what you read for participation grade. It seems like he was thrown off this semester by the format of the book changing and made the lectures really language model-heavy instead of concepts. I suspect it'll be balanced better next time.",
        "course": "LING3701H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Schuler is well prepared for class, knowledgeable, funny, patient, helpful and humble. It is obvious that he wants students to succeed, and I would definitely recommend him to anyone. I can personally attest to his patience: there was a student that would always interrupt in class and he didn't want to strangle him!",
        "course": "5801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Linguistics",
    "firstName": "Christy",
    "id": "VGVhY2hlci0xOTM1NzUx",
    "lastName": "Melick",
    "legacyId": 1935751,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Speaks quickly and online slides are not the most clear.  Reading the book is essential and the exams are fair but very detailed. ",
        "course": "2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really straightforward and to the point instructor. She tells you exactly what's on the exams and quizzes, and how to study",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Qingyang",
    "id": "VGVhY2hlci0yMjg3NDU4",
    "lastName": "Yan",
    "legacyId": 2287458,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Online class but required to attend required dates and times.",
        "course": "LING1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 2.6,
    "department": "Linguistics",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0xNTA1MDYw",
    "lastName": "Miller",
    "legacyId": 1505060,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "You won't learn a single thing, but it is an easy A for people who need GE data analysis credit. Also, make sure to schedule office hours if you need to talk to her; I showed up several times during her scheduled office hours, and she wasn't there.",
        "course": "LING2051"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Amanda is a great teacher because she is more than willing to help you if you don't understand the work. She was very helpful and I definitely recommend her.",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "This is my 2nd class with her, hence a 2nd review. As disorganized as she is, Phonology (LING 4300) was EASY.. 30% of the grade was for in-class assignments, all for completion... easy to get an A even if you don't understand anything... no exams.. grades easy.. irritating lectures, just easy A and a core requirement completion... no exams. EASY!",
        "course": "LING4300"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "Professor Miller was extremely disorganized both in thought and in her curriculum. She often confused the class by blatantly switching terms around. After probably week 1 or 2 the syllabus schedule went out the window. We skipped quizzes and assignments left and right. We had to retake a quiz because there were errors in most of her questions. ",
        "course": "LING2051"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Do not take this class.  Just don't do it.  Save yourself some time and effort.",
        "course": "LING2051"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Nice lady, but she was very disorganized and absent minded. I don't think I learned a single thing in this class. Most assignments were just copy pasting code into this program (which you've never heard of and will never use again) without knowing what's going on. Spent a whole day once going over the differences between \"and\" and \"or\". Not fun.",
        "course": "LING2051"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Amanda seems to be a very nice and helpful person. However her class and office are so disorganized that she always has to extend due dates. There was no grading rubric for anything which is why she lets you revise assignments for extra points. Grades are posted in the last minute. Extremely extremely disorganized. Lost some of my assignments.",
        "course": "LING5551"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Miller is one of the nicest professors you will ever come across! Of course those of you who took her for 286 or 201 did not enjoy it, because her focus is in phonetics. Her labs are pretty simple, and she doesn't care for 'fluff', just do the work, and show her you care, and you will walk out with an A. :) highly recommend",
        "course": "LING500"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "This was a horrible class. I only stayed in it because there are no exams, and it only meets twice a week. She has no idea how to use the program, and expects us to understand how to use it. She is willing to help if you ask, and she seems to be a nice person. She is just a horrible teacher. Definitely do not recommend.",
        "course": "LING286"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "This is a data analysis class and not only does Dr. Miller not really seem to know how the program works, but she also keeps putting incorrect instructions on Carmen. She frequently puts drop boxes up only a few hours before an item is due. Her saving grace though is if you were completely confused, she will help you ASAP. Not the worst professor.",
        "course": "LING286"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Miller isn't the clearest in lecture, but she is there to help students during office hours if needed.  Most of the material presented in lecture isn't particularly helpful but lecture slides are posted to Carmen for later review.  Do the labs (they're pretty quick and easy), and skim your book and notes before quizzes and you'll do fine.",
        "course": "LING500"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class I've ever taken in my life. I got an A without learning anything and spending a total of 4 hours the entire quarter on homework. The exams are take-home and straight out of the book. The 2 hour lectures were periods of trying my patience. I recommend it as a GPA booster. Do not recommend it as something fun or interesting.",
        "course": "LING201H"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "When I started this class, I thought I would hate it.  I'm not interested in linguistics and she seemed disorganized.  After a few weeks, though, I started to love P. Miller.  She's incredibly nice and incredibly smart, in addition to an easy grader.  Some of my friends hate the course material, but we all like her. Give the class a shot!",
        "course": "LING201H"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "She's tied for the worst professor I've ever had. She makes you play vowel bingo in class, but everyone has the same board, so you all win at the same time and there's no point. And she gives instructions like &quot;highlight an inch or so,&quot; and then expect answers accurate within 10 Hz with those ambiguous directions. I definitely do NOT recommend her.",
        "course": "LING500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.3,
    "department": "Linguistics",
    "firstName": "Peter",
    "id": "VGVhY2hlci01NzUwODM=",
    "lastName": "Culicover",
    "legacyId": 575083,
    "numRatings": 32,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "3 of his classes over the years, and my experience has been consistent: -Lot of reading outside of class -Group work in class (occasional lecture) -Tough grader (but extra credit!) Brilliant and respected linguist, kind guy. Biggest mistake students make is not asking questions when confused. He is very willing and wants to help students succeed.",
        "course": "LING4200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Never read, left with an A. Tons of extra credits. Easy af. I've taken many 5000 leveled ones and this is among the easiest. As a teacher, Peter is smart and clear while delivering lectuers. I attended every session because they are fun!",
        "course": "LING4200"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Make no mistake, Peter is tough, but he's also one of the most brilliant geniuses I've ever met. Getting on his good side is not hard: show an interest in the subject and make an honest effort. Be warned, he does grade hard. Peter sometimes can be the \"daft professor\" stereotype but you'll never have a class period with him where you don't laugh.",
        "course": "LING4200"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Although I know some students had rather negative views towards Dr. Culicover, I personally loved him! Syntax can be a rather dry course, yet I think Dr. Culicover did an excellent job of making the classes interesting even for those who aren't huge fans of syntax. I loved his sense of humor, and he was genuinely super helpful and excited to teach.",
        "course": "LING4200"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Great guy, very knowledgable and passionate about syntax, but the class seemed to be incredibly disorganized. Assigned reading was all online, but it was very hard to understand.",
        "course": "LING4200"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 5,
        "comment": "Extremely hard class, probably the hardest linguistics class you will ever take. But Culicover really isn't a terrible professor at all. He tends to assume that students have prior knowledge of the subject, so he doesn't really teach at an introductory level. Once you actually understand the subject matter, it's very interesting. Read the textbook!",
        "course": "LING4200"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "This was by far the worst taught class I have ever taken in all of my years in higher education. The teacher was unclear, his 'notes' were impossible to follow and f he obviously didn't get it he would pick on you specifically. He had no grading scale and once admitted he graded my test too harshly because he felt like it. Avoid ad all costs.",
        "course": "4200"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 1,
        "comment": "He tried to be helpful and clear, he really did.  He obviously loves teaching undergrads, and he's always excited if you ask questions, but pretty frequently he gives vague answers and goes on tangents.  The assignments aren't hard if you read the book, but if you don't understand something right away you probably never will.",
        "course": "4200"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "He makes you work for the knowledge rather than spoon-feeding it to you, but he never makes you feel like an idiot for not understanding. He is clearly more concerned about making sure students understand the material than anything else and does his best to help. Do expect to put in a lot of study time, though.  Overall a fantastic professor.",
        "course": "LING4200"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "I have never pulled as many all nighters as I have for this class, but it was worth it! I learned more with Professor Culicover in 5 weeks than any other class at OSU. Tip: ALWAYS do the extra credit, he will give you points for TRYING.. it really does add up. He is absolutely brilliant, and kind. Take his class if you want to really learn syntax.",
        "course": "LING"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Culicover is an absolutely brilliant researcher, but an incredibly difficult professor. His quizzes, while generally loaded with extra credit, are incredibly complex and vary greatly from in class examples and homework. When you go to his office hours, he refers you to the book (he wrote) or produces a long academic article to answer your ?",
        "course": "LING4200"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "It's the subject matter that's confusing, not him. He tries his best to help us understand. Very nice, friendly, and helpful. However, there's a bit of a disconnect between in-class material and assignments/exams. Grading is very strange. It's hard to keep track of what's important to know and what's not.",
        "course": "LING4200"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "The subject matter is difficult, and he does tend to move very quickly, but if you stop and ask him a question, he'll answer it (or, rather, work with you until you can find the answer yourself).  Great teacher, clearly ridiculously intelligent.",
        "course": "4200"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's an amazing teacher who is willing to work to help you to understand the difficult subject he teaches.",
        "course": "4200"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 5,
        "comment": "Culicover constantly went on tangents not relating to syntax whatsoever. His lectures are dull and long, asking for questions to be answered later on in class. He also makes you buy his $60 book, which is filled with errors, and then posts an errata on Carmen, expecting you to fill in the holes throughout the semester.  Not helpful in office hours",
        "course": "LING502"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Peter is one of the greatest professors I have had at Ohio State. Id recommend him to anyone. He's absolutely brilliant and anyone who takes his class is lucky to get the opportunity to have him as a teacher",
        "course": "LING501"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor. He had a lot of fun teaching the course and the lectures dragged on sometimes like they all do but you have to read and then come to class lecture. Also, try really hard on the homework even though its not graded because the quiz questions are very similar. Had a hard time learning the material but he offers a discussion class too.",
        "course": "LING501"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "Wrote the book and clings to it.  He gives you homework before he teaches the material, then expects you to pick up the material after he explains the homework and you never see it again until the test.  Worst class structuring I've seen at OSU.  Will avoid at all costs for the rest of my college career.",
        "course": "LING502"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 1,
        "comment": "Basically one of the best professors you can have. If you're going to a class to memorize and take every note, you're in the wrong class. If you want to actually learn something, this is the place to be.",
        "course": "LING502"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible. He wrote the textbook so if you don't unerstand his wording there...don't bother asking him. You'll get the same explanation that book gives. Completely useless information.",
        "course": "LING502"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 5,
        "comment": "Peter is helpful if you go to him and state your case.  Quite neurotic, but clearly a star in his field.  His class will really make you think outside the box.  Because of Peter's class I now believe my major is the best and most difficult at OSU.",
        "course": "LING502"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "Acts like he knows his stuff, but he really doesn't.\r Not a pleasant class to take.",
        "course": "LING602"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 5,
        "comment": "Really unhelpful guy... the class is poorly structured and he picks on people that he KNOWS are confused.  I'd recommend taking syntax with another prof; I'm sure it would be worth avoiding Culicover.",
        "course": "LING502"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "This guy is the department chair, and it is obvious he couldn't be bothered with teaching. His organization is dismal (starts the class with one topic and then just &quot;sees where it goes&quot;, etc.), and his expectations are sky-high.  If you try to work with him during his office hours, he comes off as busy and irritated. Brilliant guy, awful teacher.",
        "course": "LING502"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 4,
        "comment": "as a person, i really like him, but once he starts teaching, i can't stand him. the material can be confusing as it is, but his teaching style is unclear and pretty sporadic. really hard to take notes or follow his outlines... also pretty discouraging, makes one not want to talk out loud in class.",
        "course": "LING502"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very nice guy and easy to talk to, but as a teacher he's poor.Plays favorites and expects BS in the form of comments and questions every 5 minutes, not exactly an atmosphere conducive to note-taking, etc.",
        "course": "LING602"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "LINGUISTICS502"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great Prof.",
        "course": "LING502"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "my favorite prof, hands down.",
        "course": "LING502"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "Pretty fun teacher. Always kept our discussions based in reality, encouraged personal explorations of the subjects.",
        "course": "ASC137"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "LING502"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a truly amazing Professor.  If you have the opportunity to take his class, DO NOT HESITATE.  He is one of the best Professors at Ohio State.  He keeps his classes very interesting and he is HIGHLY knowledgeable in the field of Linguistics.  Additionally, he a very friendly and approachable.",
        "course": "LING502"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Linguistics",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0xODEyMzI2",
    "lastName": "Klippenstein",
    "legacyId": 1812326,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Rachel is a really nice woman, but a terrible teacher.  She made it so hard to pay attention in class because she was so boring and I barely got through the class with an A. Studying the worksheets she hands out in class really helps with the midterm and final though. If possible, I would avoid having her all together.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Never seemed to be able to get her point across, she rambled on and on about things that were irrelevant to the class. You end up having to teach yourself all the material on your own because her teaching is terrible. You can get better quality at CSCC and any other professor at OSU",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 2,
    "department": "Linguistics",
    "firstName": "Shontael",
    "id": "VGVhY2hlci0xODI0NjQ5",
    "lastName": "Wanjema",
    "legacyId": 1824649,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Recycled old rubrics w/ old due dates. Never answered emails personally, always had to go ask in person again. Very flexible with deadlines b/c of May Session. Quizzes were free-writes about reading the night before. So busy w/ her own life, class seemed thrown together. Couldn't finish grading on time and deleted 5 days' worth of quiz pts (10).",
        "course": "LING236701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Linguistics",
    "firstName": "Nathan",
    "id": "VGVhY2hlci0yMDk5MTY2",
    "lastName": "Rassmussen",
    "legacyId": 2099166,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Good lecturer, interesting and really connects with students. Grading was fair, although he rarely gave feedback and graded some assignments literally 2mo after submission. Quizzes over readings, but book was readable and only $10. Final was an extended group project that takes way too much of your time. Overall good class, but wouldn't take again.",
        "course": "LING3801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.5,
    "department": "Linguistics",
    "firstName": "Alex",
    "id": "VGVhY2hlci0yMDk0Mzgx",
    "lastName": "Eurdman",
    "legacyId": 2094381,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Alex was great.  He is fairly new so sometimes he doesn't have a clear train of thought with his lectures but 90% of the time he is able to clarify the issue by the end of the class.  He's super helpful and very understanding.  Quizzes are super easy because he lets you bring a cheat sheet in",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.8,
    "department": "Linguistics",
    "firstName": "Judith",
    "id": "VGVhY2hlci05OTI2Mzc=",
    "lastName": "Tonhauser",
    "legacyId": 992637,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I absolutely adore working with Judith and her classes have always been a delight. Her explanations of semantic concepts are clear, and she helps students come to their own conclusions about many topics. She's always very up-front about her expectations and if you put in the effort, you'll go far in her courses.",
        "course": "LING5401"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "I also did not like her. She can't teach, and contradicts herself all the time. In addition, shows no interest in teaching. When you ask her a question she sends you off to the T.A., which is the reason in the first place why I had come to Judith, cause the T.A. is horrible at explaining. Anyways, she's one of the worst teachers i had at OSU.",
        "course": "LING201"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "She was the type of professor who kept the quantity of work to an easily manageable level, but we still learned a ton.  Her style was fairly easy-going, and the class atmosphere always spawned good discussion.",
        "course": "LINGH201"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Amazing professor. Judith is one of-if not the best- professor I've ever had. She made syntax very very easy. I tried to take this class with Dr. Levine and it was impossible. Make sure you get Judith any chance you get. There are almost weekly assignments, graded on content but effort goes a long way. Tests are completely open book.",
        "course": "LING502"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.1,
    "department": "Linguistics",
    "firstName": "Kathryn",
    "id": "VGVhY2hlci0xNTQ2Njg3",
    "lastName": "Campbell-Kibler",
    "legacyId": 1546687,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 5,
        "comment": "Professor Campbell-Kibler is great; very knowledgable and passionate about what she teaches. She does the research work and field involvement to back up her teaching and I respect how she incorporates her own work so well. The class is very complex and confusing for a GE, but she is very accessible/easy to meet with which helps.",
        "course": "2367H"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "She seems like a very nice, knowledgable person. However, she grades all writing assignments really hard and gives a lot of work, especially for this class being a gen Ed. The class also wasn't very organized. Even though the subject matter of this class is interesting, if you need structure and don't have a lot of extra time, don't take it.",
        "course": "LING2367H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "I loved this class! It is very interesting, and worth your time.  She doesn't use a textbook, instead she gathers a lot of different articles to read.  I felt like her class was easy, and she is very passionate about what she teaches.",
        "course": "LING2367"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not a lot of work but very confusing coursework. Only one paper all quarter but she grades it really hard",
        "course": "LING367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Linguistics",
    "firstName": "Scott",
    "id": "VGVhY2hlci0xNjk2OTUw",
    "lastName": "Martin",
    "legacyId": 1696950,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class analyzes the validity of arguments using math-like formulas. Kind of confusing and pointless, but it counts as a math GEC. Scott is very nice.",
        "course": "LING280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.2,
    "department": "Linguistics",
    "firstName": "Craige",
    "id": "VGVhY2hlci01NzUxMDQ=",
    "lastName": "Roberts",
    "legacyId": 575104,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Definitely the most difficult class I took this quarter. If you are not into very complicated, math-like concepts, think very hard before taking this class.",
        "course": "LING280"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Craige is a fantastic teacher and is the reason why i'm considering linguistics as a major. She can be rude at times and comes off as hard to talk to, but she's genuinely interested in the subject material and teaching it. She came late to a large amount of classes, but it was always worth it to stay and wait for her.",
        "course": "LING201H"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "For a 62-year-old woman, she's extremely sharp. Too bad she is also aware of it and can come across as haughty and mightier-than-thou as a result. Doesn't seem to care about class to much and is regularly late/absent. She hates you for thinking this is an easy-A class, though it is. Also apparently a believer of intelligent design.",
        "course": "LINGH201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very interesting class. Dr. Roberts is genuinely interested in teaching the subject and it shows. Class is mostly interacting with students and not basic note-taking. One test on the phonetic alphabet, short final paper, and weekly homework for completion grade. Easy class and you learn a lot. Highly recommend Dr. Roberts.",
        "course": "LING201H"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've learned more in one quarter from this woman than I did in four years of high school, and she's really easy to talk to.",
        "course": "LING59702"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Craige's class is the reason I picked linguistics as my major",
        "course": "H201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.8,
    "department": "Linguistics",
    "firstName": "Michelle",
    "id": "VGVhY2hlci0xNTA2MzQ0",
    "lastName": "Dionisio",
    "legacyId": 1506344,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "she was very nice what she talks about in class is exactly what comes up. very very straightforward a fun class especially if you enjoy the material",
        "course": "LING201"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Michelle was a fantastic TA. When she was allowed to teach the class, she made everything clear and interesting. Her linguistic background in Tagalog helped to make her create relevant connections to her own language.",
        "course": "LING201H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Michelle is excellent! She gives real world examples to relate to her students (i.e. Lady GaGa videos,etc).  She goes over exactly what she expects of you on homework/exams.  Attendance isn't mandatory but I went to every class because she's so fun! You don't need the textbook at all, she goes over everything in her slides she posts on CARMEN.",
        "course": "LING201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.8,
    "department": "Linguistics",
    "firstName": "Lia",
    "id": "VGVhY2hlci0xMTQxNTM2",
    "lastName": "Mansfield",
    "legacyId": 1141536,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "I was excited about this class but it was THE most boring class ever. I struggled to stay awake and Lia often went off topic. She made the topic of linguistics very confusing and it was very difficult for me to write my 10 page final paper.",
        "course": "LING367"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "I was so excited for this class.  Then it killed the topic of advertising for me.  The only interesting part was the assignments.  The 4 hours of lecture every week were the biggest waste of time.  I can honestly say learn anything from Lia's class other than how to find advertisements on youtube",
        "course": "LING367"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "I love linguistics, but this class was a pain. Daily hw assignments like we were in HS and she took a long time grading the problem sets. We spent a lot of time in class discussions, which is normally fine, but these discussions went nowhere.",
        "course": "LING383"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "LING201"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Ms. Mansfield teaches Lingiustics, a subject which could possibly be why half the class is totally lost/confused. But it might also be because Ms. Mansfield is very eccentric in her teaching and often goes off on tangents without properly explaining the ideas.",
        "course": "LING201"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Mansfield is extremely enthusiastic about her subject.  She could make anyone love linguistics!  I would recommend her class to anyone with an interest in the subject, or who happens to need gen. ed. cred.  Thanks for a great class, Professor Mansfield!",
        "course": "LING201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 2.5,
    "department": "Linguistics",
    "firstName": "Emily",
    "id": "VGVhY2hlci05OTIyNjI=",
    "lastName": "Jamison",
    "legacyId": 992262,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "No midterm or final, but she does give assignments that are ridiculously close to busy work (summarizing a chapter, etc). Means well but isn't always totally clear.",
        "course": "LING201"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "She means well, but is not very helpful. One small project each week, sometimes took hours and hours to do and she grades them tough.  She's unclear in her teaching, and seems like she doesn't really know what she's teaching, as she is easily persuaded away from her points by any student comments. No Midterm or final is a plus.",
        "course": "LING201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Steve",
    "id": "VGVhY2hlci0xMDg2NjEx",
    "lastName": "Boxwell",
    "legacyId": 1086611,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "The subject matter is exremely interesting but he can be annoying. so overall liked the class but didnt like him.",
        "course": "LING201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.7,
    "department": "Linguistics",
    "firstName": "Mary",
    "id": "VGVhY2hlci0xMTI2MDAw",
    "lastName": "Rose",
    "legacyId": 1126000,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Save your time and money!Class is boring and you will fall asleep. Professor is unorganized as was stated by students above. Material presented is coming from books, nothing new from her. She does not respond to e-mails ever. As well what was the most irritating is that professor liked to go overtime like 3-5 minutes, asking same questions.",
        "course": "LING597"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. Rose's class was very difficult for me. I tried hard to understand the notes and homework but it didn't seem to work. I asked her for help which did help a little but not enough for me to fully understand linguistics. The first secions we covered were the most difficult. The best thing was the take home midterm. I agree she was unorganized.",
        "course": "LING201"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Rose was a pretty good teacher; sometimes she was a little confusing but if you tell her you are confused she can always find a way to explain. She is very unorganized, which can be good and bad: due dates get pushed back, but you don't always get grades or papers back. Just attend class and participate and you'll be fine!",
        "course": "LING201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Bridget",
    "id": "VGVhY2hlci0xMDY0NTMx",
    "lastName": "Smith",
    "legacyId": 1064531,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "A very interesting professor. Down to earth and funny too. Sometimes she can seem intimidating, but I feel like it's just because she knows you can do better and she tries to get you to. Always willing to clarify if you're not sure on something, like your data analysis projects. Definitely a solid choice for a professor.",
        "course": "LING2051H"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Down-to-earth, very humorous and fun prof. Attendance is mandatory, but you will want to go to class if you're going in with an interest in introductory linguistics. Offers tons of extra credit. There is some work outside of class time (avg 2 hours total over 2 sessions) to fulfill LOC requirement.  Do everything you can to get Dr. Smith!",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Bridget is intimidating the first week in order to weed out people who don't want to work hard. If you put in an effort, you'll be fine. Our class average was a 99%, she's all about the bonus points.",
        "course": "LING286"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "The person who advised against &quot;Ms. Smith&quot; is entirely wrong. Bridget is an awesome teacher. She was there for her students when they needed her and she presented the information  clearly and in a fun way. If you are thinking of taking this class I highly suggest you DO so. It's awesome. She does swear in class. If you can't handle that, grow up!",
        "course": "LING286"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Bridget is a great teacher. She did her best to make the classes fun/applicable and was always there to take time if you didn't understand. Using the program &quot;R&quot; is annoying and using computer code was hard, but the class was overall pretty easy. and no tests!",
        "course": "LING286"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Bridget was awesome. This class wasn't the easiest one I've taken, but its the only one I could actually pay attention in because she always made it fun. I loved that she could teach us so much while still making class enjoyable. I would most definitely take another class with her if I could!",
        "course": "LING286"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Although this class was not easy I thoroughly enjoyed it! Bridget is funny and is always willing to help you. Her vulgar language she warned us about on the first day of class. It was a relief to not have some stuck up teacher thinking she is better than you because she is getting her PhD! The only complaint I have is the room and the no windows bu",
        "course": "LING286"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class was tough but Bridget is there every single day to help.  She has an extreme interest and understanding for the material and is excited about what she does.  I struggled through every single assignment but because I went to class, paid attention and did my work I came out with a good grade.  She is an outstanding professor!",
        "course": "LING286"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was an easy A. I suggest taking the class with a friend or two so you can split the work load. A decent amount of work, but NO EXAMS! Bridget is a Cool person and let us joke around a bunch in class which was a nice relief profs who take stuff too seriously. Didn't learn much, but I got my A, which is really all I wanted out of the class",
        "course": "LING286"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class was a lot of fun!  It was a little challenging at times, but the teacher was very helpful!  In response to the person who commented below, Bridget Smith gave fair warning at the beginning of the quarter about her use language, so there's no room to complain.  If you can't handle stuff like that, then you SHOULD DROP THE CLASS!",
        "course": "LING286"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 1,
        "comment": "Class was a piece of cake. We were pretty much spoon fed what we needed to know and not required to retain anything afterwards. Plus she offers many chances for extra credit. I was hoping to actually learn something from this class but I didn't. Oh well, I won't complain too much because it was an easy A.",
        "course": "LING286"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "Such an excellent teacher and person! She was very helpful and she cares and looks after her students!",
        "course": "LING286"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "She was very bouncy!  This was my first linguistics class and I'm now in 201, and I really appreciate the time she took with me. she really helped me over and above the call of duty.",
        "course": "LING301"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Absolutely amazing teacher. One of the best I've had at Ohio State. She makes class way more entertaining than it needs to be. She cusses and it's hilarious. When everyone bombed the midterm, she gave us a ton of extra credit. I believe she actually said, &quot;So everyone is probably going to get an A, and I don't care.&quot;",
        "course": "LING301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.5,
    "department": "Linguistics",
    "firstName": "Abby",
    "id": "VGVhY2hlci0xNjMxMzA2",
    "lastName": "Walker",
    "legacyId": 1631306,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Abby Walker is a genuinely good professor. She is a tough grader, but her adorable new zealand accent makes it worthwhile",
        "course": "2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Abby is wonderful! If you can take a class taught by her you must take it! She is perfect! She will do what ever it takes to make students understand. There is no text book, and you just have to do readings on carmen. There are no exams just little weekly quizzes and a few papers. Easy class and she has an awesome accent.",
        "course": "LING2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Totally loved her as an instructor. She made class a lot of fun and kept the discussions interesting. The left a LOT of feedback on our writing assignments and it was so helpful. Great person to have teach the class! :)",
        "course": "LING367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 3,
    "department": "Linguistics",
    "firstName": "Christin",
    "id": "VGVhY2hlci0xMzUwNzI3",
    "lastName": "Wilson",
    "legacyId": 1350727,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "A ridiculously hard grader! In my third year at OSU and this class requires the most work out of any of the classes I've taken thus far. Takes the time to write extremely critical comments on papers, but is hypocritical; her (infrequent) powerpoints and class notes are riddled with typos. Confusing, challenging, and ineffectual teaching methods.",
        "course": "LING367"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Nice person, but she grades VERY HARD! She assigns readings that are mind-numbing and makes you do a lot of work. She is very knowledgeable on linguistics, but the class is not at all interesting, at least to a non-linguistics major. I wish I would have never taken this class.",
        "course": "LING367"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "I couldn't decide for the longest time if I liked Christin as a person. As a teacher, she's one of the most legit I've ever had. She actually gets stuff back to you REALLY quickly. Tons of comments. Really useful, really helpful. She gives points wherever she can. Lots of reading, in addition to a decent workload. Keep up and you'll be fine.",
        "course": "LING367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Linguistics",
    "firstName": "Murat",
    "id": "VGVhY2hlci0xNTQ2NDY4",
    "lastName": "Yasavul",
    "legacyId": 1546468,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "The most boring class I have ever taken with the most boring professor I have had probably ever. The material itself was useless and on top of that the professor has an attitude when you get things wrong. Save yourself the trouble and just take a real math class instead. Its just not worth it.",
        "course": "LING280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Linguistics",
    "firstName": "Yasavul",
    "id": "VGVhY2hlci0xNjI1NTgx",
    "lastName": "Murat",
    "legacyId": 1625581,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Extremely boring, I never fall asleep during classes but this was an exception. He also has an attitude when you make a mistake like &quot;you should have known that can't you read it's right there&quot; instead of explaining why something is wrong. lastly the class material itself is utterly useless. your better of sucking it up and taking a real math class",
        "course": "LING280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 3.7,
    "department": "Linguistics",
    "firstName": "David",
    "id": "VGVhY2hlci04MjAyMjQ=",
    "lastName": "Durian",
    "legacyId": 820224,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had Mr. D for the Dialects of Ohio class. Very interesting--you can def tell he knows the research. Very interesting class.",
        "course": "LING372"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "my review above should say &quot;aren't doing busy work&quot;",
        "course": "LING367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy grader. Like others have said, a lot of readers for the class, but we also discussed just about all of them, so at least you feel like you are doing busy work.",
        "course": "LING367"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr. Durian is a really cool guy. Very laid back, easy grader, and makes class interesting. I would definitely recommend him!",
        "course": "LING367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Mr. Durian was really nice and funny. He was a softy when it came to grading most people got above A's on papers, and the mid term was easy.  Doing readings is helpful before class because you end up citing and using them in papers anyway.  Better to gradually read them instead of cramming last minute.  Overall easy A and I enjoyed the class!",
        "course": "LING367"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "There are required readings every day and the class is mostly discussion style. Even though there is a lot of reading, he grades fairly easily. He's very personable and the class room atmosphere is relaxed. His teaching style is a little disorganized but he's more than willing to go back and re-explain things.",
        "course": "LING367"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "A really funny guy. Textbook was used pretty heavily, and there's a lot of readings. He goes over most of them in class though, which is helpful. Exams were fairly easy, and he's also really lax about daily reading note assignments. I felt a little lost a couple times, but he was extremely helpful when I talked to him in his office hours.",
        "course": "LING367"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "I liked the class--it was interesting, and I thought David was both helpful and informative at the same time. He does make a lot of corny jokes at times, but I thought they fit with the topics we discussed.",
        "course": "LING303"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "AWFUL. I believe the class would have been interesting if taught by another individual. He said it was his first time teaching this course, and it was obvious; his focus is very poor, and is quick to make corny jokes. For someone who studies the English language, shouldn't you be able to spell its words as well&#63;!",
        "course": "LING303"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "I thought David was an interesting and helpful teacher.",
        "course": "LING303"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "I liked the class, and thought David was a nice guy. Very helpful and let us turn in assignments that were late until the last week of class. Make sure to do the reading questions. b/c as I found out with my grade, he definitely counts those points.",
        "course": "LING372"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was an interesting class, and I appreciated the instructor's enthusiasm.  I also liked that he was open to different opinions and didn't expect all our work to just conform to what he thought was correct.  He's also very willing to answer questions.",
        "course": "LING372"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.4,
    "department": "Linguistics",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci01NTA4OTA=",
    "lastName": "Hume",
    "legacyId": 550890,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "I was really looking forward to taking a class about the &quot;Basics of Learning a Language&quot; but it ended up being a major disappointment. I dropped the class because the lectures were so long and boring I couldn't stand it anymore. She goes through the notes too fast but talks through the same points so slowly it's annoying. I didn't even learn much.",
        "course": "LING170"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was one of the best courses that I have every taken. She has incredible knowledge and a good sense of humor. I definitely recommend any course taught by Professor Hume.",
        "course": "LING170"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "hands down the worst prof and class ive taken.  the class itself was not hard at all.  the hardest thing about the class is actually going.  all the tests were online, lots of group work.  it was almost painful sometimes to stay for the whole class.  I got a good grade, but i cant say that i learned ANYTHING.",
        "course": "LING170"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She kind of reminds me of the lady on Shining Time Station.  She's a great professor.  She really knows her stuff, and I found the material very interesting.  If you aren't a fan of language, the class would probably seem boring, but I'm a Spanish major, so it was just my style.  I highly recommend this professor if you are interested in language.",
        "course": "LINGUISTICS170"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Pretty boring class- She tires to keep it interesting but after awhile the class becomes something you dread to go to- She takes attendance and talks to you like you should know everything about languages-",
        "course": "LING170"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Well prepared lectures and activities.  Interesting class as well.",
        "course": "LING170"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class is really boring and she expects you to be an English major.  Very confusing and her book is very unclear.  A nice lady, but a  poor professor.  Have to go to pointless lecture because she takes attendance.  Bring a pillow.",
        "course": "LINGUISTICS170"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's cool, I liked her a lot.  She really knows her stuff, and is very helpful.",
        "course": "LINGUISTICS170"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Rajakrishnan",
    "id": "VGVhY2hlci05NTk3MDk=",
    "lastName": "Rajkumar",
    "legacyId": 959709,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "LING384"
      }
    ],
    "SEI": []
  }
]