[
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.6,
    "department": "Linguistics",
    "firstName": "Rexhina",
    "lastName": "Ndoci",
    "legacyId": 2631455,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Posts 4-5 lectures a week up to 2 hours long that you have to watch in order to catch maybe 3 questions asked for weekly credit. questions are extremely unclear 50% of the time. the content setup is extremely unorganized and overwhelming."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Very harsh grader of group analysis work and final project\nhard to understand\nheavy writing assignments\ndid not learn anything i could apply to the real world"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Such a hard grader. So much to read and so many writing assignments. Don't take this class if you're looking for an easy gened bc it'll screw ur gpa"
      },
      {
        "index": 3,
        "rating": "4.0",
        "comment": "You read a lot of research papers in this class. Each paper is followed by a discussion in class. It can seem like a little too much sometimes but she is super relaxed and offered our class several extensions for papers!"
      },
      {
        "index": 4,
        "rating": "4.0",
        "comment": "Professor Ndoci (call her Gina!) is a great Professor. She is very accessible for questions and is always willing to work with you. The course I took with her, LING3602, is extremely reading-intensive, however. She asks you to read a lot of scientific papers (that she provides), which you should prepare for each class. Other than that, she's great!"
      }
    ]
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.2,
    "department": "Linguistics",
    "firstName": "Philip ",
    "lastName": "Whitman",
    "legacyId": 2003093,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Almost the whole class think his grading is strict and nonsense."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Bad Bad Badï¼"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "He'll give you a very low grade with apologies......."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "If u wanna a F GOOO for it !!!!!!!"
      },
      {
        "index": 4,
        "rating": null,
        "comment": "The same paragraph gave me full marks in the draft, but low marks in the final version. The teacher did not correct the homework carefully, the requirements of the homework were very unclear, the emails were not answered in time. Even if you tried your best, he would not care. If you don't want your grades to look bad, please don't take his course."
      },
      {
        "index": 5,
        "rating": null,
        "comment": "The class is full of roll call questions and group discussions. Lots of writing in class. You can lose a lot of points because of small mistakes or omissions in your homework!"
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "Amazing Professor"
      },
      {
        "index": 7,
        "rating": null,
        "comment": "IF you don't finish attendance assignments, he will punish you."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "At certain points in the lesson he is unclear so make sure to ask questions if you are confused. He is laid back and kind of lulls you into a false sense of security  but at the end it gets harder than the first semester and more confusing. Definitely ask for help and do work with other people instead of by yourself."
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.6,
    "department": "Linguistics",
    "firstName": "Brian Daniel",
    "id": "VGVhY2hlci00MTg4MDM=",
    "lastName": "Joseph",
    "legacyId": 418803,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took the course online during covid and was physically abroad. Professor Joseph did basically everything you can imagine a professor can do at his best to help. Probably the biggest name in the ling department and also the biggest heart.",
        "course": "LING5901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Can't express how much I love and admire Brian. Genuinely the most knowledgeable guy, super dorky and funny! Even though it was a high-level class and he's been in the field for many years, he isn't too hard on students and mostly just cares that you're making an effort and engaging with the material. Also, emails back right away even if its a wknd",
        "course": "LING5901"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really nice professor, if he saw you make an effort, grades generously even if you were wrong. Hard to follow sometimes, he can get abstract or go off track easily. Has weekly assignments that are worth a low number of points so it helps students. In tune to student's mental health, dropped assignments from the syllabus when we got overwhelmed.",
        "course": "LING5901"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Joseph is awesome! He is very flexible and great about answering any questions outside of or after class.",
        "course": "EEURLL5627"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I was a terrible student in Dr. Joseph's class but he still did everything he could to help me. I was a linguistics major when I took this course, but I was clearly out of my depth with this material. Brian wants his students to do well and I think that's really important and he would even check in with me when I had missed class.",
        "course": "LING5901"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Pretty funny guy. But feedback wasn't always helpful. Content given via traditional lecture-based approach, so class was really dry at times. Brian was easy to follow in class mostly, but it seems to me that he focused more on grading rather than making sure we could apply the content on our own. Mixed feelings overall, but not the biggest fan.",
        "course": "LING5901"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Brian is a great professor. He is extremely helpful and answers emails very fast with lots of help and information. He has a phD from Harvard which makes me look up to him as a Linguist. The course is quite demanding but he'll help you and occasionally let you revise the homework for points. Not easy and not for everyone!Hope to have him again tho!",
        "course": "LING5901"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Brian is a great professor.  He definitely is an expert in his field.  He is a very generous grader and does not require attendance, and I felt bad because he seemed hurt when people didn't take his class seriously because of this.  Very nice guy, loved his T-shirt du jour!",
        "course": "LING597"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I believe this class is called Ling301 now.  Needless to say Brian is an awesome teacher.  Great with people loves his work and loves teaching it to us.  As long as you go to class and pay some minor bit of attention then you should do just fine with him.",
        "course": "LING311"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is one of the best professors I've ever had.  He really wants students to succeed, and I wish I could have him for every class.",
        "course": "LING59701"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "His class was very interesting, and I would recommend it to ANYONE, not just linguistics majors.  Brian is extremely nice and loves helping his students.  He's more about learning than grades, but he's not a difficult grader at all.  And he knows WAY too much about everything Greek!",
        "course": "LING59701"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Joseph takes a very cooperative approach to learning",
        "course": "LING59701"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Joseph is knowledgable and helpful. His depth and breadth of knowledge is amazing! You will definitely enjoy any class you take with him.",
        "course": "LING59701"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "He has a habit of going off on tangents so it's not always easy to keep one's notes organized, but other than that he's a very good teacher.",
        "course": "LING792"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is very nice and understanding, interesting lecturer. Tells little funny stories and jokes sometimes. Good guy.",
        "course": "LINGUIST"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3,
    "department": "Linguistics",
    "firstName": "Rexhina",
    "id": "VGVhY2hlci0yNjMxNDU1",
    "lastName": "Ndoci",
    "legacyId": 2631455,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class is fully asynchronous so there are a few pre-recorded lectures alongside two assignments every week. She is very willing to answer questions and emphasizes her office hours whenever possible. Every assignment is given clear, timely, and encouraging feedback. Best professor to have for an asynchronous class.",
        "course": "ENG3271"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Posts 4-5 lectures a week up to 2 hours long that you have to watch in order to catch maybe 3 questions asked for weekly credit. questions are extremely unclear 50% of the time. the content setup is extremely unorganized and overwhelming. ",
        "course": "LING3602"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very harsh grader of group analysis work and final project\nhard to understand\nheavy writing assignments\ndid not learn anything i could apply to the real world",
        "course": "LING3602"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Such a hard grader. So much to read and so many writing assignments. Don't take this class if you're looking for an easy gened bc it'll screw ur gpa",
        "course": "LING3602"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "You read a lot of research papers in this class. Each paper is followed by a discussion in class. It can seem like a little too much sometimes but she is super relaxed and offered our class several extensions for papers!",
        "course": "LING3602"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Ndoci (call her Gina!) is a great Professor. She is very accessible for questions and is always willing to work with you. The course I took with her, LING3602, is extremely reading-intensive, however. She asks you to read a lot of scientific papers (that she provides), which you should prepare for each class. Other than that, she's great!",
        "course": "LING3602"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2,
    "department": "Linguistics",
    "firstName": "Philip ",
    "id": "VGVhY2hlci0yMDAzMDkz",
    "lastName": "Whitman",
    "legacyId": 2003093,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you don't want to spend focus and workload, lost points, don't ever take his class.\n\nRead other feedback from previous students",
        "course": "EDUTL5902"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "-unprofessional and unprepared\n-awful feedback and inconsistent with what he talked previously\n-unclear instruction and blamed students for bad homework\n- PEASE avoid this bad instructor   ",
        "course": "EDUTL5902"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Almost the whole class think his grading is strict and nonsense.",
        "course": "EDUTL1902"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad Bad Bad&#65281;",
        "course": "EDUTL1902"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He'll give you a very low grade with apologies.......",
        "course": "EDUTL1902"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "If u wanna a F GOOO for it !!!!!!!",
        "course": "EDUTL1902"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "The same paragraph gave me full marks in the draft, but low marks in the final version. The teacher did not correct the homework carefully, the requirements of the homework were very unclear, the emails were not answered in time. Even if you tried your best, he would not care. If you don't want your grades to look bad, please don't take his course.",
        "course": "EDUTL1902"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "The class is full of roll call questions and group discussions. Lots of writing in class. You can lose a lot of points because of small mistakes or omissions in your homework!",
        "course": "EDUTL1902"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing Professor ",
        "course": "EDUTL5902"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "IF you don't finish attendance assignments, he will punish you.",
        "course": "EDUTL5902"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "At certain points in the lesson he is unclear so make sure to ask questions if you are confused. He is laid back and kind of lulls you into a false sense of security  but at the end it gets harder than the first semester and more confusing. Definitely ask for help and do work with other people instead of by yourself.",
        "course": "LING2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Clint",
    "id": "VGVhY2hlci0yMjI4MTI2",
    "lastName": "Awai",
    "legacyId": 2228126,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Clint was one of the best professors i've had. I love how he talks so much about his background and how he was as a person. Super funny and supper passionate. Overall a great dude and I would take another one of his classes if I could. ",
        "course": "LING3601"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awai-Jennings was the best professor I've had in my career at OSU, HIGHLY recommend for any courses!",
        "course": "LING3601"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "A great instructor, and really helped me with my disability accommodations. ",
        "course": "LING3601"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Clint is absolutely amazing! He was always super understanding in any circumstances you communicated and was very flexible when you needed it. As long as you show up to class and try to participate a little, participation is easy, and the homework and final paper was very straightforward, and he gave great feedback for both.",
        "course": "LING3601"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Clint is hands down the best instructor I've ever had. He's so passionate about the material and explains it in an easily comprehendible way. A genuinely kind and likeable person AND he shares great Linguistics memes! The class was very interesting and easy but if you do struggle, he is more than willing to help. Highly recommend!!",
        "course": "LING3901"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is an amazing professor who brings you food from Hawaii and is very relaxed. He is so nice and would do anything to help you. If you can you should take this professor in any course that he teaches!",
        "course": "LING2000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is the best professor I have ever had. Accessible before, during, and after class, I cannot recommend him enough. He knows his stuff and he makes sure you do, too. He connects everything to his Hawaiian heritage and everyone was there for it. He would bring in food and demonstrations. I would take every class he taught if I could",
        "course": "LING3601"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is easily one of the best professors I have ever had. He goes above and beyond to make sure that you understand the material. He encourages the class to email him with questions and responds right away. He has such a warm and caring personality and he creates a great environment that makes you look forward to his class. Also a great cook!",
        "course": "LING3901"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is one of my favorite professors I've had. His class is super engaging and personable, and he genuinely wants every person in the class to succeed. He made the course content interesting and also shared some great linguistics memes and Hawaii language and culture facts. If you can take a class with him, DO IT",
        "course": "LING3901"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is one of the most genuine professors that I've ever had. He's hilarious, always willing to help students, and knows the material very well. He is very engaging and makes the material fun and easy. This is the only class to which I look forward everyday.",
        "course": "LING3901"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awai is one of the most authentic and empathetic instructors I've ever had! He is genuinely excited to share his love for historical linguistics. It's hard NOT to like this class. He created a positive environment, never condescended us, and folded in elements of his Hawaiian background when it was appropriate.",
        "course": "LING3901"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "He really cares about whether you understand the material and is always willing to meet outside of class and office hours. He makes lectures as enjoyable as possible, knowing full well that this class isn't the most riveting. Show up, ask questions, stay after if you're still confused, and you'll pass with flying colors.",
        "course": "LING3901"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Clint is awesome! He really cares about his students and wants you to do well in the class, so he makes himself readily available through email and office hours. The class is organized really well and the expectations are clear. He is from Hawaii so you learn a lot of cool authentic stuff, and he makes yummy treats to eat on exam review days :)",
        "course": "LING3901"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interesting material and lectures. Discussion in class is super fun. He has a unique sense of humor.  And he's from Hawaii so he has tons of examples in Hawaiian pidgin language. Overall highly recommended!",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.2,
    "department": "Linguistics",
    "firstName": "Ila",
    "id": "VGVhY2hlci0xNjE4MTY4",
    "lastName": "Nagar",
    "legacyId": 1618168,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "TBH, she wasn't even my real teacher, and she became our temporary teacher because my real teacher had to leave for a family emergency. She taught us random things that I had no idea about and then also would make us speak in Hindi when we hadn't even learned that. I wish she would've slowed down on how much information she was giving us.",
        "course": "HINDI101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Not a bad class. Her lectures are ok--sometimes confusing, but as long as you make an effort on the lecture questions, you'll be ok. Readings are dry but their material is not heavily tested. Films are ok--they get a little better as the class goes along. It's an easy class, and I learned a lot. Not a cakewalk. But if you make effort you get an A.",
        "course": "SASIA3625"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Honestly, she wasn't bad at all. I would recommend if you like working at your pace. Just that there are lectures and reading, but I never read anything until the quizzes and lectures have questions. not a tough grader.  ",
        "course": "SASIA3625"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unforgiving professor, the workload is terrible for a 3 credit class. The movies, lectures, and material are insanely dry and boring. Every week there are 3 lectures that are way too long and her commentary contributes to nothing. She loves to hear herself talk. She is also a very rude professor and has no sense of mercy if a student messes up",
        "course": "SASIA3625"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Normal amount of work for an asynchronous course, but the group projects are absolute nightmares. I had trouble communicating with my group so I reached out for help/guidance. Instead of replying back to me personally, she \"solved\" it by emailing the entire group with a threat to take points from all of us if she heard of anymore issues from us. ",
        "course": "SASIA3625"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Too much work for a 3 credit class that most people take just to fulfill a GE. There was 3 lectures of about 30 minutes each every week, and she expected us to watch 3 hour long Bollywood movies to participate in the questions. Her directions for the group projects were unclear and instead of clarifying, she was just passive in the grading. ",
        "course": "SASIA3625"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Nagar was great! There were 3 weekly online lectures (10-20 mins) with 1-2 questions to answer in them. There were a few quizzes, all extended response. Then two group projects. Pretty stress-free and not crazy difficult. She does give a lot of material at once on top of a weekly movie which was annoying, but the assignments-a breeze.",
        "course": "SASIA3625"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS IF YOU THINK ITS GONNA BE A CAKEWALK.",
        "course": "SASIA3625"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "This is too much work for a 3 credit class. First, you are given five lectures, each 30-50 minutes long, and have free responses for each of them. Always go for the word count maximum because they take points off for not being engaging. Projects are time-consuming and just overall too much work! Find another GE because this took up a lot of time.",
        "course": "SASIA3625"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "It's spring break and I'm doing some crack group project because of her. Enough said.",
        "course": "SASIA3625"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 1,
        "comment": "She sucks. I thought the class would be fun and an easy A but I literally have more assignments from this boring class than from my major core classes. For some reason she's stuck in the 70s because all the movies you're supposed to watch (1-2 a WEEK) are from then. Wiki summaries>>\nAlso her accent is annoying and fake (I say this as an Indian)",
        "course": "SASIA3625"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "Took SASIA 2220 and she was great overall. You have unlimited time for the quizzes and tests from the time they open till they close, so you can exit out and resume whenever. Didn't watch any lecture videos or do readings until the quizzes and exams and always got a 100%. ",
        "course": "SASIA3625"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "She seems like a nice lady but the workload is horrible. The movies were hours long and the lectures were about average but along with movies and readings it was a lot of work to go through. If you are looking for something easier than this is NOT the class for you. again shes nice but the workload is horrible and I wouldnt reccomend. ",
        "course": "SASIA3625"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "It is the middle of the semster and this class is too much. The amount of readings and lectures shes posts along with movies is way too much. Last week we had a 2hr and 30 min movie along with readies and 3 lecture videos. She is doing way too much for GE and honestly if you want an easy A this would not be the class for you. I regret taking her",
        "course": "SASIA3625"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Such a nice professor. So passionate about Bollywood films and what she does! Amazing professor, probably my favourite this semester.",
        "course": "SASIA3635"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "It's a super boring class with super dry content, really horrible, poor quality, it's painful for me to do the homework and especially painful for the quiz and the final exam. For the final exam, you need to write 500 words for each one. If you are looking for an easy A, take the theater class.",
        "course": "NELC3625"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is an easy A class however I have two complaints. The material we covered, in my opinion, was not interesting nor engaging. Secondly, the final has 5 questions to which the answers to have to at least be 500 words. This is unreasonable because the answers would be about 300 or less words.",
        "course": "NELC3625"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Ila she is so sweet. I took her online for the history of South Asia and I honestly learned a lot. The quizzes are very simple and you get unlimited time to do them. Interesting assignments that are actually interesting to do. Easy grader and a really sweet woman overall.",
        "course": "NELC3620"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is fun and enjoyable! You just have to watch the lecture videos, take notes, and then summarize your notes each week for the short responses. I'll be honest, I didn't watch any of the films, just read the Wikipedia plot summary, and I got all 10/10s. The movie clips I did watch were fun, and I learned a ton about Bollywood. Easy A!",
        "course": "NELC3625"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 2,
        "comment": "I felt that a lot of lectures were unclear and that she wasn't very accessible or interested in helping students, and most of the assignments were just regurgitation. However, because of that, this class is a super easy A so I can't really complain much about it, but I felt like I didn't learn much actual useful information.",
        "course": "NELC3625"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ila Nagar is the BEST professor at the Ohio State University. I am taking her course online. All you have to do is listen to weekly lecture and watch weekly Indian movie and write a reflection based on certain week. You will have to make one podcast on a movie. If you want A take in Culture and Diversity take this course. I love this professor.",
        "course": "NELC3620"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor.",
        "course": "HINDI101"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class material is fun and easy, but it seemed incredibly easy to get away with not watching the movies, not watching the lectures, and not doing the reading because the class was online. I personally did most of the aforementioned and found the class to be easy and entertaining. She's a good professor who really cares and the class is easy.",
        "course": "NELC362502"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "Ila taught me so much about life in South Asia. She incorporated multiple countries and social groups and aspects of the culture, and while there was a lot of reading it was manageable and interesting, interspersed with other media like films. She also gave generous extra credit opportunities! Ila is great!",
        "course": "NELC3620"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 1,
        "comment": "She is amazing--completely hilarious personality. As long as you stay on her good side and do not abuse the times she lets you skip, you will be fine",
        "course": "HINDI104"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome, if you want to learn a language but dont know which one, take hindi, you will learn a lot and she is absolutely awesome!",
        "course": "HINDI103"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "Excellent!",
        "course": "HINDI101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Laura",
    "id": "VGVhY2hlci0yOTg4MDAx",
    "lastName": "Siragusa",
    "legacyId": 2988001,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor for Italian 1101. There is a good amount of online homework but that is to be expected for a 4 hour course where 1 hour of that is to be completed online asynchronously. Very nice person and very funny, you really can't ask for a better professor as a beginner in the language. Do the work, attend class, and you'll be perfectly fine.",
        "course": "IT1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the nicest teacher I have ever had and she truly cares about the success of her students. It is a lot of group discussions, a couple easy papers, and one long paper instead of an exam. She offers extra credit if you are in need and is a pretty easy grader. ",
        "course": "LING3605"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "The sweetest woman! She is very caring and passionate about what she does. As long as you put effort in and are respectful, you will do just fine! :) She responds quickly to emails and loves to hear about your day!",
        "course": "LING3605"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Laura is so caring and understanding to all her students. One of the sweetest professors! Attendance is worth a small portion of your grade, but she mainly cares about you just putting the effort in for her class.",
        "course": "LING3605"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Might be one of the only professors who genuinely wants all their students to do well in their class. She's lenient on deadlines so please take advantage of any opportunities she gives you. She doesn't grade harshly and is overall a \"student's teacher\". Not to mention she's the kindest person ever.",
        "course": "LING3605"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.3,
    "department": "Linguistics",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xOTI0MjEx",
    "lastName": "White",
    "legacyId": 1924211,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Good introduction to language and computers. Grading is a little picky but it is more than offset by the generous extra credit on every assignment. You will probably get bored if you aren't actually interested in language and computers but can be interesting if you are.",
        "course": "LING3802"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is passionate about the subject and has some pretty cool in class activities. Lots of extra credit on homework and exams. That said, some lectures are tedious to sit through. Grade is based on 2 exams, a final essay, homework, in-class activities, and extra credit at home quizzes.",
        "course": "LING3802"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Easy class to pass, but I'm not sure what I learned. It kind of felt pointless and all over the place. He was usually nice enough, but sitting in that class was painful. Plus, I finished with a 103%, and yet he still called my last essay &quot;a disappointment&quot; despite giving me an A on it and my A in the class.",
        "course": "LING3802"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "I couldn't really tell you what I learned in this class. Tended to just talk about a lot of computer science jargon that you won't understand if that's not your major. Wasn't really helpful for linguistics majors.  ",
        "course": "LING3802"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Great teacher, maybe a little dry sometimes but he really knows what he's talking about. Gives extra credit on every assignment. Very nice",
        "course": "3802"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "I took Michael for LING 3802 and I would not recommend taking him. His lectures are long, his grading is hard and he doesn't answer your questions. His homework directions were very confusing ending up costing students points. In my opinion he is very disorganized and isn't teaching to help students succeed. Avoid taking Michael. ",
        "course": "3802"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Angelica",
    "id": "VGVhY2hlci0zMDQ5NzY2",
    "lastName": "Aviles-Bosques",
    "legacyId": 3049766,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ms. Angelica was a fun professor. She is very accomodating and personable both in lectures and office hours. ",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Jingyi",
    "id": "VGVhY2hlci0yNTcyNTcx",
    "lastName": "Chen",
    "legacyId": 2572571,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Took her when she was a graduate student. Clear expectations; straightforward and easy intro class. High participation and completion emphasis. Lectures can be dry at times, but never too heavy in material. Seems like she's still finding her grove in teaching, I hope to see her confidence and passion grow as the years go by. ",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Jingyi was a good instructor. I didn't participate much in lectures and mostly did homework, but the most important part was the practice problems at the end of each lectures. They would be very similar to the ones on exams. She is an easy grader as well and approachable for questions.",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "A good resource for students. She was very informative during lectures and gave us ample opportunity for practice. It was a pleasure taking this class!",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Chens class was very good. We studied lots of intro linguistics topics; for each, we had 1 homework assignment plus 1 mini-paper about a textbook chapter. She always answered e-mails fast, and graded most assignments within hours/days. Some subjects were a little confusing, but she did her best to explain them clearly. Recommended!",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Emily",
    "id": "VGVhY2hlci0zMDQ5NTU1",
    "lastName": "Sagasser",
    "legacyId": 3049555,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "My top notes are that LING 2001 with Emily doesn't have that many assignments outside of exercises, so doing well in the heavier weighted assignments is crucial. Expect this class to be more mathematics-like in its theory and approach. Problem sets are key. Smaller class, ask questions. Emily is always willing to explain and guide you. ",
        "course": "LING2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3.3,
    "department": "Linguistics",
    "firstName": "Ellen",
    "id": "VGVhY2hlci0yNDI3NDky",
    "lastName": "Dossey",
    "legacyId": 2427492,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She does a great job in fostering a caring atmosphere for her students. I learned more in this class in one month than some of my other core classes the entire semester. You have to write a few essays but she does a great job with everything. ",
        "course": "LING3605"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Prefer not to mention the course name. Her class is not fun at all. The courseload is generally okay but the whole course is insanely TEDIOUS. She never attempts to build connections with her students. She's gotten no passion for teaching. All that she has done in class is walk through the presentation. This is the class I feel the sleepiest. ",
        "course": "LING2051"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Her lectures were very well-organized and easy to digest! She helped me out a lot during office hours too and was very encouraging in general. Some of the quizzes were a bit tough, so don't wait until last minute to study! Most of the content was from the slides, but read the textbook just in case as well. Try to start your final paper early, too!",
        "course": "LING2701H"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Dossey went out of her way to make this a tough class. She would never record, as it was our responsibility to take accurate notes since it was basically like being in-person (it's not). Quizzes were given with material she would cover after the quiz. Slides were generic and vague, important info was given verbally so not recorded. 0/10",
        "course": "LING4100"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I would describe Professor Dossey as a solid professor. She's accessible if you need her and I would suggest asking questions about the labs. She usually will prompt you towards the right direction! While I would say the lectures are a bit boring, the material is interesting and the labs are *almost* fun! You should attend class/office hours.",
        "course": "LING4200"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Ellen is a very accessible teacher and is always ready to help you without making you feel stupid. Coding and linguistics can be hard for a beginner, but she takes it slow, while still making you work to keep up. Her slides are uncluttered and easy to read, just like her. She gives ample time for labs, homeworks, and questions! (they can be tough!)",
        "course": "LING2051"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Ellen is great. The class itself is a breeze, and she's incredibly informative when it comes to R and Praat. If you don't show up, you're going to struggle and she'll be less likely to help you. But if you show up and struggle, she will go above and beyond to help you out. Pay attention, and you really shouldn't struggle",
        "course": "LING2051"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "It is a very difficult class, and it's boring.",
        "course": "LING2051"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 5,
        "comment": "This course is very difficult. She is a tough grader. This course is really not a shui ke.",
        "course": "LING2051"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Conner",
    "id": "VGVhY2hlci0yNjk3Mzgz",
    "lastName": "Rouillier",
    "legacyId": 2697383,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class was a lot of work, but I think that goes for all second-level writing courses. Nobody likes doing long projects that involve big papers, but he kept it spread out so that it wasn't overwhelming. The content of the class was very interesting and he kept it fun. Some of the assignments are tedious but you get through it.",
        "course": "LING2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Emily",
    "id": "VGVhY2hlci0yOTAxNDI0",
    "lastName": "Napoli",
    "legacyId": 2901424,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is super kind, funny and engaging. She goes off on a lot of random tangents, but they are entertaining. Fair amount of assignments outside of class, but nothing too difficult. She's very knowledgeable in linguistics, and is happy to answer questions and give alternative assignments/extensions if you need them. I would definitely take her again!",
        "course": "LING3701"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Emily makes this class fun and easy. The lectures were really interesting and she does a good job of making the material relevant to our lives. Fair amount of assignments, but as long as you put effort in you will do fine. There are weekly quizzes for attendance purposes, so make sure to be there for most of those. Exams are super easy.",
        "course": "LING3701"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor! Overall her class is pretty easy and it's not very heavy when it comes to work. The lectures themselves are quite interesting and she makes it pretty relevant to our current lives. The homework assignments and exams are easy and I never had to worry about my grade in this class. I would definitely recommend! ",
        "course": "LING3701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Kevin",
    "id": "VGVhY2hlci0yOTg5MTQz",
    "lastName": "Lilley",
    "legacyId": 2989143,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kevin is a very funny and caring teacher. I took this class to fulfill a random requirement I was missing the semester before graduation and the class was really enjoyable. He definitely grades some things pretty particularly but none of the assignments were too difficult. His version of exams \"Big Quizzes\" were very easy to complete. ",
        "course": "PSYCH3371"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Barry",
    "id": "VGVhY2hlci0yOTc3NjQy",
    "lastName": "Baker",
    "legacyId": 2977642,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Barry is incredible. Very caring & wants his students to succeed. Zoom lectures are pretty boring, but they are helpful when learning IPA because he clarifies a lot that the textbook doesn't. He has two big transcription projects, but he is pretty lenient & an easy grader. He responds to emails exceptionally well, which I didn't think was possible.",
        "course": "SPHHRNG3320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.6,
    "avgRating": 2.6,
    "department": "Linguistics",
    "firstName": "Robert",
    "id": "VGVhY2hlci01MzM2OTI=",
    "lastName": "Levine",
    "legacyId": 533692,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Levine is wayyy too advanced for teaching this class. Only 4 assignments which your whole grade is based on. Told me I was doing work correctly but then gave me a 0. He only uses his own slides and doesn't explain the basics. Don't recommend.",
        "course": "LING4200"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Professor Levine seems to be teaching at a graduate level to undergraduate students. The only sources of information we had to learn was from him and his slides. The class had no prerequisites for math or logic but it was used throughout the whole class. This class dove straight into advanced topics. I do not recommend taking this class.",
        "course": "LING4200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prf. Levine is incredibly knowledgeable and is able to give feedback on any project undertaken. He takes special interest in students' projects who come to his office hours/meet with him outside of class. If you struggle with something, he will help you out as long as you make some effort to meet with him.",
        "course": "LING4780"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "He's okay but too smart.  He didn't provide anything to go off but his slides (not even notes, let alone a textbook) and would frequently get off-topic, barely covering what he'd eventually test you on.  Assignments required creativity, but only creativity he agreed with.",
        "course": "LING5202"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Horrible class, bad professor. Super nice guy who is willing to help and is passionate about his subject, but horrible at explaining what he means. Only readings are written by him, so they are just as difficult to understand. Took this to get out of math. If i had to do it again, I'd just take math. Test avg: 50s-60s. Worst grade I've ever gotten.",
        "course": "LING280"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "Mr. Levine seems nice and tries to help, however, the material is extremely difficult to follow and understand.  Average on the midterm was in the 60s. He tells us to read his PDF files which he wrote, so they're just as useless as the lectures. There are 7 grades total: 3 homeworks, a midterm, 2 homeworks, and a final. Too smart to teach undergrad",
        "course": "LING4200"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "No textbook. Posts notes online. Uses metaphors which sometimes relate to complex subjects like quantum physics. I got an A in the class, but I always turned in the assignments, midterm, and final unsure how well I'd do because I never felt sure that I knew what he was asking us to do. Really eager to help, he just doesn't do it well.Openbookexams!",
        "course": "LING4200"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "Overall, pretty good prof. Like others said, his lectures are sometimes hard to follow but if you keep him on task and ask questions he'll come back to subject. I had him at 8:30am and had to bring coffee because you really have to pay attention to do well. It was challenging, but I learned a lot. Only take his class if you are up for a challenge",
        "course": "LING502"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 5,
        "comment": "Do not take this class as a GEC. Way too hard for a gen ed class. He is willing to help but grades very hard and doesn't explain things very well. Not worth the time or frustration.",
        "course": "LING280"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is pretty awful...if you're looking to skip math and take this instead, just take the math class. Class average for the midterm was a 46, and the TA is really pompous. Unless you're planning on going to all office hours and putting in an insane amount of work, just skip it. Prof Levine is a nice guy, just too smart to teach undergrad.",
        "course": "LING280"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not a good class. Most people take it for a math/logic GEC. From the very first lecture, 90% of students were completely lost. There is no textbook. Only reading is citation-free blog posts  by the professor that are just as cryptic as the lectures. Just take a math class! Midterm class avg was 45% for a 280 level class.",
        "course": "LING280"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "If the below comments were honest, they would say the class is hard & leave it at that.  Certainly, it is hard (about 5/35 dropped it), but Mr. Levine himself is excellent.  He has a ton of passion and made class a joy to attend.  Of those who stuck with it, 2 or 3 had minor complaints & the rest of the class loved it (I saw the anon. evaluations)",
        "course": "LING601"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible lectures, assignments, and tests! I regret taking this class, very difficult and useless material. Avoid at all costs!",
        "course": "LING601"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ridiculously difficult homework assignments.  Run of the mill tests.  Lectures tend to have nothing to do with either.  Grades linguistics majors much easier than non-linguistics majors.",
        "course": "LING502"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class got whittled down fast because the first few days he used analogies to astrophysics and quantum theory... which is what everyone can relate to, right&#63; It was a ridiculously hard class but if you stick with it, it's not too bad. I don't know if I actually learned anything about syntax but I think he gave up on our class.",
        "course": "LING502"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "He would give really confusing, hard-to-grasp lectures and assignments, but then the tests were pretty easy (open-book/notes) and didn't relate much to class material.  I can't say I learned a lot about syntax in this class, but part of that is probably due to my own lack of interest in the subject.",
        "course": "LING502"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "I think he was pretty great. The class itself wasn't all that phenomenal, but I had a death in my family and a grandma with cancer whom I had to visit frequently in the hospital; because of those hardships I probably missed about 4 classes and 1 midterm. He was so understanding and compassionate and ready to do anything to accomodate me. Great man.",
        "course": "H201"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "This man may have been the worst professor I've ever had.  This is why senority sucks!  This man has no distinct teaching style, and his monotone voice makes you want to fall asleep.  Not very helpful, and over all a very poor teacher.  I would not recommend this professor for anyone.",
        "course": "LINGUISTICS201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.4,
    "department": "Linguistics",
    "firstName": "Becca",
    "id": "VGVhY2hlci0xODA2MDU0",
    "lastName": "Morley",
    "legacyId": 1806054,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her Ling class is extremely difficult if you are a non-Ling major. Material is not difficult but her grading is when you are basically figuring everything out on your own. Lectures are question based, with zero structure. She is nice, but not helpful. She teaches a freshman class at a graduate level. Would not recommend taking her courses.",
        "course": "LING4100"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "The class is very frustrating because it's so vague. There are few assignments and no exams which can be nice, however, the grading is very confusing and inconsistent. There are no written instructions or rubrics and all the directions are given during class in the first five minutes. Lectures are very dry.",
        "course": "LING3701"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took LING3701 online with Dr. Morley last semester. I felt like she was unapproachable and kinda dismissive. Along with that, she randomly started grading everything way harder later in the semester with little to no explanation. Also, assignments were more difficult than they seemed and the instructions were extremely unclear. Do not recommend.",
        "course": "LING3701"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst professor ever! Avoid her if you can. Very inconsistent expectations, confusing, tough and sporadic grader. Very smart but a horrible teacher. Lectures are hard to follow and unhelpful.",
        "course": "LING3701"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "The content of her course is not difficult at all. But she grades unfairly based on personal preferences. You will likely end up with a really bad grade if for some reason she doesn't like you. She doesn't have a clear grading system and she doesn't explain what she wants. Avoid her if you can, or you will likely hate linguistics in general.",
        "course": "PHONOLOGY5301"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "You want to go to class. It moves very quick and there is a large project at the end of the semester that requires all of the in class exercises. You will work for this grade, but Becca is very willing to help and encourages you to form your own opinions. Make sure you get good partners to help, a good group can make or break your grade.",
        "course": "LING4300"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "She was nice and funny but didnt have much structure for the class. It was easy, with no exams and minimal homework - shouldve been an easy A. Unfortunately, she graded sporadically and didnt put everything in Carmen so my final grade was a B+ but in Carmen I had a 95% so just be aware of that.",
        "course": "LING2000H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Morley makes you work hard, but she's fair. She makes you build things up from the basics before you can take anything for granted. If you work hard, come to class, and pay attention, you'll do fine in her class. Her expectations are clear and while it'll require a lot of work, if you put in the effort, it ends up being worth it.",
        "course": "LING4300"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Morley is super knowledgeable about what she teaches (which is enjoyable), but sometimes her lectures can get dry. She's great at answering questions and explaining tricky concepts, but it was tricky to know how she'd grade assignments. Make sure to elaborate on all answers for a shot at full credit. She appreciates effort.",
        "course": "LING4100"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "A bunch of non-Linguistics majors taking a GE class with Becca turned out to be a disaster. While she's a respectable person, she was unable to teach to our level and would not answer questions for help; no midterms was nice, but the rest of the class was a disaster like I said.",
        "course": "LING2051"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very approachable. But beware of group projects. Dont let them screw your grades.",
        "course": "LING4300"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her explanations were confusing and hard to understand. I felt that the lectures were not helpful. Also, she is not very approachable.",
        "course": "PHONOLOGY5301"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have had. She does NOT prepare for classes. All she does in class is answering questions, and if there are no questions, she begins talking about her personal experiences. Did not learn ANYTHING(literally)from her. Basically learned everything myself. Never replies to your emails. Do not recommend her.",
        "course": "PHONOLOGY"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "GREAT PROFESSOR! She is very informed and likes to help students with work. Go to her office hours, she's very receptive.",
        "course": "LING5301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Prerna",
    "id": "VGVhY2hlci0yOTEyNDk3",
    "lastName": "Nadathur",
    "legacyId": 2912497,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great professor",
        "course": "LING5401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Ashwini",
    "id": "VGVhY2hlci0yMzE5MDE4",
    "lastName": "Deo",
    "legacyId": 2319018,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Even though this was a class (Linguistic History of India) that had never been taught before, Dr. Deo created a syllabus that not only provided a comprehensive survey of a massive topic, but was also interesting, funny, dynamic, and multidisciplinary. I would strongly recommend taking one of her classes if possible.",
        "course": "LING4400"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Deo's subtle sense of humor made an otherwise dry class worthwhile. At times it felt like she was repeating herself and taking a long time on the easier material and skipping through the harder material, but she is willing to help outside of class.",
        "course": "LING4400"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very kind and clearly passionate about teaching. The subject matter was pretty dry but she has a subtle sense of humor that's endearing. She grades in a very meticulous way, but she does her best to be clear about what she's looking for. A very good professor.",
        "course": "LING4400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Ian",
    "id": "VGVhY2hlci0yODc3Nzcz",
    "lastName": "Cameron",
    "legacyId": 2877773,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's awesome!!! Best instructor ever!!! I was lost at the beginning because I'm non-linguistics major but he helped a lot, explaining everything clearly when I asked. After a few weeks, I was able to get pretty good grades. ",
        "course": "ling3901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cool guy, super nice. Knows the course might be tough for non-linguists so gives review that might be boring to people who've taken ling2000. HW is pretty clear and tests are easy. Read the textbook and you will ace them. All around clearly knows his stuff and is willing to talk about things more in-depth during office hours or after class. ",
        "course": "ling3901"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really fun and engaging lectures. Homework is given once every two weeks or so and is graded honestly and fairly. Exams and quizzes are easy if you pay attention, do the readings (for quizzes), and take good notes. ",
        "course": "ling3901"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3,
    "department": "Linguistics",
    "firstName": "Micha",
    "id": "VGVhY2hlci0yMzcyMDcz",
    "lastName": "Elsner",
    "legacyId": 2372073,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "While the lecture does get a bit dry and easy to get lost in sometimes, it's easy enough to pick up the general idea that's trying to be communicated, and he's more than willing to stop and explain things as needed. The class is incredibly easy, and there's loads of extra credit opportunities on top of that (median 96% w/o EC). Would take again.",
        "course": "LING3801"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Made sure, or at least tried to give everyone a good grade. More of a critique of 3801 than him but the final projects are an insane amount of work and the quizzes require a ton of reading. This class was a lot more work than anticipated. His lectures are pretty boring but he also tries to give students answers to exams if they show up for review. ",
        "course": "LING3801"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hands down one of my favorite classes. As long as you showed up, put in the effort to do the homework, and actively helped in the group projects you got an A. The midterm is a bit scary, but as long as you can do the homework you can do the midterm. Professor Elsner is a great and funny guy, he cares about the students and wants to help them.",
        "course": "LING3801"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Was very close to dropping the class. Micha is extremely boring and like other raters have said, a terrible communicator. He also makes the female students feel very uncomfortable and is genuinely creepy. Would highly recommend you dont take this class.",
        "course": "LING5802"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I very much disagree with other comments. I loved Micha! He is knowledgable, approachable outside of the class, and witty. Would recommend taking his course but be ready to work and learn a lot.",
        "course": "LING5802"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very difficult to listen to and not good at teaching the material. Would recommend getting another professor if at all possible.",
        "course": "LING3502"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is quirky but very knowledgable and willing to help. As long as you turned in your hw on time he gave you the rest of the semester to go back and correct what you missed in order to get full points on everything. Super interesting and had alot of fun. Textbooks are not necessary at all.",
        "course": "LING3502"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Unless you genuinely enjoy linguistics, I would not take this course. If you love linguistics, perhaps you could find it interesting but I dreaded being in class because of how boring and dull it was. Micha is really awkward and not the most likable guy.",
        "course": "LING3502"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved Micha! He's a kind of an awkward guy but I found it very endearing, and he actually is super funny/witty. He's very knowledgeable but also admits when he doesn't know something. There's a lot of work on the semester-long project but he walks you through it and lets you resubmit for more points. Very helpful, nice, super nerdy. 10/10.",
        "course": "LING3502"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Elsner is engaging and personable. He does a good job explaining topics, and admitting when things are outside his scope of expertise. His lecturers are interesting, the grading of assignments is clear, his feedback is excellent, and most assignments can be resubmitted for more points.",
        "course": "LING3502"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "Regret enrolling in this course and was very close to dropping it. Micha's lectures are difficult to sit through as he is a very bland and awkward lecturer. He is clearly extremely anxious talking in front of people and is not a good communicator. Somewhat knows what he is talking about but is terrible at explaining concepts and teaching.",
        "course": "LING8800"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Would not recommend. He is very awkward and lacks any sort of confidence when teaching. To make matters worse, he is very dull when describing the course material and is not good at explaining anything. A lot of unnecessary work for a gen ed course as well.",
        "course": "2000H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Linguistics",
    "firstName": "Elena",
    "id": "VGVhY2hlci0yNzkxMzg0",
    "lastName": "Vaiksnoraite",
    "legacyId": 2791384,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Elena was amazing. participation isn't a set measurement (just show up & maybe talk a little.) Interesting concepts but ALOT of papers (the bulk of the grade.) I'm Ukrainian & during the invasion, she was understanding and compassionate to my situation & let me make up a few things. she graded my final kinda hard but I did blow it off ngl. ",
        "course": "3371"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2.8,
    "department": "Linguistics",
    "firstName": "Noah",
    "id": "VGVhY2hlci0yMTI0NjU4",
    "lastName": "Diewald",
    "legacyId": 2124658,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "This man is not only boring and cringely unfunny, but just overall a rude and disrespectful. His class set up on carmen is so hard to navigate and unclear. I am an engineering student and took his class as a gen ed and he is the worst professor I&#39;ve ever had. Avoid this man as he seems to care little about his students.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Noah is subtly hilarious. He genuinely wants to help, but often seems to struggle with explaining material to non-majors and people who are extremely lost. The class is extremely easy for people who have a slight background, but for new people and non-majors, it's a little difficult. He seems to expect everyone to be a ling major",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class was an extremely easy A. Skim over the textbook before tests and your basically guaranteed a high A. Noah is a decent teacher but very dry.",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "I got As on his tests, but the class was so terribly boring and it was hard to motivate myself to go because class wasn't essential to learning, but you have to go because he assigns homework in class and doesn't post it on carmen, and he gives participation points every day.",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Linguistics",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0yNTQ4MTM4",
    "lastName": "Conner",
    "legacyId": 2548138,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great! Lenient on deadlines, supportive with work, and very relatable.",
        "course": "LING2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was great! Extremely approachable and very excited about the class. She gets to pick most of the topics taught and theyre very engaging. Shes very good at connecting the ideas to the readings.",
        "course": "LING2367.01"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really liked her. She's been one of my favorite professors that I've had so far. Her lectures were always entertaining so they were fun to go to. She also explained the criteria for her assignments very well so it was easy to know what you had to do for them. She also was very nice and relatable.",
        "course": "LING236701"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Katie is the most caring professor I've had and was willing to help me out when I really needed it. I highly recommend her class, most readings aren't for a grade so you can afford to miss a couple, but SHE CAN TELL if you don't do them. If you demonstrate that you aren't blowing off her class, she will reward you highly. LOVE HER",
        "course": "LING236701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2.5,
    "department": "Linguistics",
    "firstName": "Damayanti",
    "id": "VGVhY2hlci0yNjY1Mjcw",
    "lastName": "Tiwari",
    "legacyId": 2665270,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Damayanti is the worst professor at communicating that I have ever had. She tells you to do an assignment one way and then counts it wrong. I can tell she is very smart but some smart people should just not be teachers. She is horrible at explaining things and my GPA suffered for it. Will never take any of her classes again if I can help it.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Damayanti was a really good teacher when it came to explaining different linguistic content, but when it came to homework and quizzes, she would often throw curveballs in that we had never talked about before in class. She was a really hard grader when it came to the Problem Sets we had to do and the homework. Overall, very kind but a hard class.",
        "course": "LING2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 4.3,
    "department": "Linguistics",
    "firstName": "Carly",
    "id": "VGVhY2hlci0yMzI2ODQ2",
    "lastName": "Dickerson",
    "legacyId": 2326846,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "There are weekly readings before each class and each class is based on discussions around those readings. I hardly ever did the readings and stopped showing up to classes but still got an A on my participation grade. There is a semester long research paper but if you follow the rubric, it is an easy A. Carly is so sweet and really passionate.",
        "course": "LING2367"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Carly is extremely nice, and cares about what she is teaching. When I fell behind in class, she was extremely accommodating and helpful. Genuinely cares. Reading the textbook was not really critical for understanding, but she would get frustrated if no one read it. She is a fan of projects and essays, so you do have to put considerable effort in.",
        "course": "LING3603"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Carly explains all of the lecture material clearly. The majority of the class focuses on a project which requires you to interview someone outside of class and do a 2-page write-up every week. In addition to this, you've got to read the textbook in order to do well on the midterm and final. A decent amount of work, but doable if you put in effort.",
        "course": "LING3603"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Class was kind of boring. She nice though. Theres a semester long project where you have to find a language consultant which is tedious and a 2 page paper is due weekly, with a presentation and final paper at the end. Shes not a tough grader though and if you do your work and go to class youll most likely pass.",
        "course": "LING3603"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interesting class, very good teacher , cares about her students a lot and will take time to explain again and again if someone needs it. Very enjoyable class and caring teacher!",
        "course": "LING3603"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Carly is a good instructor and has a lot of papers in her class, but she is a fair grader. She is accessible outside the classroom and gives good suggestions and feedback. Really enjoyed having her and hope to have her again",
        "course": "LING3603"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Really interesting course if you like foreign languages and linguistics. The bulk of your grade is a language consultant assignment which is someone who you have to interview every week about their native language and write 2 pages on that week's topic, but she gives you a rubric for each one. Also she expects that you read for each class",
        "course": "LING3603"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "I wasn't very interested in the course topic but I thought Carly was overall a pretty solid teacher. As long as you put in effort on the essays you'll probably do good in the class.",
        "course": "LING3603"
      }
    ],
    "SEI": []
  }
]