[
  {
    "avgDifficulty": 3.2,
    "avgRating": 4,
    "department": "Literature",
    "firstName": "Nina",
    "id": "VGVhY2hlci01ODI3NjY=",
    "lastName": "Berman",
    "legacyId": 582766,
    "numRatings": 11,
    "summary_comment": "Nina Berman is a knowledgeable and passionate professor who receives high praise for her engaging lectures and helpfulness. However, students note that she can be a tough grader and is not open to alternative ideas, which can affect grading fairness. Despite this, many find her class interesting and valuable, with take-home tests and a supportive learning environment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "very tough grader",
        "course": "COMPSTD3360"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "only thinks her own opinion is right and the least open minded to other ideas which is messed up because its globalization and she doesn't know anything about new globally connecting technologies, aka snap chap live feed. Went to her for help, re-formated my final paper based off what she said, and got a lower grade than if i just didnt go to her. ",
        "course": "COMPSTD3360"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very nice lady. Her lectures are interesting and the books she assign aren't horrible. There are 2 papers and 2 exams. She grades pretty fairly. There's a powerpoint project, but if you try you should get a good grade. As long as you come to class and take good notes, there is no reason you shouldn't get an A in this class.",
        "course": "CMSTD2301"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Wonderful class and a great professor. Very interesting material and a Prof. Berman was extremely helpful. Final Research paper worth majority of the grade. 3 small papers 2-3 page papers worth a. One of my favorite professors at OSU (9/10). Subject matter of the class drives interesting discussions. Take this class with her.",
        "course": "CS398"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "World literature GEC class. There is a lot of reading. Attendance is required. However, tests are take-home. If you read and take notes in class, the tests are an easy A. Final is take-home too. She is very nice, knowledgeable, and understanding. Class was WAY better than I expected. I would recommend it.",
        "course": "CS273"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor and extremely helpful. Class was very interesting. I learned a lot from her and the readings used.",
        "course": "CMSTD398"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "most intelligent woman in the world. very accesible as well.",
        "course": "COMP373"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Nina Berman is a great teacher. I was kind of annoyed that most of the literature was German and she is German, but maybe Germans are really influential :) I think that when she is approached she is very helpful. The discussions in class are very good and she is very passionate about what she teaches :)",
        "course": "COMST398"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was generally interested in helping the students with understanding the material. One downfall was there was a lot of reading but as long as you skim it, you can pass. No exams, just 5 short papers and a final paper. The papers were graded very easily.",
        "course": "COMPSTD306"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "she seems like an alright teacher. but the class is a huge disappointement. first 5 minutes there, i could have sworn i was in the wrong class. i thought i was taking a german history class. nah. i'm taking a &quot;history of the arab peoples&quot; class. don't take her class unless you don't mind learning about what she wrote her books own on.",
        "course": "GERMAN250"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is an excellent Professor.Very kowledgeable and enthusiastic to teach her topic.Very kind and helpful out of the class too.i recommend her classes to everybody",
        "course": "CS840"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 2.9,
    "department": "Literature",
    "firstName": "Margeret",
    "id": "VGVhY2hlci00MDE4NjE=",
    "lastName": "Mills",
    "legacyId": 401861,
    "numRatings": 4,
    "summary_comment": "This professor is widely regarded as one of the best due to her engaging lectures, easy-to-understand material, and willingness to help students. However, opinions vary significantly; some find her classes too easy and unstructured, while others warn to avoid her due to her unorganized teaching style and difficulty in grasping the material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Incredible! The material and tests are easy, just pay attention in class. She has great stories about her own experience with the material she teaches. One of the best teachers I've had in a long time!",
        "course": "PERS370"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Keeps it interesting, always happy to help. She expects you not to do the reading, and goes over everything in class in case you havent. No homework other than reading, and tests are all Essay (i like that, some people dont) but she lets you pick topics in advance so you are well prepared. Extremely Lenient and helpful. Also very easy class to BS.",
        "course": "PERSI370"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this prof. I was so interested in the material and have a background in it. However, she made it so boring and difficult to grasp. Very unorganized and unclear, not helpful at all. Readings average 80-150 pages a week and out of all those pages, she will pick 1 random sentance. Her tests are all essay with no middle ground. Avoid!",
        "course": "PERSIAN370"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Persian 370 is suppose to be an interesting literature class unfortunatly this lady is unorganized and doesn't teach well at all.The quizzes- if you've read what you need to read and understand, it's her opinion that counts on her quizzes..it is all essay",
        "course": "PERS370"
      }
    ],
    "SEI": []
  }
]