[
  {
    "avgDifficulty": 3.9,
    "avgRating": 4.1,
    "department": "Managerial Science",
    "firstName": "Andrea",
    "id": "VGVhY2hlci0xMTMzMjI2",
    "lastName": "Prudhomme",
    "legacyId": 1133226,
    "numRatings": 31,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "She's rude, humiliating and poor at articulating. When you ask for clarification in class she just simply repeats herself again in a louder voice with a mean attitude. She assumes everyone can understand the lectures with little to no context on the slides. If a discouraging learning environment is what you want, take her class!",
        "course": "BUSOBA3230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "The best teacher I can meet in this life. Think about how much you are willing to sacrifice for this class and this major, and she will respond with the same enthusiasm. She teaches not just one class, but also helps students think about their future direction and the connections between all current courses.",
        "course": "4232"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Prud'homme was probably the best professor I've ever had at OSU. Her class isn't easy, and she expects you to put a lot of time into it outside of the classroom, but she prepares you for real-world decisions and responsibilities. If you ask her to, she will help you, but its up to you to reach out. GO TO OFFICE HOURS! ",
        "course": "BUSMGT4232"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Prudhomme was by far my favorite professor during my time at Ohio State. Her knowledge on Operations Management and the way she teaches makes you passionate about learning. If you attend lectures and visit her during office hours you will be perfectly fine. ",
        "course": "4232"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I want to preface this by saying her class is not hard, it's just a ton of work as long as you pay attention in class, participate, and follow along with her notes templates.\n\nDr. P's class was probably the most rigorous course I took in my Ops Mgmt track but was by far the best teacher I have ever had. READ THE TEXTBOOK BEFORE CLASS.",
        "course": "BUSMGT4232"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "If you WANT to learn operations and inventory management, take Dr. Prud'homme. If you want to skim by and put in minimal work, take another prof. I personally liked Prud'homme quite a bit. Her lectures are fast paced and she expects a lot of time commitment outside of class, but you'll learn applicable skills along the way. Great prof, hard class",
        "course": "BUSMGT4232"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "The lectures are pretty boring ngl, but the homeworks, lecture quizzes, recitations, and textbook quizzes really bring you down physically. They are not hard, but the exams are crazy. They have you scan your room prior to taking the exam and, for me, gave me a ton of anxiety. I would not take her if you have bad testing anxiety.",
        "course": "BUSOBA3230"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Prud'homme is easily the best professor I've had at OSU. Unfortunately, that doesn't mean it was easy. You have to work hard if you want to do well, and the classroom is treated like a professional environment. She's funny, she knows how to teach our age level, and she cares enough to set you up for success in the future. I would recommend.",
        "course": "BUSMGT4232"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "I personally didn't enjoy Prud'homme's class as much as my classmates did. I found her teaching style very confusing and acted like concepts were simple to understand even though none of us have been exposed to them before. The first half of class is very information-heavy, the second half was a monotonous simulation. I did learn tho, painfully.",
        "course": "BUSMGT4232"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Prud'homme is awesosme - she has tons of industry experience and opts to prepare students for jobs as opposed to teaching for a test. That said, this class is pretty challenging and extremely work-heavy especially in the first half of the semester (so avoid taking as a 2nd semester senior if you can)",
        "course": "BUSMGT4232"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Prudhomme, is an amazing professor with a wealth of knowledge. She is extremely passionate about teaching and her students. But, she does not let that get in the way of having a little fun in class. Be active in class, go to her office hours, and just be nice and she will treat you with the same. Be sure not to skip class, she marks attendance",
        "course": "BUSMGT4232"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Prud'homme is an awesome professor. Teaches from a wealth of experience, and is the most fair/knowledgeable/helpful prof when it comes to Ops Plan and Control (over Benton and Evans). The class is tough, but she is extremely helpful. Go to class, ask questions, be engaged in class, and you'll be fine.",
        "course": "BUSMGT4232"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "She runs a tight ship, and doesn't take any nonsense, however, she is one of the best teachers I've had in college. Big simulation you do during the second half of the class is applicable to the real world and she teaches you for jobs, not for theory. Awesome experience.",
        "course": "BUSMGT4232"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "She could be pretty rude at times, but definitely knowledgable and accessible outside of class if you have questions. The first half of the semester is homework heaaaavy, assignment due about once a week. She also grades on participation, i.e. its tracked every class - also, pick a good group at the beginning of the semester",
        "course": "BUSMGT4232"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. P is the homie! She is a tough teacher and the content is in depth but she genuinely cares about her students and make herself accessible outside of class. If you want to do well she is there to help. One of the best teachers I've had at Fisher.",
        "course": "BUSMGT4232"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "Tough class - first 8 weeks are long hours of homework in groups. Her humor can be really rude and she picks favorites very early! When you get confused bc she explained it poorly, she repeats what she laid louder and with an attitude. Her whole demeanor just made the whole environment so unwelcoming and crappy. Stay away!!!",
        "course": "BUSMGT4232"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Prud'homme was an overall great professor. It took a few weeks for me to warm up to her and her teaching style, but you can really tell she cares about her students' learning. The first half of the semester is hard due to a heavy workload of HW, but it definitely gets better as the semester moves forward. Overall, I recommend Dr. Prud'homme.",
        "course": "BUSMGT4232"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Prud'homme is a tough prof but if you stick it out you will learn a lot more from her than an easy prof. She has a lot of experience and is always willing to help you during her many office hours. Her exams are fair but you must come to class. The first 8 weeks of the class consist of a ton of group projects and long hours of doing hw.",
        "course": "BUSMGT4232"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Shes a terrible teacher run",
        "course": "BUSMGT3230"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 5,
        "comment": "Great notes, and great teacher, but she is harsh and has a dry sense of humor.  Her attitude can be very off-putting.",
        "course": "BUSMGT3230"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great teacher, learned a lot, not an easy class, but worth the effort",
        "course": "BUSMGT4232"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is really a helpful teacher!!!",
        "course": "BUSMGT4232"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very Fair. Well Spoken. Interesting. Helpful. Great business leader and professor. 1010 would do again.",
        "course": "4232"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was a very top-heavy course--last few weeks were easy. Material was a lot, but not too hard to understand. Get notes sheet on midterm and final, but lots of pop quizzes. Homeworks are hard, definitely do NOT need the book. Dr. Prudhomme is nice, just make sure to NOT use cell phones in class!",
        "course": "BUSMT732"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "She has high expectations of students, but she is the best professor of the course. She has useful real world experience making the subject applicable. Participate and put forth energy, and she will meet you halfway. BEST professor in my OSU career. Group projects are tricky but manageable. Participation grade is quizzes, not attendance.",
        "course": "MGT630"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 5,
        "comment": "Good teacher, MEAN person!!! Choose any teacher except her!",
        "course": "BUSMG630"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is very clear on her expectations. She also does everything she can to help students provided they put forth some effort and actually ask questions.",
        "course": "BMGT732"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 5,
        "comment": "If you attend class and study a day or two before the test, you should be able to get an easy A.  She essentially gives 20-34 extra credit points on each test, plus an extra credit opportunity.",
        "course": "BUSMG430"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was really helpful if you got to know her a little.  After going to her office once she knew who I was and I did better the whole quarter.",
        "course": "MGT630"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 4,
        "comment": "not as hard as you think!",
        "course": "MGT732"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 4,
        "comment": "Read Learning to See, go to class. All sections of 630 have the same exams, so choose your professor wisely.",
        "course": "MGT630"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.4,
    "department": "Managerial Science",
    "firstName": "David",
    "id": "VGVhY2hlci0xODk1MDA5",
    "lastName": "Veech",
    "legacyId": 1895009,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took the online version of this course. I would recommend doing the same if you are able. The Carmen page is well organized and the content is easy to comprehend if you attend the recitation on Zoom. Professor Veech was very kind and quick in his responses to my emails.",
        "course": "BUSMGT3230"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 5,
        "comment": "Veech seemed like a nice guy but his tests are structured horribly. There is barely any time and it is heavy on math. And it sucks taking a math test online! Half the time I would have to draw out the chart on my screen which was a waste of time.  Take another professor for now, or wait until you hear the online version has gotten more organized. ",
        "course": "BUSMGT3230"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Final grade is too heavily weighted on exams. Content was pretty dry and I didn't feel there was much effort to engage students. Too much emphasis on qualitative problems instead of the conceptual topics that were tested more frequently. Discussion board questions weren't always answered in a timely manner - not great for a 100% online class.",
        "course": "BUSMGT3230"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Veech truly cares about his students and wants them to succeed. He is very flexible when it comes to deadlines but will be tough enough to ensure you actually try. He responds to emails and carmen messages and is always willing to meet outside of class. Groups are selected randomly, and you work with them throughout the whole semester. ",
        "course": "BUSMGT4239"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Veech is very passionate for teaching. I was fortunate to have him for 4239. No exams. Group projects and workload is very manageable. ",
        "course": "BUSMGT4239"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good teacher. Great real-life experience.",
        "course": "3230"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Take it He class is easy",
        "course": "BUSMGT4239"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "This course has been very boring and ineffective. He tells jokes but not fun. He cannot give you anything related to the course content. I don't know what I have learnt so far. Be careful and ready to study by yourself!",
        "course": "3230"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Attendance is not required but his class is relaxing and interesting. A very nice professor and does enjoy his job in teaching. ",
        "course": "3230"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is a humorous person who loves to make jokes. He really likes this job of being a professor and has passion to teach. He is not so helpful on the cases, though, because he will only give you vague answers.",
        "course": "BUSMGT3230"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Veech is the absolute man.. He is so understanding if you have a problem and helps you. He hates seeing people fail so he gives strong curves. He is really good at lecturing! Definitely cares about the class. Ya the work isn't the easiest, a lot of reading but overall I liked him a lot!",
        "course": "BUSMGT3230"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Going to the class and learn nothing but something unrelated. I would not come to the class but study alone at home if not for the 5% attendance point. Assigned lots of reading but not telling you what is important and aimed at - wasting all your time. Picky on the case grading. DO NOT EVEN KNOW WHAT HAVE LEARNED IN THE END OF THE SEMESTER!!!!!!",
        "course": "BUSMGT3230"
      }
    ],
    "SEI": []
  }
]