[
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Materials Science amp Eng.",
    "firstName": "Maryam",
    "id": "VGVhY2hlci0yMzU3NTg2",
    "lastName": "Ghazisaeidi",
    "legacyId": 2357586,
    "numRatings": 3,
    "summary_comment": "Professor Ghazisaeidi is known for her tough and demanding teaching style, with extremely challenging assignments that offer little to no support or guidance. Students report that she does not handle criticism well and can be unapproachable when seeking help, making her one of the most difficult professors at The Ohio State University.",
    "summary_comment_short": "Professor Ghazisaeidi is known for her rigorous and challenging classes with difficult assignments that offer little to no support or hints. Students find her unapproachable when seeking help and warn others to avoid her at all costs due to her harsh grading and lack of responsiveness to feedback.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "She doesn't take criticism or disrespect well so don't try to change her. Her classes are impossible to pass and every time I tried to ask for help on assignments, she made herself unavailable. Worst professor at The Ohio State University, by far!! Run away as fast as you can. Save yourself countless headaches and avoid Maryam at ALL costs!!!",
        "course": "MSE3321"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "tough women",
        "course": "MSE3321"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Incredible hard assignments, not hint, no useful resources",
        "course": "MSE3321"
      }
    ],
    "SEI": [
      {
        "Subject": "MATSCEN",
        "Catalog": "5605",
        "Class Name": "Quantitative Introduction to Materials Science",
        "Class Number": "9570",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Materials Science&Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.13"
      },
      {
        "Subject": "MATSCEN",
        "Catalog": "6747",
        "Class Name": "Structure and Defects in Materials",
        "Class Number": "6677",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Materials Science&Engineering",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "3.75"
      },
      {
        "Subject": "MATSCEN",
        "Catalog": "5605",
        "Class Name": "Quantitative Introduction to Materials Science",
        "Class Number": "8521",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Materials Science&Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "3.25"
      },
      {
        "Subject": "MATSCEN",
        "Catalog": "7193.02",
        "Class Name": "Individual Studies in Materials Science & Engineering",
        "Class Number": "6536",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Materials Science&Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "MATSCEN",
        "Catalog": "5605",
        "Class Name": "Quantitative Introduction to Materials Science",
        "Class Number": "8600",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Materials Science&Engineering",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.86"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Materials Science amp Eng.",
    "firstName": "Mike",
    "id": "VGVhY2hlci0yMzk0MTQ4",
    "lastName": "Sumption",
    "legacyId": 2394148,
    "numRatings": 1,
    "summary_comment": "Professor Sumption's lectures are often described as dry and difficult to follow, with many students finding that the material is explained more effectively in the textbook. His use of slides consisting primarily of textbook screenshots does little to aid understanding. Students recommend relying on the textbook and dedicating significant time and effort to the final presentation to succeed in the course.",
    "summary_comment_short": "Professor Sumption's lectures are often described as dry and difficult to follow, with many students finding that the course material is explained more effectively in the textbook. His background in physics rather than materials science is evident, making his presentations less helpful for understanding the course content.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Sumption's lectures are dry, hard to follow, and not helpful for the course. His slides are screenshots from the textbook, and the book explains the concepts better than him. He's a physicist by training and not a materials scientist and it shows. Read the book and put a lot of time and effort into the final presentation and you'll be fine.",
        "course": "MATSCEN4181"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Materials Science amp Eng.",
    "firstName": "Pete",
    "id": "VGVhY2hlci0yNDg2MzA2",
    "lastName": "Anderson",
    "legacyId": 2486306,
    "numRatings": 1,
    "summary_comment": "Professor Anderson's lectures are often described as dry and monotonous, with a soothing tone that can lull students to sleep. Despite this, his tests are generally considered fair and aligned with the course material, and he is known for being generous with crib sheets. However, the homework assignments are frequently criticized for being poorly coded and time-consuming.",
    "summary_comment_short": "Professor Anderson's lectures are often criticized for being枯燥无味，尽管他慷慨地提供了复习资料，测试相对简单且与课程内容相符。然而，学生普遍反映家庭作业技术实现难度大，令人头疼。",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I'm not going to lie, the lectures are very boring and his voice is so soothing it's hard to stay awake. The tests are fairly easy and representative of the course material, and he's very generous with crib sheets. The homework is a major PITA because it's never coded right. He tries to make himself accessible but he's the department chair so",
        "course": "MSE3261"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 1,
    "department": "Materials Science amp Eng.",
    "firstName": "Vicky",
    "id": "VGVhY2hlci0yMzI2MDA4",
    "lastName": "Doan-Nguyen",
    "legacyId": 2326008,
    "numRatings": 6,
    "summary_comment": "Professor Doan-Nguyen is widely regarded as a challenging instructor, particularly due to her teaching style and exam structure. Students find her lectures difficult to follow, often delivered at an incomprehensible pace or overly slow with excessive repetition. The exams, which are heavily weighted and consist of numerous multiple-choice questions, are seen as unfair and not reflective of the material covered in class. Despite her friendly demeanor, many students struggle with the class, leading to lower grades than expected.",
    "summary_comment_short": "Professor Doan-Nguyen is widely regarded as a challenging instructor, particularly due to her teaching style and exam format. Students find her lectures difficult to follow, often delivered at an extremely fast or slow pace, and the exams, which are heavily weighted and based on specific multiple-choice questions, significantly impact grades despite the relatively straightforward material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Doan-Nguyen is the sole reason I will not be graduating with a 4.0. Every other class I have taken: ochem 1 and 2, biochemistry, calculus 1,2, and 3, linear algebra, and diff eq, I have received an A in. But this 3 credit hour class and it's ridiculously specific multiple choice exams worth most of your grade took that eye-catching 4.0 from me",
        "course": "MSE2010"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "The actual material for this class is not that difficult, but what makes the class hard is that you have to pretty much teach yourself since Vicky has terrible lecture skills. The homework and exam problems are usually unrelated to what she does in class. There is also no curve at the end.",
        "course": "MSE2010"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "The worst professor Ive ever had. The classes are pointless, mainly consisting of with lecture slides that are 100+ pages long or guest lectures that are only slightly related to the course. The homework doesnt help, the textbook is terrible, and recitations are a waste of time. Example problems are not done in class but make up 70% of the exam.",
        "course": "MSE2010"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is the worst professor I have ever had. Not only is the class poorly organized, she also doesn't teach the information well or really teach topics that matter to the topic at hand. Her exams were impossible for no reason, and when given feedback on the course she didn't listen. Not to mention the &quot;guest lecturers&quot; which were useless.",
        "course": "MSE2010"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "The material for this class is not difficult. However, the 20 question exams that are worth 70% of your grade suck. She seems like a nice person but her teaching style is either too or too fast, and above that she does not curve. Overall, would not recommend.",
        "course": "MSE2010"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "I'm not sure if it was her first time teaching or not, but it was rough to have VDN. She has a friendly disposition, but her lecture skills are pretty bad. VDN has 2 modes for lecture, light speed or unbelievably slow and unnecessarily repetitive. Her class (dual taught with Alison Polasik) has no curve and some content is ridiculously hard.",
        "course": "MSE2010"
      }
    ],
    "SEI": []
  }
]