[
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.6,
    "department": "Materials Science & Eng.",
    "firstName": "Jenifer",
    "lastName": "Locke",
    "legacyId": 2560445,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Weekly quizzes often did not seem to reflect the weekly content. You can attend both lectures for the content, watch the pre recorded videos, and do the optional practice problems, and there will still be a problem you've never seen before. I would highly recommend doing the optional problems on zybooks."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Class is structured very poorly, and not very helpful in lectures. Very passive aggressive, gets oddly upset when people pack up a minute early."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "This class was super annoying, a quiz every Friday morning, and 4 hour review videos if you wanted to study. Often times I would get a better grade if I guessed on the quizzes than if I tried to study and prepare. She was very passive-aggressive and would make students feel very intimidated. There are some opportunities for extra credit though."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Be ready to watch 3 hours of videos and attend lectures to be prepared for the weekly quizzes. Class is less focused on learning than doing well on quizzes due to amount of content. She asked for feedback mid-semester just to change nothing. Only plus is the amount of extra points available which bring your grade up a lot at the end of semester."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Rushed material, quizzes every Friday with difficulty to prepare, long readings that do not invite real learning. Retained low amounts of information due to the rushed course layout."
      },
      {
        "index": 5,
        "rating": null,
        "comment": "Overall Professor Lock is alright. When approached though she made you feel quite dumb. I avoided her after talking to her. There are quizzes every week, but you can get some points back by correcting your quiz. There's lots to read."
      },
      {
        "index": 6,
        "rating": "4.0",
        "comment": "I think Prof. Locke is a good professor but I believe Prof. Brown is better at explaining what is needed for the weekly quizzes. I had a hard time following her lectures in comparison, and there was less explanation in general of the stuff on the quizzes."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "you take a 40 point quiz every single week. there's a lot of opportunity to earn points back but there is a lot of homework and those quizzes will tank your grade. also professor locke does not like being contacted about grades so don't even try to ask."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "prof locke is a great instructor. 100% recommend"
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Professor Locke is a very solid professor. She explains things clearly and in detail in lecture, and has a good sense of humor which keeps lectures engaging. She has very fair exams and does bonus questions. Nothing on the exams was surprising if you attend lecture or read the material (she makes it clear what sections are considered fair game)."
      }
    ]
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4.4,
    "department": "Materials Science & Eng.",
    "firstName": "Stephen",
    "id": "VGVhY2hlci0yNzA1ODg3",
    "lastName": "Niezgoda",
    "legacyId": 2705887,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Not pop quizzes but weekly quizzes. Had two drops which was lovely. Had to follow along in lecture if you're easily distracted but you can definitely read his slides and rewatch some lectures and it makes it easier. I liked attending bc of the spotify playlists in the beginning and also he said you do by attending and he wasn't wrong I guess?",
        "course": "MATSCEN3141"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chill dude, told you what you needed to know for the quiz.",
        "course": "MATSCEN2010"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "He often went on tangents/ side tracked while lecturing. Co taught - thought other prof was better. Class is basically read the textbook, 2 lectures, recitation and quiz each week. The quizzes are not that bad if you study/ review (I often didn't do... probably would've done better in the class if I did). Kinda boring and is a lot of lecturing. ",
        "course": "MATSCEN2010"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "This man roasdted me in class and ended my whole career  like 5 minutes ago.",
        "course": "MATSCEN3141"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Steve is passionate about teaching and wants you to do well. The homework takes a long time but is graded easily. You need to work in a group or you'll waste tons of time. Only downside is he forgets to respond to emails and fix grades or give extra credit he promised.",
        "course": "MATSCEN3141"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is great professor. Honestly, I could easily say he has been the best professor I have had so far. His class is certainly difficult and if you want to do great I recommend reading the textbook, but he \"dumbs down\" difficult concepts and he is also extremely passionate about teaching.",
        "course": "MATSCEN3141"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Overall, the class was extremely difficult but if you show any type of effort (ie. Office hours, rewatching lectures, talking after class) you will be okay.",
        "course": "MSE3141"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very knowledgeable and a great lecturer",
        "course": "MSE3141"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "laid back and intelligent professor. The material is certainly difficult but there is no doubt about it- he could make this class much harder if he wanted to. Still, I feel like I have learned a lot in this class.",
        "course": "MSE3141"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "The good: Good/clear speaker. Interesting person. Loves metallurgy. One can appreciate his commitment to diversity. The bad: Frequently forgets to reply to student emails (or even act, as he indicated), on matters of importance.. Probably just a consequence of mass public education. Too much for one professor to do.",
        "course": "MATSCEN3141"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.3,
    "department": "Materials Science & Eng.",
    "firstName": "Jinwoo",
    "id": "VGVhY2hlci0yNzA1ODg5",
    "lastName": "Hwang",
    "legacyId": 2705889,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Hwang is very unintentionally (?) funny, and cares a lot about students. come up to him if you have issues. Only one homework this year, and 5 quizzes with two dropped. TAs were harsh graders.Waiting on final so expect B- to B+ for me.",
        "course": "MATSCEN3151"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hwang is a great lecturer and his homework and exams were fair. The exam questions were similar to the homework, and he lets you have a one sided cheat sheet with anything you want. Make a good cheat sheet, redo the homework and you'll do well. I loved his jokes that came out of nowhere and how down to earth he was.",
        "course": "MATSCEN3151"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Jinwoo is a clear public speaker. He teaches like a physicist, refreshingly. The content in Transport Phenomena is not difficult, compared to the companion MATSCEN3141 (Phase Transformations). There are no makeup examinations. There were about 100 students in one section, which strikes me as insane for a junior-level class.",
        "course": "MATSCEN3151"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.6,
    "department": "Materials Science & Eng.",
    "firstName": "Jenifer",
    "id": "VGVhY2hlci0yNTYwNDQ1",
    "lastName": "Locke",
    "legacyId": 2560445,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Weekly quizzes often did not seem to reflect the weekly content. You can attend both lectures for the content, watch the pre recorded videos, and do the optional practice problems, and there will still be a problem you've never seen before. I would highly recommend doing the optional problems on zybooks.",
        "course": "MSE2010"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Class is structured very poorly, and not very helpful in lectures. Very passive aggressive, gets oddly upset when people pack up a minute early.",
        "course": "MSE2010"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was super annoying, a quiz every Friday morning, and 4 hour review videos if you wanted to study. Often times I would get a better grade if I guessed on the quizzes than if I tried to study and prepare. She was very passive-aggressive and would make students feel very intimidated. There are some opportunities for extra credit though.",
        "course": "MSE2010"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Be ready to watch 3 hours of videos and attend lectures to be prepared for the weekly quizzes. Class is less focused on learning than doing well on quizzes due to amount of content. She asked for feedback mid-semester just to change nothing. Only plus is the amount of extra points available which bring your grade up a lot at the end of semester.",
        "course": "MSE2010"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Rushed material, quizzes every Friday with difficulty to prepare, long readings that do not invite real learning. Retained low amounts of information due to the rushed course layout. ",
        "course": "MSE2010"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Overall Professor Lock is alright. When approached though she made you feel quite dumb. I avoided her after talking to her. There are quizzes every week, but you can get some points back by correcting your quiz. There's lots to read.",
        "course": "MSE2010"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "I think Prof. Locke is a good professor but I believe Prof. Brown is better at explaining what is needed for the weekly quizzes. I had a hard time following her lectures in comparison, and there was less explanation in general of the stuff on the quizzes. ",
        "course": "MSE2010"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "you take a 40 point quiz every single week. there's a lot of opportunity to earn points back but there is a lot of homework and those quizzes will tank your grade. also professor locke does not like being contacted about grades so don't even try to ask.",
        "course": "MSE2010"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "prof locke is a great instructor. 100% recommend ",
        "course": "MSE5951"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Locke is a very solid professor. She explains things clearly and in detail in lecture, and has a good sense of humor which keeps lectures engaging. She has very fair exams and does bonus questions. Nothing on the exams was surprising if you attend lecture or read the material (she makes it clear what sections are considered fair game).",
        "course": "MSE2010"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Materials Science & Eng.",
    "firstName": "Pelagia-Iren",
    "id": "VGVhY2hlci0yOTczMTEy",
    "lastName": "Gouma",
    "legacyId": 2973112,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "No other professors teaches a class like Dr. Gouma. She is passionate about getting you to find a topic you're passionate about and diving deep into it. She cares more about you taking away things you may one day use than making the class difficult. She is open to changing the class based on what you want out of it and is so nice and caring.",
        "course": "MATSCEN5711"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Materials Science & Eng.",
    "firstName": "Hamish",
    "id": "VGVhY2hlci0yOTczMDk3",
    "lastName": "Fraser",
    "legacyId": 2973097,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Fraser is renowned in the field of metallurgy, but it's clear that teaching is an afterthought. He is boring and his slides are old and disorganized. He wants participation in class which is nice and he is good at explaining concepts. He's an average professor who has taught this class for over a decade and is complacent as a result.",
        "course": "MATSCEN5441"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Materials Science & Eng.",
    "firstName": "Gopal",
    "id": "VGVhY2hlci0yOTczMTAx",
    "lastName": "Viswanathan",
    "legacyId": 2973101,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Babu is one of the funniest professors in the department and he's very knowledgeable about metallurgy. He wants students to really understand the content, but he can be confusing and hard to follow in lectures. It can also be difficult to satisfy the graders if you don't explain concepts in the way they want. Overall he's a good professor.",
        "course": "MATSCEN5441"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Materials Science & Eng.",
    "firstName": "Salva",
    "id": "VGVhY2hlci0yOTczMTE2",
    "lastName": "Salmani-Rezaie",
    "legacyId": 2973116,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Salmani-Rezaie joined the department this semester and has become one of my favorite professors. She is incredibly kind, knowledgeable, and communicates the course content well. She is down to earth and is fun to talk to before class. She cares a lot and as she gets more experience, I can see becoming one of the best MSE professors at OSU.",
        "course": "MATSCEN5572"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Materials Science & Eng.",
    "firstName": "Elvin",
    "id": "VGVhY2hlci0yNzA4MzA0",
    "lastName": "Beach",
    "legacyId": 2708304,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Beach is one of the best professors at OSU. He genuinely cares about the students and wants you to be successful beyond the classroom. Take advantage of being his student. He's a wealth of knowledge and advice, and will do everything he can to help you.",
        "course": "MATSCEN-3331"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 1.7,
    "department": "Materials Science & Eng.",
    "firstName": "Suliman",
    "id": "VGVhY2hlci0yNTE5NTQ3",
    "lastName": "Dregia",
    "legacyId": 2519547,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Final was published 10 mins late, he was rude and dismissive of students questions and we didn't even get the 10 mins back. Unprepared to teach from day 1, this class was online and wasn't published until the first day of class. There were only 2 grades in the class, the midterm and the final because he didn't want to hire a TA to grade hw.",
        "course": "MATSCEN3151"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "stank ass attitude towards teaching",
        "course": "MSE3151"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I've had him twice. 3/5 the first time, 5/5 the second time. If you're reading this, you're probably about to have him for the first time. Go to every lecture, take detailed notes. Even if you already know it. He tends to repeat things with minor adjustments. If you zone out, you'll end up in a bad spot.",
        "course": "MATSCEN3141"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "One of the worst professors I've ever had. He's the only one that teaches a mandatory MSE class, so you just have to deal with it. The lecture slides and the homeworks, quizzes, and exams he posts don't help at all. If you have him and want a B or better, you better sit in the front row and copy every little thing he says and writes on the board.",
        "course": "MSE3141"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "One of the worst professors I have ever had. I missed 1 lecture that had the material that was covered on the midterm and is NOWHERE in the textbook and I got docked 3/10 points. Wouldn't be bad if the whole midterm wasn't 10. And if the class wasn't out of like 2 midterms and 2 quizzes. Easy to accidentally fail his class.",
        "course": "MATSCEN3141"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Three months into the course, our only assignments are one midterm and two quizzes, for a total of 22 multiple choice questions. The questions themselves aren't terribly tough - but they're so specific to Dregia's lectures and found nowhere in his lecture notes or the textbook. The only way to do well is to religiously write down every Dregia rant",
        "course": "MSE3141"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.3,
    "department": "Materials Science & Eng.",
    "firstName": "Roberto",
    "id": "VGVhY2hlci0xNTc1MTQ4",
    "lastName": "Myers",
    "legacyId": 1575148,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "The lectures are so amazing, yet unfulfilling because you will have a hard time to grasp the flow of topics. Gives homework that needs serious brainstorming. Had to read a lot of literature to write the final paper and felt it was too much for just a 2 credit course. Plus point is that there was no final exam, only a final presentation.",
        "course": "ECE7531"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great lectures, the professor knows a lot on the subject. Only bad quality is that he sometimes wonders off from the topic being discussed and then the class notes will not mean much. You have to read the books. Good grades, though you have to work for it.",
        "course": "MATSCEN6777"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Course lecture is fine. But grading  was disappointing. Exam question seemed too much subjective being based on definitions mostly rather than conceptual or quantitative. Grading seems very critical as you need to be very precise in writing on what he prefers and receive 70% marks only for not writing comments in other people's presentation",
        "course": "MSE6777"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I agree with the previous review.  He is a  much better teacher than is given credit for here.  Interesting and engaging.  If he has good TAs he will have them do plenty of very memorable demos too.  His poles during class are a good way to learn and give good insight for test questions.  O ya, and Greenland has a fiber-optic cable. (who knew?!?)",
        "course": "MSE2010"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very knowledgeable on every topic, especially the fiber optic network. Great lecturer and easy to follow during lecture. In class demos were very entertaining. So yeah, take his class!",
        "course": "MSE2010"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Myers rambles on and his lectures are almost incoherent. His homework problems are straight forward and not bad if you have read the assigned text. His practice exams are easy and his midterms are tricky. He is hard to follow and he speaks softly.",
        "course": "MSE2010"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "He definitely knows what he is talking about. However, he rambles on a lot and the lectures get very boring. Going to lecture is mandatory because once and a while he will let you know of a question on an exam and quizzes. His quizzes are super easy, exams not so much. Doing the practice exams are a must, or there is no way to pass the real exams.",
        "course": "MSE205"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Pretty boring lectures, often hard to stay awake and pay attention.  Clicker quizzes are usually pretty easy, homework takes a while but it's not that bad. Practice exams are pretty helpful.",
        "course": "MSE205"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic MSE teacher. Chemistry based material so a lot of people do poorly but fair quiz and exam questions. Do the practice exams, very relevant/similar to actual exams.",
        "course": "MSE205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Materials Science & Eng.",
    "firstName": "Patricia",
    "id": "VGVhY2hlci0yNzA4ODkz",
    "lastName": "Morris",
    "legacyId": 2708893,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "She literally just reads off her slides. She also graded solely off exams when I took the class. Worst professor in the MSE department by miles. If you're taking 3271 you probably won't have another choice of professor anyway but my advice is study the figures in her slides to prep for exams. That's the bulk of what she tests on.",
        "course": "MSE3271"
      }
    ],
    "SEI": []
  }
]