[
  {
    "avgDifficulty": 1.5,
    "avgRating": 4,
    "department": "Medicine",
    "firstName": "Martin",
    "lastName": "Fitzgerald",
    "legacyId": 2897897,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "The class had weekly readings and every class could have a pop quiz. The pop quizzes were easy, only 3 questions and if you read the reading you should be able to pass it. For example the reading could be about a disease and a question would ask what disease it was. Loved the lectures and was very good at explaining topics and answering questions."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Only homework was the readings, but readings were a lot. Only grades were pop quizzes, attendance, and exams. Pop quizzes were annoying because you didn't know how many there would be, but he only kept the top 9 scores. As long as you email him before the lecture missing class won't affect your grade."
      }
    ]
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4,
    "department": "Medicine",
    "firstName": "Martin",
    "id": "VGVhY2hlci0yODk3ODk3",
    "lastName": "Fitzgerald",
    "legacyId": 2897897,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class had weekly readings and every class could have a pop quiz. The pop quizzes were easy, only 3 questions and if you read the reading you should be able to pass it. For example the reading could be about a disease and a question would ask what disease it was. Loved the lectures and was very good at explaining topics and answering questions.",
        "course": "BIOETHC2010"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Only homework was the readings, but readings were a lot. Only grades were pop quizzes, attendance, and exams. Pop quizzes were annoying because you didn't know how many there would be, but he only kept the top 9 scores. As long as you email him before the lecture missing class won't affect your grade.",
        "course": "BIOETHC2010"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Medicine",
    "firstName": "Pamela",
    "id": "VGVhY2hlci0zMDA0MTYw",
    "lastName": "Rafferty-Semon",
    "legacyId": 3004160,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Instructions can be very unclear more often than not, but she's very easy to work with, very nice, 10/10",
        "course": "HTHRHSC2500"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 5,
        "comment": "First off, Prof. Semon is a highly intellectually curios person. She is so kind and great at teaching. See sends out kind reminders and truly cares about each of her students. This class is extremely difficult to get an A in but because of Prof. Semon's help, I was able to. I would take this class again just because of her kindness to her students.",
        "course": "HTHRHSC2500"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor, she was always ready to help if needed. The class had a decent amount of reading and work but was very manageable if you spread it out across the week. ",
        "course": "HTHRHSC2500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 5,
    "department": "Medicine",
    "firstName": "Sorabh",
    "id": "VGVhY2hlci0yNDU2MDcw",
    "lastName": "Khandelwal",
    "legacyId": 2456070,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "vghbfduhge",
        "course": "MEDCOLL2000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "Nice professor",
        "course": "MEDCOLL2000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "TAKE THIS COURSE W DR KHANDELWAL!!! extremely helpful and he is genuinely so caring for his students",
        "course": "MEDCOLL200021"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "dr khandelwal is amazing and has so much great advice to give. such an amazing physician and professor. ",
        "course": "MEDCOLL2000"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had him for MEDCOLL 2000 and the class was so helpful and just eye opening. Dr. Khandelwal was so helpful in helping me know how to get extracurricular and was always down to answer questions.",
        "course": "MEDCOLL2000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is the GOAT. Dr. K was very informative and straightforward with this course. He prepares all of his students well for applying to medical school since that is a big chunk of this course. If you're pre-med, I would definitely recommend to take this course!",
        "course": "MEDCOLL200021"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very informative and helpful. ",
        "course": "MEDCOLL200021"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "There was usually one assignment due each week and most lectures were a big discussion or panel. ",
        "course": "MEDCOLL2000"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "I also took/am taking 2022. Dr. Khandelwal is an extremely personable professor who is willing to go above and beyond to help students. Both classes are a must if you are serious about pursuing medicine. ",
        "course": "MEDCOLL2000"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Khandelwal was absolutely amazing. He gave us all such valuable information about the process of applying to medical school and the life as a med student, resident, and doctor. I would recommend this class to anyone who is looking for more info regarding these topics. 12/10 would do again",
        "course": "MEDCOLL2000"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's cool",
        "course": "MEDCOLL2000"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. K was great and this course was extremely informational! I learned so much from both Dr. K and the speakers be brought in. ",
        "course": "MEDCOLL200021"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. K does a great job of communicating information well and emphasizing the importance of mental health and wellbeing. He truly cares about teaching and being the best he can for his students. Dr. K is also very honest and willing to share any advice, wisdom, experience, or constructive criticism in order to make you a better student. ",
        "course": "MEDCOLL200021"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy course mostly designed to help you through the medical school application process and to decide if it is the right path for you. Attendance is mandatory but all assignments are graded easy. The professors and TAs are the most caring ones you will have at OSU!",
        "course": "MEDCOLL200021"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor. I would highly recommend this class for anyone who wants to pursue medicine. Amazing class that teaches the ins-and-outs when it comes to med school (application, life in medical school, resume building tips, etc).",
        "course": "MEDCOLL200021"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "I did not expect there to be an in-person component to the shadowing class. I really enjoyed the lectures from Dr. Khandewal, and what Dr. Khandewal added to the guest lecturers. ",
        "course": "MEDCOLL2022"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best I have ever had, really cares about his students and our learning. A true homie",
        "course": "MEDCOLL2000"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "AMAZING Professor. Is very real and open about the truths of going into medicine.",
        "course": "MEDCOLL2000"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Khandelwal is a dream for any pre-med student. He is incredibly kind and understanding, and treats every student as though they are important. He hopes to get us all into good medical schools, and is helping us along the way through every step. I feel like I can go to him with anything, and he is such a huge inspiration!!",
        "course": "MEDCOLL200021"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "I wish all my professors were like Dr. K",
        "course": "MEDCOLL2022"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "A helpful professor in more ways than one, he provides excellent insights and feedback into what it takes to become not only a physician but also how to better yourself as a person through his own experiences and stories. You can tell he genuinely cares for the course and his students I would highly recommend this course to all premed students.",
        "course": "MEDCOLL200021"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor that truly cares about his students! The course was great and provided so much insight on the difficult path of becoming a physician. Sorabh specifically was a very caring and interesting professor that wanted to lead his students down the right career path and help them achieve their goals.",
        "course": "MEDCOLL200021"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's an incredible professor. Such a wonderful speaker and made this class very enjoyable for me. I learned so much throughout the semester and Ioved the speakers and resources that he provided (with the help of his great teaching assistants.) Highly recommend this course!",
        "course": "MEDCOLL200021"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not like any other professor I've had. He gives really good insight on the medical field and what there is to expect. He and his teaching assistants arranged these really great talks. There should be more professors like him. Thanks for a great undergraduate experience.",
        "course": "MEDCOLL2000"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good guy. Pretty dope. Fun class- could be more organized but its kinda refreshing to not have to stick strictly to the syllabus",
        "course": "MEDCOLL200021"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. K is an amazing professor. He is a very busy individual yet still takes time to dedicate to undergraduate pre-med students. His class is taught to help students prepare for medical school admissions and is full of helpful tips and advice. This is easily one of the most influential classes I have taken during undergrad.",
        "course": "MEDCOLL2022"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best (possibly THE best) professors that I've had since being on campus. Genuinely cares about every single student and wants you to succeed. Goes out of his way to know you on a personal level and even though his class is pass/fail he makes you want to show up because everything is meaningful. He is hilarious!!!",
        "course": "MEDCOLL2000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.4,
    "department": "Medicine",
    "firstName": "Richard",
    "id": "VGVhY2hlci01MTE1MA==",
    "lastName": "Fertel",
    "legacyId": 51150,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "This man is just a great prof overall, does not give tests that often and he is laid back. ",
        "course": "DENTDENT"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great Professor,extremely prepared for class- clear about what exams cover. Only tests off material he writes down and projects on an overhead projector while he's lecturing. Explains relevant but complicated physiological and biochemical processes extremely  clearly and concisely- You can just tell he put a lot of effort into preparing the course",
        "course": "DENT6571"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Excellent professor. He writes his notes out on an overhead, so you know he'll not lecture too fast. He tells stories to assist in remembering and often provides mnemonics. His class and exams are not easy but if you know the material you need not worry. He never tries to trick you though he'll make you think. Go to class; this man truly teaches.",
        "course": "GENERALPHARM"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best Teacher at OSU that I've had.",
        "course": "DENTDENT"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "PHARM"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Medicine",
    "firstName": "Gabriel",
    "id": "VGVhY2hlci0yNzgzNjU0",
    "lastName": "Alain",
    "legacyId": 2783654,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is by far one of my favorite professors on campus! He cares about you doing well outside of his class, he has helped me find research by connecting me with some of his colleagues and he cares a lot about your wellbeing. Only a couple of quizzes throughout the semester and they were all open note and straight from the slides/ book. Very easy!",
        "course": "HTHRHSC3500"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Overall, loved this dude. I skipped a couple classes, but the class is super easy to pass. As of when I took this class, there were no exams, just 1 quiz every couple weeks. All the information you need to do well are in the slides and in the textbook. The quizzes were also open note. The only complaint would be lectures might be dry sometimes.",
        "course": "HTHRHSC3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Medicine",
    "firstName": "Courtney",
    "id": "VGVhY2hlci0yMTUxNTk5",
    "lastName": "Thiele",
    "legacyId": 2151599,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Thiele really wants you to find her material interesting and succeed. While the class did include two lengthy exams and a long (7-8pg) essay, almost every other assignment is graded for completion and acts as a nice cushion for your grade. Use the study guide &amp; attend the short lectures and you will do good. Prof Thiele is a gem!!!",
        "course": "BIOETHCS3000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Thiele is an AMAZING professor. She's thorough and gives plenty info on exams. She is such an easy grader but she did struggle on getting back our midterms on time but she gives amazing feedback and more than enough material to study for on the exams. The final and midterm were online and when I got was unable to take the final she gladly helped me",
        "course": "BIOETHC3000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a great class! Professor Thiele is an amazing teacher and it was a great opportunity to take her class. The material is very interesting and the class discussions are insightful. Overall great experience, classwork and grading were very manageable.",
        "course": "BIOETHICS3000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Bioethics 3000 was easily my favorite class I've taken at OSU. The class size is small so it's mostly discussion-based. The discussion questions on Carmen are really manageable. The exams aren't bad either and she prepares you well. Read as much as possible, it will enhance discussion and it's genuinely interesting. Great class, great teacher",
        "course": "BIOETHICS3000"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, this is my second time taking a class with her and I really enjoy her teaching style.",
        "course": "BIOETH4000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "really great professor that loves her students and tries to make the class interesting. she really wants people to think and it def made me love bioethics even more. 10/10 recommend",
        "course": "BIOETHICS3000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was such a great class, despite it being the first time it's offered. I really like Courtney and her laid-back teaching style. She is so passionate about what she does and she really cares for her students. There is a lot of reading but the class is called \"Readings in Bioethics\". One of the best professors I've had!!!",
        "course": "BIOETH4000"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor who is both knowledgeable and unbiased",
        "course": "BIOETHICS3000"
      }
    ],
    "SEI": []
  }
]