[
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.5,
    "department": "Medieval Studies",
    "firstName": "Kristen",
    "id": "VGVhY2hlci0yMzIxNzUx",
    "lastName": "Figg",
    "legacyId": 2321751,
    "numRatings": 2,
    "summary_comment": "Professor Figg offers a structured course with three quizzes, a final exam, and five discussion posts contributing to the grade, allowing students to substitute discussion grades for their lowest quiz score. Exams consist of 30-point multiple-choice questions that require careful attention to reading materials. Class attendance is mandatory, and participation is factored into the grade. Overall, her approach is methodical and fair, though the exams are challenging.",
    "summary_comment_short": "Professor Figg uses a structured approach with three quizzes, a final exam, and five discussion posts to assess students, allowing substitution of discussion grades for the lowest quiz score. Her exams are multiple-choice and require thorough understanding of the course material, as class participation and mandatory attendance are also factored into the grade.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Figg is fine. Three quizzes and a final, with five discussion posts makes up your grade. The grade for the discussions can also be substituted for your lowest quiz grade. Quiz/exams are fair. Just study the review guides she posts on Carmen. Class is mandatory, with participation also built into the grade. Overall, a fine professor.",
        "course": "MEDREN2666"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "There's 4 exams that are all 30 point multiple choice questions. The exams are relatively difficult and you have to pay really close attention to the readings in order to answer all of them. There aren't many questions so if you miss a few your grade won't be great.",
        "course": "MEDREN2666"
      }
    ],
    "SEI": [
      {
        "Subject": "MEDREN",
        "Catalog": "2666",
        "Class Name": "Magic and Witchcraft in the Middle Ages and Renaissance",
        "Class Number": "29210",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Center-Medieval & Ren Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "79",
        "Rating": "4.19"
      },
      {
        "Subject": "MEDREN",
        "Catalog": "2215",
        "Class Name": "Gothic Paris: 1100-1300",
        "Class Number": "34993",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Center-Medieval & Ren Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Medieval Studies",
    "firstName": "Luis",
    "id": "VGVhY2hlci0xNTg5NDI0",
    "lastName": "YE",
    "legacyId": 1589424,
    "numRatings": 1,
    "summary_comment": "Professor YE is highly regarded as one of the best professors at OSU, known for his exceptionally clear lectures that enhance understanding significantly.",
    "summary_comment_short": "Professor Ye is widely regarded as the best professor at OSU, known for his extremely clear lectures that effectively convey complex concepts.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is possible the best professor at OSU. His lectures are extremly clear.",
        "course": "SPAN481"
      }
    ],
    "SEI": []
  }
]