[
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.8,
    "department": "Media",
    "firstName": "Gene",
    "id": "VGVhY2hlci03Nzg1NjE=",
    "lastName": "Felice",
    "legacyId": 778561,
    "numRatings": 6,
    "summary_comment": "The professor is effective at teaching the basics of Maya through engaging lectures and practical tutorials, though he requires active participation in class discussions to maintain a high grade. His approach is structured and demanding, which some students find challenging but ultimately rewarding in terms of skill development. However, his rigid policies on participation and grading can be seen as insensitive and inflexible, particularly for introverted students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Lectures are very useful, and get you familiar with the basics of Maya. He shows lots of animations , and the projects are pretty fun. The major downside is that you HAVE to participate in discussions in class, or your grade suffers a lot. He has an option for &quot;quiet learners&quot; where you can email him lecture reflections. Teaches thru tutorials.",
        "course": "CSC220"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "I can forgive his assignments lacking artistic freedom and his broken attendance system where he berates you for not going to class, despite that you HAVE BEEN, but the fact that he takes a lot pts away from your final grade for not participating in lecture discussion is insensitive. Basically, you're not allowed to be an introvert. Control freak.",
        "course": "NMD200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class really taught me an interesting combination of concept and skills w/ 3D modeling.  I know a lot of people complained that it was too hard, but how else can you learn&#63;  Thanks for giving me some real 3D skills!",
        "course": "ART552"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "This teacher dictates your concept. No artistic freedom. Controll Freak.",
        "course": "ART452"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "I believe in this instructor, his intentions lie with the group of conceptual artists attending this institution. True he is not a pushover when it comes to giving marks as many art instructors can be, but he cares. I saw &quot;slapped together projects&quot; in the class also (both conceptually and technically), is that his fault&#63;  3-D Modeling is hard!!",
        "course": "ART452"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "I deserved a better grade than I got. I busted my ass in this class and I know students who slapped together crap (total crap) the night before the assignment due date and got better grades. Screw this class, find another professor.",
        "course": "ART452"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 5,
    "department": "Media",
    "firstName": "Dr",
    "id": "VGVhY2hlci0yMzk4MjE1",
    "lastName": "Boom",
    "legacyId": 2398215,
    "numRatings": 1,
    "summary_comment": "The professor is highly regarded for their effective teaching methods, which challenge students with difficult puzzles at Boom Labs, fostering significant personal growth. They emphasize that scientific understanding is not absolute, promoting a more nuanced approach to learning.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "The puzzles at Boom Labs were really hard, but I think I grew as an individual because of it. Always remember that science isn't an exact science.",
        "course": "LETHAL005"
      }
    ],
    "SEI": []
  }
]