[
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.1,
    "department": "Microbiology",
    "firstName": "Maria",
    "id": "VGVhY2hlci0xNjcyNzY4",
    "lastName": "Neil",
    "legacyId": 1672768,
    "numRatings": 62,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I enjoyed when Dr. Mia took over half way through. I found her portion of the class more interesting and easier to learn. Her lectures are helpful so make sure you attend. However, she does not cover everything in lecture so make sure to read the textbook! She does a lot of practice q's and has some extra credit. Highly recommend!",
        "course": "MICRBIO4000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was very reasonable with test questions and she is very accessible outside of class for questions. ",
        "course": "MICRBIO4000"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Asynchronous/in-person lecture days throughout the week. Will be upfront with you on what topics will be on the quizzes/exams. Only frustrating part is that you cannot see what questions you got wrong after test. Provides few extra credit opportunities - TAKE EVERY ONE YOU CAN GET. Slides are easy to understand & she really wants you to succeed.",
        "course": "MICRBIO4000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mia is AMAZING. For me, the class was much easier to understand when she took over halfway through the semester. The material is much more interesting and relevant too. She is incredibly knowledgable and explains things extremely well and in detail. She hosts a lot of review sessions and office hours and even offered some extra credit.",
        "course": "MICRBIO4000"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Switching to Dr. Neils teaching style was honestly a slap in the face compared to Dr. B. She rarely had review sessions during the scheduled class times so I was unable to attend. Additionally, her PPTs and lectures were very disorganized which makes it hard to connect and retain information. Being nice and answering questions only does so much.",
        "course": "MICRO4000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mia is a fantastic professor! She offers a lot of review sessions and is very accessible. Her exams are very reasonable and you will do well as long as you study! I dont understand the complaints because she is one of the best professors I have had!",
        "course": "MICRO4000"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Material gets more challenging in her half. She's strict but fair and gives plenty of opp to ask Qs. Office hours are KEY. Don't just memorize - grade reflects the time you put in and thinking critically. Profs already accomodated for COVID by dropping an exam/quiz - time manage and don't cram. Laziness and bad profs aren't the same thing.",
        "course": "MICROBIO4000"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "She really likes to force you to do unnecessary work. Including information discussed outside of lecture on the assessments is not cool. On one quiz, the figures did not load and she refused to give points back. She is the type of professor no one enjoys taking a class with because she wants to make the class artificially hard. Avoid if you can.",
        "course": "MICRBIO4000"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really really liked her course! I just wish she would be more transparent about not writing rec letters for students. She is so kind but me and a few friends have asked her for rec letters without her responding to multiple emails.",
        "course": "MICRO4000"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Beware, there is material on the exams and quizzes that isn't covered in lecture. You are better off reading the textbook and making notes off of that. Her exams aren't necessarily hard but you will need to prepare allot and go through all the resources she offers to find that extra information that isn't on the powerpoints. Wouldn't recommend.",
        "course": "MICRO4000"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Recorded lectures were detailed both on the slides and when explained. Dr. Neil even set up texts to remind when assignments/quizzes/tests were due. Super helpful professor that genuinely cares about their students. 10/10 would recommend!",
        "course": "MICRO4000"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "Her exams and quizzes are way harder than Dr. Bullwinkle's. She's a great person and she knows her stuff, but the exam and quiz questions sometimes are not even taught through the lecture. Not bad, not the greatest. At least she tries her best through offering plentiful zoom office hours and what not. Know your material WELL and you will pass.",
        "course": "MICRO4000"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "She simply cares and teaches above and beyond.",
        "course": "MICRO4000"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Over-detailed lectures. Misleading discussions. Very difficult and irrelevant exams.",
        "course": "MICRO4000"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Do not listen to the bad reviews on this. Dr. Mia is a fantastic lecturer and she really puts in the effort so that her students understand the material and do well on the exams. You still need to study of course, but she does a great job in her office hours explaining the material.",
        "course": "MICRBIO4000"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very difficult to get a high grade.",
        "course": "MICRO4000"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "Everyone's having a hard time but don't put faults on Dr. Mia if you are cramming it hours before the exam and say it's her fault not to make the exam easier for you to get an A, if you want to get an A and just playing in college you shouldn't attend tosu at all. Just drop the class or take the pass and stop pouring hatred ratings here, thank you.",
        "course": "MCB312"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "Micro 4000 She's super nice and just mixed her gentle with professionalism. Dr. Mia made you feel like you are her child, and she's doing everything to help you learn. Office hour and lec zoom not mandatory but she said it would be helpful, which is true. She also gave out TH Qs for review. Dr. Mia if you are reading this, WE LOVE YOU.",
        "course": "MCB312"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is the best! Her lectures are so helpful and is always willing to help us outside of class. The material is difficult sometime but I would take her class again for sure.",
        "course": "MCB312"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Kinda upset to see the hatred. Does the exams have some very specific details from the exam you might have forgotten? Yes, but see the issue, you forgot it. Just study. She had an discussion open in which she wanted us to reply to and she mentioned it only in the lecture. Most didn't answer until right before the exam. Meaning no one watched. Lazy",
        "course": "MICRO4000"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mia is a great! The material she teaches is challenging, but with good notes, studying, and review you can definitely pass this class. Dr. Mia is always accessible and promptly replies to any questions that you have. Only advise that I have is pretty basic: This isn't the class to cram the night before and expect to do well.",
        "course": "MICRO4000"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very caring and nice professor overall. However, it is very hard to get a good grade in the class and even harder to understand what information will be on the tests. Overall, I learned a lot as she has a good teaching style but this was misleading because after studying extensively, the test still included stuff that wasn't in lecture.",
        "course": "MCB4000"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Neil is a caring professor and wants her students to learn when it comes down to it, but this doesn't reflect in her tests and grading style. Her tests do not reflect what was taught in class and she grades even the easiest assignments (like discussions) very harshly.",
        "course": "MICRO4000"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love Dr. Mia. Since she took over for the second half of the semester, my confidence in the class has increased significantly. She cares so much about her students and is a sweetheart. This class is definitely difficult, but you're given all the information you need, it just takes some extra thinking.",
        "course": "MCB312"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lectures are clear and well presented, only thing I wish she would do is add subtitles. She has extra lectures for students and is very assessable despite the pandemic. The phone message notifications are also very helpful.",
        "course": "MICROBIO4000"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "She's a great lecturer and takes student feedback seriously to be more accommodating. The main issue for me is the lack of flexibility for student emergencies that can arise on exam days as the course is designed to have one quiz and exam drop. Another issue is not knowing what you get wrong on exams and quizzes to learn from.",
        "course": "MICROBIO4511"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Neil is so helpful! She makes her expectations clear and really wants her students to learn the material and not just memorize, and allows for that with so many resources as well as examples and great lectures. She isn't an easy A but shes not a hard A either, put in just above the minimal amount of work and use her resources, you'll do great!",
        "course": "MCB312"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "Honestly a queen for addressing the class like that. You can't stop it, she gave a little more time (about two or so minutes) for the midterm which honestly helped. She cares, has sessions all the times and honestly has been a breathe of fresh air concerning teachers. She over teaches so that you can understand and Ace the exam.",
        "course": "MICRO4000"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mia is one of the best professors I have had. She goes above and beyond to make sure her students are prepared for lectures and quizzes. I thoroughly enjoy her lecture content. If you attend the lectures and study the material, while also attending office hours, you will definitely do good in this class!",
        "course": "MICRO4000"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "I literally love Dr. Mia, I don't get the complaints. She does everything she can to help her students and is there for us as much as she can be during a pandemic. I enjoy her lecture content and find it to be very useful information. Her exams are very reasonable and you'll do well if you watch lectures and study well! Love her!",
        "course": "MICRO4000"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 5,
        "comment": "Would rate her a zero if i could. Not understanding or show any signs of mercy towards students during this pandemic nor has Bullwinkle. The exams are unclear and way harder than they need to be. A minute per question on the exam, therefore you have no time to check over your work. Its obvious she doesn't want her students to do well, very careless",
        "course": "MICRO4000"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 5,
        "comment": "Prof. Neil is not what the rest of the reviews claim. During lecture, she mentions many details that are unnecessary and aren't on the exams. Her questions are extremely misleading and have nothing to do with what was taught in class. Prof. Bullwinkle is a much better microbio professor.",
        "course": "MICRO4000"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 3,
        "comment": "Mia Neil is knowledgeable in her field for sure, but she does not know how to run a class. She makes her quizzes harder than the tests, tells us that there will be extra credit opportunities, but there ends up being none. She is not a considerate professor and expects students to be more perfect than her.",
        "course": "MICRO4110"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Neil was an amazing professor. Dont listen to the negative review on here. She did a great job of making the transition to online during the pandemic. Always accessible and helpful. Dr. Neil stood her ground during pandemic made you work for your grade and you learned something. I liked the second portion better than the first!",
        "course": "MICROBIO4000"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Neil truly cares about your success and is a very kind and clear lecturer. She covers the more difficult material of the course, but she explains things thoroughly and as long as you study you will be fine. She expects you to put in work but is very clear about her expectations and how you will be graded. Extremely nice as well!",
        "course": "MBC4000"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 3,
        "comment": "Does not round grades at all. The class structure is garbage and grading scales are made to screw you over. ended with an 89.7 and would not allow any grade adjustments even when the class shifted to online learning and a pandemic.",
        "course": "MICRO4000"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mia was an amazing professor! I really enjoyed her half of the class and found the material to be tougher but much more interesting than the first half. She was very helpful in office hours and really wanted her students to succeed. Highly recommend!",
        "course": "MICRO4000"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mia was super passionate, kind, and helpful. Her lectures were interesting and it's important that you write down what she says. It does require a decent amount of studying outside of class, but if you study and understand the concepts, the tests are definitely doable.",
        "course": "MICRO4000"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is an amazing professor especially for the tough material. Many people complain about her, but I doubt they put in the work to get the grade. She REALLY encourages putting in extra work (tophat, online module, study lecture after each class), and it WILL make a difference. Go to lecture because she will mention things on the exams!!",
        "course": "MICRO4000"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 4,
        "comment": "This section of the class was more difficult than other section. Possibly because the first half was more general concepts and the second half got more in depth. Either way, her exams were tougher than the first half's. However, they were all fair and studying a decent amount resulted in a good grade. Paying attention during lecture was important.",
        "course": "MICROBIO4000"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor I've had in college. Go to lecture and pay attention and it is an easy A.",
        "course": "MICRO4000"
      },
      {
        "index": 42,
        "rating": 3,
        "difficulty": 4,
        "comment": "When a class of 450 students gets an average of 71% on the midterm, then the professor is not doing her job.",
        "course": "MIC4000"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is exponentially better than the lecturer in the first half of the course; she makes the content much more interesting. I found that in the past, exams in this class were way more difficult/oddly worded than they needed to be. Her exams are SO much fairer and much better for critical thinkers. If you know your material, you're in good shape",
        "course": "MICRO4000"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mia is an amazing professor. Very smart and really great at teaching material. Lecture is a must, many exam questions are based off of examples she gives in class that are not on slides. She makes material very interesting, ties it into real world applications. Office hours are very helpful. Does unannounced bonus quiz, so go to lecture!",
        "course": "MICROBIO4000"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Mia was a great professor for MICRO4000. She was an amazing lecturer and was always so sweet and helpful at her office hours. Make sure you go to class and take notes on what she says, not just the slides, because she WILL ask questions on the exams based on questions and discussions in lecture. Difficult exams. Lab is basically useless.",
        "course": "MICROBIO4000"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mia was awesome. She truly cares about her students, which is not common for such a large class. She is interesting and gives a lot of examples, so lecture is a must. She is strict and expects students to meet expectations, but she doesn't have unreasonable expectations. I wish she taught the entire MicroBio 4000 course!",
        "course": "MICROBIO4000"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mia was a very caring professor. If you attend class and actually pay attention then the concepts you learn in this course will not be that difficult. She uses examples in class that she later uses in test questions. It's all pretty straight forward. We never had to read the text book, you can easily get by with just the lectures and mastering.",
        "course": "MICROBIO4000"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Neil is a great professor! Lectures are always very intriguing and integrate concepts that are not just found in the textbook. That being said, the tests do too so make sure you attend class and listen carefully!",
        "course": "MICROBIO4000"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mia is a solid professor. She is great but very strict and sets high expectations of students. Never miss lecture as her tests are based on lecture, not straight out of the slides. Shes always accessible outside class and really sweet, I highly recommend her",
        "course": "MICRO4000"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Neil is very clear with her expectations and is highly accessible outside of lecture. Going to lecture is also helpful, as some of the exam material is lecture-only. A good professor to have for this course.",
        "course": "MICRO4000"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "learned a ton, great at not reading off the slides. she adds so much that's not on the slides that it's a bit hard to write down, so i do wish she talked a little less. but she's so caring in that she offers tons of office hours and helps students to the best they can",
        "course": "MICRO4000"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved Dr. Neil, she's so sweet and very accessible outside of class. She has clear lectures but bases exams off of anything that comes out of her mouth during lecture, and I'd prefer to be tested on textbook/slides material. Exams are challenging but fair. Lab is super easy and fun. Overall really enjoyed the class but wish there were more points",
        "course": "MICRO4000"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mia is one of the clearest lecturers you could get for Micro. She knows her stuff, will only test you on the slides (and details she adds during lecture, so make sure you go!!) and also offers great extra credit. If you know her notes backwards and forwards, you will do just fine on the tests. Ask questions! She loves that.",
        "course": "MICRO4000"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 4,
        "comment": "10/10. One of the most genuine professors who clearly loved to teach",
        "course": "MCB4000"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mia is a great professor with clear expectations and detailed notes. The class was tricky, but most definitely manageable if you think critically and attend lecture. She's always willing to answer questions and will often tailor her exams to questions that student ask during lecture, so pay attention. Really enjoyed her!",
        "course": "MICROBIO4000"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 4,
        "comment": "Such a great Professor! Lecture is heavy so missing class makes it hard to catch up but Dr. Mia is always available outside class. Her tests are tough but fair. I recommend her!",
        "course": "MICROBIO4000"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very organized easy to follow lectures; attendance is not mandatory but you get bonus points for going.  Also they are generally interesting and worth going to.  She is a very solid professor with tests that are not easy but very fair.",
        "course": "MICRO4000"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 4,
        "comment": "EXCELLENT PROFESSOR!!! I was so nervous taking this class &honestly had no interest in biochem. She completely changed my mind! She is so thorough and makes sure everyone in class understands. I learned so much!! Altho class was 200 students, she paid attention to everyone. Id take classes with her over any other prof!",
        "course": "BIOC3312"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome Professor!! She poured her heart out to us and made sure we fully understood the material in class. Her exams were challenging but she was fair. I really enjoyed her class!",
        "course": "BIOC3312"
      },
      {
        "index": 60,
        "rating": 2,
        "difficulty": 1,
        "comment": "Taugh only easy stuff.  Learn nothing from her class.",
        "course": "MCB312"
      },
      {
        "index": 61,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor. Very helpful and keeps class interesting. You really don't even need to go to class just read the notes unless you want the 5 random attendance points which I recommend getting. They help your final grade.",
        "course": "MOLBI311"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor for this course! Extremely clear and taught until everyone understood! But DO NOT buy the book unless you only learn by doing practice problems. I got over 100% n he class and didn't even own the book!",
        "course": "MOLBI311"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4,
    "department": "Microbiology",
    "firstName": "Jesse",
    "id": "VGVhY2hlci0xNTM3NDUy",
    "lastName": "Kwiek",
    "legacyId": 1537452,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed Dr. Kwiek's course! It was definitely a challenge- there's lots of information across multiple disciplines. However, he provided clear focus areas and good rubrics so nothing came as a shock. If you study, you'll be fine. The group project could be a lot, but they divide it into smaller steps so it's not overwhelming.",
        "course": "MICROBIO3704"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Overall, Dr. Kwiek is a good professor who is very knowledgeable in his area of study. His lectures are very information heavy, and somewhat boring. The class is a lot of work for 3 credits, and the exams are all extended response and graded harshly. He seems to really enjoy what he teaches, and the class is interesting, just a lot of work. ",
        "course": "MICRO3704"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class was not at all worth the amount of work outside of class. However I enjoyed Dr. Kwieks contributions much more than Dr. McDows. Hes a very nice person and a good teacher.",
        "course": "MICRO3704"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "While Microbio3704 is a very interesting class and one I should have enjoyed taking, the professors ruin it. You have a huge project in probably the worst format possibly imaginable. Also this class is test heavy and the two tests are straight essays that are not graded that easily. Also participation is 15% and not graded easily. Have Fun!",
        "course": "MICRO3704"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Kwiek is great and super accessible outside of class.",
        "course": "MICROBIO3704"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kwiek is awesome! The class is a lot of busy work, but the course is new so they're working on ironing out the wrinkles. Overall, the History and Microbiology of HIV was a really cool class to take.",
        "course": "MICRO3704"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class was extremely easy. However, the professor did not seem to care about his work. I would advise choosing another professor if you are genuinely interested in the material.",
        "course": "MICROBIO5122"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very interested in HIV and was able to talk clearly about almost every topic. It was clear that he was a virologist and not an immunologist, thus the class sometimes had very specific questions that he was unable to answer the day of, but would come back for the next lecture and provide information or recent studies that explained the question ",
        "course": "MICRO5122"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Better than the other profs who teach the course, clear and helpful. If you dont do well in this class its not because he failed to teach you the material but rather you just didnt put forth the effort",
        "course": "MICRO522"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 2.5,
    "department": "Microbiology",
    "firstName": "Ahmed",
    "id": "VGVhY2hlci05OTEyNjk=",
    "lastName": "Yousef",
    "legacyId": 991269,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 5,
        "comment": "Micro 5536 is a difficult class, but Dr. Yousef is there to answer questions and offer assistance. Starting studying early and studying often, memorizing the many details and critical thinking will give you the best result. Dr. Yousef makes you earn the grade, but it is possible to do well!",
        "course": "MICROBIO5536"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "I don't think the assistants or instructor were disorganized but the grading was a mess. The course is difficult but critical for food science students.",
        "course": "MICROBIO5546"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "The lecture is fine, but the reviews are the lab are accurate. Disorganized, unprepared instructor and TAs take off points for following exact direction or over things never told, like question set format. This lab is a serious embarrassment to this school. Avoid if you can.",
        "course": "MICROBIO5536"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 5,
        "comment": "He's one of the most brilliant and inspirational people I've ever met. Yet, his exams are so hard and there are pop quizzes here and there. Absolutely the hardest Food Science class I've ever taken (even harder than OChem). OChem is a piece of cake compared to this class.",
        "course": "MICROBIO5536"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Avoid this class at all costs. It's an embarrassment to the Microbiology Department. Poorly organized, grading is extremely meticulous, assignments worth virtually nothing take hours to complete because of formatting requirements and vague instructions. Be prepared to lose points for following directions and stay over for 30+ minutes many times.",
        "course": "MICRO5546"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Don't take this class. The class sounds interesting, but the professor is not helpful. He does not post keys for quizzes/exams and does not give you any practice problems. Quizzes are unannounced.  You will just be making flashcards to try and memorize the content. Avoid.",
        "course": "MICROBIO5536"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "Being a Meat Science student, I will be using the information I (should have) learned from this course. However,  the instructor does not explain his notes or importance of charts/graphs very well. Knowing the lecture handouts will not receive a passing grade. Tests are very detail oriented, miniscule details are necessary to grade high. Avoid.",
        "course": "MICROBIO5536"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "It is true that Dr. Yousef's class could be challenging. Memorization and exceptional note takings are key to getting good grades. Having said that, if you come to class and take a good note, you will be fine. I am a huge fan of microbiology and his lectures were inspirational. I learned so much from his class and it was so worth it. ",
        "course": "MICROBIO5536"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "The class is ridiculous!  You can know virtually all the slides but still find a way to do poorly.  He expects you to know details that are not on slides and is picky about spelling when he spells words wrong on the notes.  He grades on a curve when the class is not even a weeder course.  He does not have office hours and is not helpful.  AVOID!!!",
        "course": "FDMIC636"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "memorize, memorize and memorize!!!!! the course is food microbio but the approach is clinical microbio with little food topics on the side.... course is for graduate level but there is no analysis but purely memorization!!!!! we are thinkers, not photocopy machines to put every word and detail to stay in our minds!!!",
        "course": "FS636"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "prof does not explain details/significance of tables/graphs,etc...he just wants you to memorize everything at all cost!!!! and he cares about spelling and ironically, pronunciation as if the clasd has an oral exam. i am a grad stude but i do not recommend him as a teacher to this course!!!",
        "course": "FST33"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 5,
        "comment": "(con't) for graduate students&#63; the class averages were pretty low and many of us didn't know if we were going to make it, i got a c+ and i can tell you that is what i earned. i didn't take the labs, but from what i hear they are a lot of work and you may not want to take the lecture and lab together with a full schedule..",
        "course": "MICRO636"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 5,
        "comment": "(con't)for graduate students&#63; the class averages were pretty low and many of us didn't know if we were going to make it, i got a c+ and i can tell you that is what i earned. i didn't take the labs, but from what i hear they are a lot of work and you may not want to take the lecture and lab together with a full schedule..",
        "course": "MICRO636"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "this class is extremely hard but i don't think it is fair the way everyone is bashing professor yousef. he does his best in presenting the material, but it is up to you as a student to take the time to study everyday. i will admit that he is an anal grader (he will take off points for spelling, etc.) but what do you expect when the class is meant f",
        "course": "MICRO636"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst class that I have ever taken and will ever take! I don't really see anyone doing well unless you have a photographic memory, because that's what you need to get an A. When a prof. asks what particular organism causes a particular disease off a list of 20 organisms and then takes off for spelling...on a quiz, you're in trouble.",
        "course": "FST636"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 5,
        "comment": "it is note an easy class and it is very tough. This course is designed for graduate students. just to let you all know",
        "course": "MICRO636"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 5,
        "comment": "The lectures are informative and relate well to current events. The exams are VERY specific and detail oriented.  Expect to know specific numbers and minor details about everything!  I can't complain about the lecture being difficult since it is a 600 level class.  However, the lab is very disorganized, lots of work, and the TAs are clueless.",
        "course": "MICRO636"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "This is a serious course with plenty of information to learn. The instructor brings meaningful examples, sometimes touching on our own lives. I don?t recommend it for anyone wanting easy course, get an ?A? and learn nothing. There is plenty of this type of courses already at OSU.",
        "course": "MICRO636"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 5,
        "comment": "this class is a tough one.  Don't miss lecture and definetely take good notes.Lecture is ok; however the lab is a lot of work.  I think dr Yousef is a good professor ; he's a good grader but because the class is 600 level; it's designed for grad students so you have to think about stuff in order to do well.",
        "course": "MICRO636"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 5,
        "comment": "i really dont understand what youre supposed to know for the tests. i have never had a class where you can 100% understand everything in the notes like the back of your hand and only be able to answer 65% of the questions on the test. quiz average is like 40%. the content is definitely interesting but a really tough class.",
        "course": "MICRO636"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is by far the worst that I have EVER had! He makes his pop quizes & exams as hard & as tricky as he can. 70% of the material he tests you on aren't even in your notes! It's the only class were I could know the notes he gives perfectly and still fail the exam!! And don't even bother going to him for help. He is terrible! AVOID HIM AT ALL COSTS!!!",
        "course": "MICRO636"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "took it thinking it'd be easier than any other available class... wrong, expect a lot of work especially in the lab.   the lecture is not that bad a lot of repetitive learning but still this teacher does not give you much information to go on when trying to answer questions properly (doesn't want abbreviations for anything)",
        "course": "MICRO636"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 3,
        "comment": "not a fun class",
        "course": "MICRO601"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do NOT take Food Microbiology 636.01 or 636.02! These classes only intentions are to ruin your G.P.A. Understanding and fairness are not qualities of the class and the actual Professor absolutely does not know what he is talking about. I usually do not take the time to write bad about a class or even anybody for that matter but PLEASE be aware!",
        "course": "MICRO636"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Microbiology",
    "firstName": "Steven",
    "id": "VGVhY2hlci0yNTA3MzMy",
    "lastName": "Carlson",
    "legacyId": 2507332,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors ever! He truly cares about his students and is really helpful. His lectures can get a little boring but he always tries to make it fun. Great class and professor!",
        "course": "MICRO4100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I've had at Ohio State. After taking 4100, I went and took Micro 2100. Micro 2100 is definitely easier than 4100, but both are great courses. Overall, just an amazing guy and an even better educator. 10/10 recommend!",
        "course": "MICRO4100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Carlson is the best professor in the Microbiology Department at OSU by far. He genuinely cares about his students and listens to feedback. He is professional and knowledgeable while creating a relaxed classroom environment where students feel comfortable to participate and ask questions.",
        "course": "MICRO2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Carlson is one of the best professors at OSU I've had. He is so upbeat and cares about his students. He is open and explains things in a way that can be understood well by students and makes himself available for asking questions. Love his teaching style and the learning experience:)",
        "course": "MICRO4100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely amazing professor through and through. You can tell that he clearly cares for the students, in stark contrast to the bulk of the microbiology department. ",
        "course": "MICRO4100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Carlson is a great teacher and really cares about his students and their learning. Lectures are interesting and taught in a way that doesn't go over the class' head. 10 out of 10 recommend taking this class!",
        "course": "MICRO4100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Steven is amazing! He gets to know all of the students and is very helpful. The class is very fun. You have to do a lab notebook everyday, and turn in a notebook check, there are a few take home assignments that are pretty easy and a final paper and group presentation. ",
        "course": "MICRO2100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I just finished my final semester of undergrad. I wish I had someone like Dr. Carlson teaching every course I ever had. He is mindful and caring of us as students and as individuals who have a lot going on. I have learned so much from him alone. There are so many good things to say. You do yourself a huge favor taking a course with him.",
        "course": "MICRO2100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is super caring about his students and gives super easy exams. Definitely would take him again.",
        "course": "MIC4120"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Carlson is an amazing professor- if you are lucky enough to have the option to take his class you should. He actually makes sense and is willing to explain things to you if you ask for clarification. Not only a fair professor, but a nice professor who actually cares for his students",
        "course": "MICRO4120"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Carlson was the instructor for the lab portion of Micro 4100 and he is by far the best lab instructor I have ever had. He is very understanding and caring. Additionally the lab is actually really fun! He is an easy grader and always willing to provide feedback. He is very willing to answer any questions without making the students feel dumb.",
        "course": "MICRO4100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. C. is the lab instructor for Micro 4100 and is super awesome! He cares about his students and is willing to meet with you if you have questions. He's great at answering questions and incredibly helpful during the lab. I would highly recommend!",
        "course": "MICRO4100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 4.7,
    "department": "Microbiology",
    "firstName": "Chad",
    "id": "VGVhY2hlci0xODYxMDYz",
    "lastName": "Rappleye",
    "legacyId": 1861063,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Rappleye is an amazing professor. His lectures are incredibly engaging and truly made me look forward to his class each week. The class is difficult, but if you are willing to put in the effort and think critically you can succeed. He is also always willing to help students after class which is great. Overall, I recommend!",
        "course": "MICRO5147"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "the class content is really interesting and organized/taught well. the problem is that he asks very open ended questions but expects a very specific answer. much of the class is revolved around learning how to answer a question the way chad wants, not thinking critically.",
        "course": "MICRO5147"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I feel like the micro department has many great professors bur Dr. Rappleye is one of the best. This was the most well-organized and interesting classes I have taken at OSU. You do have to go to this class if you want to do well, the slides can be difficult to understand without context. However, I felt like every single lecture was worth my time.",
        "course": "MICRO5147"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Rappleye is the best professor Ive ever had. The class is difficult and you really have to do a lot of thinking, but the format of it makes it easy to get a good grade. Youll learn how to critically think about things rather than just remember. Make sure you go to class though because his slides are pretty empty of words(just lots of graphs)",
        "course": "MICRO5147"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Rappleye is amazing :) Class is not mandatory but if you miss class then you'll miss a lot of good content. He is SUPER accessible outside of class and very understanding. He doesn't make you feel stupid at all even if you are :) Would highly recommend this class bc you learn a lot and Dr. Rappleye is the best professor I've ever had",
        "course": "MICRO5147"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "great professor, by far one of my favorites in the microbiology dept! He is very knowledgable, but also very humble and kind. Super accessible, his exams are different t what many of us are used to, its very logic based and honestly it's a lot better that way. Awesome.",
        "course": "MICRO5147"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Fantastic professor.  He is passionate and engaging about what he is teaching.  His powerpoints have hardly any text, so you need to go to class and take notes.  He holds office hours by appointment. Tests are tough and he really wants to make sure  you can think through the information.",
        "course": "MICRO5147"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Rappleye is by far one of the best microbiology professors at Ohio State. He is clearly passionate about his material and very helpful. The two group projects will easily boost your grade, despite the difficulty of exams.",
        "course": "MICRO5147"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hands down, the best professor I've had at OSU! He's extremely down to earth and is always willing to help a student no matter the question. The exams are by no means easy, but he did standardize the grades for our class at least. If you are willing to put in the work, you can get a good grade in the class!",
        "course": "MICRO5147"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Rappleye is a great professor!  There is no textbook and powerpoint slides are fairly empty, mostly just graphs that require his explanations so go to class and pay attention.  There are 2 group projects that can really boost your grade bc the exams are very difficult but not overwhelmingly so.",
        "course": "MICRO5147"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Rappleye is the kindest and most helpful professor I've had. If you're a Micro major you will love this class despite its difficulty. There is no textbook and you absolutely HAVE to go to lecture, the powerpoints alone won't help you. Exams are all application-based short answer questions and require you to really understand the material.",
        "course": "MICRO5147"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Microbiology",
    "firstName": "Virginia",
    "id": "VGVhY2hlci0yOTM3OTcz",
    "lastName": "Rich",
    "legacyId": 2937973,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. rich is very very nice and the class is pretty easy. Attendance is not mandatory but participation is significant part of grade.",
        "course": "microbio5155"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 2,
    "department": "Microbiology",
    "firstName": "Abhay",
    "id": "VGVhY2hlci04MTkzMjQ=",
    "lastName": "Satoskar",
    "legacyId": 819324,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "I would highly recommend not taking this class. It is co-taught by three lecturers, with Dr. Satoskar being by far the worst out of the three. During the lectures, he rambles as fast as he possibly can through his 80-slide powerpoints, then expects students to know every last detail for the exam. Please be warned this is an absolutely awful class!!",
        "course": "MICROBIO5122"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "He expected you to understand every detail on his slides for exams and is not clear on what will be tested. Often complicated things more than they need to be. Exam questions were weirdly written. Often tuned him out during class and had to teach myself the material before exams. ",
        "course": "MICROBIO5122"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "DON'T TAKE THIS PROFESSOR!!!!!!!!!! My biggest life regret is not dropping his class while I still had the chance. Your entire grade is exams and he tests on the most specific details from very dense slides. You basically have to memorize every single thing to get a good grade.",
        "course": "MICROBIO5122"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Satoskar belongs in a lab, not in a classroom. Do not take this class unless you are prepared for heavy graduate level work, even then, every exam (which is your entire grade) is questioning your ability to memorize tiny details in slides that he never even talks about. Hard to understand and just reads you the slides. Avoid him at all costs.",
        "course": "MICROBIO5122"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Horrid professor.  Is not clear at all on what he expects you to know, literally saying everything on the slides are fair game (and they're dense slides). Not very clear in lecture, and even worse in office hours. Tests are overly difficult, leading to a D average on one such exam. Overall, he is bad. Flat out bad. Don't take. Ever.",
        "course": "MICROBIO5122"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class was very easy. However, the professor does not care about teaching and is a horrible person. I would advise transferring universities if you are interested in immunology.",
        "course": "MICROBIO5122"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Amazing instructor",
        "course": "IMMUNOLOGY"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "Awful professor. Difficult to understand and his lectures were extremely dense, which made it very difficult to study. Exams were full of minute details and information we never covered in class.",
        "course": "MICRO522"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Put material on the final we never cover in class. Terrible excuse for a teacher.",
        "course": "MICRO522"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 5,
        "comment": "A VERY challenging professor. Our whole class was terrified we were going to fail, but as a result we learned a lot. He was helpful in person, but you needed to be on top of your game before you approached him. It was really hard going through it, but looking back I really appreciated that he pushed us so much.",
        "course": "MICRO701"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "Difficult to understand due to his accent.  I know this is a common concern, but when the pronunciation is vital to your understanding particularly with so many uncommon term; then it is important to have a professor who can properly pronounce the terms included.  \r \r In addition, I wish he would let someone proofread his slides. I think it is comp",
        "course": "IMMUN522"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "I would strongly suggest not taking a class with Dr. Satoskar.  He simply reads off of the powerpoint slides and never adds extra comments.  The subject material is interesting but the exams are ridiculous.  Studying won't help.  He doesn't test on major concepts, but on small details that he puts into the tables or charts of his lecture slides.",
        "course": "MICRO522"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "Beware. You won't understand him in lectures as he abbreviates everything and he adds no content to the slides. His midterms are absolutely ridiculous and he teaches as if we were all graduate students who are in his field of study. Labs will help you though but good luck on your midterms. (Does not curve too)",
        "course": "MICRO522"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 5,
        "comment": "Micro 522. Look over notes but do not bother studying them too hard. Satoskar puts in minimal effort and copies/pastes test questions from the online textbook straight into his exams. Due to this, the class can be impossible or ridiculously easy depending on if you look at the questions.",
        "course": "MICRO522"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "Well structured class but not too many grade oppurtunities. Somewhat hard to understand sometimes because of accent. I fun professor though and allows joking in class.",
        "course": "MICROBIO629"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Microbiology",
    "firstName": "Patrick",
    "id": "VGVhY2hlci0yOTA3MTEz",
    "lastName": "Bradley",
    "legacyId": 2907113,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "It seems like he teaches at a graduate level to undergraduates. Very difficult to reach outside of class, which is a problem for students who desperately need help. I feel so incredibly stupid every time I attend one of his lectures.",
        "course": "BIO3401"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "He is a nice guy who is definitely knowledgeable and enjoys his field of study. His lecture slide notes are handwritten which helps a little with paying attention and retaining the material. It might have just been because it was an hour and 20 minutes long, but every lecture I was really fighting for my life to pay attention.",
        "course": "BIO3401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 2.6,
    "department": "Microbiology",
    "firstName": "Maggie",
    "id": "VGVhY2hlci0yODQ1MTE1",
    "lastName": "Wetzel",
    "legacyId": 2845115,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Wetzel explains concepts poorly and provides a surface-level, general understanding of the concepts discussed in the textbook during lecture just to ask EXTREMELY specific questions on every exam. She does not provide a study guide, only key concepts that ultimately do nothing to help you on the exams. The class itself is fine! But her?&#8230;",
        "course": "M4000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. W does a good job of making a hard class manageable. I recommend going to office hours for extra help.",
        "course": "M4000"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Nice professor but just reads off slides during lecture. Content is not too difficult exams aren't that bad. No extra credit and not a lot of assignments other than lab quizzes and lecture exams. ",
        "course": "M4000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "No extra credits. grades mostly depends on lab quiz and exams. Lecture is hard to understand and she is unable to be heard. The only thing I heard from lecture is her reading out the slides and \"okay?\". weekly assignment SmartWork is non-organized. A lot of things unmentioned in class appears.Time line is messy. Lab does not line up with lectures. ",
        "course": "M4000"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lectures really hard to understand. Didn't make sense and topics skipped around a lot. Came out of lectures more confused than when I went in, even with previous knowledge of the topics. Exams were extremely difficult even with studying key topics provided. Material itself is interesting & easy, professor makes it hard to learn. Wouldn't recommend.",
        "course": "M4000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "This prof knows her stuff and cares about student learning.",
        "course": "M4000"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Wetzel is very responsive to students and makes herself available to answer questions and talk about Microbiology. ",
        "course": "M4000"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. B taught the first half of the class very well and was a great professor. However, Dr. Wetzel was not good at teaching. She was always very nervous during lecture, and just read off the slides. She was not good at explaining concepts or making exams. Please do not take this class with Maggie Wetzel.",
        "course": "M4000"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Wetzel is a good teacher, but not a great professor. She reads directly from the slides, which can make skipping class very enticing, but her exam questions come straight from lecture. She offered several extra credit opportunities and in-class activities are not required but good for review. Learn the slides. ",
        "course": "M4000"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "My biggest criticism with Dr. Wetzel is that she reads off of slides. However, she offered extra credit opportunities and had very fair exams. I overall enjoyed the class a lot. ",
        "course": "M4000"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Very intelligent but not a strong lecturer. Reads directly from slides that have large paragraphs written on them. Does not engage the class, and asks questions with a lot of jargon to where they confuse the students.",
        "course": "M4000"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very approachable and relatable for a large lecture course.",
        "course": "M4000"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Wetzel was kind and sweet, but her lectures were lackluster and not comprehensive of the exam. The first exam we had with her was not ideal, and she seemed kind of not familiar or confident about the material. The average dropped too. For our last exam though, she seemed more confident and didn't read off the slides as much. Lab was fun though!",
        "course": "M4000"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her lectures are sub-par compared to Dr. B's. She seems extremely nervous and just reads off the slides. I find it unnecessary to attend her lectures, I just get the same thing from the slides. She breezes through information and then expects everyone to understand challenging questions immediately. Not a fan. ",
        "course": "M4000"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Wetzel is a kind person but not a great lecturer. She mostly reads of the slides and does not seem confident in the material that she is teaching. Many times it seems she is reading the slides for the first time. On exams, she is more interested in testing small details than big picture information. She is the lab coordinator and it's well run.",
        "course": "M4000"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 3,
        "comment": "She is nice and accessible outside of class, but a bad lecturer. Doesn't discuss things/rushes, then will ask detailed questions about something she didn't go over. The class was better the half Dr. B taught. Read the slides and make sure you understand them and can apply them and you should do well. Hard to pay attn to her lectures though. ",
        "course": "M4000"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great Teacher. I highly recommend making use of office hours. ",
        "course": "M4000"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "Nice person, but not a great lecturer. She teaches the second portion of the class. When she took over I stopped going to class. Often seemed confused on what she was lecturing on, even though she basically just read off the slides (which were poorly written and had many grammatical mistakes). I don't feel like I learned much for the second half. ",
        "course": "M4000"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "Taught the second half of the course. Slides explained the material well but her lectures just rehashed these slides word for word. She cared for us as students and made sure she was accessible outside of class. Exams \nrequired a good understanding of the course material and often required a thorough understanding of the slides. ",
        "course": "M4000"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Wetzel taught the second half of class and ran the lab portion of this class. She frequently did not know what she was talking about and would be confused during lecture, making everyone teach themselves before the exams. I would not recommend taking her unless she is the only option. Be prepared to study a lot on your own!!!!",
        "course": "M4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 4,
    "department": "Microbiology",
    "firstName": "Natividad",
    "id": "VGVhY2hlci0yMDAzNjE3",
    "lastName": "Ruiz",
    "legacyId": 2003617,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Ruiz is a really good lecturer very engaged and positive. The content was broken up in a way that made sense and contributed to my understanding of bigger ideas. The tests are really tough I will admit, best recommendation is just to treat it like it is a tough class from the start and don't get behind. ",
        "course": "MICRO4130"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "There are 3 exams that determine how you do in the class. She claims to give other opportunities such as poems and attendance points, but they don't actually help very much. Her notes are terrible- just pictures that can hardly be deciphered. Unless you HAVE to take this class for a requirement, do yourself a favor and avoid it. ",
        "course": "MICRO4130"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "The older reviews say its only graded on 3 exams but she has changed it and now there are a couple of homework assignments and quizzes worth 25% of your grade, so thats good! I will say, however, the exams were all over the place, some really easy some really hard,and the other assignments wont prepare you. Take good notes and you should be fine",
        "course": "MICRO4130"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "yup, three exams, alot of folks didn't do that well or were retaking the course because first time they didn't pass. she's an amazing lecturer, she is very clear and direct. it gets harder, but your grade should also improve after the first midterm if it doesn't go that well out the gate. she is also very approachable in office hours.",
        "course": "MICRO4130"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "three tests are the sole determining factor of the grade, and there is NEVER a curve. but, in truth the tests are very fair. you just need to pay very good attention and use her jargon when answering the questions (the tests are mostly extended response). she is an amazing instructor, she's very clear and direct, one of the best I've had.",
        "course": "MICRO4130"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "the tests are pretty much her slides, but she doesnt put everything on the slides online that she talks about in lecture. GO TO CLASS. and tape the lectures. her TA is very picky on wording so answer exam questions wisely. kind of scary with only 3 tests determining your grade but she is more than fair if you put in the work.",
        "course": "MICRO4130"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "It's already been said - THREE MIDTERMS, ONLY GRADES YOU RECEIVE. And do well on the first midterm, it only gets more in depth. Tough class but she definitely helps students develop understanding about biological systems.",
        "course": "MICRO4130"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Just way too much of your grade rides on three mornings. I was badly sick for the first test but didn't have time to see a doctor, and it ruined my grade so much that I couldn't possibly get above a C. Went into the course as a senior in the final semester with a 3.8 GPA and this is the first and only class I've dropped.",
        "course": "MICRO4130"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "tough class. the only grades are 3 midterms, but they are fair.  if you study really hard and answer the questions the way she addressed the material in lecture verbatim, it isnt so bad.  Dr. Ruiz is definitely passionate about what she teaches and she is always willing to help students succeed.",
        "course": "MICRO4130"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is very passionate about her field and knows what she is talking about. Pay attention in class and study a week before the exam and you should be more than set in getting an A or B in the class. The first exam is very information heavy but the next two are more problem solving type exams. Overall, one of the better professors at OSU.",
        "course": "MICRO4130"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you study, you can do really well. Tests are straightforward, she's just a tough grader. She's an awesome lecturer and clearly enjoys teaching students about the field she works in. Her slides don't have much text, so going to class is pretty important if you want an A or B in the class. She's very approachable. I'd take a class with her again.",
        "course": "MICRO4130"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "The tests she had didn't really seem hard but she is a hard grader for sure. Everyone else has already mentioned that she isn't lenient with grade help, which is definitely true. She's a fine teacher but the class can get annoying because there are only the 3 tests. It'd be nice to have some grades other than the tests for stability's safe",
        "course": "4130"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "Decent teacher but the class is tough and she isn't forgiving when it comes to grades. No extra credit and the only grades are the 3 midterms, so if you struggle on one it's a real task to come back. Must go to lecture. She's helpful and will answer questions you have, but she isn't very understanding about grades. Strikes me as a know it all.",
        "course": "4130"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "She brings things you supposed to do in the lab. You know how hard that would be when some one tells you, \" when you do this, you will get this result' without any observation. To make it clear you have to know things that would happen in the lab theoretically. Her tests are tough AND EXPECT NO extra credit.",
        "course": "4130"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Was a good, clear professor that wants her students to succeed. Tests are difficult but fair (there are only 3 and those are your only grades). No extra credit. Definitely a must to go to class, I recommend printing out the slides and then annotating in class. Cool accent. She stays after class to answer questions.",
        "course": "MICRO4130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.3,
    "department": "Microbiology",
    "firstName": "Nick",
    "id": "VGVhY2hlci0yOTIzNjM3",
    "lastName": "Chesarino",
    "legacyId": 2923637,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this professor's virology course. I felt that the content was really well laid out and that I learned a great deal from the course. I had a health issue during the term and the professor was incredibly supportive and helped me to be successful in the class despite my set back.",
        "course": "MICRBIO5149"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Decent instructor. Absolutely horrible at responding to emails. Evidently thinks very highly of himself, which establishes a professional environment that is poorly conducive to student learning. I would steer clear of this professor.",
        "course": "MICRBIO4000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. C has a really clear study guide and lecture slides. Total of 4 exams, no cumulative final! However, study hard for the exam, like all the details for the topic. It is a lot of memorization, but not impossible to study. Make sure if you take it online, stay on track watching the lectures. It will pill up pretty quickly, and you will be behind. ",
        "course": "MICRBIO4000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "really good professor teaches well, goto office hours!",
        "course": "MICRBIO4000"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great guy, he teaches the other half of this course & the material is naturally \"harder\" but he makes the exam questions much easier than anticipated. He tells you what to focus on for the exams (& what to ignore from the slides) and he's very laid-back guy. Lab is easy and most fun, lab final is open note (easy 20 pts). He's caring for sure.",
        "course": "MICRBIO4000"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ches gave a very chill and laid-back vibe to our lectures. He honestly has some funny remarks here and there which I loved! Personally, I think his tests are a fair bit easier than I expected when listening to his lectures. Every test question was fairly asked. No problems!",
        "course": "MICRBIO4000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor! Wish he taught the whole course. Lectures were great. Explained everything in easy way to understand. Topics/slides were organized, exam questions were very fair. Key topics given were very helpful study tool. Gives great advice to succeed in the course and office hours are helpful. Couldn't recommend more.",
        "course": "MICRBIO4000"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of work and do not recommend it if you do not have a lot of time. Discussion posts have to be at least (2-3 paragraphs that contain 7-8 sentences per paragraph). There is an assignment due on Sundays that consists of 400 words (which is not bad but can get annoying). The professor is very great and passionate about what he teaches and chill. ",
        "course": "MICRBIO4000"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lectures are super straightforward and Dr. C makes them interesting, you can tell he loves what he teaches. Barely any HW, and it's graded VERY flexibly. Exams are based on the key concepts so read them! He provides a lot of study materials and will also tell you most of what needs to be memorized for the exams. Great professor!",
        "course": "MICRBIO4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.8,
    "department": "Microbiology",
    "firstName": "Kelly",
    "id": "VGVhY2hlci0yMDM2NzQ0",
    "lastName": "Wrighton",
    "legacyId": 2036744,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "For future researchers: This lab is a toxic environment. Condescending leadership, constant plan changes, gaslighting, and unprofessional communication (rude, edited messages). High turnover, with many leaving or burned out. Stress caused insomnia and unhealthy habits. Prestige isn't worth the toll&#8212;proceed carefully.",
        "course": "MICRO"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is really great!!!! Lectures are good and she goes fast but catchable. The exams are not easy, need to study hard. The materials are useful and i fell in love with environmental microbio because of her class.",
        "course": "MICRO5155"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "You learn a lot in this class and Kelly genuinely cares about her students. She goes WAY too fast for undergrads though, so don't fall behind. Pop quizzes are  announced and she will basically give you an A for the semester paper if you just try. She does her best to give students the highest course grade possible, even if they did poorly on exams.",
        "course": "MICRO5155"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kelly is inspiring. She helped me when I felt I couldn't continue. Her lectures are always clear, focused and passionate. I couldn't recommend her more. ",
        "course": "MICRO"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 3,
    "department": "Microbiology",
    "firstName": "Birgit",
    "id": "VGVhY2hlci0xMTEwNTE0",
    "lastName": "Alber",
    "legacyId": 1110514,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr.Alber is a really good professor. She is very caring and accessible outside of class. Her lectures seem to be disorganized but as long as you attend lecture and do the problem sets, you will be fine. She is a tough grader, so make sure to say write precisely what is on her slides and don't say anything incorrect (she will mark more points off). ",
        "course": "MICRO4120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Alber is knowledgeable, articulate, and happy to answer questions. Her teaching style emphasizes critical thinking and will prepare you for a career in science. She took time out of her schedule weekly to host a journal club for research-minded students. Extra credit problems are abundant and earned by your hard work.",
        "course": "MICRO4120"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Alber (like many microbiology professors) is very caring. Show up to every lecture and go to office hours when you need to, she is ready to help any student that comes her way. Her class' topic is one of the hardest in the undergraduate classes, but it can be interesting if given the chance",
        "course": "MICRO4120"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Difficulty was similar to other Microbiology courses at OSU. I appreciated that she offered bonus points but the grading was ambiguous and there was no real rubric. Exams were difficult to study for and I think the class should have been graded on a curve. Some students put the effort in and did not deserve to fail the course.",
        "course": "MICRO4120"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Alber is very knowledgeable and cares a lot about her students, but the class is a structural nightmare. I found the lectures to be very chaotic and unorganized. Her problem sets and exam questions are very vague and unspecific. This class was required for my major, and it seems that Dr. Alber is the only one who teaches it. ",
        "course": "MICRO4120"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "The class is based on the 5 problem sets and 3 exams. The problem sets are basically exam level questions and are sometimes confusing. Her lecture slides are just as confusing. If you want points you have to answer questions almost exactly how she puts them on the slides. She is really nice, she just words things difficultly.",
        "course": "MICRO4120"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is brilliant, but as an instructor she isn't very good at communicating. She isn't clear on what is going to be on exams, nor is she clear when explaining content in the classroom. Her tests are fair, just... a crap shoot.",
        "course": "MICRO4120"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "She's not bad. She's kinda all over the place in lecture (or so I thought) made recordings listened to it later, realized she wasn't speaking gibberish. She gives you 3 problem sets which help direct you to the things she gives you on the exam. Not bad, I thought she was going to be terrible from the reviews.",
        "course": "MICRO4120"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "can't understand a word she says. never got a C in a bio class before this. the tests aren't impossible, the final was what tripped me up. essentially a biochemistry course, nothing really related to physiology. diversity,eh. KNOW EVERYTHING ABOUT RHODOBACTER SPHEROIDES.",
        "course": "MICRO4120"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Alber meant well, but taught so poorly. Her notes were all over the place and didn't follow the ones she gave to students. She grades based on opinion, not on a rubric, but will give extra credit on HW if you go the extra mile. DON'T miss lecture. Study the material over dry weight of a cell and similar math sections because it's on every exam.",
        "course": "MICRO4120"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "This isn't a hard class in terms of material, she is just very picky about how she wants questions answered. I can't say there's a lot of new material if you've taken micro 4100, but again she is pretty picky. She brushed over questions people asked in class. Also, she gave bonus on the assignments if she \"liked your answer\", give me a break.",
        "course": "MICRO4120"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Does not communicate well with classroom, in lectures or on exams and assignments. The grading on exams and assignments seem meticulous and somewhat random. Will disregard questions on clarification of major concepts.",
        "course": "MICRO4120"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Alber is very respected and a good lecturer. She makes you really think about material instead of just memorizing. The class ties together many classes for a micro major.",
        "course": "MICRO4120"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is a nice person, but her lectures are painful. This is essentially the biochemistry of microbes, not physiology and diversity. A lot of info in one lecture, and not much on the slides, so go to class. The entire content of her course could be taught in 2 weeks, but she loves to make things unnecessarily difficult. Good luck.",
        "course": "MICRO4120"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 2,
        "comment": "You can tell she's really passionate about what she does.  She's very willing to spend one-on-one time explaining stuff.  Grammatically her English is very good, and her accent isn't really that thick. She expects a lot out of you (which isn't bad) but sometimes it's hard to understand exactly what it is she's looking for, hence why clarity is a 3.",
        "course": "783"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Alber is a very sweet person. You can tell she genuinely wants her students to do well and is willing to meet whenever. The class is definitely challenging but she makes herself very available to help. That being said , I did find the class difficult. But a very cool lady!",
        "course": "MICRO4120"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Alber is very nice and makes the class super easy. You get 5/10 on the quizzes just for writing your name and lab section and she only takes the top 5 quizzes into your final grade.  Tests are straight from lecture and not tricky.  She even boosted everyone's midterm score by 13% or so by taking off a question that  lot of people missed.",
        "course": "MICRO520"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "TERRIBLE TEACHER.",
        "course": "MICRO520"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "Terrible teacher- cannot even speak proper english grammatically, yet expects the students to spell complex organism. Hard to understand. Not helpful. Goes on tangents.",
        "course": "BIO520"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful teacher, takes pop quizes in lectures and asks you to come up with a question from previous lectures. Not bad professor",
        "course": "MICRO581"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Microbiology",
    "firstName": "Alexander",
    "id": "VGVhY2hlci0zMDQyMDQ5",
    "lastName": "Michaud",
    "legacyId": 3042049,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Alex Michaud is the kindest, most inspiring professor I have ever had. It's great to have a professor who cares as much as he does about his students. Lectures are really interesting and cover a range of topics. Overall, the course is not terribly hard, but you will absolutely still learn a great deal. ",
        "course": "earthsci2203"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great lectures and passionate about what he talks about. Goes through presontations fast so its best to do some note taking and review on your own.",
        "course": "earthsci2203"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.3,
    "department": "Microbiology",
    "firstName": "Tina",
    "id": "VGVhY2hlci0xOTgzNjcw",
    "lastName": "Henkin",
    "legacyId": 1983670,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was a good professor and her module was very interesting, the in class writing assignments and activities were the only thing I didn't enjoy. Also her exam was a piece of cake as long as you read the lectures and some of the articles, quite simple and to the point!",
        "course": "BIO3401"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Henkin was honesty a great professor, and her midterm exam was cake if you actually went to lecture. Her module was also super interesting (on microbes \"the good, bad, and the ugly\"). Bio 3401 is a terrible class setup wise, but take it with Dr. Henkin to ease the pain a bit.",
        "course": "BIO3401"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is super nice and responses clearly to any question. Her exam is very straightforward from the notes. Too many in class activities and readings. Overall not bad.",
        "course": "BIO3401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 3.3,
    "department": "Microbiology",
    "firstName": "Kathleen",
    "id": "VGVhY2hlci0xMTA0OTQy",
    "lastName": "Sandman",
    "legacyId": 1104942,
    "numRatings": 32,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Sandman is one of the coolest womenprofessors I've ever met.  She was the only woman in her grad school class at HARVARD.  She does not suffer fools lightly, but she is more than willing to go the extra mile for her students.  Extra help, letters of rec, open door policy, etc.  Without a doubt the most dedicatedhard working prof I've ever had",
        "course": "4140"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "She doesn't even bother hiding her dismay when students ask questions or for more directions. This is a 5-credit class - no one is taking this for funsies. Dr. Sandman's lab book is terribly disorganized and she blames her students for not understanding material immediately. ",
        "course": "4100"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "She said it was her first time doing the lecture part of the class and it showed! She was way too complex, especially for a GE summer class. Her reasoning behind the difficulty of the class was that MOST of us were going into the medical field. She should stick to teaching the lab and avoid lecturing.",
        "course": "MICROBIO4000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her exam was unreasonable with a very low average. Her questions require you to think way too conceptually and she was no help when asked questions. She basically wants you to know everything and she expects you to \"figure things out on your own.\" not personable and condescending. easily the worst professor i have ever had. PLEASE AVOID.",
        "course": "MICROBIO4000"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "Kathy is alright. Her TAs do all the teaching though, which I didn't like. But she is very helpful if you mess up in a lab. The nature of the lab itself is very challenging  so I personally hated the class since lab reports/ homework assignments were wayyyy too time consuming because she made us graph by hand. I genuinely hated lab because of that.",
        "course": "MICRB4100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kathy genuinely cares about her students and she tries her hardest to make sure her students know what's going on. It's not very hard to get by in her lab, just make sure you just briefly read over the lab before class and they will explain the rest. She can be a quirky sometimes and actually makes parts of Micro very interesting.",
        "course": "MICRO4100"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Kathy is not as bad as she seems at first. She is helpful and approachable, but she does not tolerate ignorance or pure ineptitude. Tough assignments, but a good instructor.",
        "course": "MICRO4100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I didn't like her at the start of the year because her demeanor was so clinical as to border on frigid. She loves microbiology, though, and she was really cool by the end of the semester. I was pretty much always unprepared and behind on experiments and ended up with an A, so the class is far from impossible.",
        "course": "MICRO4100"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "FYI, Micro 4100 = 520 + 521. Dr. Sandman is very knowledgeable and the labs are very well organized. She is a hard grader (I can see how some would see her grading as subjective) and sometimes her exams are worded so that there can be some confusion. She can be cold at times, but if you're genuinely interested in the class she will warm up.",
        "course": "MICRO4100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Everybody has negative comments about Dr. Sandman, but if you do your work and show that you care all of her classes becomes a guaranteed good grades. Understand the concepts and you'll do well, spend your time thinking you know everything and she is just being nit-picky and you won't do well. She's a Good teacher.",
        "course": "MICRO581"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "Extremely unfair on grading even if material is easy. Her TAs take points off for the most absurd details and refuse to acknowledge different opinions. Sandman was barely there for most of the labs and left everything to her useless TAs. Don't take if avoidable. pay attn to MNUTE details",
        "course": "MBIO520"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class isn't that hard. If you put in a little bit of sweat, this class will help you. Lab honestly saved my grade. And Dr. Sandman seems harsh in class, but when I went to her for help, she was extremely nice, and even stayed back on a Friday afternoon.  She even helped me during some practicals when an injury didn't allow me to do some things",
        "course": "MICRO520"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "Terrible.  I am in the class right now.  Everyday I have been more than prepared and I have done a majority of the lab tasks before.  This woman does not like me for some reason and is extremely rude. Certainly plays favorites.  Avoid!!",
        "course": "MICRO520"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very reasonable, helpful, nice, with a sense of humor.  She's really not a monster, provided you don't consistently do stupid things like set your lab bench on fire.  It helps to read the lab manual before class, but if you're really on top of things you can get away without it.",
        "course": "MICRO521"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lots of sour grapes on here, kathe is actually pretty helpful and has been more than helpful to me.  She has even gone so far as to help me outside of class eveytime i've asked.  stay on top of the work, these labs aren't bad so long as you go in having read the manual before.",
        "course": "MICROLABS"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is college. No one is going to spoonfeed you. And why anyone would take these classes if they were not necessary to their specific area of study, I'm really at a loss to explain.  There is no avoiding these labs, or Professor Sandman, so make her aware that you are thinking and putting forth effort and it will go a long way.",
        "course": "MICROLABS"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class makes me want to blow my brains out (or maybe just rip my hair out). Yeah it is an interesting class and Dr. Sandman's not bad as a professor but I can't stand how many little points you'll lose for STUPIDEST**** ever!! I spent 4 hours on a goddamn worksheet that everyone else spent 2 seconds on. I lost 2 points for being too explicit. ",
        "course": "MICROLABS"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 4,
        "comment": "There is no doubt that she can be tough, but did you expect college to be a cakewalk&#63; She really focuses on details and wants students to problem solve, not just regurgitate. So, always think about why we do the things that we do in the lab. I welcome her style. It toughens you a bit.",
        "course": "MICRO521"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "This woman is an absolute monster. She is condescending and acts as if she is superior and doesn't help students at all. She is unclear in her directions and quizzes are graded inconsistently. She took points off of my quiz for misspelling &quot;itself&quot;. I was not aware that this was an English course, otherwise I would have edited my work. Avoid her!!!",
        "course": "MICRO520"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 3,
        "comment": "This person is not a very good professor. When someone has no level of leniancy and constantly puts down student academic thought, I feel like it is not going to help anyone. I hope OSU comes to their senses and replaces this person with a more well-spoken, more knowledgable and approachable lab coordinater than her. Get rid of her!!!",
        "course": "MICROLABS"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Dr. Sandman for Micro 520, 521, and 581 labs.  521 was when the &quot;number&quot; policy was implemented so that people would stop complaining.  The trick to her is this:  you have to actually think and communicate your reasoning well.  Speak up if you don't understand something.  But you better put forth some actual effort and try to understand/care.",
        "course": "MICROLABS"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr sandman is very helpful if you show your interest and seriousness in the class.  I went to her office to ask for help with the assignement and she was very nice and very available.  Try to do the assignements as soon as you get them and definitely go to her office.  Her quizzes are a little tricky at times.  I think she's very fair.",
        "course": "MICRO581"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 5,
        "comment": "WOREST professot in my life!! very rude and disrespectful. She looks down on people and thinks she is superior! no manners at all. I cant beleive how the department still has her. the lab was fun though even though it is hard-work.  Good luck with the monster sandman",
        "course": "MICRO520"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 3,
        "comment": "The WORST professor that I have dealt with in my 6 years at OSU. Very rude in e-mails and face to face conversation. She does pick favorites and if you are not one of them she does not mind telling you, not directly but in grading and the way she talks to you when you ask a question. Grading is erratic. The course is quite interesting regardless.",
        "course": "MICRO520"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "MICRB521"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 5,
        "comment": "if you're not a &quot;suck-up&quot;, she probably wont like you.  after we received our first lab report grades we had several students request that we each be assigned a number to use instead of our names on our lab reports to promote more fair grading.  low and behold, students' grades were totally different when she couldn't tell whose reports they were!",
        "course": "MICRO581"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 5,
        "comment": "What can I say about Sandmonster, aka the Sandman&#63; Well for starters I do believe she is the spawn of satan. She grins like the devil when she sees that students' grades are low. I just felt that of all the teachers at OSU she just didn't care, plain and simple.",
        "course": "MICRO521"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's extremely fair.  I had her in all micro classes; those classes require constant work.  Her exams could be challenging at times but if you go to her office she will help you at all times.  My advice for the lab is to keep up with it and to do the assignements as soon as you get them so that you have a chance to ask Dr sandman for help.",
        "course": "MICRO520"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 5,
        "comment": "Tough but fair.",
        "course": "MICRO580"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 4,
        "comment": "I had a good experience and relationship with her, even though she did pile on the work.  In my experience with her (2 quarters), she was only mean or condescending to the idiots in the class, who wanted her to do the work for them.",
        "course": "MICRO521"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 4,
        "comment": "I agree.  I had her for Micro 581 lab and she is just not nice!  She acts all students are idiots and talks down to everyone.  The TA's were great though!",
        "course": "MICRO581"
      },
      {
        "index": 32,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is the worst professor at OSU. Impossible to talk to, condescending, ENJOYS making students suffer.  Absolutely no compassion for the needs of students.  Loves to see students suffer and fail! DO NOT TAKE 520  UNTIL SHE IS NO LONGER TEACHING IT!!!",
        "course": "MICRO520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 3.5,
    "department": "Microbiology",
    "firstName": "Joseph",
    "id": "VGVhY2hlci0xMDM4MDI1",
    "lastName": "Krzycki",
    "legacyId": 1038025,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr Krzycki's class is one of the hardest classes I have ever taken. The material is very dense, and very difficult to grasp. While attendance is not mandatory, you will be lost without attending. Ask to record the lectures beforehand, you won't do well without doing that.",
        "course": "MICRO6020"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "This class is pretty tough, geared more towards grad students (there were only 4 undergrads in my class). He stays up on current research and is a pretty nice guy, he knows he's really smart though. Well I guess he did help discover pyrrolysine",
        "course": "MICRO661"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4,
    "department": "Microbiology",
    "firstName": "Stephanie",
    "id": "VGVhY2hlci0xMTQ1ODIz",
    "lastName": "Seveau",
    "legacyId": 1145823,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Seveau was a very knowledgeable and helpful professor. Her lectures were well organized and full of relevant and interesting information. Her test questions were sometimes hard to understand, but the content of the questions was fair. She sincerely wanted her students to succeed. Great professor!",
        "course": "MICRO4110"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Seveau teaches at an easy to follow pace and engages us by asking questions mid-lecture and reviewing content/providing review sheets. She's energetic, clearly enjoys teaching, and hopes for our success. I've found her kind, helpful, available, accommodating and understanding. Would take another class with Dr. Seveau!",
        "course": "MICROBIO4110"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Seveau was by far one of my favorite professors. The course was challenging but what great course isn't? There was a lot of information to know but she really was able to simplify the concepts. Office hours are a big help and she's always trying to improve the course. If you love the subject and work hard, you will get the grade you want.",
        "course": "MICRO4110"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Seveau was a teacher that disappointed me greatly. The actual course material is decently interesting, but her teaching is just SO AWFUL that it becomes almost impossible to retain any of it from her. Don't take her class if you don't have to.",
        "course": "MICRO524"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class was OK, but its was kinda boring at first. Its pretty easy though. I really liked the guest lectures. The exams are pretty straightforward so just study your notes. The only thing is she goes over the material pretty slow and it makes the class boring when she does! And she adds new slides and changes the order of the ppt sometimes :(",
        "course": "MICRO524"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Microbiology",
    "firstName": "Olga",
    "id": "VGVhY2hlci0xNTQ1NTMy",
    "lastName": "Zemska",
    "legacyId": 1545532,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's really awesome, nice, helpful and friendly!",
        "course": "MICRO581"
      }
    ],
    "SEI": []
  }
]