[
  {
    "avgDifficulty": 1.8,
    "avgRating": 1.1,
    "department": "Music",
    "firstName": "Tim",
    "lastName": "Leasure",
    "legacyId": 2989050,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "I encourage any prospective students to listen to Tim's recent faculty performance with wind symp. I will admit that Leasure is a great technician on the trumpet. However, his sound production leaves a lot to be desired, especially for a professional, and this is evident in his lackluster performance. I've heard high schoolers with better sound."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "The level of playing and teaching in the studio is astonishingly low. I was in Tim's studio for 2 years and learned absolutely nothing. Leasure is not a musician, he's a technician. I've studied with principal players of the best orchestras in the world, Leasure is NOWHERE CLOSE to their level. Leasure left me unprepared for grad school auditions."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Neither a good player nor a good teacher"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Tim Leasure is straight up disrespectful to his students. This year he WALKED OUT in the middle of his student's recital. What a great way to represent the OSU school of music in front of other faculty, family, and friends. Extremely distasteful, disrespectful, and downright rude to walk out of your upperclassman student's recital. smh"
      },
      {
        "index": 4,
        "rating": null,
        "comment": "If you want to improve your trumpet skills STAY AWAY!!!!!!"
      },
      {
        "index": 5,
        "rating": null,
        "comment": "Professor Leasure is very rigid, not flexible on anything, not to mention rude, short, and cold with his students. Trumpet studio is disorganized with Leasure not staying on top of anything. Tim Leasure generally dislikes students who are in the Marching Band, which is a shame since the Marching Band draws so many talented brass students into OSU."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "If you are looking for a serious performance program, be very cautious with Tim Leasure. Leasure has limited orchestral experience and his musical style and expression can be quite lacking. The style he teaches is very bland and lacks expression, focusing more on note accuracy rather than musicianship. Doesn't play how top orchestral players play."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "Very unprofessional and apathetic towards trumpet. Has very little enthusiasm about teaching students. Hard to get in touch with as well, never replies to emails. If you have a question outside of your lesson/studio, he doesn't like to help. Leasure has a cold personality and is very slow to warm up to newcomers. He's very closed minded and rigid."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "Leasure is an extremely incompetent professor. His approach to trumpet pedagogy is incredibly outdated. He teaches obsolete methods that the rest of the trumpet world has agreed are quite harmful, such as stretching the corners back into a smile. Whenever a student struggles with range/endur, he blames the mpc instead of addressing the root cause."
      }
    ]
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 1.7,
    "department": "Music",
    "firstName": "Kenneth T",
    "lastName": "Williams",
    "legacyId": 400969,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "This professor was by far the worst I have had. He is very hard to work with so the class is not enjoyable. He never updates grades and completely ruined my gpa. I communicated with him over three times that my grades needed to be updated, but then I checked my final grades and he put in zeros for those assignments."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Absolutely awful, he is a tough grader. On each video assignment for the week, he assigns like 5 different things and they are only 10 points each, he took off 5 points because I played 1 wrong note in one of the songs. Make sure that you make the video assignments as perfect as possible because there are very little assignments for the class."
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Horrible professor that uses tenure as an excuse to not teach."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Assignments are thrown out randomly and clearly not thought out. The structure of the class needs improvement, as there is no structure right now. It's as though he's making up the material during the class and expects you to know information that hasn't been taught."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "He tells you that you did a very good job then takes off 20 points. The class is practically self taught. Doesnt establish clear grading criteria at all. Hes too lazy to even play a simple melody on his own piano so he makes people play it on their own instruments that arent piano. Uses tenure to his leverage. Avoid him if you care about gpa."
      },
      {
        "index": 5,
        "rating": null,
        "comment": "This professor is the reason tenure should not be a free pass to do whatever. He finds excuses to end class early even for random things like forgetting his glasses. He gives vague instructions then docks points for concepts he never explained. Doesn't answer his emails. Tells the TA different instructions. You won't learn any piano from him"
      },
      {
        "index": 6,
        "rating": "4.5",
        "comment": "I actually thought he was a very good teacher. Our class had a lot of fun with him and he was very accommodating."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "He does not help students at all. He will ignore students' emails and phone calls. Try to avoid him as much you can. he will make your college life like hell."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "He acted like a complete jerk to several people in the class.  He is not a good prof to have as a piano 1 teacher.  He doesnt teach.  He just TELLS you to do things"
      },
      {
        "index": 9,
        "rating": null,
        "comment": "Williams is an awful teacher. And he thinks he is the best teacher there ever was. I worked really hard in his class but we didn't get along well because I didn't fit into his teaching ways and instead of helping me he was unsupportive and definitely not encouraging. The worse teacher I have ever had."
      },
      {
        "index": 10,
        "rating": null,
        "comment": "I wouldn't say he is a terrible person but definately stuck on himself. He thinks his classes are the best ever and everyone should be required to take them. While a few subjects of his course are semi useful, the course work is futile, nothing more than busy work. If you suck up to him and pretend to be enthusiastic about the class expect an A."
      },
      {
        "index": 11,
        "rating": null,
        "comment": "An awful man. Cruel, mean-spirited, unhelpful. Thinks he's the best thing that ever happened to music. Unwilling to accommodate students with disabilties."
      }
    ]
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.9,
    "department": "Music",
    "firstName": "Graeme",
    "lastName": "Boone",
    "legacyId": 43990,
    "numRatings": 107,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Professor Boone is passionate about music, but the online format makes the class a slog. Lectures are lengthy PowerPoints that are hard to stay engaged with. Quizzing on song release dates is brutal. Unstuck AI could help with memorization."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Boone is a nice guy and very knowledgeable, but this class is brutal for non music majors. The tests are extremely hard: identify a piece, composer, year, and characteristic from 15 seconds, plus lots of vocab and essays. There's also crazy amounts of busywork and discussion posts. Music majors might enjoy it, others, avoid it."
      },
      {
        "index": 2,
        "rating": "4.0",
        "comment": "Difficult exams but grading on other assignments was fairly easy"
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Graeme Boone is a nice guy, but his material is heavy. Expect to memorize over 50 songs, their artists, and the year they were released for tests. Lectures were long and mandatory. Overall, a bit more difficult than I expected for a GE."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Horrible, everything in this class was so over the top and a complete waste of time"
      },
      {
        "index": 5,
        "rating": "4.0",
        "comment": "Professor is very caring and passionate. However, lectures are long and not the most captivating. Exams are a bit tricky with memorization. Assignment instructions are a bit convoluted but manageable. Overall a great class but it's definitely not for those without prior background knowledge in music history/theory (despite what is claimed)."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "My favorite professor. His lectures are fascinating and you can tell he just has so much knowledge in music. For someone that loves classical music or doesn't know it at all, he will make you love it even more."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "Great caring guy with amazing lectures, but the exams are outrageous for a GE. You only get a week to memorize the title, artist, year, genre, and sound of 35 songs and he chooses 10 random songs off the list. I studied more for this GE than any other class and I'm an aerospace engineering major."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "Where do I even start. I am a premed student who took this class thinking it would be a fun GE that would lighten up my schedule. WOW, I was wrong. This is by far the most studying I have done for any class. It's ridiculous calling this a GE. Graeme is a great guy but taking this class as a non music major is a mistake."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Graeme's kind of a confusing guy. Not in the sense that he's a bad teacher (he's lowkey a genius), but more in the sense that he has crazy lore that he's always dropping during class. This class is a bit of work for a GE, but if you pay attention in lecture and put in a little effort, you won't have too much trouble. Just don't fall behind."
      },
      {
        "index": 10,
        "rating": null,
        "comment": "THE. WORST. CLASS. IVE. EVER TAKEN. insanely hard exams that are weighted so heavily. If u miss one class your grade will drop 5 points. Horrible teacher. Horrible TA. Horrible class. Literally do not take this class. This is ur warning"
      },
      {
        "index": 11,
        "rating": "4.0",
        "comment": "Dr. Boone really cares about what he does. But because of this he over complicates most things from his own textbook he wrote. With this the lectures are all early long and boring and it's nearly impossible to pay attention. TA CARRIES THIS CLASS. Almost all of the concepts you learn will be from recitation and they are super super chill graders."
      },
      {
        "index": 12,
        "rating": null,
        "comment": "DO NOT TAKE THIS CLASS. I took this for a simple freshman-year GE and it ended up being my hardest class all semester. This is my only class with 90-minute lectures twice a week and a recitation. The 2 midterms and final are nearly impossible having to memorize over 80 terms, 50+ songs, and essay questions."
      },
      {
        "index": 13,
        "rating": null,
        "comment": "You will not have access to notes for exams anymore. The lectures are long and he doesn't make them interesting. The actual teaching falls to the TAs. Exams are more work to study for than they really should be for this kind of class."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Professor Boone really cares about his lessons, and is more than willing to give extra credit for showing an application to music (air guitar comp, museum visit, etc). He can get off topic easily, but it is usually still relevant and interesting. There is a concert attendance requirement for the class, so be prepared to find a concert!"
      },
      {
        "index": 15,
        "rating": null,
        "comment": "He is very passionate about the topic, I would consider him an expert, and he wrote his own textbook. But this book isn't always clear, highly opinionated, and unnecessarily long. The recitation is kinda dumb and I felt like I had to teach myself some topics. I relied heavily on notes and the book for tests, which are all open-note."
      },
      {
        "index": 16,
        "rating": "4.0",
        "comment": "Long lectures can get boring. Study guides are given for every test which are super easy if you do the work before. A lot of kind of pointless time consuming work but really not terrible. Very passionate about what he teaches."
      },
      {
        "index": 17,
        "rating": "4.0",
        "comment": "Professor Boone was a fantastic human being and was very passionate about his job. I appreciated the amount of work he puts into his class. The lectures are online though--which is something he can't control--so it wasn't as interactive and captivating as it would've been in person. I recommend reading through the chapters if you don't pay attentio"
      },
      {
        "index": 18,
        "rating": "4.0",
        "comment": "Dr. Boone is a great professor who is passionate about music, but the online lectures make the class unbearable. It is impossible to pay attention and very long. There also a lot of just unnecessary assignments. Tests are easy, you are given a study guide before and everything on the tests can be found in the textbook."
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "Dr Boone is very compassionate, supportive, into what hes teaching, and he will help in any way he can."
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "Music",
    "firstName": "Katie",
    "lastName": "Graber",
    "legacyId": 2550046,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "Katie was a decent teacher. She seemed to enjoy teaching and she makes an effort to get people engaged. Your enjoyability for the class mostly depends on how much you enjoy music as a subject. In every class, there would always be an opportunity to participate. This would range from questions to group exercises. Generally an easy A and a good time!"
      },
      {
        "index": 1,
        "rating": "4.0",
        "comment": "I took Music3352 for credit as part of my GE's second theme. It's a 4-credit hour class, and you are expected to do weekly readings. Overall, the experience has been positive, and the professor is very nice. If you're looking to fulfill the requirement for the second theme of GE, I highly recommend this class. (P.S. no test or quiz in this class)"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Very removed from the atmosphere in the class. She is here just to get a check and does not care whether we retain the knowledge or not. Attendance is mandatory and she forces group work every class. Each unit has so much information and only about 10% of that is covered in class- the rest is your responsibility to learn for the exam."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Dr. Graber is truly passionate about what she teaches! You have to read some articles/chapters every week, but they're usually interesting and skimmable. There's a lot of group discussions and three group projects throughout the class, but in my case it worked out well and she seemed understanding of potential issues. Def would recommend!"
      },
      {
        "index": 4,
        "rating": "4.0",
        "comment": "Prof. Graber is really kind and truly cares about what she teaches. If you do take this class, just be aware that it may be more boring if you don't really care about the subject. As long as you show up and try, you'll be good! Overall a really kind professor and a pretty neat class."
      },
      {
        "index": 5,
        "rating": "4.0",
        "comment": "Dr. Graber is very kind and understanding, and definitely cares for every single one of her students. She had many in class activities, but the lectures were overall very boring. It was hard not to skip. I would rate the class a 2/5, but Dr. Graber a 4/5 herself."
      },
      {
        "index": 6,
        "rating": "4.0",
        "comment": "Dr. Graber is very sweet and lenient and always there to help you out during her office hours. Her lectures are boring tho but the content itself is pretty interesting. Attendance and participation is graded tho so skipping class will impact your grade but otherwise its a nice class to take."
      },
      {
        "index": 7,
        "rating": "4.0",
        "comment": "Dr. Graber is a good professor, she cares about the subject matter, and the lectures arent too bad. However, lectures can get off topic and I feel like I tend to learn more in the recitations. The only problem I have with this class is that the lectures ARE graded (else Id have an A), so dont put it as a morning class thinking you can skip."
      },
      {
        "index": 8,
        "rating": "4.0",
        "comment": "Dr. Graber is very passionate about what she does. The topics we covered were generally interesting but lectures could get boring at times when we got into technicalities. She is very sweet though and is happy to answer any questions. She genuinely wants everyone to enjoy the class."
      },
      {
        "index": 9,
        "rating": "4.0",
        "comment": "The class was sometimes interesting, but lectures were often hard to sit through. But Dr. Graber was very kind and always willing to listen or help if you needed it. The assignments can be annoying, but they aren't very difficult. As long as you review everything from lecture and recitation before the exams you'll do fine."
      },
      {
        "index": 10,
        "rating": "4.0",
        "comment": "The class overall was an easy A. As long as you show up and do the online quizzes, you will do well as those count towards a good amount of your grade. There were 2 assignments where you had to write a page or 2, but they were easy and actually fun to do. The only negative about her class is that the lectures can get boring at times."
      }
    ]
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 1.6,
    "department": "Music",
    "firstName": "Kenneth T",
    "id": "VGVhY2hlci00MDA5Njk=",
    "lastName": "Williams",
    "legacyId": 400969,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Just don't choose him if you care about your gpa. ",
        "course": "PIANO"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "This professor was by far the worst I have had. He is very hard to work with so the class is not enjoyable. He never updates grades and completely ruined my gpa. I communicated with him over three times that my grades needed to be updated, but then I checked my final grades and he put in zeros for those assignments. ",
        "course": "PIANO1"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely awful, he is a tough grader. On each video assignment for the week, he assigns like 5 different things and they are only 10 points each, he took off 5 points because I played 1 wrong note in one of the songs. Make sure that you make the video assignments as perfect as possible because there are very little assignments for the class.",
        "course": "PIANO"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible professor that uses tenure as an excuse to not teach.",
        "course": "PIANO1"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Assignments are thrown out randomly and clearly not thought out. The structure of the class needs improvement, as there is no structure right now. It's as though he's making up the material during the class and expects you to know information that hasn't been taught. ",
        "course": "MUS226101"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "He tells you that you did a very good job then takes off 20 points. The class is practically self taught. Doesnt establish clear grading criteria at all. Hes too lazy to even play a simple melody on his own piano so he makes people play it on their own instruments that arent piano. Uses tenure to his leverage. Avoid him if you care about gpa.",
        "course": "MUS226101"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "This professor is the reason tenure should not be a free pass to do whatever. He finds excuses to end class early even for random things like forgetting his glasses. He gives vague instructions then docks points for concepts he never explained. Doesn't answer his emails. Tells the TA different instructions. You won't learn any piano from him",
        "course": "MUS226101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "I actually thought he was a very good teacher. Our class had a lot of fun with him and he was very accommodating.",
        "course": "MUS226101"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "He does not help students at all. He will ignore students' emails and phone calls. Try to avoid him as much you can. he will make your college life like hell.",
        "course": "PIANO261"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "He acted like a complete jerk to several people in the class.  He is not a good prof to have as a piano 1 teacher.  He doesnt teach.  He just TELLS you to do things",
        "course": "PIANO1"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "Williams is an awful teacher. And he thinks he is the best teacher there ever was. I worked really hard in his class but we didn't get along well because I didn't fit into his teaching ways and instead of helping me he was unsupportive and definitely not encouraging. The worse teacher I have ever had.",
        "course": "PIANO261"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "I wouldn't say he is a terrible person but definately stuck on himself. He thinks his classes are the best ever and everyone should be required to take them. While a few subjects of his course are semi useful, the course work is futile, nothing more than busy work. If you suck up to him and pretend to be enthusiastic about the class expect an A.",
        "course": "PIANOPEDAGOGY"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "An awful man. Cruel, mean-spirited, unhelpful. Thinks he's the best thing that ever happened to music. Unwilling to accommodate students with disabilties.",
        "course": "PIANO"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 1.1,
    "department": "Music",
    "firstName": "Tim",
    "id": "VGVhY2hlci0yOTg5MDUw",
    "lastName": "Leasure",
    "legacyId": 2989050,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "I encourage any prospective students to listen to Tim's recent faculty performance with wind symp. I will admit that Leasure is a great technician on the trumpet. However, his sound production leaves a lot to be desired, especially for a professional, and this is evident in his lackluster performance. I've heard high schoolers with better sound. ",
        "course": "studio"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "The level of playing and teaching in the studio is astonishingly low. I was in Tim's studio for 2 years and learned absolutely nothing. Leasure is not a musician, he's a technician. I've studied with principal players of the best orchestras in the world, Leasure is NOWHERE CLOSE to their level. Leasure left me unprepared for grad school auditions. ",
        "course": "studio"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "Neither a good player nor a good teacher",
        "course": "studio"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Tim Leasure is straight up disrespectful to his students. This year he WALKED OUT in the middle of his student's recital. What a great way to represent the OSU school of music in front of other faculty, family, and friends. Extremely distasteful, disrespectful, and downright rude to walk out of your upperclassman student's recital. smh",
        "course": "studio"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "If you want to improve your trumpet skills STAY AWAY!!!!!!",
        "course": "studio"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "Professor Leasure is very rigid, not flexible on anything, not to mention rude, short, and cold with his students. Trumpet studio is disorganized with Leasure not staying on top of anything. Tim Leasure generally dislikes students who are in the Marching Band, which is a shame since the Marching Band draws so many talented brass students into OSU.",
        "course": "studio"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "If you are looking for a serious performance program, be very cautious with Tim Leasure. Leasure has limited orchestral experience and his musical style and expression can be quite lacking. The style he teaches is very bland and lacks expression, focusing more on note accuracy rather than musicianship. Doesn't play how top orchestral players play. ",
        "course": "studio"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unprofessional and apathetic towards trumpet. Has very little enthusiasm about teaching students. Hard to get in touch with as well, never replies to emails. If you have a question outside of your lesson/studio, he doesn't like to help. Leasure has a cold personality and is very slow to warm up to newcomers. He's very closed minded and rigid. ",
        "course": "studio"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "Leasure is an extremely incompetent professor. His approach to trumpet pedagogy is incredibly outdated. He teaches obsolete methods that the rest of the trumpet world has agreed are quite harmful, such as stretching the corners back into a smile. Whenever a student struggles with range/endur, he blames the mpc instead of addressing the root cause. ",
        "course": "studio"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.9,
    "department": "Music",
    "firstName": "Graeme",
    "id": "VGVhY2hlci00Mzk5MA==",
    "lastName": "Boone",
    "legacyId": 43990,
    "numRatings": 107,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Boone is passionate about music, but the online format makes the class a slog. Lectures are lengthy PowerPoints that are hard to stay engaged with. Quizzing on song release dates is brutal. Unstuck AI could help with memorization.",
        "course": "MUS2252"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "Boone is a nice guy and very knowledgeable, but this class is brutal for non music majors. The tests are extremely hard: identify a piece, composer, year, and characteristic from 15 seconds, plus lots of vocab and essays. There's also crazy amounts of busywork and discussion posts. Music majors might enjoy it, others, avoid it.",
        "course": "MUS2251"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Difficult exams but grading on other assignments was fairly easy",
        "course": "MUS2252"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Graeme Boone is a nice guy, but his material is heavy. Expect to memorize over 50 songs, their artists, and the year they were released for tests. Lectures were long and mandatory. Overall, a bit more difficult than I expected for a GE.",
        "course": "2255"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Horrible, everything in this class was so over the top and a complete waste of time",
        "course": "2252"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor is very caring and passionate. However, lectures are long and not the most captivating. Exams are a bit tricky with memorization. Assignment instructions are a bit convoluted but manageable. Overall a great class but it's definitely not for those without prior background knowledge in music history/theory (despite what is claimed).",
        "course": "MUSIC2251"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite professor. His lectures are fascinating and you can tell he just has so much knowledge in music. For someone that loves classical music or doesn't know it at all, he will make you love it even more.",
        "course": "MUS2251"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "Great caring guy with amazing lectures, but the exams are outrageous for a GE. You only get a week to memorize the title, artist, year, genre, and sound of 35 songs and he chooses 10 random songs off the list. I studied more for this GE than any other class and I'm an aerospace engineering major. ",
        "course": "2252"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Where do I even start. I am a premed student who took this class thinking it would be a fun GE that would lighten up my schedule. WOW, I was wrong. This is by far the most studying I have done for any class. It's ridiculous calling this a GE. Graeme is a great guy but taking this class as a non music major is a mistake. ",
        "course": "MUSIC2252"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Graeme's kind of a confusing guy. Not in the sense that he's a bad teacher (he's lowkey a genius), but more in the sense that he has crazy lore that he's always dropping during class. This class is a bit of work for a GE, but if you pay attention in lecture and put in a little effort, you won't have too much trouble. Just don't fall behind.",
        "course": "MUSIC2253"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "THE. WORST. CLASS. IVE. EVER TAKEN. insanely hard exams that are weighted so heavily. If u miss one class your grade will drop 5 points. Horrible teacher. Horrible TA. Horrible class. Literally do not take this class. This is ur warning ",
        "course": "MUS2252"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Boone really cares about what he does. But because of this he over complicates most things from his own textbook he wrote. With this the lectures are all early long and boring and it's nearly impossible to pay attention. TA CARRIES THIS CLASS. Almost all of the concepts you learn will be from recitation and they are super super chill graders. ",
        "course": "MUSIC2252"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS. I took this for a simple freshman-year GE and it ended up being my hardest class all semester. This is my only class with 90-minute lectures twice a week and a recitation. The 2 midterms and final are nearly impossible having to memorize over 80 terms, 50+ songs, and essay questions. ",
        "course": "2252"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "You will not have access to notes for exams anymore. The lectures are long and he doesn't make them interesting. The actual teaching falls to the TAs. Exams are more work to study for than they really should be for this kind of class.",
        "course": "2252"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Boone really cares about his lessons, and is more than willing to give extra credit for showing an application to music (air guitar comp, museum visit, etc). He can get off topic easily, but it is usually still relevant and interesting. There is a concert attendance requirement for the class, so be prepared to find a concert!",
        "course": "HISTORYOFROCK"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "He is very passionate about the topic, I would consider him an expert, and he wrote his own textbook. But this book isn't always clear, highly opinionated, and unnecessarily long. The recitation is kinda dumb and I felt like I had to teach myself some topics. I relied heavily on notes and the book for tests, which are all open-note.",
        "course": "HISTORYOFROCK"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "Long lectures can get boring. Study guides are given for every test which are super easy if you do the work before. A lot of kind of pointless time consuming work but really not terrible. Very passionate about what he teaches. ",
        "course": "MUSIC2252"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Boone was a fantastic human being and was very passionate about his job. I appreciated the amount of work he puts into his class. The lectures are online though--which is something he can't control--so it wasn't as interactive and captivating as it would've been in person. I recommend reading through the chapters if you don't pay attentio",
        "course": "MUS2252"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Boone is a great professor who is passionate about music, but the online lectures make the class unbearable. It is impossible to pay attention and very long. There also a lot of just unnecessary assignments. Tests are easy, you are given a study guide before and everything on the tests can be found in the textbook. ",
        "course": "2252"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Boone is very compassionate, supportive, into what hes teaching, and he will help in any way he can.",
        "course": "MUS2252"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 1,
        "comment": "I took his History of Rock n Roll online class for a GE. I wish it would have been in person because I know it would have been so engaging and more interesting but frankly it being online made it almost unbearable. He is so passionate and interested in what he's teaching but it's hard to get involved. I wouldn't say it's his fault though.",
        "course": "MUS2252"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Boone is one of the most passionate and caring professors out there. While lectures can sometimes be long, Dr. Boone does his best to include music clips and videos throughout the presentations to keep things interesting. This class was online for SP2021 and would probably be more difficult in person.",
        "course": "MUSIC2251"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Boone is very passionate about music. Unfortunately due to an online setting, his class was boring as hell. The lectures are like 2 hours long on PowerPoint and are very hard to pay attention to. Your grade in this class will heavily depend on your TA and your memorization skills.",
        "course": "MUS2252"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class was a huge drag since it was online and he posted Microsoft powerpoints for all the lectures. Each lecture was around 150-200 slides with his voice inserted into different slides. It's really hard to pay attention for that long because you can't jump ahead or fast forward. Tests are nice though because you can use your notes.",
        "course": "MUS2252"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 4,
        "comment": "ONLY take this class if you are purely interested in rock and music in general, do not expect it to be easy just because it's a GE, but if you are into the subject you'll do fine. Dr. Boone is really nice and always there to give tips, his class trip was awesome too. TA's are super helpful with assignments and also hold review sessions for tests.",
        "course": "MUSIC2252"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "This professor is excellent. I really enjoyed MUSIC 2252 and learned a lot about rock history as well as gaining a more advanced, unique outlook on music appreciation in general. This is one of the harder GEs Ive taken at OSU, so I would only recommend it if youre interested in rock to begin with. The exams are somewhat difficult, but fair.",
        "course": "MUSIC2252"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 4,
        "comment": "I really would not recommend MUSIC 2252 at all. Lectures were boring and pointless to attend beyond receiving attendance points. For each midterm you have to memorize the date of release for about 30 different songs which requires an unnecessary amount of work for a GE credit to complete. Overall, this class was a headache.",
        "course": "MUS2252"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 5,
        "comment": "Take this class is you want to read 300 pages before the first midterm, be tested on the year that certain songs were recorded, and identifying the song by hearing it. We spent almost 6 weeks before we even mentioned rock. In addition its a music history course but we learn musical aspects like scales, beats, and tempo. I would not recommend.",
        "course": "MUS2252"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "What a great professor for the history of rock n roll GE. I've always loved music and been really into discovering. This class really enlightened my perspective of rock, and although I was taking this for a GE credit, that's what I got most out of it. I really learned about things I was interested in and that was so cool",
        "course": "MUSIC2252"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had a love-hate relationship with this class. It was decently hard but also interesting and entertaining. To study, read his online chapters. Papers are graded easy by TAs. You must attend 2 concerts of your choice through the semester. Start memorizing song info a week before tests. Lecture and recitation attendance is taken for a grade.",
        "course": "MUS2252"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the coolest professors that has lots of personal stories with iconic artists. Posts a study guide a week before each exam that goes over what will be on exams, so there are no surprises. If you don't have an interest for rock music, don't take it cause it requires more work than other GE's, but you learn a lot about music if taken",
        "course": "MUSIC2252"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "All the lectures are also posted online so you don't need to go to class, but the class is entertaining and exposes you to lots of good music. There are 3 exams, very straight forward",
        "course": "MUSIC2252"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "Boone is a great professor. Lectures can seem really long so don't take this class if you aren't genuinely interested in the inner workings of music and musicians. Exams are very easy and straightforward: listening section, mc terms, and essay. Easy A if you do all the homework and memorize what they tell you to. Attendance taken in lecture and rec",
        "course": "MUS2252"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing lectures. I could seriously listen to this man talk all day! If you are passionate about music and want to learn more, this is the class for you. Midterms aren't hard if you read the chapters, and there are decent amounts of bonus given on them. It is a lot for a GE, but it doesn't matter much to me since it is fairly easy to get an A.",
        "course": "MUS2252"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 5,
        "comment": "While professor Boone is both very knowledgeable and enthusiastic about this subject, he gives way too much work for a basic GE. Unless you love music I would not recommend this class as it takes a lot of time to receive even a B, from the 3 concerts you must attend to the long list of songs you must remember for exams.",
        "course": "MUS2252"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 3,
        "comment": "The class was not nearly as enjoyable as I thought it would be for a music gen ed, but was still a little interesting. Boone is a genius on the subject. Exams are extremely easy if you prepare with his study guides, but the study guides are a giant chore to begin with. Recitations were useless. Don't leave class at the break, they do know, btw.",
        "course": "MUSIC2252"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 4,
        "comment": "Though I think he is very knowledgeable in his area, this class just has too much content. You go over a ton of information and the exams are extremely difficult. Do not take this class unless you're extremely passionate about classical music. If you're just taking it as a GE, save yourself and take something else.",
        "course": "MUS2251"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class for a GE and I loved it. Boone made so enjoyable and his knowledge on the subject was so expansive which made it super interesting. At the same time though, if you don't like the subject then lectures will be pretty boring. The tests seem like they're gonna be hard but as long as you study for them you're good.",
        "course": "MUSIC2252"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good professor who cares about his students, and does cool things to keep them interested. Exams are pretty straightforward. Some of the assignments can be a pain in the butt, but aren't tough. Good class/professor to take to knock out a GE.",
        "course": "MUS2252"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 2,
        "comment": "Graded easy. Pay attention to lectures and memorize the songs to get 100% on tests. Only 10% of the study guides are actually on tests. Memorizing songs is a pain, but it's easy points. Don't read the online chapters (he writes them), it's poorly written and only repeats lecture material. Beware you'll have to buy tickets to and attend 2 concerts.",
        "course": "MUS2252"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 2,
        "comment": "Boone's lectures can be boring sometimes and so can recitations, but you can tell that he's passionate about the material. He's a nice, approachable guy. Attendance is taken for a grade. Study guides for the exams have a ton of material on them, but the exams themselves aren't too bad. I recommend this class if you're interested in rock 'n' roll.",
        "course": "MUSIC2252"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love this class and the professor. The long lectures can be a drag, but they are interesting and fun if you're engaged. He is extremely passionate about the class and I find him very personable, nice, and interesting. I have literally only missed 0.75 points in this class, but came in with a solid music/classic rock knowledge. Would recommend!",
        "course": "MUSIC2252"
      },
      {
        "index": 43,
        "rating": 4,
        "difficulty": 4,
        "comment": "Boone is a good professor, but the class is more about the mechanics of music than the history of rock. Only take this class if you have a long history in music and are very passionate about music (especially Pre-70s music.) Good class, bad GE. It is definitely not an easy A. Midterms are very hard and require lots of studying.",
        "course": "MUSIC2252"
      },
      {
        "index": 44,
        "rating": 3,
        "difficulty": 2,
        "comment": "While he knows what he is talking about, he is very opinionated.  I didn't think the material was interesting since he only spent one day talking about the big rock bands such as Journey, ACDC, Boston, etc.  Recitations are absolutely pointless, so are all the stupid little assignments but you have to do them to pass the class.",
        "course": "MUSIC2252"
      },
      {
        "index": 45,
        "rating": 3,
        "difficulty": 2,
        "comment": "Notes are poorly formatted and full of too much filler. Get ready to use CTRL+F a lot. Tests are easy if you do the study guides. Study guides contain an insane amount of information, 90% of which doesn't matter. Get ready to waste hours of your time studying for tests.  Lectures are long and consist of mostly filler.  Easy but very boring class.",
        "course": "MUS2252"
      },
      {
        "index": 46,
        "rating": 2,
        "difficulty": 3,
        "comment": "The way he teaches is terrible. This should not be a GE if it is taught Prof. Boone, it is too specialized. I took this thinking it would be fun and learn a history of the bands of rock 'n' roll but most popular 'rock' bands he skipped over and talked slightly about obscure bands no one has really heard of.",
        "course": "MUSIC2252"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Boone is passionate about his subject and knows A LOT about what he is talking about from first hand experience. He knows insight on the subject and we play instruments and listen to songs a lot. The midterms are hard to study for and there is A LOT of little assignments (weekly) and a few papers (4-5). He goes fast through lectures on Powerpoi",
        "course": "MUSIC2252"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 2,
        "comment": "I strongly suggest you take 2252 (History of Rock 'n' Roll), and I suggest you take it with Boone. He clearly knows a lot about the material, and is very good at teaching it. He wrote his own version of the book, which he posts by chapter online when he teaches it. The exams are not difficult, and he does not take it out of all the possible points.",
        "course": "MUSIC2252"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 4,
        "comment": "He is very talented and knowledgeable. He wrote his own version of the textbook that is posted online. He completely changed how I look at music. He plays several instruments and gives personal insight about artists (he brought in Taylor Swift's keyboardist to talk to us, who is a personal friend of his). ",
        "course": "MUSIC2252"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Boone is an outstanding professor. His history of Rock and Roll class completely changed my life and the way I perceive all types of music. You should want to go to the lectures. This guy is so incredibly smart and knowledgeable about what he teaches. He's also extremely talented and plays instruments (piano, guitar, etc..) in the lectures. ",
        "course": "2255"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures are extremely interesting.  He gives you an online copy of the book, so you don't need to buy anything.  Very easy weekly assignments, and the midterms have review sheets.  If you put in about 3 hours for the midterm, you should be able to ace it no problem. Would take History of Rock n Roll again in a heartbeat.",
        "course": "2252"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class on the recommendation of a friend of mine and I absolutely loved it. An academic approach to rock icons like Elvis Presley is strange but nonetheless fascinating and has changed they I perceive many musicians from the 30's onward. The only complaint I have is that Dr. Boone isn't offering more classes on music.",
        "course": "MUSIC2252"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 3,
        "comment": "Exams cover a lot of content and it isn't an easy A class, but not difficult if you spend an hour looking over things before the exam. Strange curve system that other students cannot break.",
        "course": "MUSIC2252"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Boone is very interesting and intelligent. All of his lectures are engaging and make you excited about life!",
        "course": "MUS2252"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class was so easy, but the midterm and final are pretty hard. Boone will help you with anything. He even offered to give us guitar/ harmonica/ etc lessons. He's so passionate, knows everything about music and he is AMAZING! Take his class!",
        "course": "MUSIC2252"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great professor, lectures are very detailed but he doesn't expect you to remember a lot for the exam. No book, but attendance is mandatory. This class is extremely easy, review guides are provided for each exam, and he generally wants to help any student that asks. Definitely take this course for GEC credit if you like rock music.",
        "course": "MUS2252"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "A great guy!  He's essentially a hippy in the form of an average-looking professor!  He's great at teaching, and I highly recommend his class!",
        "course": "MUSIC2252"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very knowledgable&truly passionate about what he teaches.He has a ton of great stories from\"back in the day\"(like how he knows rock stars!).Lectures can be a tad boring because he's monotone as a bedtime story,but the information is interesting if you pay attention.Also, DO NOT BUY THE TEXT BOOK.He one that he wrote,and the grammar is terrible.",
        "course": "MUSIC2252"
      },
      {
        "index": 59,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Boone is very knowledgeable in music, but this class is not an easy GE by any means. Exams are rough and lectures are very very dry. Only good thing is listening to songs during lectures and hearing Dr. Boone play instruments (occasionally)",
        "course": "MUSIC2252"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is unbelievably easy. Rough part is the listening portions of the exam. (a lot of songs to memorize) But even with that, I've scored over 100% on both exams. They're so easy and common sense. Boone is great. Very clear, easygoing guy. Never have Gunay Kochan as a TA. She is the worst.",
        "course": "MUS2252"
      },
      {
        "index": 61,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class sounds good in theory but don't take it. Prof Boone is very knowledgeable but is very opinionated and makes that known to everyone. For a GEC this class is a LOT of work you have to write response papers every week and the amount of material you need to know for exams is ridiculous. Lectures are mandatory and extremely dry.",
        "course": "MUSIC2252"
      },
      {
        "index": 62,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Boone is a good professor. He definitely knows his stuff. However, if you're looking for an easy A or an interesting class, avoid this one at all costs. It's a lot of work and the exams are very stressful and extremely heavy on detail. Also, the lectures aren't all too exciting and everything is mandatory.",
        "course": "MUSIC2250"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 2,
        "comment": "No joke, this man knows everything about music. It is obvious that what he's teaching is his passion. He does expect you to know a lot of information, and lectures are not entirely stimulating.. But he IS a great professor",
        "course": "MUSIC252"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Boone was a very good teacher. He makes lectures interesting and lively, playing various recordings of music and occasionally playing an actual guitar or banjo. His tests are heavy on details and require a lot of studying. The final paper is also somewhat of a pain to write, but the class is worth the workload.",
        "course": "HIST252"
      },
      {
        "index": 65,
        "rating": 3,
        "difficulty": 3,
        "comment": "I took the history of Rock and Roll course and I learned a lot while also expanding my musical interests. Heavy on minor details in his lectures which you are not tested on. He writes great notes and puts them on Carmen though which is very helpful if you can't make it to class.He's a little boring in lecture, but has a lot of knowledge.",
        "course": "MUSIC4490"
      },
      {
        "index": 66,
        "rating": 4,
        "difficulty": 2,
        "comment": "he knows the material really well and his passion for music keeps the class upbeat for the most part so it is easy to follow, all powerpoints are on carmen so its not hard to study for the test though there is a lot of facts to study. he is really helpful if you show interest by answering questions.",
        "course": "MUSIC251"
      },
      {
        "index": 67,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good prof who knows his stuff. But he also teaches what he wants to, which ends up being a lot of middle ages and modernist music when I expected the class to be mainly bach/beethoven/mozart. Anyway, it was still very interesting and the class was easy-he gives a detailed review sheet for exams. final paper and some hw also, but he's an easy grader",
        "course": "MUSIC251"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 1,
        "comment": "The previous comment is absurd. Imagine that- not being on facebook during class&#63; Also, he does expect you to know a lot of information, but he gives you a study guide for each exam with EVERY bit of info that you need to know. Very manageable if you take a few hours to study for each exam. Don't bother buying the textbook, not necessary at all.",
        "course": "MUSIC251"
      },
      {
        "index": 69,
        "rating": 4,
        "difficulty": 1,
        "comment": "Boone is an excellent professor and a &quot;musical genius&quot; as another reviewer said. His history of Rock and Roll class is a little heavy on the technical aspects of the music, but he's very knowledgeable, funny, and really wants you to understand the material. Exams are a breeze and class is fun - even the days about disco and roots music!",
        "course": "MUSIC252"
      },
      {
        "index": 70,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Boone is honestly a musical genius! I've always liked classical music, but he takes it to a whole new level. His tests are easy but you do have to study.He gives a complete review sheet and offers extra credit tho.Go to class cause he bases tests off of his lectures, but complete lectures are on carmen.You also have to write a paper at the end.",
        "course": "MUSIC251"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor. Without a doubt, the best class I've taken at Ohio State.",
        "course": "MUSIC252"
      },
      {
        "index": 72,
        "rating": 4,
        "difficulty": 1,
        "comment": "One of the easiest classes i've taken. He is very interested in teaching and comes across pretty clear.  don't buy a textbook, no reason to at all.  attendance in mandatory and i tried harder to stay awake than i did study for the exams. study review sheet the week before and its and easy A",
        "course": "MUSIC252"
      },
      {
        "index": 73,
        "rating": 4,
        "difficulty": 2,
        "comment": "No need to take notes, however most of the time he did not get to have the material in the notes so read up.  Do not buy book, you will never use it.  Class content was not bad but the man thinks San Fransisco was the epicenter of the musical universe for every trend of the last 100 years",
        "course": "MUSIC252"
      },
      {
        "index": 74,
        "rating": 5,
        "difficulty": 2,
        "comment": "when it comes to the midterms and finals it is alot of memorization, but he curves well and gives bonues questions. So there is no reason not to get an A in his class. Boone is really good at what he does. Take this class, and dont buy the textbook.",
        "course": "MUSIC252"
      },
      {
        "index": 75,
        "rating": 4,
        "difficulty": 2,
        "comment": "this guy actually made me enjoy classical music and I never thought that was possible.  Not only that but the class is pretty easy, I got an A+ without too much work.  Boone actually wants you to learn, hes not just working for a paycheck, unfortunately some ppl don't appreciate that.  He is by far a true asset to OSU, A+",
        "course": "MUS251"
      },
      {
        "index": 76,
        "rating": 1,
        "difficulty": 5,
        "comment": "There's no point in attending his lectures because he doesn't take attendance during them and he reads the internet notes in a monotone voice for two hours. Only attend the Friday class, and DON'T BUY THE TEXTBOOK.",
        "course": "MUSIC251"
      },
      {
        "index": 77,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is a complete joke. If you can't get an A, I judge you. Also, he showed up to our final 20 minutes late, hungover, after a week in Cabo and liked to talk about how you have to &quot;feel&quot; (get stoned) to really appreciate some rock music. Ahahahah!",
        "course": "MUSIC252"
      },
      {
        "index": 78,
        "rating": 2,
        "difficulty": 4,
        "comment": "lectures are boring. sections are worse, but thank god they're only 48 minutes long. midterms and final are very very specific about 4 or 5 of the 30 songs/artists you studied. the multiple choice section is a joke; it's almost impossible unless you live for jazz. very hard gec.",
        "course": "MUSIC253"
      },
      {
        "index": 79,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class is such a joke. I might have spent a combined 2 hours total studying the entire quarter, never opened the textbook, and got an A in the class. Keep in mind that attendance is part of the grade; I know people whose grades slipped because they slipped.",
        "course": "MUSIC252"
      },
      {
        "index": 80,
        "rating": 5,
        "difficulty": 2,
        "comment": "I LOVED THIS CLASS!  I have been at OSU for two years now, and he is the best teacher that I  have had.  He loves what he teaches and is extremely leniant.  No note taking necessary, he only wants you to come to class to enjoy it.  GREAT music!  If you do the work you will get an A+.  The best class and teacher ever :)",
        "course": "MUSIC252"
      },
      {
        "index": 81,
        "rating": 2,
        "difficulty": 1,
        "comment": "With over 300 pages of typed notes by the end of the quarter, the midterms and final essentially become just a made dash to memorize as much as you can. There was also little coordination between TA's, so one TA would give full credit for the same answer where another would give 0.",
        "course": "MUSIC252"
      },
      {
        "index": 82,
        "rating": 5,
        "difficulty": 1,
        "comment": "I did not buy the book and never went to office hours and still got an A...although I was a bit nervous after the final that I may have got an A-...",
        "course": "MUSIC252"
      },
      {
        "index": 83,
        "rating": 5,
        "difficulty": 1,
        "comment": "Boone was an excellent prof.  He really makes you appreciate the music and seems to love the subject.  Also, the class is really easy and fun.  He starts you with an automatic 120% on all of the exams.",
        "course": "MUSIC252"
      },
      {
        "index": 84,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very intellegent and knows a lot about what he is saying. The class is boring though, it is not Boone that makes it boring-its just boring material. Participation = 20% of your grade, but he is very awesome and super nice.",
        "course": "MUSIC252"
      },
      {
        "index": 85,
        "rating": 4,
        "difficulty": 1,
        "comment": "TAKE THIS CLASS. It's really easy and pretty fun. You get to jam out to tunes the whole class-no need to take notes or buy the textbook. Dr. Boone's online notes are all you need. Great GEC.",
        "course": "MUSIC252"
      },
      {
        "index": 86,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent teacher, passionate & super smart, but makes learning easy to do. Inspires you to learn more on your own. Works hard for the students, more than other profs. One of best classes I've ever taken. Teaches you to &quot;own&quot; music and understand its place in history. Gives a real handle on the knowledge that you can use in the rest of life/music.",
        "course": "251"
      },
      {
        "index": 87,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome guy and very smart.  The class is pretty easy, definitely reccomended.",
        "course": "MUSIC252"
      },
      {
        "index": 88,
        "rating": 4,
        "difficulty": 3,
        "comment": "Boone is great and speaks with poetry.  His passion behind his ideas and expressions intrigue and inspire me.  He truely loves to teach.  It's refreshing to have a professor who is really into his class.  Rock on Graeme!  You are filled with passions for music.",
        "course": "MUSIC251"
      },
      {
        "index": 89,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Boone is certainly very well versed in this subject matter. He shows great artistic interest in rennisance/classical music. However, I wonder if he is beginning to become a little bored teaching this class over and over again. He should do a better job of balancing music with European history. I like history, but I was enrolled in a music class",
        "course": "MUSIC251"
      },
      {
        "index": 90,
        "rating": 5,
        "difficulty": 2,
        "comment": "Overall, good guy.  Interested in bettering his students on more levels than one.  Incorporated art as well as history in his music class.",
        "course": "151"
      },
      {
        "index": 91,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "MUSIC251"
      },
      {
        "index": 92,
        "rating": 5,
        "difficulty": 1,
        "comment": "brilliant teacher who loves teaching.  i had slight interest in this class, but he motivated and inspired me to learn as much as i could.  i wish all my classes were this stimulating and informative.  i feel that this is what i thought college would be all about.",
        "course": "MUSIC252"
      },
      {
        "index": 93,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "HISTORYOFROCK"
      },
      {
        "index": 94,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is amazing.  Best professor I've had in two years at this university.  His lectures were always very well-planned, and even though he was lecturing 100+ people, he did a great job involving students.  Knows his rock history.  He  had some amazing firsthand accounts of cool bands.",
        "course": "MUS252"
      },
      {
        "index": 95,
        "rating": 3,
        "difficulty": 1,
        "comment": "his lectures suck but the class is easy as hell.. you can tell that he is very opinionated about music but he has good intentions",
        "course": "MUSIC252"
      },
      {
        "index": 96,
        "rating": 5,
        "difficulty": 1,
        "comment": "&quot;incredible stuff&quot;",
        "course": "MUSIC252"
      },
      {
        "index": 97,
        "rating": 4,
        "difficulty": 2,
        "comment": "Well I guess this is his first time teaching the history of rock and roll course, but I think he does a good job. The only thing that is a little weird to me is that he publishes the notes online and just reads from them during lectures, so they become easy to skip. But, he really seems knowledgable",
        "course": "MUSIC252"
      },
      {
        "index": 98,
        "rating": 5,
        "difficulty": 3,
        "comment": "His class is boring. I mean, I sleep everyday in his class, literally. However, he is still a very good teacher and he has a very good understanding of music history.",
        "course": "MUSIC141"
      },
      {
        "index": 99,
        "rating": 3,
        "difficulty": 2,
        "comment": "He's very passionate about his teaching and likes to involve the class",
        "course": "MUS141"
      },
      {
        "index": 100,
        "rating": 4,
        "difficulty": 2,
        "comment": "I loved this class. Plus he let me take my midterm when i missed it.",
        "course": "MUS141"
      },
      {
        "index": 101,
        "rating": 2,
        "difficulty": 2,
        "comment": "extremely boring class. seems like he would rather talk about the history of europe than music. i like music but i really did not like his class at all.",
        "course": "MUSIC141"
      },
      {
        "index": 102,
        "rating": 2,
        "difficulty": 4,
        "comment": "He doesn't seem to like teaching as much as he used to; he seems cranky and unhappy, not very into teaching at all.",
        "course": "150"
      },
      {
        "index": 103,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "MUSIC141"
      },
      {
        "index": 104,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "MUS141"
      },
      {
        "index": 105,
        "rating": 2,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "151"
      },
      {
        "index": 106,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "MUSIC141"
      },
      {
        "index": 107,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "151"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4,
    "department": "Music",
    "firstName": "Austin",
    "id": "VGVhY2hlci0xOTY1MzQ2",
    "lastName": "McCabe-Juhnke",
    "legacyId": 1965346,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great lecturer and I really enjoyed this class. I also found the content enjoyable which helped. I would recommend this class as long as the topic sounds interesting to you. There is some homework involved, but I didn't think it was too bad.",
        "course": "MUSIC2252"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great lecturer, really cared about the subject and wasn't boring even though the class is mostly lectures and discussion posts. If you show up and pay attention, it's an easy A and a fun class. If you don't care (and already know some) about the history of music, it'll be a lot harder\n",
        "course": "MUSIC2252"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "There is way to much information in each class and exam with too much work for a Gened which doesn't apply to 99.9% of students majors. He also gives too much work and is a tough grader for a class where you don't learn anything you would ever use again. I also had a 89.72 as a final grade which he refused to round up.",
        "course": "MUSIC2252"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "I did not enjoy this class and wouldn't recommend. The lectures were very boring and long and the slides were packed with information. The tests were moderate and there was always a take home exam to go along with the tests. The take home exams were easy and just a short essay, but at the end we had a paper along with that which was a lot for a GE.",
        "course": "MUSIC2252"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Gives entertaining lectures and works to make class worth attending. Exams are not very difficult. Attendance is graded. ",
        "course": "MUSIC2252"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really enjoyed Dr. Juhnke's lectures! This class changed the way I view music and I feel so much more knowledgable now because of it. He's such a friendly guy and very easy to talk to and ask questions. You have to do a takehome essay with each exam and a final 1000 word paper, but it was graded easily and didn't take too long. Highly recommend!",
        "course": "MUSIC2252"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a fantastic gen ed for me to take. Austin is super knowledgeable, and keeps his lectures interesting, engaging, and funny. Plus, I've learned so much about music and you literally listen to rock for 1/3 of the class. If you pay attention it should be an easy A.\n\nNo brainer - take this class!",
        "course": "MUSIC2252"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Austin teaches a pretty interesting class to begin with but does a great job to go over the top and make it even better. Lectures are lengthy but still easy to pay attention to. ",
        "course": "MUSIC2252"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Austin. He is such an interesting person as well as very approachable and caring. He is so open to discussion and allows students to express their ideas openly without judgement. He is fun in class and is always smiling. He is also very available if you have any questions or concerns. His class was always a highlight.",
        "course": "MUSIC2252"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class surprisingly had a lot of work for a Gen Ed but I enjoyed listening to Austin. His lectures were engaging and I learned ton in this class. Exams/work aren't really difficult as long you pay attention.",
        "course": "MUSIC2252"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Austin is a good guy but incredibly disorganized. He does not give us a clear idea of what is being tested until the last minute. For our second exam we had to memorize 30 songs and he wondered why the average was a D+. Luckily he gives enough extra credit and curved that exam so that the class average remains slightly above a C. ",
        "course": "MUSIC2241"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class isn't bad besides the fact that at the beginning of the semester, we were told that you didn't have to have any musical background whatsoever. I found this class challenging at times because I had no background. Also, there is an essay for all three exams and a big final paper. This professor is also pretty boring!!",
        "course": "MUSIC2252"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Austin is a wonderful professor who cares a lot about the topic. I took him for History of Rock and Roll and it was one of the most interesting classes I've taken so far. Biggest downside is that there are so few grades, 85% of the class is on 4 assignments. On the plus side, the grading on the papers is easy. Definitely recommend him for any class",
        "course": "MUSIC2252"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "Music",
    "firstName": "Katie",
    "id": "VGVhY2hlci0yNTUwMDQ2",
    "lastName": "Graber",
    "legacyId": 2550046,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Katie was a decent teacher. She seemed to enjoy teaching and she makes an effort to get people engaged. Your enjoyability for the class mostly depends on how much you enjoy music as a subject. In every class, there would always be an opportunity to participate. This would range from questions to group exercises. Generally an easy A and a good time!",
        "course": "MUSIC2250"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took Music3352 for credit as part of my GE's second theme. It's a 4-credit hour class, and you are expected to do weekly readings. Overall, the experience has been positive, and the professor is very nice. If you're looking to fulfill the requirement for the second theme of GE, I highly recommend this class. (P.S. no test or quiz in this class)",
        "course": "Music3352"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Very removed from the atmosphere in the class. She is here just to get a check and does not care whether we retain the knowledge or not. Attendance is mandatory and she forces group work every class. Each unit has so much information and only about 10% of that is covered in class- the rest is your responsibility to learn for the exam.",
        "course": "MUS2250"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Graber is truly passionate about what she teaches! You have to read some articles/chapters every week, but they're usually interesting and skimmable. There's a lot of group discussions and three group projects throughout the class, but in my case it worked out well and she seemed understanding of potential issues. Def would recommend! ",
        "course": "MUSIC3364"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Graber is really kind and truly cares about what she teaches. If you do take this class, just be aware that it may be more boring if you don't really care about the subject. As long as you show up and try, you'll be good! Overall a really kind professor and a pretty neat class.",
        "course": "MUSIC3364"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Graber is very kind and understanding, and definitely cares for every single one of her students. She had many in class activities, but the lectures were overall very boring. It was hard not to skip. I would rate the class a 2/5, but Dr. Graber a 4/5 herself.",
        "course": "MUSIC2250"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Graber is very sweet and lenient and always there to help you out during her office hours. Her lectures are boring tho but the content itself is pretty interesting. Attendance and participation is graded tho so skipping class will impact your grade but otherwise its a nice class to take.",
        "course": "MUSIC2250"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Graber is a good professor, she cares about the subject matter, and the lectures arent too bad. However, lectures can get off topic and I feel like I tend to learn more in the recitations. The only problem I have with this class is that the lectures ARE graded (else Id have an A), so dont put it as a morning class thinking you can skip.",
        "course": "MUSIC2250"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Graber is very passionate about what she does. The topics we covered were generally interesting but lectures could get boring at times when we got into technicalities. She is very sweet though and is happy to answer any questions. She genuinely wants everyone to enjoy the class.",
        "course": "MUSIC2250"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class was sometimes interesting, but lectures were often hard to sit through. But Dr. Graber was very kind and always willing to listen or help if you needed it. The assignments can be annoying, but they aren't very difficult. As long as you review everything from lecture and recitation before the exams you'll do fine.",
        "course": "MUSIC2250"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class overall was an easy A. As long as you show up and do the online quizzes, you will do well as those count towards a good amount of your grade. There were 2 assignments where you had to write a page or 2, but they were easy and actually fun to do. The only negative about her class is that the lectures can get boring at times.",
        "course": "MUS2250"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Music",
    "firstName": "Dallas",
    "id": "VGVhY2hlci0zMDY1NjI0",
    "lastName": "Carpenter",
    "legacyId": 3065624,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "This professor is a good person but needs to learn how to not take his frustrations out on the students. It causes stress and anxiety and has made multiple students, including myself, cry afterwards. I have heard similar about his other classes too.",
        "course": "21256"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 3.7,
    "department": "Music",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNjE0Mzg2",
    "lastName": "Lomax III",
    "legacyId": 2614386,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mark Lomax did a great job with this course, it was super easy to follow and the amount of assignments was very manageable. You do one 7 point quiz a week and a short discussion board, definitely a good class for GE. ",
        "course": "ARTEDUC1600"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "dr lomax is an amazing lecturer he often goes beyond what the tangents he goes on are often funny!",
        "course": "MUSIC-2244"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "Terrible professor. Lectures have nothing to do with course content. The textbook has all of that. Attendance is graded so you have to sit in class while he goes on tangents and sexual experiences he has had. He also brags about himself constantly, including how he's been fired by 12 churches. Recitations have the exact same questions as exams do.",
        "course": "MUSIC-2244"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.6,
    "department": "Music",
    "firstName": "Robert",
    "id": "VGVhY2hlci02MTA2ODc=",
    "lastName": "Ward",
    "legacyId": 610687,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Ward is very wise & inspirational to all. He is always concerned with making each student better, no matter what skill level they are. I am studying to be a music educator one day and I hope I can be as good as him one day.",
        "course": "MUSIC2203"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ward's commitment to making everyone in the room a better musician is very admirable. His ensembles achieve a world class sound while remaining a space where everyone is expected (and encouraged) to make mistakes and learn. Dr. Ward- you are the best!",
        "course": "MUS20304"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Ward is hilarious and makes music a wonderful escape from my challenging major courses. The audition for Chorale was extremely intimidating and challenging, but the pieces that we learned in class were fun and manageable. He definitely improved my singing, oral, and sight-reading skills. ",
        "course": "MUSIC2203"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ward was by far the highlight of my Ohio State experience. Many STEM majors (like myself) pursue Glee Club because it affords us the opportunity to debrief from the insanity of a tough STEMM curriculum, and enjoy something we love. He is absolutely hilarious, and truly cares about each student. My favorite professor at OSU!",
        "course": "MUSIC20304"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "I just did not enjoy this class. If you come from a classical singing background, go for Chorale. Dr. Ward creates a weird cult-like environment, similar to a high school youth group. If you like to sing but don't have many music skills, he'll work with you to improve that but I'd encourage you just to apply for University Chorus at that point.",
        "course": "MUSIC220304"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ward is one of those professors who will make your university experience so much better. He's super caring and wants you to love music as much as he does. Is particular about attendance when it was in person choir. Virtually, he assigns homework but its music basics. Virtual class was simply a space to learn new music techniques and life skills",
        "course": "MUS2203"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ward is AMAZING. I was looking for a choir class with little time commitment (due to my already heavy course load) and he was so helpful when I was trying to choose an ensemble. He is hilarious and always in a good mood. I enjoyed going to his class so much, it felt more like a club because of how fun it was. Incredible guy.",
        "course": "MUSIC2203"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Ward is very respected by those that have been around him awhile. He seems intimidating at first but once he gets to know you and vice versa, he's very easy going and respects you if you respect him. Try hard, put in the effort, be honest and you'll do fine. Favorite faculty of my time at OSU.",
        "course": "MUSIC220304"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Ward is truly gifted when it comes to clearly teaching students how to understand music. He made the students view sight singing as a fun game that we all have the ability to understand how to do, and he never made a student feel dumb in the class even if they had no clue what they were doing.",
        "course": "MUSIC4193"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "dr ward is a phenomenal instuctor and conductor.  really gives his all to mens glee and we are all grateful.  anyone with a chance and desire to take mens glee, please audition!  you wont regret it.",
        "course": "MUSICMGC"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Ward is one of the best. His classes are fun and yet productive. I have learned a lot from this man and am grateful for the opportunity to know him.",
        "course": "MUS203"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very fun and excellent teacher. Full of knowledge though sometimes a little weird. Plays favorites and &quot;suck-ups&quot; will do well in this class. Lets upper classmen basically run things on the road and they are full of complexes, some very weird and power hungry. Bus trips on bus 2 very fun but often extremely annoying and no discipline.",
        "course": "MUSIC167"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Full of energy. A great director, but rather intimidating and hard to approach. You'll learn a lot!",
        "course": "MUS202"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 5,
        "comment": "He lets his personal biases dictate how much or how little he will help you as a student, has no room for grace or mercy under ANY circmustances (if he is biased against you),has a serious inferiority complex that is nursed by intimidating people around him.",
        "course": "MUSICTUTT"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "Incredible enthusiasm for all he does, and a great sense of humor. So much talent here that isn't recognized nearly enough. Thank you, sir.",
        "course": "MUS203"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "inspiring teacher.  it's a privilege to sing for him.  symphonic choir's a blast, and he's wonderful teaching conducting classes.",
        "course": "MUSIC203"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Thank you for doing all that you do, Dr. Ward. Amazing director and amazing person.",
        "course": "MUSIC20304"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "After mentioning this in class, I had to go give him some kudos.  He's hysterical...and what energy!  And I guess he's an alright director.  =)  Just kidding - he's awesome.",
        "course": "SYMPHONICCHOIR"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent director.",
        "course": "GLEECLUB"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is nice, good sense of humor. The class is challenging, but it's not hard.",
        "course": "20802"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing director, makes glee club the best class ever.",
        "course": "MUS20304"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Dana",
    "id": "VGVhY2hlci0yMzE2MjE3",
    "lastName": "Plank",
    "legacyId": 2316217,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I'm taking this class because it fulfills my GE themes. Dr. Plank is amazing, she makes this class very interesting. Before taking the class I didn't know what to expect because I had zero knowledge about a class for music. I've learned things I didn't know existed and it feels good. Dr. Plank cares a lot about his students and makes the class fun",
        "course": "MUSIC2254"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had no prior experience with classical music. I don't even like classical music. Dr. Plank doesn't care. If you do the assignments you will get an A. Those include listening and evaluating songs, group discussions, and easy quizzes. The final is a very open-ended paper.",
        "course": "MUSIC2251"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Plank was very clear with what was expected and provided ample resources. While the course wasn't organized as much as my OCD brain likes online courses, it wasn't hard to get the assignments done on time and her feedback on early ones made the larger projects easier to do. Her attitude towards the material was a delight. I ended with a 99.6%",
        "course": "MUSIC2254"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4,
    "department": "Music",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0yOTcyNDM2",
    "lastName": "Bilik",
    "legacyId": 2972436,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "His lectures aren't super entertaining, but he keeps everyone pretty engaged and is pretty clear with his instruction. He also chooses music that is more interesting to analyze using music outside of classical very often. Make sure you go to class and there's only one homework assignment a week plus a reflection which is very low stakes.",
        "course": "3421"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Many of my classmates could not stand Dr. Bilik, as he can come off very power hungry. I didn't necessarily enjoy him, but you will do well in his class if you kiss up to him and do the homework correctly. He has a dry sense of humor, so get ready for uncomfortable moments. I learned a lot from him and he is easy to reach outside of class.",
        "course": "37499"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.9,
    "department": "Music",
    "firstName": "David",
    "id": "VGVhY2hlci0xNzc3ODAy",
    "lastName": "Bruenger",
    "legacyId": 1777802,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was my second semester taking a class with Professor Bruenger. He's such a sweet, interesting, and funny guy. You really do learn a lot in the class if you show up or at least go through the lectures. But I was in my final semester so I hardly ever went to class. There wasn't many assignments, just do them and you'll get full credit.",
        "course": "MUSIC3330"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was easy because there really weren't many assignments. His lectures are so detailed and you can tell he knows so much about the music industry. You don't particularly need to attend because there isn't attendance, just read the powerpoints and you'll know everything you need.",
        "course": "MUS2271"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class for a minor and learned so much! Definitely recommend taking one of his classes if you get the opportunity to! ",
        "course": "MUS2271"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Prof Bruenger is a genuinely knowledgeable and understanding prof. The assignments are clear and not difficult. Maybe don't take the class in the morning, lectures can get pretty boring, but overall I would recommend any course he teaches. Interesting stories and always available to help &amp; exams/assignments are all open note &amp; online. Great guy!",
        "course": "MUS2271"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite class I have taken at tOSU but that is mostly because I was genuinely interested in what we learned in this class. It's not hard, he genuinely just wants you to learn. All of his assignments and exams are online and they are open book, open internet, but just do your own. Great lecturer and much wisdom to offer. His book is fantastic.",
        "course": "MUS2271"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Bruenger is infinitely wealthy in his knowledge of music history and the changing music industry. He is heavily involved in electronic and multimedia use in the classroom, so for once I actually enjoyed attending a class. I learned a TON that I've used in interviews multiple times since completing the MME program. TAKE ALL OF HIS CLASSES!",
        "course": "MUSIC3330"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bruenger is the best professor I've had at OSU.  Hie has a wealth of knowledge through research and tacit experiences in music, but also a creative approach to teaching.  He engages students inside and outside of the classroom. This is a highly relevant intro course, with a remarkable professor.  If you don't get inspired, it's your own fault!",
        "course": "MUS2271"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.8,
    "department": "Music",
    "firstName": "Jordan",
    "id": "VGVhY2hlci0yNTU3NzYz",
    "lastName": "Saul",
    "legacyId": 2557763,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The GOAT. Nuff' Said. ",
        "course": "MUSIC220305"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Saul is a great, educated person who cares deeply about her students and musicians. However, Women's Glee is not the vibe I was looking for. I felt like we spent a lot of time doing silly exercises and focusing on family time. I personally get a lot more enjoyment out of Music 2203.01 (Chorale) where we focus on more technical music. ",
        "course": "MUSIC220305"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Saul is AMAZING! Never gets frustrated, never looks like she doesn't know what she's doing, and always has such a positive mindset. She clearly knows the ins and outs of conducting a choir and conducting it well. I learned more about proper choral singing from her in a semester than I have in the rest of my life.",
        "course": "MUSIC220303"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jordan is an amazing professor and provides you with many resources you need to be a successful music educator. ",
        "course": "MUSIC3370"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "What an amazing, caring person! I wish all professors would be as good (and as easy) as Professor Saul! She was very flexible and gave plenty of notice about upcoming assignments. She was also a very easy grader.",
        "course": "MUSIC3370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jordan is an amazing professor, she really cares for her students. She is also very passionate about what she is teaching. I would most definitely take her class again if I could. She also responds in a fashionable manner for emails!",
        "course": "MUSIC3370"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Saul was... amazing! She truly cares about her students and their success. Very easy A. Lots of extra credit opportunities. Fun and useful class overall. 10/10 would take again!!!!",
        "course": "MUSIC3370"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was so easy especially since it is online. Attendance wasn't mandatory which was nice. She's not a strict grader on assignments. As long as you show effort in this class it should be an easy A. Please take this class!",
        "course": "MUSIC3370"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "She knows what shes talking about and can whip a choir into shape. This is more than a class, and it is not easy, but she makes us feel seen and cared for. Her knowledge of choral techniques and pedagogy and very specific ability to carry those out in a classroom is unmatched. 10/10 will take again.",
        "course": "MUSIC220305"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4,
    "department": "Music",
    "firstName": "Robert",
    "id": "VGVhY2hlci03Mzc4NQ==",
    "lastName": "Gillespie",
    "legacyId": 73785,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "This professor scolded me in front of the whole class for being 30 seconds late. I always show up on time, but that day I had my period and had to go change my clothes. Good leaders don't punish in public. ",
        "course": "MUSIC261"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "The main reason I chose OSU for my Master of Arts in Music Education.  A great professor and colleague and one I learned a great deal from.",
        "course": "MUSICED"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy is the reason I came to Ohio State!  He is one of the best in his profession... definitely a golden ticket to a job!",
        "course": "MUSIC261"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "yay!!! he's awesome but.... deffinetly has favorites... very strict, but really helpful!!! :D tries to be funny, but jokes can get pretty old... he points fingers, and says &quot;that person in the white t-shirt in the 2nd stand...&quot; or &quot;one little turkey over in the _____ section...&quot; but other than that, i recomend him!!!",
        "course": "MUSIC5"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "STRINGS"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome. Teaches Chamber strings and makes us sound great. Too bad he has favorites and doesn't really care about the student itself.",
        "course": "STRINGS"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "A great professor to have for strings.  He taught me all I know about pacing, strategies that work, planning, etc.  One good thing OSU school of music has going for it.  Highly recommended.  A good witness for God as well. He just needs to relax!",
        "course": "STRINGED"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Knows his stuff!!!",
        "course": "STRINGED"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you are going into string education this is the man that will get you where you need to go.  Nationaly known and very knowledgable.  If you try to fake your way through he will weed you out.",
        "course": "STRINGS"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Pompous and slave-drives students in the worst ways. Demanding is one thing, slave labor is another. An appalling man who thinks everything can be codified neatly, which has no reality attached to it.",
        "course": "STRINGS"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "He knows his stuff and is a great teacher!  He is very approachable and is always willing to help even after graduation!",
        "course": "STRINGED"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Dylan",
    "id": "VGVhY2hlci0zMDAxMjU3",
    "lastName": "Crosson",
    "legacyId": 3001257,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dylan is a super guy who really is just there for the vibes. He leads recitation and is able to make kinda boring content into really interesting and engaging discussions. He is very fashionista too, which I appreciate. Lots of snaps for Dylan, hope he slays the PhD life. ",
        "course": "36821"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dylan slays the house boots down! He is a very chill dude but talks about fish and baseball too much...kidding love you king:)",
        "course": "36821"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.3,
    "department": "Music",
    "firstName": "Scott",
    "id": "VGVhY2hlci0yMDA2NDQx",
    "lastName": "Jones",
    "legacyId": 2006441,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr Jones is a shining beacon of positivity in the OSU school of Music. Unlike Tim Leasure, Scott Jones is incredibly thoughtful, kind, passionate, and respectful. Incredible conductor, very passionate about the music. I truly believe Scott Jones cares about his students as people. Wish we had more professors like Scott Jones in the school of music.",
        "course": "MUS2204"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "While Dr. Jones and I have not always seen eye to eye on everything, he is genuinely a kind and caring person. He provides good feedback, and goes out of his way to work with you outside of class. If you show that you are trying, he will notice and go out of his way to help you. He genuinely cares about his students at the end of the day.",
        "course": "MUS2262"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took Symphonic Band with Dr. Jones. He was a fantastic conductor and teacher as well as a very kind and approachable person. It was really obvious he cared about the students that were involved while simultaneously pushing them to do their best.",
        "course": "MUS2204"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Jones is a kind-hearted man who will do anything to help you out. Also, he has a lot of assignments for his conducting class, so you have to keep up. ",
        "course": "MUS2262"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "A fantastic human being and a wonderful teacher. Cares tremendously about what he does and wants the best for his students. However, he is a tough grader and does give assignments in his class.",
        "course": "MUS2404"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "The weekly meetings with Jones are awkward & useless, and he makes sure to drag them out for an hour & a half while other advisors realize this is unnecessary. He assigns deadlines like it's a class, while other advisors understand that we are students with other commitments. Save yourself a headache and choose another advisor, it's not worth it.",
        "course": "STEP"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Jones was one of the Greatest Teachers I've ever had a The Ohio State University every student in his class will learn from him and gain essential knowledge in becoming a musician as well as a becoming a genuine human being. Take Symphonic Band with him if you can it is truly an amazing course.",
        "course": "MUS2404"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Andrea ",
    "id": "VGVhY2hlci0yOTkwNzc4",
    "lastName": "Tinajero Perez",
    "legacyId": 2990778,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Andrea makes what could be a very mundane class fun for her students. She is very kind and understanding during performances, and is always willing to help if you are struggling with something.",
        "course": "music2225"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.3,
    "department": "Music",
    "firstName": "Eugenia",
    "id": "VGVhY2hlci0yMzAxNTgx",
    "lastName": "Costa-Giomi",
    "legacyId": 2301581,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "not it",
        "course": "MUSIC3343"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very passionate, but hated group discussions over zoom every week. Usually a one-page single spaced paper due every week, which wasn't terrible. Overall an OK class, a little more difficult than other music GEs I've taken, but I don't fully regret taking it.",
        "course": "MUSIC3343"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Pretty much hated this class. Doesn't use Carmen. She treats you like children and makes you do activities that are ridiculous. I've learned nothing this semester except, I never want to be a music teacher.",
        "course": "MUS5722"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3,
    "department": "Music",
    "firstName": "Ann",
    "id": "VGVhY2hlci0xMjgzMzE2",
    "lastName": "Stimson",
    "legacyId": 1283316,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I enjoyed Dr. Stimson. She is not as engaging as the other aural professors but she is willing to help those who need it outside of class and wants you to do well. I will say Aural Skills class was a proponent in switching my major, but not because of Dr. Stimson herself.",
        "course": "MUSIC2224"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Stimson is Awesome! She is very flexible and always willing to help. She is better than the TA's for Aural Training.",
        "course": "MUS2225"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "A lot of people didn't like her but I did. She was very helpful when answering questions and seemed genuinely interested in the students. She took the class very seriously but that was okay because I ended up learning more.",
        "course": "MUSIC443"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Music",
    "firstName": "Karen",
    "id": "VGVhY2hlci0yOTcyNDMw",
    "lastName": "Kim",
    "legacyId": 2972430,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Kim simply has no desire to teach and it is clear. A very typical failed musician turned teacher that takes their resentment of the performing world out on their students. Speaks to students in a condescending manner and grades tough when she feels like it. I would avoid taking her keyboard class if you can.",
        "course": "2261"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yOTY3ODIy",
    "lastName": "Harnetty",
    "legacyId": 2967822,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not my cup of tea but the professor really cares about the material and his students. Course was pretty light with two midterm \"sound-art mixing\" projects and some homework sprinkled in throughout. I would recommend if you're interested in music or learning about musical history of Columbus. Really nice and friendly guy too",
        "course": "3352"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 3.8,
    "department": "Music",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yMDA2NDc3",
    "lastName": "Hoch",
    "legacyId": 2006477,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "I emailed the professor to let him know about my medical issues and all I got back in response was that they would not excuse my absences (which were out of my control) and to contact SLDS. I have already contacted them. No compassion from this professor. He also wanted me to provide doctor notes for every absence which is unrealistic. Disappointed",
        "course": "MUSIC220502"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good director.",
        "course": "MUSIC20502"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "I mean, it's marching band, so...",
        "course": "MUSIC220501"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Sammy",
    "id": "VGVhY2hlci0yNTI5MTc3",
    "lastName": "Gardner",
    "legacyId": 2529177,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I cannot recommend Professor Gardner enough. His class was really interesting and he seriously prioritized students' mental health when giving assignments, making sure they weren't overly strenuous. He's a great person. If you can take his Music and the Mind course, please do!!",
        "course": "MUSIC2221"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Sammy is an amazing human being. Give this man a gold medal! I felt like he was my only professor who really understood the toll of covid. And even during the pandemic he was still able to deliver great lectures and really develop my ear.",
        "course": "MUSIC3435"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sammy makes Aural Training a breeze. He makes it clear what you are supposed to learn each lesson, and he knows how to take your musicianship to the next level. He can be a bit awkward, but he is really nice and cares about his students a lot. Best teacher ever. Take any class with him, you won't regret it.",
        "course": "MUSIC2225"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sammy is great. He seems to know everything about music. He is also easy to reach if you don't understand something, and he is happy to explain things either again or in a different way. Sometimes he gets too excited about a topic and talks too fast, which is a treat to watch. Overall, 10/10. An excellent teacher and quality human.",
        "course": "MUSIC2221"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.9,
    "department": "Music",
    "firstName": "Lynn",
    "id": "VGVhY2hlci0xMDg3NDU3",
    "lastName": "Singleton",
    "legacyId": 1087457,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Singleton is one of the best professors at OSU. She cares so much about her students. She deserves Kenneth Williams' job.",
        "course": "MUSIC2263"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent!",
        "course": "MUSI1000"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "I thought this class would be a breeze, but this professor covers A LOT. I missed a few classes (sickness and laziness) and though she was really understanding and even let me make up a quiz I got pretty behind which was tough. It was more material for a basic piano class than I expected.",
        "course": "PIANO101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "101.01 was an easy, fun, interesting class and Lynn was a good instructor.  I'd recommend it to anyone wanting to start playing the piano recreationally or for a fun, easy A.",
        "course": "MUSIC101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Jayne",
    "id": "VGVhY2hlci0yOTA0MjA4",
    "lastName": "Wenner",
    "legacyId": 2904208,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor. Cares about students and makes the class a fun environment to learn.",
        "course": "MUSIC3578"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.4,
    "department": "Music",
    "firstName": "Arved",
    "id": "VGVhY2hlci0yNzM5MDU=",
    "lastName": "Ashby",
    "legacyId": 273905,
    "numRatings": 29,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Ashby is a very kind person and very knowledgeable in his field. Lectures can be hard to keep up with since he goes very slow. Other than that, easiest music history class in college.",
        "course": "MUSIC2242"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a great guy and interesting to listen to. History of Rock &amp; Roll was definitely my favorite class I've ever taken.",
        "course": "MUSIC252"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class should be called the history of music. Not the history of rock and roll. Recitation lectures were not helpful and class lectures were typically pretty boring. I didn't attend a total of 4 classes (class was three time a week) and got a B on attendance. So I'd show up to every single class. 2 papers that are graded with a lot of grace",
        "course": "MUS2252"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Ashby is a passionate professor and Rock and Roll is a great and fun class to take to fulfill a visual/performing arts credit. There are two papers that are graded easily and 3 exams that are easy as long as you use the resources given to you. Lecture outlines are on carmen and recitation TAs use Kahoots that are also posted for studying help.",
        "course": "MUS2252"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "So smart and so fun!!",
        "course": "MUS252"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love Ashby! He's an amazing instructor and clearly is passionate about his subject. He's also really funny and doesn't take himself too seriously. Even if the class isn't required, it's definitely worth taking.",
        "course": "MUS224302"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "this was romantic through 20th century stuff.  required, but definitely the most palatable of other mus hist courses for majors...may be because he taught it(&#63;).  nice guy, good lectures.",
        "course": "MUS243"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really good class to take for VPA GEC. I took it online. It's difficult doing group papers over the net, but we got through them. Not to mention the class is WAY easy!",
        "course": "MUSIC252"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class, no need to buy the text books. Attendance is graded but their is no recitation and lectures are enjoyable. Papers are in groups and are graded very easy. Very good pick for VPA GEC.",
        "course": "MUSIC252"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ashby is a great and amazing teacher.  His class has really inspired me.  I believe in myself a bit more.  He's adorable too.  I hope he adds Tori Amos to his list of rockers!",
        "course": "MUSIC252"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you want a really easy A without going to class ever, please take this class.  I haven't been to class in weeks and got a 100 percent on the midterm.  You definitely don't need to buy the books, so don't waste your money.",
        "course": "MUSIC252"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class was fun and easy. Very clear and helpful. He obviously loves teaching. Group papers were a pain, but no recitation so it was ok. Take this class with Ashby!",
        "course": "MUS252"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class was very fun and easy. Tests were a breeze, papers aren't bad because they are group efforts. The online discussions sure as heck beat recitation. Take history of rock!",
        "course": "MUSIC252"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "MUSIC142"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 1,
        "comment": "I loved this class! I have to agree that the papers were graded way too hard. The only downfall of the class, in my opinion, was the online discussion groups. I really hated those",
        "course": "MUSIC142"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's the best. Everyone should takes his course!!!!",
        "course": "MUS142"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Cares very much about how students do. If you show intrest in subject he will open a whole new world for you to discorver. Loves to teach!!!!!! Lectures give alot of interesting context to the songs that one would have not know about perviously to his course. Strongly recomend taking his course or any that he may teach!!!!",
        "course": "MUS142"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "was really interesting some of the stuff i learned.  dr a was very funny and we went really broad in the topic.  one of the better big classes i've had.  four stars check it out",
        "course": "MUS142"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "the class was beyond disorganized, often went off on tangents that often trailed off, no real grading scale, seemingly could not think on his feet, believes students to actually spend time on online discussions and 2/3 page papers, makes things more difficult then they should be",
        "course": "142"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 5,
        "comment": "Class was easy.....test were super easy...however the papers were graded tough.  Not a bad class if you want an A if you are willing to work a bit on the papers.",
        "course": "MUS142"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "I thought this was a very easy class.  I had no problems with the papers, and I actually enjoyed writing about why I hate Britney Spears for one of the papers.  It's interesting material, though I thought Ashby made some of it kind of boring.",
        "course": "MUS142"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Pretty fun class once you get past the blues songs from 1870.  Grades the papers kinda hard, but you know most of the songs anyway.  Only part that actually sucked was having to do online discussions all the time and getting graded for it.",
        "course": "MUS142"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is a cool guy but he HATES if you leave early while he is talking or playing a song!  So don't leave unless absolutely necessary.  He knows what he is talking about but he grades the papers a little hard.  Still a fun class and easy points if you try hard.",
        "course": "MUS142"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was fun, and while slow at times, who wouldn't love hearing about the history of rock&#63; He was interesting most of the time and was genuinely interested in the material. Worth the time",
        "course": "MUSIC142"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "Sweet and really smart!",
        "course": "MUSIC241"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dude!  Excellent!!  Entirely worthwhile on all levels.",
        "course": "MUS241"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "MUSICHIST"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very funny and realistic about his classes. He calls gregorian chant &quot;Bud(weiser) Music.&quot; The course packet was very helpful and his tests weren't too hard. This is the guy you want for your music history sequence.",
        "course": "MUS241"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ashby rocks!!!",
        "course": "MUS30363"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Music",
    "firstName": "Elena",
    "id": "VGVhY2hlci0yODg5OTM2",
    "lastName": "Cruz-Lopez",
    "legacyId": 2889936,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "She was pretty monotone and made a really interesting subject pretty boring. Not a lot of homework but the essay exams were pretty hard. There was also a final project which was pretty interesting.  ",
        "course": "MUSIC2251"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 2,
    "department": "Music",
    "firstName": "Jim",
    "id": "VGVhY2hlci0xMDI0MDA0",
    "lastName": "Akins",
    "legacyId": 1024004,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is the worst professor ever. He has been grooming his students for years and gets away with it  ",
        "course": "MUSIC402"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Sexist, racist, homophobic. Makes me hate music.",
        "course": "MUSIC402"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Though he is a professional orchestral musician, he is a bit out of touch with the music world. His communication skills are lacking at best, and don't expect him to reply to emails. He doesn't seem to care about his job at OSU, as he doesn't show up and have his TA cover, and fell asleep in a couple of lessons. He is inconsistent in expectations.",
        "course": "MUSIC402"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great!",
        "course": "MUSIC402"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Music",
    "firstName": "Jason",
    "id": "VGVhY2hlci0yODYzMzIw",
    "lastName": "Buchea",
    "legacyId": 2863320,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "While Jason definitely has good intentions, my biggest problem is how the class is structured. On some assignments, the instructions were subjective and he took points off no obvious reason. Also there aren't too many assignments to offset exam grades, which are time crunching especially with matching. Overall not a bad class but won't take again.",
        "course": "Music2252"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Robert",
    "id": "VGVhY2hlci0yODYyNzIy",
    "lastName": "Bode",
    "legacyId": 2862722,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've been in the OSU Chorale for about a year and a half now, and I'm so glad I am. He's by far my favorite choir teacher I've ever had. I'm a business major, but every time I come to class, I think more and more about switching to a music major. 1000% Recommend. ",
        "course": "MUSIC220301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Music",
    "firstName": "Dana",
    "id": "VGVhY2hlci0yNzI4MTUx",
    "lastName": "Carlson-Kottke",
    "legacyId": 2728151,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The absolute worst Professor I ever had! She wouldnt excuse me to take my exams because of a reason that was outside my control! Tried to talk to the department they were even worse! Wouldnt recommend",
        "course": "MUSIC2216"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Music",
    "firstName": "Richard",
    "id": "VGVhY2hlci0yNjY2NDQ1",
    "lastName": "Palese",
    "legacyId": 2666445,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Palese is like that band director who would give homework in band class. Or like the teacher who assigned reading over break. He expects woodwind players with 2 weeks of experience to play like professionals, and he will make you redo assignments until his weird standards are met. Dr. Palese is too &quot;Type A&quot; for his own good.",
        "course": "MUS226204"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Phallic Palese is a bad teacher. It seems like he had a hard time growing up and is taking that out on students that remind him of people he doesn't like. He is willing to fail you on a project for missing one detail of an assignment even if you have 90% of it completed properly.",
        "course": "MUSIC226204"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Misogynistic- talks over female students when they are trying to teach or present and then grades them badly for not explaining themselves well even though he didnt give them any time to speak or even taught their lessons for them.",
        "course": "MUSIC226204"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2.8,
    "department": "Music",
    "firstName": "Thomas",
    "id": "VGVhY2hlci0yMDMwOTA3",
    "lastName": "Wells",
    "legacyId": 2030907,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Not a reliable teacher. Class cancelled every time. &quot;We'll make it up later&quot;. Received an A for doing no work.",
        "course": "MUS678"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "memorable class",
        "course": "524"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Andy",
    "id": "VGVhY2hlci03ODk0NTU=",
    "lastName": "Blosser",
    "legacyId": 789455,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best teachers you will ever have. Is super caring and will do anything to see you succeed. He is extremely knowledgeable and easy to work with. If you have the chance to study with him, you wont regret it.",
        "course": "MUSI2201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great music professor!",
        "course": "MUS20121"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome!",
        "course": "MUSI2201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Andy is an awesome teacher, I have learned so much from him this quarter! And he has a great tenor voice and is just overall a nice man!  Yah Blosser!",
        "course": "MUS20121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 1.8,
    "department": "Music",
    "firstName": "Jere",
    "id": "VGVhY2hlci0xMzUzNDc=",
    "lastName": "Forsythe",
    "legacyId": 135347,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Worst professor I ever had at tOSU. Just a research guy that has very little real world teaching experience, but wants you to think that his ways are the best. If its not in a book-he doesnt know it.",
        "course": "MUSIC470"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "One of the worst professor I had. For some reason did not like me since we met and remember him telling me &quot;I don't think you can get through the program&quot;. Says the guy who never taught in public schools.... what a joke.",
        "course": "MUS470"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Worst teacher ever and the only one who taught the class.  Was cut from the music education program because of him.",
        "course": "MUS470"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "For the class, it's not easy to pass. However, he is not a passionate or helpful teacher even though you thought he would be. He would talked a lot to you but that's only thing he did.",
        "course": "MUS470"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "He was my academic advisor and he knew absolutely nothing about the coursework required to complete the BME. I think he's a decent man but a hopeless professor.",
        "course": "MUS470"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Very disorganized.",
        "course": "MUSIC875"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 1,
        "comment": "Frankly, I do not understand how, frankly, he got as far as he did within the SOM, or, frankly, his career considering his lack of experience.",
        "course": "MUSIC470"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very intelligent. Stays up to date with music ed issues, although his personal teaching style is quite dated.  Lectures often turn into tangents on unrelated topics.",
        "course": "MUS470"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "Frankly, he's unclear about what kind of guidelines to use for essays-  just write on a topic.  This is bad since the course counts as a second writing class requirement.",
        "course": "MUS470"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.6,
    "department": "Music",
    "firstName": "Marshall",
    "id": "VGVhY2hlci03MjYyMTI=",
    "lastName": "Haddock",
    "legacyId": 726212,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Marshall was a great conductor, and teacher.",
        "course": "ORCH315"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "While Haddock might have some good musical ideas, all other aspects of his conducting are horrible. He is rude and demeaning, his conducting is horrible to follow, and his class is torture to sit through. His mood can go from okay to scary in seconds. You shouldn't have to \"get used\" to the way he communicates to students. It's not appropriate.",
        "course": "MUSIC2250"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "I see some students are saying that you just have to get used to Haddock and he's showing students what the real world of music is like and that is 100% absolutely not the case. Professional orchestra conductors are selected because they are not like Haddock and are great at what they do b/c  they encourage beautiful music respectfully and kindly.",
        "course": "MUSIC2215"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "All Haddock does is yell at the students and gets furious when they cannot perform a piece the way he wants it before he tells us how he wants it - if we played it perfectly, he wouldn't  have a job. Soloists are brought to the first rehearsal when students are SIGHTREADING bc no music was given in advance. There is no professionalism in the class.",
        "course": "MUSIC2215"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "I'm a music major who has played in many orchestras across the country. I can honestly say I have never experienced anything like prof. Haddok before. He is hard to work with and unclear on what he wants. Rehearsals are long and tedious and last forever. ",
        "course": "MUS2215"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "incredible teacher. typical artist temper but his knowledge is incredible. I've taken three classes with the Maestro and am looking for more. as a violinist and singer, the wealth and range of expertise brings a depth and richness that is a are and special combination.",
        "course": "780302"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Having worked with many levels of orchestras around the country, I have a pretty wide tolerance for conductors. Haddock, however, is worse than useless.  His conducting is imprecise, unplanned, and incomprehensible.  He yells at students who have no chance of realizing his desires and belittles anyone who attempts a semblance of professionalism.",
        "course": "MUSIC780"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely amazing teacher. Learned so much. He can be a little scary... but you get used to it. He really understands the music and conducts it wonderfully. Also picks great music to play",
        "course": "MUSORCH"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 5,
        "comment": "He's ruthless, but he knows more about music than any other conductor I've ever worked with. Listen to him, and you'll learn a lot. Don't take what he says personally. Take what he says and apply it.",
        "course": "MUSIC215"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Marshall Haddock is an incredible conductor. His knowledge is unparalled in its applications and diversity. He will take a whiny, cookie-dough musician and show them what the real music world is like. You have to work diligently and learn to have thick skin, but the end result is a better smarter, tougher, more well-rounded musician.",
        "course": "ORCH315"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "Where do I begin. One of the worst teachers I've ever had. Disrespectful, rude, and boring. He treats the students as if they are working for him and not him for the students. This guy made me hate orchestra.",
        "course": "MUS215"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 2.9,
    "department": "Music",
    "firstName": "Emily Alane",
    "id": "VGVhY2hlci0xNjIwMTgy",
    "lastName": "Erken",
    "legacyId": 1620182,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved taking this class with Dr. Erken. The quizzes were all easy As and the discussion boards were actually kind of enjoyable",
        "course": "MUSIC252"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not sure why she has these bad reviews! Professor Erken is amazing! Her lectures are a bit long, but all interesting and she is very passionate about music. As long as you participate and put forth the effort, you will pass- even if you mess up some terms, she'll explain what you did wrong but still give you credit. Overall amazing and recommended!",
        "course": "MUSIC2252"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Took the online class with Professor Erken. Lectures were long and boring, she's very hard to contact outside of class, took almost 2 weeks to hear anything about an assignment. Class seems pointless but it is an easy A if you pay attention.",
        "course": "MU3348"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Music Lit with Emily Erken is where dreams go to die.  Her lectures are worthless and taken from Wikipedia, her homework assignments are long but completely meaningless, and she is stubborn and unwilling to receive the classes opinions. Also she never seems intelligent because she mispronounces names of composers. Avoid this class at all costs.. ",
        "course": "MUSIC122"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very boring, she spent class reading her presentations (which were pulled from wikipedia) and occasionally referencing out of class readings. Homework assignments were long, boring and were never referenced until midterms/finals. Overall, awful.",
        "course": "MUS121"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "I took the online component. The syllabus says it is a five hour class and should be treated like one but it is hard when the professor does not treat it like one. \"lectures\" were not very interesting and papers we had to write were pointless and never graded. He discussions seemed like they wanted us to debate one another. horrible class",
        "course": "MUSIC252"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "worst prof ive ever had. takes forever to grade papers. so you dont know what to do and when to start the next one. readins are pointless",
        "course": "MUSIC252"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "She makes class interesting, but she assigns TOO MUCH homework. I usually spend most of my time on music homework and have no time for other courses.",
        "course": "MUSIC251"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really interesting class",
        "course": "MUS123"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 1.4,
    "department": "Music",
    "firstName": "Ellen",
    "id": "VGVhY2hlci0xODEzOTYz",
    "lastName": "Archambault",
    "legacyId": 1813963,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful! Simply awful,Good Lord,If you have prior experience in music,Maybe this is for you. If youre a beginner beginner, RUNNNNNN its honestly an awful class with a very condescending teacher who doesnt know how to teach and Im stuck.",
        "course": "MUSIC2221"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you have Theory with her, run. If you dont know something, she will talk down to you and act like you should know everything despite this being the first course in Theory.",
        "course": "MUSIC2221"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The course moves so quickly and she grades very hard. If you miss one note of a line, she takes off points for the whole line. Homework every day of class as well. Had to drop to save my grade.",
        "course": "MUSIC2221"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Archambault is a nice lady.  She grades very leniently, has a fair homework policy, and always tries to be as helpful as possible.  However, she doesn't lecture.  You watch online videos, do a worksheet over it, and then she answers questions.  I literally just went to class to turn papers in.",
        "course": "MUSIC2221"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Music",
    "firstName": "Edward",
    "id": "VGVhY2hlci0yNDU2ODYy",
    "lastName": "Bak",
    "legacyId": 2456862,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Bak is a wonderful professor. He's very approachable and easy to talk to. He gives wonderful feedback and is considerate of how difficult zoom music classes can be. I would definitely take Dr. Bak again. He's very supportive of his students and loves to see growth.",
        "course": "MUSIC1101"
      }
    ],
    "SEI": []
  }
]