[
  {
    "avgDifficulty": 4.5,
    "avgRating": 2,
    "department": "Natural Resources",
    "firstName": "Bob",
    "id": "VGVhY2hlci05OTAzMDM=",
    "lastName": "Gates",
    "legacyId": 990303,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "The professor is pretty much useless. The man just comes into the lecture and sometimes he doesn't even do that. he will just not show up to classes for conferences or his own personal research. Most of the directions for what you need to be doing are given by the TAs not the actual man in charge of teaching the class. ",
        "course": "ENR5362"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "I refer to Dr. Gates as the \"Benjamin Button of professors\" because as he tries to explain things, they become less and less clear. He talks in circles and wastes a lot of class time. The other professor for the class told us on day 1 that we would all fail Dr. Gates' lab practical, and he was right. Very tough grader.",
        "course": "ENR5362"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "He may be confusing and expect a lot out of the students but he is a great resource and really cares about the students' future careers. If he doesn't have a lot of time it's because he's a big deal in the field. One on one and in labs he is very friendly and passionate about the class.",
        "course": "ENR5362"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "All he does is read off of his instruction sheets, which are almost always WRONG. So he tries to fix them in class... and wastes everyone's time. He talks in circles and is almost never prepared for class.  He knows what he's doing but has 0 idea how to actually convey it to us as students and expects us to know things not covered in the pre-reqs!",
        "course": "ENR5362"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "He's not helpful at all. The lectures are boring and the tests are hard. In one midterm, the whole class was still there by the end and he said \"Ok I have to collect the tests now because I have somewhere to be\". So no one finished and he didn't offer a chance to finish it. Sucks he's the only professor for this class.",
        "course": "ENR5362"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "I really like Bob as a professor and teacher. Sometimes he talks in circles and his lectures can be pretty boring, but out in the field he is in his element. Very friendly and funny. I don't know why the previous reviews are so negative.",
        "course": "ENR606"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "I agree. He's arrogant, gets offended by questions,and grades very harsh. Despite class not having prereqs, he assumes you know things not covered in class or in book.",
        "course": "ENR624"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Bob is very difficult as a teacher, not just in the difficulty of the course, but is very un-apporachable outside of class, has no interest in helping undergrad students. He acts as if you are wasting his time.",
        "course": "ENR606"
      }
    ],
    "SEI": []
  }
]