[
  {
    "avgDifficulty": 4.5,
    "avgRating": 2,
    "department": "Natural Resources",
    "firstName": "Bob",
    "id": "VGVhY2hlci05OTAzMDM=",
    "lastName": "Gates",
    "legacyId": 990303,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "The professor is pretty much useless. The man just comes into the lecture and sometimes he doesn't even do that. he will just not show up to classes for conferences or his own personal research. Most of the directions for what you need to be doing are given by the TAs not the actual man in charge of teaching the class. ",
        "course": "ENR5362"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "I refer to Dr. Gates as the \"Benjamin Button of professors\" because as he tries to explain things, they become less and less clear. He talks in circles and wastes a lot of class time. The other professor for the class told us on day 1 that we would all fail Dr. Gates' lab practical, and he was right. Very tough grader.",
        "course": "ENR5362"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "He may be confusing and expect a lot out of the students but he is a great resource and really cares about the students' future careers. If he doesn't have a lot of time it's because he's a big deal in the field. One on one and in labs he is very friendly and passionate about the class.",
        "course": "ENR5362"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "All he does is read off of his instruction sheets, which are almost always WRONG. So he tries to fix them in class... and wastes everyone's time. He talks in circles and is almost never prepared for class.  He knows what he's doing but has 0 idea how to actually convey it to us as students and expects us to know things not covered in the pre-reqs!",
        "course": "ENR5362"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "He's not helpful at all. The lectures are boring and the tests are hard. In one midterm, the whole class was still there by the end and he said \"Ok I have to collect the tests now because I have somewhere to be\". So no one finished and he didn't offer a chance to finish it. Sucks he's the only professor for this class.",
        "course": "ENR5362"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "I really like Bob as a professor and teacher. Sometimes he talks in circles and his lectures can be pretty boring, but out in the field he is in his element. Very friendly and funny. I don't know why the previous reviews are so negative.",
        "course": "ENR606"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "I agree. He's arrogant, gets offended by questions,and grades very harsh. Despite class not having prereqs, he assumes you know things not covered in class or in book.",
        "course": "ENR624"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Bob is very difficult as a teacher, not just in the difficulty of the course, but is very un-apporachable outside of class, has no interest in helping undergrad students. He acts as if you are wasting his time.",
        "course": "ENR606"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.9,
    "department": "Natural Resources",
    "firstName": "Amanda",
    "id": "VGVhY2hlci05OTAzMTA=",
    "lastName": "Rodewald",
    "legacyId": 990310,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "great class. lots of easy points but hard exams. GREAT PROFESSOR!!!!",
        "course": "ENR5360"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "she is a great prof.",
        "course": "ENR623"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Rodewald is one of the best professors I have ever had. She truly cares about her students in and out of the classroom. She is very good at connecting the material to real life and on top of it all she is hilarious!",
        "course": "ENR623"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a wonderful professor who really seems to enjoy teaching.  She always makes time to help her students, and all of the classes that I have had with her so far have been a lot of fun.  She is definitely one of my favorite professors.",
        "course": "ENRH231"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great class and professors!",
        "course": "ENR231H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Rodewald is so amazing! She is genuinely interested in helping students and makes an effort to get to know them.",
        "course": "ENR623"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great prof both in and out of class. Knowledgeable with contagious enthusiasm about subject material and very approachable. Also a helpful and insightful research adviser who thinks outside the box and helps students explore their own interests.",
        "course": "ENR231"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "A very helpful and enthusiastic professor. Very funny, clear, relateable, and knowledgeable when talking about her subject. Offered me a lot of research opportunities as a sophomore and full of advice for the future. If you like birds, definitely take her class(es)!",
        "course": "ENR230"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Wonderful Professor, always helpful and friendly. She is enthusiastic about class topics and teaching, she definitely knows her stuff. I would recommend this class to anyone interested in natural resources.",
        "course": "ENR623"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "great prof who is very easy to talk to and conducts class in a fun way.",
        "course": "ENR231"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, doesn't just read from power points, very helpful both woth class material and advising, also gives many undergrades out of class researching experience, I would definitly recommend this professor, especially to anyone interested in birds",
        "course": "ENR623"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher.  Finding a teacher in natural resources that does not just read power points is great",
        "course": "ENR623"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "ENR231"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Enthusiastic about teaching. Very helpful. Very respectful of students. Fun.",
        "course": "EEOBSECT"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best teachers I have had at OSU. She is interesting as a lecturer and is incredibly helpful. You can stop by her office or catch her after class, and she will give you great advice on anything, jobs, grad school, a course you're taking, etc.. I would definitely recomend her.",
        "course": "ENRH231"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.4,
    "department": "Natural Resources",
    "firstName": "William",
    "id": "VGVhY2hlci04MTYyNzg=",
    "lastName": "Mitsch",
    "legacyId": 816278,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I took two of Dr. Misch's classes at OSU and had different experiences in both.  One was his general wetlands ecology class and the other ecosystem restoration.  Eco Rest was by far the more interesting class - it is smaller so you get more personal attention and discussion. Tests are not hard if you read and study his book. He's a great prof!",
        "course": "SENR725"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class is mostly about memorizing the book which was recently split into two books of which one is required and one recommended for the class. Knowledge in this class is ultimately useless since it is simple memorization. Buy the book and you will have taken the class. Wetland labs fail to make students think either.",
        "course": "ENR725"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love Professor Mitsch. He is really nice. He does grade really hard but I learned alot- which is really what matters. I would recommend him any day but you have to love wetlands and Odum.",
        "course": "ENR725"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Too much memoriz. of basics and not enough concept/big picture/current status of the subject.  The OR wetland field part is a JOKE, because few stus have necessary tech abilities, and expt. results apparently go into the annual ORW report.  Kinda scary comment on his research.  Newest text edition has the kitchen sink--needs EDITING!",
        "course": "WETLANDS"
      }
    ],
    "SEI": []
  }
]