[
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Near Eastern Studies",
    "firstName": "Sean",
    "id": "VGVhY2hlci0yMDk5NTY3",
    "lastName": "Anthony",
    "legacyId": 2099567,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "He's a pretty good prof and gives good lectures but I swear he favors the people with islamic background. ",
        "course": "ARABIC3601"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I have ever had. His lectures are very interesting and highly entertaining. Go to office hours, too--you will learn even more fascinating stuff and get a sort of sneak-peek preview of future lecture content details. There is a LOT of reading and writing in this course, but if you stay on top of things, it is manageable.",
        "course": "ARABIC3705"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great lecturer, small class. I would only take this course if you're really into Quran and be ready to ready many surahs per class. I enjoyed the course it made me really think, the amount of effort you put in shows in your grade. ",
        "course": "ISLAM5701"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have now had professor Anthony twice and enjoyed both classes. He works very hard to make the material enjoyable and the assessments are about as fair as they come.",
        "course": "ISLAM3355"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "It's obvious that he really knows his stuff but his lectures are a pain to sit through but you have to come to class because he occasionally gives pop quizzes over last night's reading. Even though the work load is minimal nothing connected well to each other. You can write the essays without understanding the readings and the lectures.",
        "course": "ARAB2701"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "I wouldn't recommend him to my worst enemy. Sure he's very knowledgeable and ambitious, but in my experience he's was rude and almost felt like he wanted us to fail. Graded on: he gives simple pop quizzes here and there usually around 2 questions. three essays in total and hw due every class period. and he doesn't post grades till the very end.",
        "course": "ARABIC2701"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Took (Intro to Islam) to boost GPA, since I have studied Islam, I thought this course would be an easy A . 90% of the stuff taught was familiar. 2 exams, 5 pg essay &amp; participation is to email him three questions from the reading assignment b4 the next class. I was disappointed, he ensures that you do not get an A. Will take him again ever.",
        "course": "NELC3501"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Im gonna be honest, there were reasons I stressed out over NELC 3501. One of those reasons was the ridiculous amount of reading assigned. Im talking like 60-80 pages due each class. However, Professed Anthony is easily the most interesting lecturer Ive ever had. He knows his stuff and hes been around the world quite a bit. It made it worth it.",
        "course": "NELC3501"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "The Professor is extremely knowledgeable and is compassionate about the subject. He makes some pretty good jokes and tries his best to keep the class interested in an otherwise VERY dull subject, but sometimes he makes off-topic political comments. Attendance is not mandatory, however he does give pop quizzes without warning, so go!",
        "course": "ARAB2701"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Anthony is a great professor if you are not a busy student. He is very knowledgeable and I have learned a lot of interesting stuff from him. However, he has a very strict approach to how he handles his students. Get things done on his time and you'll be great.",
        "course": "ARAB2701"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Funny, very helpful and knowledgeable on just about everything. Might pick on you but don't take it personally. If taking Arabic philosophy, the material is dense but Prof. Anthony is very willing to help",
        "course": "ARABIC3601"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Near Eastern Studies",
    "firstName": "Ceyda",
    "id": "VGVhY2hlci0yNjUwNDY3",
    "lastName": "Steele",
    "legacyId": 2650467,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very Easy class if you want an easy A definitely take this class if you have a language requirement.  ",
        "course": "TURKISH1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ceyda was one of my best professors at osu I loved attending her lectures and looked forward to every class. You feel like she is more of a friend than a professor, loved her! Would definitely recommend.",
        "course": "TURKISH1101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof made online learning Turkish a great experience! Show up to class and participate and you will do well. She goes fast sometimes, but I would just mark pages in the textbook I wanted to review/missed and go over them again after class. Not to much homework and the exams and midterms are manageable, just ask questions and she will help you prep!",
        "course": "TURKISH1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.2,
    "department": "Near Eastern Studies",
    "firstName": "Ehsan",
    "id": "VGVhY2hlci0xOTk5ODE0",
    "lastName": "Estiri",
    "legacyId": 1999814,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's a really nice and laid-back back, great professor and he made sure I was always doing good and caught up with assignments and stuff. Wouldn't take a folklore class again, not my thing, but he was a great professor. Quizzes are really hard, but. I managed to pass my class.  ",
        "course": "ENGL2210"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Estiri managed to make an online folklore class one of the most interesting and engaging classes I ever took. I am a computer science major and just took this class for a general and I L O V E D this class! He is a very fair grader and his assignments were extremely interesting and reasonable.",
        "course": "ENGL2210"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He only had papers and discussion questions/responses. Make sure you show up though as every unexcused absence reduces your grade 3%.",
        "course": "NELC3204"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hes really nice and laid back, great professor and he made the class really fun and interesting. Would def have him again if i could",
        "course": "NELC2244"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "No mid or final exam so made it easy. You choose your final project, it can be a short video you make on your own with your phone. Lectures are interesting, and the professor makes sure everyone is participating in class. Opinion matters in this course!",
        "course": "NELC3204"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent!",
        "course": "NELC3204"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "It was an easy class for me. He asks insightful questions, doesn't force people to talk.  Eshan was easy going and informal, but He can be forceful with his opinions.",
        "course": "NELC3204"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "No exam, just a final project and you choose your own final project topic",
        "course": "NELC3204"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "His grading criteria is messed up just like the class. He's not clear on what he expects until the assignment is graded. We never used a textbook nor were we assigned one so idk what everyone else is talking about. The class would be better with someone else who is open to other ideas and is clear on grading and expectations.",
        "course": "NELC3204"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "He focused on main themes and concepts that can be applied to a variety of topics. He is flexible and understanding with absences and work turned in late.",
        "course": "NELC3204"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "Definitely an interesting professor. He really knows what he is talking about. He is clear during the lectures and gives extra credit if you do all the reading responses. The class is super easy. He makes things very simple to understand.",
        "course": "3204NELC"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "Light reading load and no exam. The class could be more organized, but overall it's easy and low-stress.",
        "course": "NELC3204"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "I thought this class would be interesting but turned out to be horrible & unclear on everything. Ehsan has his own opinions & is not open to accepting or hearing what other students have to say. For a class that was suppose to speak about the Middle east, all we talked about was Iran. He has 300-400 reading responses that take forever to  be graded",
        "course": "NELC3204"
      }
    ],
    "SEI": []
  }
]