[
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.2,
    "department": "Near Eastern Studies",
    "firstName": "Ehsan",
    "id": "VGVhY2hlci0xOTk5ODE0",
    "lastName": "Estiri",
    "legacyId": 1999814,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's a really nice and laid-back back, great professor and he made sure I was always doing good and caught up with assignments and stuff. Wouldn't take a folklore class again, not my thing, but he was a great professor. Quizzes are really hard, but. I managed to pass my class.  ",
        "course": "ENGL2210"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Estiri managed to make an online folklore class one of the most interesting and engaging classes I ever took. I am a computer science major and just took this class for a general and I L O V E D this class! He is a very fair grader and his assignments were extremely interesting and reasonable.",
        "course": "ENGL2210"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He only had papers and discussion questions/responses. Make sure you show up though as every unexcused absence reduces your grade 3%.",
        "course": "NELC3204"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hes really nice and laid back, great professor and he made the class really fun and interesting. Would def have him again if i could",
        "course": "NELC2244"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "No mid or final exam so made it easy. You choose your final project, it can be a short video you make on your own with your phone. Lectures are interesting, and the professor makes sure everyone is participating in class. Opinion matters in this course!",
        "course": "NELC3204"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent!",
        "course": "NELC3204"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "It was an easy class for me. He asks insightful questions, doesn't force people to talk.  Eshan was easy going and informal, but He can be forceful with his opinions.",
        "course": "NELC3204"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "No exam, just a final project and you choose your own final project topic",
        "course": "NELC3204"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "His grading criteria is messed up just like the class. He's not clear on what he expects until the assignment is graded. We never used a textbook nor were we assigned one so idk what everyone else is talking about. The class would be better with someone else who is open to other ideas and is clear on grading and expectations.",
        "course": "NELC3204"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "He focused on main themes and concepts that can be applied to a variety of topics. He is flexible and understanding with absences and work turned in late.",
        "course": "NELC3204"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "Definitely an interesting professor. He really knows what he is talking about. He is clear during the lectures and gives extra credit if you do all the reading responses. The class is super easy. He makes things very simple to understand.",
        "course": "3204NELC"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "Light reading load and no exam. The class could be more organized, but overall it's easy and low-stress.",
        "course": "NELC3204"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "I thought this class would be interesting but turned out to be horrible & unclear on everything. Ehsan has his own opinions & is not open to accepting or hearing what other students have to say. For a class that was suppose to speak about the Middle east, all we talked about was Iran. He has 300-400 reading responses that take forever to  be graded",
        "course": "NELC3204"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Near Eastern Studies",
    "firstName": "Trisha",
    "id": "VGVhY2hlci0yMzY3NzU2",
    "lastName": "Myers",
    "legacyId": 2367756,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Not sure how long Trisha will be here or if shes still teaching any classes but if by chance you get her as an instructor or TA shes amazing. I had her as an instructor for 3205 NELC and she did not disappoint. She knows her stuff and gives her lectures with passion. I wish I could take another class from her because she was a great instructor.",
        "course": "NELC3205"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.3,
    "department": "Near Eastern Studies",
    "firstName": "Sean",
    "id": "VGVhY2hlci0yMDk5NTY3",
    "lastName": "Anthony",
    "legacyId": 2099567,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "He's a pretty good prof and gives good lectures but I swear he favors the people with islamic background. ",
        "course": "ARABIC3601"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I have ever had. His lectures are very interesting and highly entertaining. Go to office hours, too--you will learn even more fascinating stuff and get a sort of sneak-peek preview of future lecture content details. There is a LOT of reading and writing in this course, but if you stay on top of things, it is manageable.",
        "course": "ARABIC3705"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great lecturer, small class. I would only take this course if you're really into Quran and be ready to ready many surahs per class. I enjoyed the course it made me really think, the amount of effort you put in shows in your grade. ",
        "course": "ISLAM5701"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I have now had professor Anthony twice and enjoyed both classes. He works very hard to make the material enjoyable and the assessments are about as fair as they come.",
        "course": "ISLAM3355"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "It's obvious that he really knows his stuff but his lectures are a pain to sit through but you have to come to class because he occasionally gives pop quizzes over last night's reading. Even though the work load is minimal nothing connected well to each other. You can write the essays without understanding the readings and the lectures.",
        "course": "ARAB2701"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "I wouldn't recommend him to my worst enemy. Sure he's very knowledgeable and ambitious, but in my experience he's was rude and almost felt like he wanted us to fail. Graded on: he gives simple pop quizzes here and there usually around 2 questions. three essays in total and hw due every class period. and he doesn't post grades till the very end.",
        "course": "ARABIC2701"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Took (Intro to Islam) to boost GPA, since I have studied Islam, I thought this course would be an easy A . 90% of the stuff taught was familiar. 2 exams, 5 pg essay &amp; participation is to email him three questions from the reading assignment b4 the next class. I was disappointed, he ensures that you do not get an A. Will take him again ever.",
        "course": "NELC3501"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Im gonna be honest, there were reasons I stressed out over NELC 3501. One of those reasons was the ridiculous amount of reading assigned. Im talking like 60-80 pages due each class. However, Professed Anthony is easily the most interesting lecturer Ive ever had. He knows his stuff and hes been around the world quite a bit. It made it worth it.",
        "course": "NELC3501"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "The Professor is extremely knowledgeable and is compassionate about the subject. He makes some pretty good jokes and tries his best to keep the class interested in an otherwise VERY dull subject, but sometimes he makes off-topic political comments. Attendance is not mandatory, however he does give pop quizzes without warning, so go!",
        "course": "ARAB2701"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Anthony is a great professor if you are not a busy student. He is very knowledgeable and I have learned a lot of interesting stuff from him. However, he has a very strict approach to how he handles his students. Get things done on his time and you'll be great.",
        "course": "ARAB2701"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Funny, very helpful and knowledgeable on just about everything. Might pick on you but don't take it personally. If taking Arabic philosophy, the material is dense but Prof. Anthony is very willing to help",
        "course": "ARABIC3601"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Near Eastern Studies",
    "firstName": "Ceyda",
    "id": "VGVhY2hlci0yNjUwNDY3",
    "lastName": "Steele",
    "legacyId": 2650467,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very Easy class if you want an easy A definitely take this class if you have a language requirement.  ",
        "course": "TURKISH1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ceyda was one of my best professors at osu I loved attending her lectures and looked forward to every class. You feel like she is more of a friend than a professor, loved her! Would definitely recommend.",
        "course": "TURKISH1101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof made online learning Turkish a great experience! Show up to class and participate and you will do well. She goes fast sometimes, but I would just mark pages in the textbook I wanted to review/missed and go over them again after class. Not to much homework and the exams and midterms are manageable, just ask questions and she will help you prep!",
        "course": "TURKISH1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Near Eastern Studies",
    "firstName": "Nada",
    "id": "VGVhY2hlci0yMTM1MzMw",
    "lastName": "Moumtaz",
    "legacyId": 2135330,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nada really makes an effort to get students to understand the content. The textbook is very easy to digest; supplementary books were quick to read and really left an impression. She focuses on concepts and circles back around to them often. If you read and answer study questions before class like she asks, you will be solid on quizzes and exams.",
        "course": "INTSTDS2200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 4,
    "department": "Near Eastern Studies",
    "firstName": "Joe",
    "id": "VGVhY2hlci0yMDEyMzMy",
    "lastName": "Price",
    "legacyId": 2012332,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 5,
        "comment": "I took the \"Mythology of Ancient Egypt and Mesopotamia\" expecting it to be fun, interesting, and pretty easy. WRONG. There are daily quizzes over homework (about 2-4 hours worth a night), a paper due, and the exams are graded very harshly and are all short answerfill in the blank. DO NOT TAKE THIS CLASS. YOU WILL REGRET IT. IT WAS A NIGHTMARE. ",
        "course": "NELC3700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.9,
    "department": "Near Eastern Studies",
    "firstName": "Ryan",
    "id": "VGVhY2hlci0xODExODk1",
    "lastName": "Schaffner",
    "legacyId": 1811895,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Schaffner is great and funny. He is pretty serious about getting your stuff in on time and showing up to class. The content is interesting and he makes it even more interesting. The class is really easy. You could spend a day on a paper and still get an A.",
        "course": "NELC3702"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Definitely a great easy A class. Will take up a decent amount of time reading, however you can normally get by from just skimming. Participation quiz from weekly readings are easy, just be sure to do the readings so when you get to your midterm papers they aren't as hard to write because you will need to recall info from the readings.",
        "course": "NELC3702"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This is a GE lit class and it was really awesome. Great professor! He responds to questions and concerns quickly and gives lots of opportunity for extra credit. Texts are mostly online. Interesting material that can sometimes be quite difficult, but he makes it clear and understandable. Would definitely recommend this guy.",
        "course": "NELC3702"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great beard, better personality, even his substitutes are nice!  Class is one of the best GE's I have taken at OSU",
        "course": "NELC"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "The best lecturer in OSU! A great man. Know his field well. Reading materials are quite difficult but his slides makes everything easy. Got nearly perfect score for every midterm and final exams. Quizzes every class but very easy because you'll get credit as long as you write something, more like attendance. Highly recommend. Funny and awesome guy",
        "course": "NELC3501"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class, awesome professor.",
        "course": "NELC3105"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ryan is a great teacher! Friendly, hilarious, and really knows his field. He is reasonable with the course load and puts all the readings online so no textbook.",
        "course": "NELC3501"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best teachers I've ever taken at osu! The class was super easy and ryan is hilarious! If you're even considering taking him don't even think twice!",
        "course": "NELC3501"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.8,
    "department": "Near Eastern Studies",
    "firstName": "Snjezana",
    "id": "VGVhY2hlci0xMDU0NjE2",
    "lastName": "Buzov",
    "legacyId": 1054616,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Buzov is an excellent professor and a wonderful lady.  It has been a while since I took the class. I wish I could take more classes with her.",
        "course": "NELC372"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good, just do the readings and ask questions if youre confused",
        "course": "NELC372"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Buzov is a very sweet lady and she is very knowledgeable about the subject matter. HOWEVER, she is extremely unorganized and sometimes unprofessional as well. She takes weeks to grade exams and gives little to no guidelines on how to complete some assignments.  Great person not great instructor.",
        "course": "NELC372"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "i don't know how much i can stress this, DO THE READS...she becomes uneasy when students don't do their readings. come to class early because there is a pop quiz at the beginning of the class. overall is was easy class as long you keep up with the readings. there is that word again lol",
        "course": "NEL372"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "DO THE READINGS, OR U WILL NOT DO WELL IN THE ASK. she likes students to do their reading so she can have engaging discussion about the text. overall it was a easy GEC as long u do the work. she is sweetheart :) . there is pop quiz so make sure u do attend class, and there is a midterm , final.. i recommand ppl to take this class but u do the work!",
        "course": "NELC372"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "DO THE READINGS, OR U WILL NOT DO WELL IN THE ASK. she likes students to do their reading so she can have engaging discussion about the text. overall it was a easy GEC as long u do the work. she is sweetheart :) . there is pop quiz so make sure u do attend class, and there is a midterm , final.. i recommand ppl to take this class but u do the work!",
        "course": "NELC372"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "I got a good grade in the class by attending lectures and doing most of the reading. She is very helpful and really knowledgeable.",
        "course": "ISLM372"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Buzov is an excellent teacher. I really learned a lot.",
        "course": "NELC675"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "she is very very BORING and disorganized for class...she picks good books to read but then practically reads them too u in class.. she has you write stupid papers to make sure you did the readings ..midterm and fial are take home papers that are so disorganized the topics are about nothing in the class",
        "course": "NELC675"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Near Eastern Studies",
    "firstName": "Allen",
    "id": "VGVhY2hlci0xNzk0NDY0",
    "lastName": "Tuazon",
    "legacyId": 1794464,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Allen was one of the best teachers I've had so far! Extremely clear, funny, and cares about you as a student. He grades generously too! Highly recommended. YOU SHOULD TAKE THIS CLASS Arabic 2701",
        "course": "ARABIC2701"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, really flexible and understanding.  Just show up and you'll be surprised how much he can make you care about an obscure topic. Funny, bright, and wants to help his students succeed.  One of the best GTAs at OSU in my opinion",
        "course": "NELC371"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "I have had Mr Tuazon for other classes and they were fantastic",
        "course": "ARABIC2701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Near Eastern Studies",
    "firstName": "Jonathan",
    "id": "VGVhY2hlci0yMDI0MzIw",
    "lastName": "LeidheiserStoddard",
    "legacyId": 2024320,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "After four years at OSU he was in my top 3 for good teachers. Every class there is some light reading to finish and a list of questions are given. From the question there is a quiz every class which is very generous graded. they are out of 10 points and just for writing something you will get 7 points. his exams are taken from questions given. ",
        "course": "NELC3700"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was generally enjoyable and it's not hard to get an A as long as you stay on top of the weekly readings. I don't think I've ever laughed so much in a class before, and Jon's sense of humor kept material from getting boring. There are reading quizzes just about every so make sure to do the readings. ",
        "course": "NELC3700"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.5,
    "department": "Near Eastern Studies",
    "firstName": "Parvaneh",
    "id": "VGVhY2hlci04OTM3MTk=",
    "lastName": "Pourshariati",
    "legacyId": 893719,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Great professor has such a sweet, kind spirit. She loves teaching and has such a desire for her students to learn Her tests are not bad at all, she doesn't like to concentrate on them as she does lecturing and talking about the readings. I found the class to be a great experience and I came away with learning a lot about Ancient Persia and Iran",
        "course": "HIST540"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really caring professor. Relates to the class very well! Wants you to know the geography of middle east but will give you several chances to score well. I would recommend this class to anyone who is interested in the history of the area.",
        "course": "A01"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "This was the pilot class for Shia Islam. There is one geography quiz of the middle east that is actually pretty hard. She expects you to know random places and mtns, one midterm (know the info REALLY well for this), and a paper/presentation combo (topic is your choice). She is a great woman, just really unorganized professor. Interesting course.",
        "course": "NELC351"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "If your the type that can't pay attention to boring profs, then you'll love her! She's so passionate about what she teaches, I've never met a women like her before! It keeps you interested, and she's so helpful! A GENIUS!!!",
        "course": "HIS143"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a terrific teacher and extremely knowledgeable about the middle east. She is extremely passionate and cares a lot about her students. I highly recommend her, I have taken two classes with her, including NELC 351 and HIST",
        "course": "HIST540"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved this class. Okay so she goes on tangents but there's still important information there. She also teachers from a historical perspective so if you want religion based more go to comparative studies. But overall interesting professor and great classes!",
        "course": "NELC351"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Pourshariati knows what she is talking about.  There is a lot to get out of this class, but a background or general knowledge of Islam helps.",
        "course": "NELC351"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 3.9,
    "department": "Near Eastern Studies",
    "firstName": "Georges",
    "id": "VGVhY2hlci0xMjI2ODIw",
    "lastName": "Tamer",
    "legacyId": 1226820,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Interesting class, slightly difficult, lots of reading. If you are interested in anything relating to Islamic lit this would be the class for you. The class covers classical and medieval lit, including pre-Islamic poetry. Learn how to read smart, and remember important concepts/people/dates, and you'll be fine. I really enjoyed this class.",
        "course": "ARAB371"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "I was very pleased with this class and the instructor and would suggest it as a jumping off point for anyone who has any interest in Islam, Arabic, or Islamic culture. All of these are addressed by studying Arabic Lit since it all interconnected. Dr. Tamer very helpful and incredibly smart. The readings are interesting and online so no books to buy",
        "course": "ARABI371"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really enjoyed this class. We read interesting articles and had interesting discussions. Dr. Tamer is extremely knowledgeable and you learn a lot in this class. Arabic terms are all explained and written out in english letters so anyone can take this class. Its easy if you keep up with the readings and reference them repeatedly in your papers",
        "course": "ARABI371"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "Don't take class unless you have Arabic knowledge. Arabic words were spoken and written, and previous knowledge would help in understanding materials. No formal outline or key points to follow. Readings were extremely long and boring-impossible to maintain if working or have kids. Nice professor and interesting class, just not introductory course.",
        "course": "ARAB371"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "He was a terrible teacher, he didnt explain anything, he made the students teach, and wasnt helpful at all. Class was boring beyond belief, the subject material itself was amazing, but he made it so boring. Never taking anything with him again.",
        "course": "ARB371"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "This class was wonderful! Dr. Tamer expected students to have prepared before getting to class, but that made discussion better. Dr. Tamer was a great guide as we worked through understanding the development of various Arabic-Islamic terms. This class was well worth my time and were it offered again, I wouldn't mind sitting in.",
        "course": "ARAB621"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Tamer is one of the smartest instructors I've had the privilege to study under at OSU.  He is extremely knowledgeable, and always willing to help students and discuss material.  He is very kind, but very strict when it comes to class readings: If it's assigned, then you must read it!  Simply, Dr. Tamer is the best!",
        "course": "ARAB371"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.1,
    "department": "Near Eastern Studies",
    "firstName": "Bruce",
    "id": "VGVhY2hlci0xMTAzOTA1",
    "lastName": "Fudge",
    "legacyId": 1103905,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Expectations were not clear regarding the midterms, hence his grading was unexpectedly unfair. He takes off points for no reason. He was grading everyone's answers off another student's answers from OUR own class! That's just not right! The readings themselves were interesting and discussion was good, however the professor sucks!",
        "course": "ARAB375"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Well informed professor.  Class is interesting and informative.  Can be very disorganized.  There are rarely review sheets he hands out to prepare you for his quizzes.  Asks questions on quizzes and tests that he does not prior review.  Would recommend, but take good notes!",
        "course": "MED214"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "This was a great grammar class. Very informative and Fudge was very helpful and funny. You have to really study the vocab. and come to class. Take this teacher for arabic grammar!",
        "course": "ARAB200"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "I encourage you to learn about Islam but... NELC 351 with Fudge is NOT the best way to go. No matter how you answer a question it is not the way he wants it to be answered. He makes you feel stupid for answering questions. He says he tries to guide the discussion but he does not do it in a way that encourages students to participate. 2 Thumbs Down",
        "course": "NELC351"
      }
    ],
    "SEI": []
  }
]