[
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.3,
    "department": "Neuroscience",
    "firstName": "Laurence",
    "lastName": "Coutellier",
    "legacyId": 1955963,
    "numRatings": 50,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "I loved Dr. Coutellier. She is more traditional which I absolutely love and really appreciate. Also, I didn't have to read a textbook which was awesome and saved me HOURS. She can seem intimidating but I went to her office hours numerous times and she is really kind, knowledgeable, and intelligent. I loved her teaching style, and miss it!"
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Dr. Coutellier was amazing and is easily the best teacher I have ever had! Some advice is to make sure you attend EVERY lecture, do all the assignments, and study up for quizzes and exams (her study guide is amazing). Good luck y'all."
      },
      {
        "index": 2,
        "rating": "4.0",
        "comment": "Everything that people are saying on here is true, she is very funny and explains the content very well to beginners. However, she has a very thick French accent which can make it impossible to understand certain words at times. I wish she would record her lectures or have more detailed slides to compensate for it, but it is what it is"
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Amazing lecturer and pretty funny. Exams are very fair and she also gives 8 percent in bonuses quizzes. Overall user great professor."
      },
      {
        "index": 4,
        "rating": "5.0",
        "comment": "I was very scared of taking 3313, however this professor was INCREDIBLE. She was able to \"dumb\" down material very well. I had absolutely no background in neuro/anatomy, but I was able to study well enough to earn an A. However, if you were to miss even a single lecture, you would be in trouble. She provides good study guides but you must attend."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "I LOVE HER!! She is a great professor who is truly interested in what she teaches and is really good at explaining difficult topics. She is very helpful and funny. Definitely go to lecture, i never missed since she explains everything on the slides. There are a quizzes for extra credit and 3 big midterms. Just do flashcards and go to class."
      },
      {
        "index": 6,
        "rating": "5.0",
        "comment": "She was a super nice professor. She is extremely knowledgeable and she will always explain more if needed. Her office hours are super helpful as well. I personally never skipped a lecture, partly because I just enjoy neuroscience. The class itself has a lot of terminology but she does a good job explaining in it."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Professor Coutellier was an amazing professor. Some people don't like her class because it is difficult - which is true. But, if you are taking this class for the neuroscience major, her 3313 class will prepare you better than any other professor. Yes, it is hard - but she truly cares about her students and their understanding."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Good if you know ur stuff"
      },
      {
        "index": 9,
        "rating": null,
        "comment": "If you are taking this class for your major, pick Dr. Phenis instead. This professor graded only on two assignments and four exams total, dropping the lowest midterm. Lecture heavy as well. Do with this what you will."
      },
      {
        "index": 10,
        "rating": "5.0",
        "comment": "The class was difficult, but Dr. Coutellier was there to help. She cares about her students and will take time to explain concepts in detail that students are struggling with. The class is lecture heavy and mainly graded off exams, but 1 midterm is dropped and there are 2 EC opportunities. Material is hard, but if you study you will be fine."
      },
      {
        "index": 11,
        "rating": "5.0",
        "comment": "Dr. Coutellier is very smart and very funny. Information packed lectures (90 mins) with a 3 min break (~80 slides). Three midterms (lowest one is dropped), two short reading assignments, and two bonus point quizzes. She provides study guides that allows the student to focus in on the topics that will be on the test rather than study everything."
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "I really like her lectures. She is very knowledgable and explain very well difficult concepts. She is always available to answer questions in and outside the class. There are 3 midterms (but the lowest grade is dropped), the final exam, 2 assignments, and there are 2 quizzes for bonus points."
      },
      {
        "index": 13,
        "rating": null,
        "comment": "This class is not one you want to be taught by this professor. If you are taking this for your major and you pick her, beware. She only grades off of 3 midterms and a final, with 2 assignments. ABSOLUTELY NO CREDIT will be given for late assignments. Like, at all. She does not teach off of the textbook, but her own vague slides."
      },
      {
        "index": 14,
        "rating": "5.0",
        "comment": "Dr. Coutellier is a must have teacher at OSU! Yes the content is hard, but if you do bad in the class it is NOTHING on her part. She posts all the lectures to carmen, offers office hours and explains things in depth while making it easy to understand. She truly seems to care about the content and the success of her students. ugh queen energy!!!!"
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "Really loved the class. The teacher did a great at explaining difficult concepts."
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "This class covers a lot of information, but Dr. Coutellier does a great job teaching. Make sure that you pay attention to the specific examples of questions gone over in class, as they are the questions that will be on the exam, just reworded. I took this class during COVID and she was very understanding. I would recommend!"
      },
      {
        "index": 17,
        "rating": "5.0",
        "comment": "I learnt so much in this class."
      },
      {
        "index": 18,
        "rating": "5.0",
        "comment": "Great class. Lectures are super interesting."
      },
      {
        "index": 19,
        "rating": "4.0",
        "comment": "While attendance counts toward the final grade, we can be easily excused if cannot attend, and we don't need to attend the full 80 minutes (50 is enough to count toward \"present\"). First exam was tough but Dr. Coutellier asked for our feedback and changed things. Second exam was much better. The class is very interesting."
      }
    ]
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.3,
    "department": "Neuroscience",
    "firstName": "Georgia",
    "lastName": "Bishop",
    "legacyId": 1962363,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Lecture slides are very unorganized, it is obvious that she has been reusing the same slides for years. In class, she reads directly from the slides, therefore attendance to class isn't necessary. The reason this class is difficult is because there is just so much information to know. You have to memorize every detail from the slides"
      },
      {
        "index": 1,
        "rating": null,
        "comment": "Dr. Bishop is very nice and clearly knowledgeable, but I have never been happier to finish a class. She was easily the most boring professor I have ever had (and of course the lectures are 80 minutes). The only grades are 4 exams (all have EC), and they are strictly from the slides in class. Study the slides a lot before exams and you will do well."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "Dr. Bishop was extremely clear on what information students should know for the exams (all of which were very fair). Lecture attendance is crucial, but if you show, up, pay attention, and review lecture slides on your own you will be just fine. Dr. Bishop is incredibly intelligent and caring, and makes every effort to help students succeed."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Dr. Bishop is one of the best professors I have at Ohio State. She is nice and does care about her students. NS3050 is a combination of neuroanatomy and neuroscience, which is as hard as it is supposed to be. Dr. Bishop is trying to make it as easy as she can. Make sure you study hard and go to her office hours."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "Bishop is so monotonous, her lectures are useless to attend and she is likely one of the most inconsiderate professors I have ever met. The course is graded only based on 3 midterms and 1 exam totally 100 points, which have very little room for error."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "The class is about brain anatomy and physio, it's not supposed to be fun. Dr. Bishop makes it as manageable as she can. The only grades are four exams, each covering the lectures in that block. You can tell she wants students to succeed because she provides everything you need. I recommend studying early and often, and she'll curve it at the end."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "Dr. Bishop is a kind person and has good intentions. Although Neuro 3050 is a very difficult class, she only makes it harder. The lectures are long and difficult to pay attention to. She likes to read off the slides without much expression and the slides are all over the place so it is extremely difficult to organize. Overall good person, meh prof."
      },
      {
        "index": 7,
        "rating": null,
        "comment": "Too much content on each exam with little to no direction of what would be on it. Her powerpoints are a mess. So unorganized. Better off reading a textbook and organizing it yourself. Much of the material on exams is SPOKEN in class and not even on the slides. Basically. Teach yourself. Lectures are so dry and boring."
      },
      {
        "index": 8,
        "rating": "4.0",
        "comment": "This class is SUPER lecture/test heavy. There are 4 tests, 50 points each (200 total) with 5-6 bonus questions/points included in the last three exams (we had a total of 16 bonus points/questions)(& a 3% curve). For me, I REALLY needed to attend/record the lectures. Dr. Bishop is a very good professor who does a good job of explaining the lectures."
      },
      {
        "index": 9,
        "rating": null,
        "comment": "I wouldn't take this class if I had any choice whatsoever. Dr Bishop is your introduction into the most complicated, convoluted, and overwhelming material you've ever read. Dr Bishop has negative sympathy for this and decides to only grade you on 4 Midterm Exams. If you do poorly or any of these, good luck graduating as a neuroscience major."
      },
      {
        "index": 10,
        "rating": null,
        "comment": "Don't take this class unless it's something you are interested in learning about. A lot of the material on the tests is not found in the power points and, Dr. Bishop was not the professor for the block 2 and 3 exams. Her 3050 class is much better and only has her teaching, which she excels at."
      },
      {
        "index": 11,
        "rating": null,
        "comment": "The tests were absolutely nothing like the material in the lecture. It's no surprise she has to curve her classes because everyone struggles and stresses over remembering every little detail."
      },
      {
        "index": 12,
        "rating": "5.0",
        "comment": "Dr. Bishop was very accommodating, considering the pandemic .. Her lectures were easily accessible and she allotted time during her weekly (non-mandatory) Zoom class to clear up any doubts or go over difficult topics. It was the most straightforward class I took this semester. This is a heavy class in terms ofthe amount you have to learn but doable"
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "Georgia is an absolute GEM. She did awesome teaching this course online due to COVID."
      },
      {
        "index": 14,
        "rating": "4.0",
        "comment": "Pretty difficult class but the instructor is so very knowledgable about the subjects. She explains difficult material well, but be prepared for a lot of it. She mentions many times the importance of drawing out tracts and pathways, and I completely agree. Drawing everything out helped me raise my grade from a C to an A!"
      },
      {
        "index": 15,
        "rating": null,
        "comment": "She was so lecture heavy, with the class only being out of 4 exams. Lecture is hard to sit through since the content is so dry. There were some bonus questions at the end of the exams that helped a lot."
      },
      {
        "index": 16,
        "rating": null,
        "comment": "Dr. Bishop is awful. Her lectures are so boring and its hard to stay awake. She is monotone and her lecture slides don't make sense. Good luck!!"
      },
      {
        "index": 17,
        "rating": null,
        "comment": "Dr. Bishop is not the worst teacher but she does have implicit bias towards specific students. She only clarifies a question on a test for specific people (only If you go to class on a regular basis). She is also a very boring lecturer. After taking her class I began to question her integrity as she lied about personal grade adjustments."
      },
      {
        "index": 18,
        "rating": "4.0",
        "comment": "clear explanations of what you need to know to pass the exams. She doesn't make the exams harder than it is, its brain anatomy its already extremely difficult. She lectures and draws questions straight from lectures. She likes to use the pictures a lot on exams so really study where structures are in brain and what they do."
      },
      {
        "index": 19,
        "rating": "5.0",
        "comment": "Dr. Bishop was phenomenal. After the first exam, you get 5-6 bonus questions on the next 3 exams. She also curved our class (90%-100%A). Everything on the exam is from the powerpoint-don't waste your time on the book. For exam 2, KNOW THE CROSS SECTIONS. Exam 3 and 4 had no pictures, and 4 was by far the easiest. Her exams are difficult, but fair."
      }
    ]
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.3,
    "department": "Neuroscience",
    "firstName": "Georgia",
    "id": "VGVhY2hlci0xOTYyMzYz",
    "lastName": "Bishop",
    "legacyId": 1962363,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lecture slides are very unorganized, it is obvious that she has been reusing the same slides for years. In class, she reads directly from the slides, therefore attendance to class isn't necessary. The reason this class is difficult is because there is just so much information to know. You have to memorize every detail from the slides",
        "course": "NEURO3050"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Bishop is very nice and clearly knowledgeable, but I have never been happier to finish a class. She was easily the most boring professor I have ever had (and of course the lectures are 80 minutes). The only grades are 4 exams (all have EC), and they are strictly from the slides in class. Study the slides a lot before exams and you will do well.",
        "course": "NEURO3050"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bishop was extremely clear on what information students should know for the exams (all of which were very fair). Lecture attendance is crucial, but if you show, up, pay attention, and review lecture slides on your own you will be just fine. Dr. Bishop is incredibly intelligent and caring, and makes every effort to help students succeed.",
        "course": "NEURO3050"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bishop is one of the best professors I have at Ohio State. She is nice and does care about her students. NS3050 is a combination of neuroanatomy and neuroscience, which is as hard as it is supposed to be. Dr. Bishop is trying to make it as easy as she can. Make sure you study hard and go to her office hours.",
        "course": "NEURO3050"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": "Bishop is so monotonous, her lectures are useless to attend and she is likely one of the most inconsiderate professors I have ever met. The course is graded only based on 3 midterms and 1 exam totally 100 points, which have very little room for error. ",
        "course": "NEURO3050"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "The class is about brain anatomy and physio, it's not supposed to be fun. Dr. Bishop makes it as manageable as she can. The only grades are four exams, each covering the lectures in that block. You can tell she wants students to succeed because she provides everything you need. I recommend studying early and often, and she'll curve it at the end.",
        "course": "NEURO3050"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Bishop is a kind person and has good intentions. Although Neuro 3050 is a very difficult class, she only makes it harder. The lectures are long and difficult to pay attention to. She likes to read off the slides without much expression and the slides are all over the place so it is extremely difficult to organize. Overall good person, meh prof.",
        "course": "NEURO3050"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Too much content on each exam with little to no direction of what would be on it. Her powerpoints are a mess. So unorganized. Better off reading a textbook and organizing it yourself. Much of the material on exams is SPOKEN in class and not even on the slides. Basically. Teach yourself. Lectures are so dry and boring. ",
        "course": "NEURO3050"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class is SUPER lecture/test heavy. There are 4 tests, 50 points each (200 total) with 5-6 bonus questions/points included in the last three exams (we had a total of 16 bonus points/questions)(& a 3% curve). For me, I REALLY needed to attend/record the lectures. Dr. Bishop is a very good professor who does a good job of explaining the lectures.",
        "course": "NEURO3050"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "I wouldn’t take this class if I had any choice whatsoever. Dr Bishop is your introduction into the most complicated, convoluted, and overwhelming material you’ve ever read. Dr Bishop has negative sympathy for this and decides to only grade you on 4 Midterm Exams. If you do poorly or any of these, good luck graduating as a neuroscience major.",
        "course": "NEURO3050"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't take this class unless it's something you are interested in learning about. A lot of the material on the tests is not found in the power points and, Dr. Bishop was not the professor for the block 2 and 3 exams. Her 3050 class is much better and only has her teaching, which she excels at.",
        "course": "NEURO3010"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "The tests were absolutely nothing like the material in the lecture. It's no surprise she has to curve her classes because everyone struggles and stresses over remembering every little detail.",
        "course": "NEURO3010"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bishop was very accommodating, considering the pandemic .. Her lectures were easily accessible and she allotted time during her weekly (non-mandatory) Zoom class to clear up any doubts or go over difficult topics. It was the most straightforward class I took this semester. This is a heavy class in terms ofthe amount you have to learn but doable",
        "course": "NEURO3050"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Georgia is an absolute GEM. She did awesome teaching this course online due to COVID.",
        "course": "NEURO3010"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "Pretty difficult class but the instructor is so very knowledgable about the subjects. She explains difficult material well, but be prepared for a lot of it. She mentions many times the importance of drawing out tracts and pathways, and I completely agree. Drawing everything out helped me raise my grade from a C to an A!",
        "course": "NEURO3050"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "She was so lecture heavy, with the class only being out of 4 exams. Lecture is hard to sit through since the content is so dry. There were some bonus questions at the end of the exams that helped a lot.",
        "course": "NEURO3050"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Bishop is awful. Her lectures are so boring and its hard to stay awake. She is monotone and her lecture slides don't make sense. Good luck!!",
        "course": "NEURO3050"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Bishop is not the worst teacher but she does have implicit bias towards specific students. She only clarifies a question on a test for specific people (only If you go to class on a regular basis). She is also a very boring lecturer. After taking her class I began to question her integrity as she lied about personal grade adjustments.",
        "course": "NEURO3050"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "clear explanations of what you need to know to pass the exams. She doesn't make the exams harder than it is, its brain anatomy its already extremely difficult. She lectures and draws questions straight from lectures. She likes to use the pictures a lot on exams so really study where structures are in brain and what they do.",
        "course": "NEURO3050"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bishop was phenomenal. After the first exam, you get 5-6 bonus questions on the next 3 exams. She also curved our class (90%-100%A). Everything on the exam is from the powerpoint-don't waste your time on the book. For exam 2, KNOW THE CROSS SECTIONS. Exam 3 and 4 had no pictures, and 4 was by far the easiest. Her exams are difficult, but fair.",
        "course": "NEURO3050"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Bishop is a good lecturer, it's just that the material isn't always interesting. Exams are fair (w/ bonus questions) and the material comes straight from the slides. The book can be used to enforce pathways and concepts. Overall, good class but be prepared to put in the time to memorize a bunch of information in a short amount of time.",
        "course": "NEURO3050"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 4,
        "comment": "You'll definitely have to work for your grade. She isn't very interesting to listen to in class, but is always more than happy help students during office hours. Her tests are pretty fair and there's always carry-over material from exam-to-exam; she also offers bonus questions on exams. Be ready to have a lot of material thrown at you all at once.",
        "course": "NEURO3050"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "I really loved Dr. Bishop! She was always really clear with the concepts and went over things multiple times and at a pace that wasn't too fast. You can tell she's really knowledgable about neuro. The exams were hard but not crazy.",
        "course": "NEURO3050"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bishop is a really good teacher. She is very sweet, she is very quick to respond to questions you have, she is very quick about grading  ( grades posted within 24 hours of your exam) and she is pretty straightforward about her requirements. Excellent teacher. Most of the people that do not do well in this course do not actually like neuro.",
        "course": "NEURO3050"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bishop is a wonderful professor!  She is a very fair grader and it is clear what she looks for on exams.  She is very accommodating and understanding of extenuating situations which may impact students.  She is very knowledgeable and I definitely learned a lot from her.",
        "course": "NEURO3050"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "The topic weren't interesting to me, but its Structure & Function of the brain. She is a wonderful professor though. Although the information was dry, tests were a bit difficult,  and there was a lot to memorize, she really did empathize with students.  Going over the notes often, making flashcards, drawing visuals, etc is really helpful.",
        "course": "NEURO3050"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Bishop taught Neurophysiology during May Session. This class is way out of my interests in the field of neuroscience, yet Dr. Bishop made me appreciate the extreme detail of physiology. Very clear lectures, but material can be tough if you don't keep up with it. Kind and brilliant professor, wish she taught more classes for undergrads",
        "course": "NEURO3010"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Bishop is one of the best professors I've ever had while attending Ohio State. This class is by no means easy; however, Bishop is a very fair test administrator. If you've taken Boyd in Neuro 3000 this class is the polar opposite and a breath of fresh air! You will learn so much from Dr. Bishop!",
        "course": "NEURO3050"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.2,
    "department": "Neuroscience",
    "firstName": "Laurence",
    "id": "VGVhY2hlci0xOTU1OTYz",
    "lastName": "Coutellier",
    "legacyId": 1955963,
    "numRatings": 52,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "one of the best professors I've had in college. far from easy but that's because she cares and neuroscience is inherently difficult. she is clear in her expectations and she offers all of the resources necessary to be successful. also has underratedly funny moment during lecture ",
        "course": "PSYCH5602"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Off putting professor and all 3 exams are written and like 10 questions so it makes it difficult if you do bad on one exam because there is not many grades. Didn't seem like she cared about her students and just wanted to get the material across. Lowkey seemed judgey to students who didn't understand something.  ",
        "course": "PSYCH5602"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved Dr. Coutellier. She is more traditional which I absolutely love and really appreciate. Also, I didn't have to read a textbook which was awesome and saved me HOURS. She can seem intimidating but I went to her office hours numerous times and she is really kind, knowledgeable, and intelligent. I loved her teaching style, and miss it!",
        "course": "PSYCH3313"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Coutellier was amazing and is easily the best teacher I have ever had! Some advice is to make sure you attend EVERY lecture, do all the assignments, and study up for quizzes and exams (her study guide is amazing). Good luck y'all. ",
        "course": "PSYCH3313"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Everything that people are saying on here is true, she is very funny and explains the content very well to beginners. However, she has a very thick French accent which can make it impossible to understand certain words at times. I wish she would record her lectures or have more detailed slides to compensate for it, but it is what it is",
        "course": "PSYCH3313"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing lecturer and pretty funny. Exams are very fair and she also gives 8 percent in bonuses quizzes. Overall user great professor. ",
        "course": "PSYCH3313"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "I was very scared of taking 3313, however this professor was INCREDIBLE. She was able to \"dumb\" down material very well. I had absolutely no background in neuro/anatomy, but I was able to study well enough to earn an A. However, if you were to miss even a single lecture, you would be in trouble. She provides good study guides but you must attend.",
        "course": "3313"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "I LOVE HER!! She is a great professor who is truly interested in what she teaches and is really good at explaining difficult topics. She is very helpful and funny. Definitely go to lecture, i never missed since she explains everything on the slides. There are a quizzes for extra credit and 3 big midterms. Just do flashcards and go to class.",
        "course": "PSYCH3313"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a super nice professor. She is extremely knowledgeable and she will always explain more if needed. Her office hours are super helpful as well. I personally never skipped a lecture, partly because I just enjoy neuroscience. The class itself has a lot of terminology but she does a good job explaining in it. ",
        "course": "PSYCH3313"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Coutellier was an amazing professor. Some people don't like her class because it is difficult - which is true. But, if you are taking this class for the neuroscience major, her 3313 class will prepare you better than any other professor. Yes, it is hard - but she truly cares about her students and their understanding. ",
        "course": "PSYCH3313"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good if you know ur stuff",
        "course": "PSYCH3313"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 5,
        "comment": "If you are taking this class for your major, pick Dr. Phenis instead. This professor graded only on two assignments and four exams total, dropping the lowest midterm. Lecture heavy as well. Do with this what you will.",
        "course": "PSYCH3313"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "The class was difficult, but Dr. Coutellier was there to help. She cares about her students and will take time to explain concepts in detail that students are struggling with. The class is lecture heavy and mainly graded off exams, but 1 midterm is dropped and there are 2 EC opportunities. Material is hard, but if you study you will be fine.",
        "course": "PSYCH3313"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Coutellier is very smart and very funny. Information packed lectures (90 mins) with a 3 min break (~80 slides). Three midterms (lowest one is dropped), two short reading assignments, and two bonus point quizzes. She provides study guides that allows the student to focus in on the topics that will be on the test rather than study everything.",
        "course": "PSYCH3313"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "I really like her lectures. She is very knowledgable and explain very well difficult concepts. She is always available to answer questions in and outside the class. There are 3 midterms (but the lowest grade is dropped), the final exam, 2 assignments, and there are 2 quizzes for bonus points. ",
        "course": "PSYCH3313"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is not one you want to be taught by this professor. If you are taking this for your major and you pick her, beware. She only grades off of 3 midterms and a final, with 2 assignments. ABSOLUTELY NO CREDIT will be given for late assignments. Like, at all. She does not teach off of the textbook, but her own vague slides.",
        "course": "PSYCH3313"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Coutellier is a must have teacher at OSU! Yes the content is hard, but if you do bad in the class it is NOTHING on her part. She posts all the lectures to carmen, offers office hours and explains things in depth while making it easy to understand. She truly seems to care about the content and the success of her students. ugh queen energy!!!!",
        "course": "PSYCH3313"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really loved the class. The teacher did a great at explaining difficult concepts.",
        "course": "PSYCH3313"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class covers a lot of information, but Dr. Coutellier does a great job teaching. Make sure that you pay attention to the specific examples of questions gone over in class, as they are the questions that will be on the exam, just reworded. I took this class during COVID and she was very understanding. I would recommend! ",
        "course": "PSYCH5602"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "I learnt so much in this class.",
        "course": "PSYCH5602"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great class. Lectures are super interesting.",
        "course": "PSYCH5602"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "While attendance counts toward the final grade, we can be easily excused if cannot attend, and we don't need to attend the full 80 minutes (50 is enough to count toward &quot;present&quot;). First exam was tough but Dr. Coutellier asked for our feedback and changed things. Second exam was much better. The class is very interesting.",
        "course": "PSYCH5602"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Coutellier is one of the least understanding professors I have had at OSU, especially during the pandemic. She penalizes anyone that can't attend all 80 mins of her online lectures and makes the exams all written response, which is impossible to finish with the time given. Don't take her class.",
        "course": "PSYCH5602"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Coutellier was really easy to get ahold of over email or zoom. Very understanding. Lectures were recorded but they were always interesting. Make flash cards for her class theyll be really helpful and often shell tell you exactly what to write on them. She does have a French accent but shes not difficult to understand imo.",
        "course": "PSYCH3313"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Has a very cute/funny personality. Lectures are released weekly. No homework, just three midterms and one final. Just take thorough notes like word for word what she says and you will be fine for the midterms because the questions are straight from the lecture. Midterms/final were open note which made it so easy. Pick her if you have a choice!!!!!!",
        "course": "PSYCH3313"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's an amazing professor, the class just has a lot of material that you have to understand. The class is only graded from exams, but 1 is dropped and you can earn up to 4% extra credit through quizzes. Most test averages were around an 85%, but the extra credit helps. I really recommend her!",
        "course": "PSYCH3313"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very interesting class. Lecture is not mandatory but helpful for better understanding graphs and material on slides. Exams are all multiple choice and she provides study guides for all the exams. Not too hard to do well if you dedicate the time to really understanding material.",
        "course": "PSYCH3313"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Best professor for 3313. Go to lecture and take notes and you'll be fine. No homework or papers just exams. 3 midterms worth 60% of grade and you drop one of them. Final is 40% (can't be dropped) not bad at all, make quizlets she gives you studyguides. Has 2 bonus quizzes for a total of 4% to your grade.",
        "course": "PSYCH3313"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Coutellier is a very funny &amp; smart woman! Her class has optional attendance, but her exams are lecture-based so it's important to go. You won't be able to understand the information from the just slides she posts. There are 3 midterms, the lowest one gets dropped, 2 quizzes for up to 4% extra credit on your final grade, and a cumulative final.",
        "course": "PSYCH3313"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Coutellier is my favorite professor so far. Her expectations are explicitly stated and she is accessible for questions. Her class is graded on only tests but she gives 2 bonus quizzes. She prepares study guides for the exams with content that lines up perfectly. Overall AMAZING professor.",
        "course": "PSYCH3313"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor for Psych 3313. Awesome and endearing accent, great stories, extremely intelligent woman. Really loves and cares about the content and it shows. Offers extra credit quizzes which really help your grade if you do well. Final was extremely difficult, had an A all semester and ended with a B- because of final. Course is just difficult.",
        "course": "PSYCH3313"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great professor overall. She gives extra credit in the form of 3 quizzes and lets you drop one of the exams. There are not a lot of opportunities to earn points in this class so it's imperative to do well on the exams. The class itself isn't the most fun because has a lot of memorization but she is VERY clear about what you'll be tested over.",
        "course": "PSYCH3313"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 3,
        "comment": "I'm systems behavioral neuro and I loved this class. You definitely need to study hard for exams but she gives out study guides. And there are 15 points bonus in the form of quizzes! No textbook needed and no homework! Even though she's French, she isn't difficult to understand. And very funny.",
        "course": "PSYCH3313"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 4,
        "comment": "I didn't enjoy the material or the lectures. There is nothing wrong with her teaching abilities but if you don't like neuroscience this class will not be easy. The final is 50% of your grade and there is an incredible amount of information you need to memorize in order to do well.",
        "course": "PSYCH3313"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "great class, great professor",
        "course": "PSYCH3313"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class was not fun. The final was 50% of the grade, which I barely passed by the skin of my teeth. There are 3 quizzes for extra credit, so make sure you do well on them. As for the actual instructor - very meh.",
        "course": "PSYCH3313"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 3,
        "comment": "Not a hard class, but there's a lot to know and study! I would highly recommend voice recording her because she speaks quickly and the powerpoints don't have all the specific information you'd be tested on. I started getting A's when I did that! The quizzes she gives for bonus points help A LOT. Study for those! Overall, a great class.",
        "course": "PSYCH3313"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Coutellier does a really good job of teaching Behavioral Neuroscience. Yeah, the content can still be hard to grasp and you'll need to study outside of class to do well. But, she's super clear about what you need to know and answers questions. There are extra credit quizzes that can boost your grade and the exams are really straightforward.",
        "course": "PSYCH3313"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good professor. A lot of information but she makes sure to indicate during lectures what is important to study for the exams.",
        "course": "PSYCH3313"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 5,
        "comment": "Take any other class besides this one. Understanding tough concepts is difficult when its explained by a professor with a French accent who talks entirely way too fast. And get ready to memorize diagrams that she finds on google that make absolutely no sense. Textbook isnt reader friendly either. Only grades are exams.",
        "course": "PSYCH3313"
      },
      {
        "index": 41,
        "rating": 2,
        "difficulty": 4,
        "comment": "Test questions are VERY specific even if you know the general concepts. Questions are focused on the smallest details and exams are the only grade component besides a small 5 pt extra credit. Its a LOT of content to memorize and the class is harder than it needs to be, especially trying to understand her accent with how fast she talks.",
        "course": "PSYCH3313"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 3,
        "comment": "Trust me, it's a lot of slides, but they are interesting and she knows everything soo well, you will love the class. no hw. take advantage of her extra credit quiz at the beginning of the semester, the rest of your grade will be based off midterms and final and the extra few points will help. great person teaching cool neuroscience.",
        "course": "PSYCH3313"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class has a ton of information but Laurence made sure to tell you what you needed to know for each exam. You don't need the textbook, it's based off of lecture. It's not mandatory, but paying attention in class makes the material much easier. Overall she was a funny professor and helped make this class a lot easier.",
        "course": "PSY3310"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Coutellier was my absolute favorite professor. She's incredibly helpful and available and is always open for students to ask questions. Her tests are completely straight forward, giving you a chance to really learn and enjoy learning. I loved her class, her as a professor, and am friends with her to date.",
        "course": "PSYCH3313"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is a great professor. She has a very cute french accent, but is not hard to understand. Classes are important. Books are not necessary, her lecture slides are all you need. Only graded things are the three midterms and final. She drops the lowest midterm grade. Not easy A, but Easy B. A lot of memorization. But interesting material.",
        "course": "PSYCH3313"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Coutellier is an amazing teacher! She was very specific about what information would be on the test and the book was unnecessary to understanding the information.  Though the material may be a bit challenging, Dr. Coutellier was very helpful to students whenever concepts were challenging or not understood well.",
        "course": "PSYCH3313"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interesting, very sweet professor. Always engaged in lecture and clearly loves what she teaches. Material is well explained (especially the complex parts) but the exams are challenging and specific but fair. If you email her with a question she replies in minutes. She is also very funny. I really really enjoyed her class.",
        "course": "PSYCH3313"
      },
      {
        "index": 48,
        "rating": 2,
        "difficulty": 3,
        "comment": "Overall, she's not a bad prof but you have to make sure you not only study but understand everything",
        "course": "PSYCH3313"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Coutellier is an amazing lecturer. I would definitely recommend taking her! She cares a lot about the success of her students and she made the material very interesting (she sometimes uses videos to demonstrate the material).She has review sessions the class before each midterm where she tells you EXACTLY what to study. Very good overall!",
        "course": "PSYCH3313"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Coutellier is a great professor! She knows her class requires a lot of material so she makes it very clear what you will be tested on. The class is 3 midterms and a final, and you get to drop the lowest midterm. The material can be difficult so don't expect an easy A, but it is definitely attainable if you pay attention and study. Textbook isn't required, but it is helpful to refer to if you miss lecture since her class follows along with it perfectly",
        "course": "PSYCH3313"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher! She understands that there is a ton of information to learn through out the semster but she is very clear on what to focus on. Test questions don't go into much detail and are very easy if you understand the core concepts. Class is pretty interesting. Would definitely recommend this teacher!  ",
        "course": "PSYCH3313"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Coutellier has a strong French accent but she really tries to make it so everyone understands. The only grades in the class are midterms and finals. The lowest midterm can be dropped and she does not require attendance. However, if you go to class she points out on the slides (they are available online) is what will be tested on. ",
        "course": "3313"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.5,
    "department": "Neuroscience",
    "firstName": "John",
    "id": "VGVhY2hlci0yMDEyNDYw",
    "lastName": "Oberdick",
    "legacyId": 2012460,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 5,
        "comment": "This was one of the hardest classes I've ever taken, and a weave out class for neuro majors. It is VERY exam heavy, and he doesn't give a lot of other points. His wording is difficult, but doable. The final exams saved my grade, so make sure to talk to him and review past exams!",
        "course": "NEURO3000"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Oberdick is a nice professor. His class is challenging but he is always willing to help if you have a problem.",
        "course": "NEURO4050H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you did well in 3313 this is not too bad but it's in no way an easy A. I'm not an A student and I was not expecting to get an A- but I really had to work for it. My tip: RECORD HIS LECTURES! Get a free audio recording app and play them when you're studying so you don't miss his explanations! Only complaint, he's bad at replying to emails.",
        "course": "NEURO3000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Oberdick is vert knowledgable about neuroscience and you learn a lot about molecular neuroscience in this class, he is a great lecturer and makes the material very clear. It's pretty easy to get a good grade in this class, almost all exam questions are from powerpoint or review guide, attend lectures and review before exams you'll do great.",
        "course": "NEURO3000"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "lectures get boring and sometimes he throws in irrelevant info. but overall he's rly nice and gives good feedback when you schedule to go over your exams (which i really recommend making the time to do) study pretty much everything on the slides with focus on the bolded things and don't let it be like a day before an exam before u start and ur fine",
        "course": "NEURO3000"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "I thought I knew the material but the exams showed that I did not know anything. I liked his class though! make sure you really understand the concepts and the connections between everything! 50 tophat questions and 4 exams is your only grade so study hard!!! He is very bland though and only reads off the slides which is very inconvenient for me",
        "course": "NEURO3000"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "I honestly liked Oberdick, however he does just read off the slides for the most part, so once you have your 50 for tophat points, I at least stopped attending and taught myself the material. The grading is only 4 exams, 50 tophat points, and 2 optional finals. Study hard and take advantage of his TA sessions for review!",
        "course": "NEURO3000"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Oberdick is a wonderful professor. While the content is pretty dense and there is a lot of it, he clearly breaks down the relevant, important details in a way that makes it easily understandable. I have seen other posts here saying he is a poor lecturer, but I really disagree. The exam questions follow clearly what are on his slides.",
        "course": "NEURO3000"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Oberdick is the only reason I got through this class. I knew as a cellular neuro course this class would be challenging, but his comprehensive notes, focused review guides, and TopHat questions gave me a clear sense of what to focus on for each exam. Communication with him was also always stress-free and comfortable. Definitely take him!",
        "course": "NEURO3000"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr.Oberdick is an exceptional professor who truly cares about his students. He is very available outside of class and supported me throughout the semester. It's clear he is passionate about neuroscience and as a result has fun and engaging lectures. The exams were very fair and studying for this class is straightforward.",
        "course": "NEURO4050H"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class was only exams and a few tophat points. There was an opportunity to replace exam grades at the end of the semester but it was difficult material that you had to teach yourself because he was not a good lecturer. ",
        "course": "NEURO3000"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible lecturer expects you to memorize everything on the slides",
        "course": "NEURO3000"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "Just trying to get us to drop neuro as a major smh",
        "course": "NEURO3000"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Oberdick has material that he is very knowledgable in but is not the most engaging lecturer. You basically just need to memorize the slides to do well on the exams, so don't worry about coming to every class if it's putting you to sleep.",
        "course": "NEURO3000"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Oberdick is a very nice guy, but unfortunately he was not a good instructor. My recommendation is to just memorize the slides as most of the lectures are just him reading it without adding much for 80 minutes. The content itself is interesting, but the presentation of it was not very well done.",
        "course": "NEURO3000"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "His class was relatively fair. All the points came from exams (4) which were 100 points each and 50 top hat points. There are two optional finals and each one can replace one of your exam scores if need be. His lectures can be a little dry but the grading scale is curved. 88 is an A. I studied 5 days in advanced for his tests and they went well.",
        "course": "NEURO3000"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 2,
        "comment": "The lectures were 80 min long. Super boring lectures/monotone lecturer. Study slides for exams. ",
        "course": "NEURO3000"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. O uses TopHat for attendance, so make sure you go to class. His lecture is long w/ lots of information. Focus studying on highlighted words and anything he emphasizes. Grade is test-based. 4 unit exams and 2 optional finals. Personally, first 2 units are harder than the last 2 units. Tests are pretty fair. 78=B, 87=A. My class ave is 74% FYI. ",
        "course": "NEURO3000"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. O gonna throw a bunch of information during his lecture so might feel lost on what to study. My advice is to focus on the highlighted words and their concepts. He gives study guide but has a lot of words, just read to know what on the exam, but study from the slides. Dr. O is very accessible for questions. Attend TA review session if you can. ",
        "course": "NEURO3000"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Oberdick is a great professor! He cares for his students and often stays long after class to answer questions. He is very willing to meet outside of class to discuss questions, exams, etc.\n \nIt was his first time teaching the class but I he did his best to make sure students were understanding his teaching style and he adapted when needed. ",
        "course": "NEURO3000"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Oberdick seemed to be a nice person, but did not care for his students. At times it was difficult to understand what he was saying, and the study guides were not helpful for the exams. ",
        "course": "NEURO3000"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 4,
        "comment": "His first time teaching the course, didn't do terrible given that fact. He's a nice guy but clearly is here to do his research and got thrown into a teaching role. Your grade will primarily depend on the four exams you take and two optional finals (2 lowest get dropped). There's no homework but TopHat Q's and EC. Doesn't give practice problems.",
        "course": "NEURO3000"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Oberdick is cool. Tries his best to provide accurate information and gives fair exams. Lectures can drag on but bearable if you read about the material beforehand. ",
        "course": "NEURO3000"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was incredibly nervous to take Neuro 3000 based on previous years' feedback. Dr. Oberdick is so patient with breaking down concepts and is truly a brilliant researcher and professor. He is so accessible outside of class and is not afraid to admit when he is uncertain about something. The lectures are long, but go to them!!!!",
        "course": "NEURO4050H"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 4,
        "comment": "This was a great class! Molgen 4500 is not listed as a prereq for it, but I think that it maybe should be. Having a background in genetics and biochemistry will help you to succeed in this class, as the main focus is not on the basics of molgen, but on genetics applied to the nervous system. Dr. O does cover the basics, but not everything from 4500",
        "course": "NEURO4050H"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 4,
        "comment": "The professor tries really hard to ensure that students can succeed; however, without having taken an intro to genetics course or biochem, this class was nearly impossible. The slides are rather unclear and the class is incredibly detail focused. While he is a nice guy, I would not recommend this class as a whole.",
        "course": "NEURO4050H"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. O was always ready to help and clear about what he would test students on. Materials were well-written and he was always enthusiastic in class.  Definitely one of the my favorite professors at Ohio State and will always recommend this class to everyone I know.",
        "course": "NEURO4050"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "One of my favorites classes in college. Definitely recommend it! I found lectures to be interesting and often inspiring. It's not a super easy class as some of the material is challenging but if you put modest work in an A is definitely possible. Dr. O is one of the most approachable profs I've had and he goes out of his way to offer help.",
        "course": "NEURO4050"
      },
      {
        "index": 29,
        "rating": 2,
        "difficulty": 3,
        "comment": "Lectures are long and monotonous. There are three exams, but no final. Take home labs and quizzes are given around exam time and are helpful grade boosters. Make sure you read the research papers he mentions in lecture. Attendance is important, so be sure not to miss too many classes.",
        "course": "NEURO4050"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 2,
        "comment": "Well organized class and great prof. Prof is clearly concerned for the students and wanted everyone to do well. The material itself was very interesting as well, using pastcurrent research as a primary teaching tool. Focus on understanding the research examples he presents and you'll do just fine. Great class, I definitely recommend it to others!",
        "course": "NEURO4050"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Neuroscience",
    "firstName": " Jessica",
    "id": "VGVhY2hlci0zMDQ4NTI5",
    "lastName": "Arrasmith",
    "legacyId": 3048529,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The lack of transparency and fairness in her grading system makes the class unnecessarily stressful. Despite putting in significant effort to meet the outlined expectations, students often feel their work is undervalued. ",
        "course": "NEUROSC1100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.9,
    "department": "Neuroscience",
    "firstName": "Kathryn",
    "id": "VGVhY2hlci0xODkxMjY0",
    "lastName": "Lenz",
    "legacyId": 1891264,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "The content of the class is odd (be prepared to learn a lot about rat sex). The mid",
        "course": "PSYCH4644"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class was by far the most interesting that I've taken at Ohio State! The lecture slides were organized and the study guides were very clear about what you should know for the exam. Additionally, extra credit was offered at the end of every exam and there was another bonus assignment at the end. ",
        "course": "PSYCH4644"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lenz and the Hormones and Behavior class were great! Usually covered interesting material and she was always really excited about teaching it. Posted lectures online so I could review them if needed. She was really helpful in office hours. Would definitely take another class with her!\n",
        "course": "PSYCH4644"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "She is incredibly condescending to anyone who dares ask a question in her class. It feels like she tries to make people feel bad and not smart enough. Additionally, her exam questions are poorly worded and she frequently makes mistakes on her own answer key for the exam so your score is never right. ",
        "course": "PSYCH4644"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "3 midterms (lowest is dropped), one final, one research assignment, and weekly in-class activities to check attendance. The material is really interesting, but Dr. Lenz seems closed off and sometimes rude when answering questions, and her test questions are worded in confusing ways(and she's not good at clarifying these). Still a doable class.",
        "course": "PSYCH4644"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Terrible professor even though I got an A. I literally had a terrible time in this class. She can never admit when her questions are worded badly. The class literally just talks about rats for 16 weeks. If you like that then the class is for you. If not I would recommend another course. I did not learn anything from this instructor.",
        "course": "PSYCH4644"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lenz is so lovely and approachable. The class wasn't difficult, but there's lots of lectures to keep up with which can be tedious. If you slack off and don't watch them when posted, it will be tedious and a pain watching them all to catch up. Take good notes on everything since quiz/exam questions are picky. Just be organized and you'll be fine.",
        "course": "PSYCH4644"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good prof, tough course. Mostly graded off of exams and quizzes. Exams were always very difficult. Just watching the lecture won't help- definitely have to really understand the material for yourself in order to get an A on exams. She's an interesting person to listen to and her lectures were pretty enjoyable.",
        "course": "PSYCH4644"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lenz has made taking online classes because of covid so much more manageable. She consistently went out of her way to make the material as accessible and understandable as possible. While some of the topics may have been slightly difficult, her explanations made it very easy to digest. She was amazing for both 4644 and 3313.",
        "course": "PSYCH4644"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "The people saying that this class was bad obviously did not know what they were getting into, and that is not Dr. Lenz's fault. It's a 5000 lvl psych course, which at OSU, generally means group projects/presenting. Should have looked into it before you signed up. Anyway, Dr. Lenz is fantastic &amp; wants you to succeed. Do the work and you'll do great.",
        "course": "PSYCH5604"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "I think Dr. Lenz would be a great 3313 prof, but this class was the worst neuro I have ever taken. Every class is people giving presentations, so it is so boring and really hard to follow. The open note exams are really stressful over all the papers. For homework, you have to write discussion posts and attend every class.",
        "course": "PSYCH5604"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is based on essay exams, a presentation of a paper, discussion posts (for every class), and attendance. It's a fair amount of work, but the exams are open note. No final. Lenz doesn't actually teach that much because it's student-led, but she's good whens he does. For an upper-level course, I think that the course has too strict policies",
        "course": "PSYCH5604"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class is a lot of information, but the tests are pretty easy. Dr. Lenz comes off as rude sometimes in class. She puts out crazy long exam reviews that you can fill out for practice, yet still puts questions on the exams that werent on the review, which can be annoying. The class has good EC and a midterm can be dropped, which is nice.",
        "course": "PSYCH3313"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Lenz wasn't too bad. I really loved the course content so it was easier for me to prepare for tests. The class is VERY test heavy, but you can drop 1 of 3 midterms. There is also extra credit that will boost your grade. She is kind of rude sometimes, and she can be a bit snappy, so be prepared for that. Overall, not too bad, though.",
        "course": "PSYCH3313"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "amazing prof!! really clear and understandable lectures and she is always willing to make time to meet with any student if they need help outside of her office hours! makes great study guides for exams and wants her students to succeed. definitely recommend this class",
        "course": "PSYCH3313"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Lenz is very passionate about what she teaches which makes lectures bearable. She also gives study guides for the exams which most other professors in the neuro department don't. You can drop 1 out of the 3 midterm grades, but you have to take the final. She offers 10 points of extra credit which really boost your grade. I would recommend!",
        "course": "PSYCH3313"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "A good prof and clearly very passionate about the subject. You're graded on 3 midterms and a final, you can drop one of the midterms but you have to take the final. She also gives a study guide for exams which other Neuro profs don't. Definitely recommend",
        "course": "PSYCH3313"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lenz has been my fav prof. so far. She is truly passionate about the material and very accessible if you cant make her office hrs which are directly after class. Exams arent bad if you study and use her detailed study guides for ea one. She is clear and gets to the point in lecture, moves fast so look at slides ahead. 110% reccomend her!",
        "course": "PSYCH3313"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lenz is a great prof! She is very straight forward and provides detailed study guides. Her lectures provide just the right amount of material needed to succeed on tests. Textbook reading is optional. In-class activities once a week for attendance. Very friendly and approachable! Also allows you to drop a test which is very helpful.",
        "course": "PSYCH3313"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Attendance is taken by weekly in class quizzes. There is essentially no homework. You take 3 exams and drop 1 but there is no curve or extra credit. She posts finished powerpoints on Carmen and makes great study guides. Moves quickly through lectures, but there is a lot of material to cover so its understandable.",
        "course": "PSYCH3313"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Favorite class taken at OSU. She cared about students ands always available when help was needed. She lets you drop 1 out of 3 tests and the final is very straight forward. The entire class is very strait forward and although there is a lot of info, Dr. Lenz is passionate about it. She is the best professor to take this class with.",
        "course": "PSYCH3313"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Lenz was a great teacher.  Class was mostly article presentations by students.  Tests were essays over faculty lectures and all open note.  No final (just a third midterm).  Learned a TON, really enjoyed it, easy A.",
        "course": "PSYCH5898"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Everything on the test is in the notes.  Every time. ",
        "course": "NEURO3313"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very boring lectures. Reads straight from the slides.  Covers a lot of information in a single lecture.  Doesn't give students enough time to write down information in class, but provides the exact notes of what she is reading online.  Possible to never attend class and still receive an A.",
        "course": "PSYCH4644"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures were sometimes boring but very clear. It started becoming confusing when she would give study guides to tell you what to study for; then give questions on the exam that were not covered. The cumulative study guide was the worst. Approached her after receiving grade; she said she clarified that EVERYTHING was fair game; which was not true.",
        "course": "3313"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really enjoyed her class, she was very straight forward when it came to material  that would be on the exam and provided a study giude that was vague but at least gave you a direction to study in. Always willing to email you back right away, overall shes a very approachable teacher and I look forward to taking another class from her.",
        "course": "3313"
      },
      {
        "index": 27,
        "rating": 3,
        "difficulty": 2,
        "comment": "She can be very dry in her lectures at times, but she really grew on me as her interest level in the course grew over the semester. She stresses A LOT on what she wants you to know for exams and also makes really helpful study guides but they're extremely long. I really liked the class and she's the best one to teach it.",
        "course": "NEURO3313"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very helpful: always answered emails, stayed after if you needed help, had useful office hours. Tests are straightforward, however, the majority of the answers are found in the slides. Her lectures are interesting. Great professor, would recommend to any neuro/psych major/minor.",
        "course": "PSYCHOLOGY3313"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Lenz was a wonderful professor who addressed a wide variety of interesting topics in  her class. If I had any questions she cleared them up when I asked. Tests were pretty much straight forward and being allowed to drop the lowest really helped too.",
        "course": "PSYCH3313"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "Covered MANY different topics in this course. The 3 midterms were difficult, but the cumulative final exam was really easy and only focused on main concepts! The book is extremely helpful. Sometimes when students would ask questions in class she seemed judgmental, as if you should already know the answer. Other than that she was a great professor!",
        "course": "PSYCH3313"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4.8,
    "department": "Neuroscience",
    "firstName": "Kris",
    "id": "VGVhY2hlci0yODg2OTY5",
    "lastName": "Martens",
    "legacyId": 2886969,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Martens is a wonderful professor. She always loves to answer your questions and take them seriously. Top-hat is used in this class and well-organized review guides are provided. You can do well in this class if you study hard enough. ",
        "course": "3000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "The tests in this class are difficult unless you take the time to understand and study for the material. Tophats are used for attendance but only a certain amount is required not all.",
        "course": "3000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Martens has gotta be one of the nicest professors around and she was always willing to answer questions after class. Show up to class to get the participation points and study the slides and review guides for the exams. There is a little bit of extra credit, and she drops your lowest two exam scores if you do better on the two optional finals.",
        "course": "3000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is seriously the nicest woman ever and knows the material really well. She is super helpful and understanding the class is graded on 4 exams. Neuroscience majors don't really have a choice they have to take this class but Dr. Marten's is awesome and don't be afraid of this course its not that bad.",
        "course": "3000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Neuroscience",
    "firstName": "Stephanie",
    "id": "VGVhY2hlci0yOTE4Nzg5",
    "lastName": "Muscat",
    "legacyId": 2918789,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Stephanie as a TA and guest lecturer for my 4100 class. She gave very clear and informative lectures, I actually remember a lot from her class despite having taken it a while ago. I look forward to future classes with her teaching! \nShe's also really good at answering questions, super receptive!",
        "course": "4100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Stephanie was my TA for Neuro 4100. Super receptive to any questions that I had pertaining to the course and genuinely listened to my questions and concerns. She also taught lectures for the course and she made difficult content easily digestible. ",
        "course": "4100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great TA for history of neuro. She helped make this class super interesting and engaging despite the online format. Would definitely take more of her classes in the future, you can tell she has a love for teaching!",
        "course": "3025"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Stephanie was hands down one of the best TAs I've ever had for a course. Not only is she super knowledgeable about the material, but she also knows how to make a great presentation. All of her lectures were very digestible and easy to follow for those who are new to the topic.",
        "course": "4100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Neuroscience",
    "firstName": "Brian",
    "id": "VGVhY2hlci0yNzE4MjY1",
    "lastName": "Kaspar",
    "legacyId": 2718265,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "What a fun lecture series and so informative. Great real lab examples of science and how it relates to what we learn in our textbook. ",
        "course": "IBGP780"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "A really amazing course that helped me think about science and presentations. ",
        "course": "IBGP780"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "was one of the best classes in my graduate training!",
        "course": "IBGP780"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.1,
    "department": "Neuroscience",
    "firstName": "Charlie ",
    "id": "VGVhY2hlci0yODk3OTgz",
    "lastName": "Campbell ",
    "legacyId": 2897983,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Didn't have a class with him but had to schedule an appointment with him. I don't like his personality and snarky attitude. ",
        "course": "NEURO1100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Seemed like people didn't like his personality, but he gets results and he knows it. So he can be snobby if he wants to be. Maybe a little too much homework than I'd like for a survey class, but he was super helpful and knowledgeable. If you wanna go to med school, law school, or any sort of grad school, he's your guy.",
        "course": "NEURO1100H"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Had Dr. Campbell as my freshman advisor. Scheduled one singular meeting with him. He double booked the time slot AND didn't show up. Emailed to reschedule and to this day have never heard back from him. Never scheduled with him again. Friends have had bad experiences as well, completely unprofessional and uses \"humor\" to cover up snarky attitude.",
        "course": "NEURO1100H"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "Would give him a zero if I could. I got a bad vibe from him immediately as he called out his co-chairs by acknowledging that they were not a \"doctor\" like him and further solidified my distaste when he walked into an advising meeting I was in (with another advisor) and scoffed and left when he found out my brother was a past disliked student of his",
        "course": "NEURO1100H"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's a nice guy but can be standoffish at times and not the best at offering opportunities/resources. Good advisor for freshman but consider other advisors for later years.",
        "course": "NEURO1100H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Phenomenal advisor in the Neuroscience program at tOSU! Despite having a Phd in Psychology and having had the opportunity to teach Psych classes, Dr. Campbell choose to serve as adviser and build the program along with various researchers who are very respected in the field. Very down to Earth and approachable!",
        "course": "NEURO1100H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I dont have him for class but met with him for help scheduling classes as my honors advisor. He is my absolute favorite person Ive met thus far. Hilarious, caring, and also so knowledgeable in what he does. I walked out of his office with my classes all scheduled and a sense of security knowing that I have someone like Dr. Campbell to guide me",
        "course": "PSYCH100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome professor that loves to use video clips from The Big Bang Theory in lecture. Charming, funny and extremely helpful!",
        "course": "2300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is great! Loves helping others.",
        "course": "PSYCH1000"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "A great teacher. Loved his way of teaching and always approachable. One of the best professors I have ever had.",
        "course": "PSYCH100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Charlie is a great teacher, really cares about students, humanistic approach, fed off students energy, if he sensed the class was tired he sent you home, great preparation for quizzes/exams.  Funny clips in class, involved class greatly.",
        "course": "PSYCH100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Charlie was an amazing teacher and probably an even better guy. It seemed like he was having the time of his life up there teaching. He knew a lot of students names even in the somewhat large lecture setting. He always had cartoons or funny clips to keep you interested. Charlie was the man.",
        "course": "PSYCH100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "i love charlie like a son",
        "course": "PSYCH100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Neuroscience",
    "firstName": "Sara",
    "id": "VGVhY2hlci0yNjcwOTE2",
    "lastName": "Gombash Lampe",
    "legacyId": 2670916,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, her 4100 and her 3025 class are interesting and her exams/ work is very reasonable. I definitely recommend any neuro major to take her class. ",
        "course": "NEUROSC4100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is basically a survey class of disease. Dr. G is awesome and i've taken 3025 as well. She does have discussion posts and a few quizzes. Her EC is very generous. If you do everything, you can get over 100% in the class. I personally didn't even go to any of the lectures but she recorded them also. The content is interesting ! ",
        "course": "NEUROSC4100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "As a second-session class, this ended up being a bit of a grind, but I really enjoyed my time in History of Neuroscience. Lectures were interesting and accessible even for those not interested in history, grading criteria was clear and fair, and Dr G was very generous in terms of assignments. I would absolutely recommend this class to neuro majors!",
        "course": "NEUROSC3025"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.9,
    "department": "Neuroscience",
    "firstName": "Robert",
    "id": "VGVhY2hlci05NTYxNzc=",
    "lastName": "Boyd",
    "legacyId": 956177,
    "numRatings": 72,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Boyd cares about his students and is very accessible during office hours and outside of class. His knowledge and passion for the material come across as he teaches. He presents material thoroughly and provides you with all the resources/practice you need to succeed in the class, but the text-heavy, lengthy lectures were not at all engaging.",
        "course": "NEURO3000"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very difficult class with a lot of in-depth content that goes at a fast pace. He basically just reads off the lecture slides and has an extremely monotone voice so it is hard to stay focused. I advise doing Cognella and rereading the lecture slides because the exams can be confusing and unclear.",
        "course": "NEURO3000"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "SUPER dry and spews information at you in 2 hour-long lectures. Only graded on exams and you won't hear from him at all unless you go to office hours. By far my least favorite class at OSU so far (because of him). Very very old school",
        "course": "NEURO3000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "You are graded on only exams. Literally got a B- because of 1 point. Can't stand this dude. He wouldn't even boost me by a whole 0.25%. His lectures are dry and boring, also 2 hours LONG because this class is online. The exam questions are pretty detailed and he schedules the 2 finals on the same day in the same time frame.",
        "course": "NEURO3000"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "this class was extremely difficult to get through lecture-wise. dr boyd has a dry humor &amp; would occasionally entertain us with strange stories from his past. however, he has a soothing voice that can put you to sleep. heavy lectures regarding the nitty-gritty of neuron pathways can cause you to drift away. helps grade with cognellaSAVED MY GRADE!",
        "course": "NEURO3000"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lectures were VERY painful and boring, probably could have skipped them and gotten the same grade. Didn't read textbook really, I didn't feel like it was worth my time when I did. Tests were very difficult, even with Cognella. This course is a weed-out for a reason. Get ready to work. I got a comfortable B, but it did not come easy.",
        "course": "NEURO3000"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Exams are extremely difficult and based off of memorization. You have to know the material extremely well to get high scores on exams. Grade based on the best 4/6 exams and the grading scale is adjusted so that an A falls in the high 80s. Lecture is extremely monotonous and not necessary to attend, however he sometimes throws in useful information",
        "course": "NEURO3000"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Your entire grade is based off of 4 exams. However, there are 6 total and he drops the lowest 2, and if you do well enough on the first 4 you do not have to take the two-part final! Boyd can be dry, but he lets his witty sense of humor come out sometimes during lecture. This is a tough class, so rereading the lectures several times is imperative!",
        "course": "NEURO3000"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I could not give this professor a high enough rating. While lecture can be a little dry, Boyd is actually really funny if you pay attention, and he cares about his students. Exams weren't too bad as long as you come to class, study, and DO THE COGNELLA. He gives at least 5-7 questions straight from the practice quizzes. You can even drop 2/6 exams!",
        "course": "NEURO3000"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Attendance not mandatory but helpful. He can be dry at times but overall gives good info. TEXTBOOK HELPS A LOT! Drops 2/6 exams, gives extra credit, provides practice quizzes (most questions are the same on exams!) and uses helpful grading scale (i.e. 88  A). Should be an easy A for neuro majors as long as you put in a moderate amount of effort.",
        "course": "NEURO3000"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "LOTS of material and 4 midterms (one every few weeks). Dr. Boyd's voice is extremely monotone and lectures were painful. He took some exam questions from material that wasn't in either the powerpoints or on cognella. At least he adjusts the grading so it's easy to get a B or higher.",
        "course": "NEURO3000"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "I thought this class was really good, It is basically an extension of Psych 3313. If you are interested by neuroscience you will do fine. I didn't go to many lectures but still got good grades. He takes ALOT of answers directly from the online quizzes. Two exams are dropped which is amazing, but beware the final is comprehensive and in 2 parts.",
        "course": "NEURO3000"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I know a lot of people dislike him or have heard the class is difficult but I think getting an A is pretty easy if you study a week before the test using the ppts and cognella. Definitely recommend going to lecture and taking notes as he talks. At times he can be really boring and put you to sleep but he has good stories and interesting facts.",
        "course": "NEURO3000"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "A lot of material, but 3000 is considered the weed-out class for Neuro so that should be expected. His lectures are a bit disorganized but thorough and fascinating. Exams are difficult but there is plenty of time given for them. If you use the Cognella quizzes, GO TO CLASS, study hard, and think through every question on the exams, you'll do well.",
        "course": "NEURO3000"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "Speaks clearly but he's monotone, rambles and he's very controlling, opinionated and passive agressive like most of the high up faculty at OSU. He blatantly ignores student's questions. He gets to do this. Everyone in neuro has to take his class. There's only one other instructor.",
        "course": "COS126"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 2,
        "comment": "Everything is off the slides, he even says you don't need the book. He drones on and on with very little specifics, talks in circles. He speaks loud and clear but he's monotone, ignores raised hands. He's completely in his own little world.",
        "course": "NEURO3000"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Would've gotten a better grade if there were more grading opportunities. Complete PrepU before finals even start because some quizzes will randomly be closed off before the exam and you won't get extra credit. Anyone can read off of powerpoint slides. I taught myself the material. The worst class in this major. Professor distanced himself from us.",
        "course": "NEURO3000"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "I loved Dr. Boyd! His lectures are boring honestly, but he is great to talk to in office hours and willing to help out however he can. Read the textbook and do the prepU and you will be fine.",
        "course": "NEURO3000"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Boyd's voice will most definitely put you to sleep. Most boring lecture I've ever sat through. But if you study with the online practice quizzes he gives, it's really not impossible to get an A.",
        "course": "NEURO3000"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "I don't understand the horribly low ratings /: honestly speaking, yea well he doesn't put forth enthusiasm in teaching like many neuro lecturers do, but he does inject some hilarious personal stories occasionally to spruce up his teachings. His notes needs to be supplemented w the TB, and also go to class!! He gives out helpful hints and keywords!!",
        "course": "NEURO3000"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "I'm literally writing this during class-lecture is THAT boring. Dr. Boyd is the most dry, monotone lecturer you'll ever have. He's a good guy &amp; willing to help, but unless you can stay awake during class, it's not worth it. Your better off studying the material at home (&amp; I mean study HARD, there's a lot) &amp; doing PrepU. Get ready to hustle hard.",
        "course": "NEURO3000"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "He's definitely not my favorite professor but not the worst I've had. He's nice and the test material comes directly from the slides. Definitely helps to read the book. The material is really specific so just make sure you study in advance and study hard.",
        "course": "NEURO3000"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Boyd's class is just fine- he is a great professor, despite the monotone voice. Go to class and take good notes, read the textbook, and most importantly: do the PrepU assignments and quizzes!! Success is easily attainable in this class with some work.",
        "course": "NEURO3000"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 4,
        "comment": "Personally, I thought this class was easier than PSYCH3313; the material from 3313 has a decent overlap with this class.  Boyd is boring; his voice will lull you to sleep if you let it.  Take good notes in class, study the details, and you'll be fine.  Around 3-4 chapters per test which isn't bad, and the adjusted grading scale is a godsend.",
        "course": "NEURO3000"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "I don't understand the complaints about this class.  Exams are based directly off his slides, you don't even need the book or to go to class for that matter. A decent amount of effort is needed, but an A is easily attainable, especially considering his grade scale.  He gives you plenty of chances to do well. Don't be lazy and you will do fine.",
        "course": "NEURO3000"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 3,
        "comment": "Boyd is very dry and gets off topic easily so it can be hard to focus, but try to take notes because the slides are very minimal in details. The optional final and adjusted grading scale definitely help.",
        "course": "NEURO3000"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "Boyd has a very dry sense of humor but is absolutely hilarious. Neuro 3000 is a hard class but if you work you will do well. Adjusted grading scale helps. Dont fall behind. definitely review old exams in office hours. He is always willing to help and is very personable.",
        "course": "NEURO3000"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 5,
        "comment": "Probably the hardest earned A- I've ever got. Lecture is not necessary, you'll only find yourself struggling to remain awake. Test preparation is absolutely key, DO NOT PROCRASTINATE ON STUDYING!!! If you don't know something, ask before it gets more complicated. Other than how hard the class is, Boyd is overall really nice, just boring in lecture.",
        "course": "NEURO3000"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Boyd is a good professor for the class that he teaches! He tries to explain the information the best way he can and if you have questions, he is more than glad to answer them! He is an interesting man out of class so get to know him in office hours, it will help you a ton! He explains the materials you get wrong in office hours and helps you",
        "course": "NEURO3000"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "Here's a little poem about Boyd and Neuro 3000: He's not the best He's not the worst But he's the only one  Who teaches this course",
        "course": "NEURO3000"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 1,
        "comment": "Dr. Boyd is very boring. The class material is a little dry,  but the lectures were not engaging most of the time. He seems like a chill guy, but not the best lecturer. Additionally, his tests included tricky true-false type questions and did not accurately assess the material. Reading the book helps! His slides follow it but the book is better.",
        "course": "NEURO3000"
      },
      {
        "index": 32,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is very monotone. Lectures get boring after a while. He can be very confusing and say irrelevant things. His test are hard and confusing. It tricks you easily.",
        "course": "NEURO3000"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 4,
        "comment": "Let me tell you now, this class was difficult. You have to put a lot of reading, studying, and effort to get a good grade. Dr. Boyd's lectures have good material, but can be grueling . The book is your friend, read it!",
        "course": "NEURO3000"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is not hard AT ALL. I never attended lecture not once and ended the class with a 95 no curve needed. The biggest issue students have is that they do not know how to manage a heavy information load. If you have less than 700 notecards for each exam you are studying for an F. Read the book and make notecards, it is that simple.",
        "course": "NEURO3000"
      },
      {
        "index": 35,
        "rating": 2,
        "difficulty": 4,
        "comment": "If you don't have to take this for your major, DON'T.  He's a great guy, very smart, but he's given up on this class by now. His lectures are long and it's hard to say who's more bored-you or Dr. Boyd. Go to office hours, and read the book. He follows it pretty closely and it makes more sense than his slides. (His tests are based solely on slides.)",
        "course": "NEURO3000"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Boyd was great. He may be dry at times, but he knows his neuroscience and is a great connection to have for future goals. He is willing to meet with students, but many students wait until it is too late.",
        "course": "NEURO3000"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures seem really long and its very easy to doze off or zone out. Its better to read the book at home. But a nice human being and knows a lot about neuroscience. He tries to make lectures interesting but doesn't help. Read the book, follow lecture slides, go to review session. 3 midterms, 2 finals. Drops lowest 2 grades. Grade above 88% is an A.",
        "course": "NEURO3000"
      },
      {
        "index": 38,
        "rating": 3,
        "difficulty": 4,
        "comment": "When reading these reviews it is important to keep in mind the type of student writing them. This class is no where near easy! Be warned! Boyd's lectures are crazy boring. To compensate for zoning out/ not going to class you must read the textbook; it is the key to doing well. Slides are ambiguous and exams are hard. IF you put in work you'll be ok",
        "course": "NEURO3000"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Boyd is a well-meaning guy with a very dry voice. His lectures are extremely long, especially when they're in the late afternoon for 1.5 hours at a time. However, if you manage to take notes and memorize what's on his powerpoints, the exams shouldn't be bad. He also takes the highest scores of 3 exams out of 5, so you can avoid taking the final",
        "course": "NEURO3000"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 4,
        "comment": "This is the most boring class I've ever taken and it's 90% because his voice is designed to put you to bed.",
        "course": "NEURO3000"
      },
      {
        "index": 41,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Boyd was not a great professor. He was pretty monotonous and boring in the delivery of his lectures. His exams were pretty nitpicky and not easy to study for. That being said, he does let you drop the lowest 2/5 exam grades. If you study enough out of class you will do fine",
        "course": "NEURO3000"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class is pretty straight forward. Make a bunch of note cards and you will be fine. But he is pretty much a massive jerk. I once went to him after an exam to ask about a question i missed. Since I got a 94% on the exam he asked me if i was conceited and above the class for worrying about 3% when I still got an A. Not helpful or kind. ",
        "course": "NEURO3000"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Boyd was not that great of a professor. He was a nice guy, but he was so monotonous that he drained the energy out of you, and it was very difficult to pay attention during class. His exams were very straightforward and clear. His lectures literally followed the book verbatim. Read the book as well as the powerpoint slides and you can get the A",
        "course": "NEURO3000"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anyone that says he is not clear, must not go to class. Exams test exactly over the slides. If there is something unclear on the slides, he likely explained it in lecture. GO TO CLASS, take notes based off what he says. You can read the book, but his notes come directly out of it so its unnecessary unless you need more clarity. Exams are very fair.",
        "course": "NEURO3000"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 2,
        "comment": "Honestly, this class is not hard at all, IF you put some work in. Neuro isn't a freebie major, so if you don't like actually being a student, switch majors. Reading the book reiterates his slides because his slides are verbatim parts of the book. The midterms are not hard if you know the slides. And 35 chances for an A is very generous. Easy A.",
        "course": "NEURO3000"
      },
      {
        "index": 46,
        "rating": 3,
        "difficulty": 2,
        "comment": "The course material is boring and his lectures are even worse, but the class is not that hard, and he is a pretty goofy dude. Took the best 35 exams which I thought was overly generous, and he wanted to help - he always complained for more students to attend his office hours. The book was a must-have, but I found it to be a very manageable A.",
        "course": "NEURO3000"
      },
      {
        "index": 47,
        "rating": 3,
        "difficulty": 3,
        "comment": "Boyd is definitely a nice guy, however this class is just painfully boring at times. Going to class is really not 100% necessary, especially if you have the book. That being said, the questions on the exams really do come from his slides, they just take a little deciphering at times and his test questions are sometimes ambiguous. Pretty fair prof. ",
        "course": "NEURO3000"
      },
      {
        "index": 48,
        "rating": 3,
        "difficulty": 4,
        "comment": "His power points are pointless, so be prepared to buy the text book, use the student textbook help site online (free).  I trusted him by believing him when he said we  don't need the book, and just read the slides and my grade sucks now, so, just read the book, & if he tells you that secretive review questions will be on the exam, that is a lie. ",
        "course": "NEURO3050"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 4,
        "comment": "Its very clear neuroscience is a weed out major (50% classes being in med school) 40 students dropped out first semester because of chem 1210 and this class will most likely make some people switch to the minor. Boyd was unclear at times and tests were unnecesarily difficult with 70 averages. I survived this class but will switch to the minor...",
        "course": "3000"
      },
      {
        "index": 50,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lecture is painful to sit through.  That being said, what you see is what you get.  None of the exam questions are a surprise, but you have to be familiar with the material.  The slides aren't always clear, but they follow the textbook verbatim.  Boyd is reasonable and let me take the final four days after my scheduled time with another section.",
        "course": "NEURO3000"
      },
      {
        "index": 51,
        "rating": 2,
        "difficulty": 3,
        "comment": "Nice guy, probably would be fun to visit at office hours, but lectures are long and boring. His slides don't make sense so either read the book or prepare to take thorough notes during class. 3 tests during the semester and 2 tests are offered during the final. You drop your 2 lowest scores. Test questions are tricky, especially the wording.",
        "course": "NEURO3000"
      },
      {
        "index": 52,
        "rating": 3,
        "difficulty": 4,
        "comment": "There are 3 exams and 2 parts to the final; you get to drop your lowest 2. BUY THE BOOK. The lectures are pretty dry because he goes in to a lot of detail, but reading the book really helps! Side note, I missed the final exam and he let me redo it the next day, so he is a pretty reasonable guy.",
        "course": "3000"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 4,
        "comment": "This was a tough class, but by no means unfair. Lectures are boring and long but everything on the tests comes off of the power point slides so just go and listen. He is more than willing to help in office hours, you can drop 2 tests, and there was a generous curve - no complaints here.",
        "course": "NEURO3000"
      },
      {
        "index": 54,
        "rating": 1,
        "difficulty": 5,
        "comment": "His lectures were so difficult to pay attention to, he's monotonous, never encourages questions, does not seem very interested in teaching. His exams are ridiculously specific & difficult. He said that we would not need to textbook, but I wonder if most of the questions he made for the exam came from the book. He's awful overall. ",
        "course": "NEURO3000"
      },
      {
        "index": 55,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is not a very interesting professor. He just reads off the slides and doesn't show much interest. He will help if you ask. The tests seem unreasonable for an intro class and based off of the material he presented, especially because he told us at the beginning of the semester that we wouldn't really need the book. ",
        "course": "NEURO3000"
      },
      {
        "index": 56,
        "rating": 1,
        "difficulty": 5,
        "comment": "I am interested in neuroscience, but I regret taking this class.",
        "course": "NEURO3000"
      },
      {
        "index": 57,
        "rating": 3,
        "difficulty": 3,
        "comment": "Boyd is quite dry but you will get out what you put into the class. The questions are specific but if you read the book and memorize the powerpoints you will be fine,  no surprises. Honestly going to class was useless except for when he used socrative review questions before the tests. The grading scale is generous and you get to drop 2 tests ",
        "course": "NEURO3000"
      },
      {
        "index": 58,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Boyd's lectures are very boring and disengaged. His slideshows make very little sense and are hard to follow. He decided to switch his tests for this semester since a lot of students have his old ones. The questions he chose are confusing and sometime unclear. I'd recommend reading the book before coming to lecture if you want success in 3000.",
        "course": "NEURO3000"
      },
      {
        "index": 59,
        "rating": 3,
        "difficulty": 2,
        "comment": "While Dr. Boyd is a dry lecturer, he gives all the info you need during lecture. Over half the class skipped lecture, which explains why so many people think he is awful. Boyd is a great person to talk to, and always willing to help. Just go to class, unlike 90% of the people who wrote bad reviews. Your final grade is your best 3 of 5 exam scores.",
        "course": "NEURO3000"
      },
      {
        "index": 60,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Boyd is kind of a boring lecturer but this class is really not that bad. You even get to drop 2 of your exams. To be completely honest you don't really need to show up to class since all the information is on the slides but I would recommend that you read the textbook as well. Dr. Boyd is not really a bad professor but he is sort of just ok...",
        "course": "NEURO3000"
      },
      {
        "index": 61,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very disengaged professor that gives overly complicated exams for an intro class. I really wish he would be more interesting and make his tests easier since he's the only one teaching this class.",
        "course": "NEURO3000"
      },
      {
        "index": 62,
        "rating": 1,
        "difficulty": 4,
        "comment": "HORRIBLE lecturer. Probably the most boring person I have ever encountered. There is nothing you can do to avoid him though since Neuro 3000 is a requirement for the major. Definitely study the slides for exams. Good luck.",
        "course": "NEURO3000"
      },
      {
        "index": 63,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Boyd has no funding for research, so he teaches this class half halfheartedly. This is supposed to be an interesting class and unfortunately, I'm seeing no effort put forth by the professor. The sad thing is, this is the ONLY class he teaches.",
        "course": "NEURO3000"
      },
      {
        "index": 64,
        "rating": 1,
        "difficulty": 4,
        "comment": "His lectures are awful, and he treats his students horribly. Hardly cares about lecturing his students, and hates to be there. Rely completely on his powerpoints, but do that at home, no need to suffer through his boring lecture.",
        "course": "NEURO3000"
      },
      {
        "index": 65,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures can be boring, but the information he gives is great if you're majoring/minoring in Neuro. I never needed to read the book, save vocab maybe. REALLY study the slides and take notes during lectures because he often repeats the ideas that WILL show up on tests. Otherwise, just cram for tests and you'll be okay. Helpful office hours too!",
        "course": "NEURO3000"
      },
      {
        "index": 66,
        "rating": 3,
        "difficulty": 5,
        "comment": "Absolutely useless lectures.... read off slides.... tests are brutal, doesnt make study guides. How does he have a job? Literally a robot could teach this class. prepare to study a lot of stuff that you arent even sure will be on the test, then get killed on test day by that one thing you forgot",
        "course": "NEURO3000"
      },
      {
        "index": 67,
        "rating": 2,
        "difficulty": 5,
        "comment": "Tests are ridiculously hard and detailed. He reads off the slides, but is the only one who teaches 3000. Take other major Neuro classes before taking 3000 so you might have a clue what's going on when you take this.",
        "course": "NEURO3000"
      },
      {
        "index": 68,
        "rating": 2,
        "difficulty": 5,
        "comment": "His tests were just terrible! You never really knew what he was looking for. Lecture was useless as well. He just read off his powerpoints. It sucks that he's the only professor that teaches this class.",
        "course": "NEURO300"
      },
      {
        "index": 69,
        "rating": 3,
        "difficulty": 4,
        "comment": "Exams were really hard. He reads off of his Powerpoints in lecture, so I found them useless. Reading the chapters and taking notes from his powerpoints are the best ways to prepare for the exams. Don't underestimate the amount of studying you'll need to do for his exams.",
        "course": "NEURO300"
      },
      {
        "index": 70,
        "rating": 3,
        "difficulty": 4,
        "comment": "Kind of  monotonous in lecture, but has office hours. Never answered my emails. Tests are multiple choice, but you still have to know everything, and you can't just go by recognizing the right answer. I never really got the hang of it. Look at old tests because he repeats questions.",
        "course": "NEURO300"
      },
      {
        "index": 71,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "NEURO300"
      },
      {
        "index": 72,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "NEURO300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.8,
    "department": "Neuroscience",
    "firstName": "Stuart",
    "id": "VGVhY2hlci0yNTgyNzM1",
    "lastName": "Mangel",
    "legacyId": 2582735,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This was the most challenging course i've taken at OSU but insanely interesting. I felt lucky to learn from Dr. Mangel as he is so intelligent and devoted to the lecture material (most students don't notice that some of the research shown in lecture is his own!). If you are really committed to studying advanced neuroscience, take this class!",
        "course": "NEURO4623"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Some might refer to him as a dry lecturer he is straight forward with the material and his lecture style is the norm for the department. He is accommodating and does a good job explaining concepts. It's on you to reach out to him, but once you do he's very helpful. The course content is interesting even if the delivery isn't study and youll do well",
        "course": "NEURO4623"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Yikes.",
        "course": "PSYCH4623"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "Literally the worst professor I've ever had at the OSU, class material is not hard, but his lecture is just simply boring and dry. Taking the class with another professor if possible, it felt like a total waste of money taking his class I am extremely frustrated with him all the time.",
        "course": "NEURO4623"
      }
    ],
    "SEI": []
  }
]