[
  {
    "avgDifficulty": 4.2,
    "avgRating": 2,
    "department": "Nursing",
    "firstName": "Amber",
    "id": "VGVhY2hlci0yNzIyNTA2",
    "lastName": "Murray",
    "legacyId": 2722506,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is a nice person, but her class is just terrible. She brings in guest lectures every week, group projects biweekly and just insane amount of homework. The quizzes are SO hard for no reason and she won't share the answers or justify why the answers are wrong. The quizzes are open note but not on the quiz. Also videos each week are 50+ min long. ",
        "course": "4240S"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Should not be even called a professor. She does NOT teach a thing. Relies on guest speakers to teach and quizzes on niche information from them or videos pulled from the web. All course work is group work. She will not give credit back despite talking to her. She'll just blame you for not following instructions she does not provide. ",
        "course": "4240S"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "You will get good grades if you follow the rubrics and the instructions are clear.",
        "course": "4240S"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class has interesting. The only grades came from parts of our group project. No quizzes at all.",
        "course": "4240S"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely the worst professor I've ever had. In a clinical class, exams account for 80% of our grade and ask questions about statistics and random facts. There are dozens or videos, power points, articles, and links to study before class, usually taking me 5 hours. I spent hours studying for exams and still got a B on every exam. Absolutely awful.",
        "course": "4240S"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.6,
    "department": "Nursing",
    "firstName": "Brooke",
    "id": "VGVhY2hlci0yNjIxMjcx",
    "lastName": "Rengers",
    "legacyId": 2621271,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "N/A",
        "course": "NURS2452"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Brooke is a wonderful professor and person. She has great and concise lectures and exams!",
        "course": "NURS2452"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I have never had such a kind professor. She cares so much about the wellness and success of her students. This course was very manageable and I learned so much!",
        "course": "NURS2451"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Brooke really cares about us, as nursing students, and will do everything in her ability help us learn. I had her for both patho and pharm, and can truly say that she is a great lecturer and wants us to learn the material even if it is complex. ",
        "course": "NURS2450"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Brooke has to be the sweetest professor I've ever had. She has made it clear since the beginning of the semester that she is here for us and that she wants to see us succeed. She made this slightly difficult course pretty easy to pass, as long as you put in the work. She makes sure you receive the maximum amount of help. Would def take her again!!",
        "course": "NURSING2450"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "She always tells us she is new to teaching and new to the course content. I prefer a professor who at least someone knows what they are doing (or at least pretends). She's very nice, easy, and tells us exactly what we will be tested on. I'm glad I got an A but I didn't actually learn very much and it's negatively impacting this semester.",
        "course": "NURS2450"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Brooke is the nicest professor I've had! She genuinely cares so much about all of her students and makes the class enjoyable. She even brought candy on Halloween. The exams are made to not trick us and are straightforward. You have to study a good amount and know the information, but the exams are very fair. The content was also really interesting.",
        "course": "NURS2450"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Brooke is such a great professor and she is always looking to help her students. Super nice and prepared well for her lectures. Gives us a clear outline for exams. Dont need to read. Do the prepUs!",
        "course": "NURS2450"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof Rengers is amazing. She is very thorough with her content and gives very in-depth explanations. If she does not know the answer to a question she will take the time to find that answer for you. I had her for both pharm and patho and she was amazing in both classes.",
        "course": "NURS2470"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Rengers was amazing! She clearly cares about her students and has one of the kindest dispositions ever. She prepared us well for exams. Weekly quizzes keep you accountable for studying, and besides that there are only some group assignments to do outside of class. Overall, loved her and am so excited that she is teaching pharm next semester!",
        "course": "NURSING2450"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Brooke is one of the best professors I have had so far. She is so nice and she prepares you so well for tests. She truly cares for her students and wants you to succeed. I am so excited to have her again for Pharmacology.",
        "course": "NURS2450"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4.4,
    "department": "Nursing",
    "firstName": "Christine",
    "id": "VGVhY2hlci0yMDMxOTAx",
    "lastName": "Sayre",
    "legacyId": 2031901,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Christine is a passionate teacher. You need to put in effort, but if you commit and use the resources, you'll do well. She uploads her lectures after class now. Her final was the easiest of my junior year because she prepares her students well. As a clinical instructor, she's tough but makes you a better student!",
        "course": "NUR4280"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great teacher. Passionate and wants students to learn.",
        "course": "NUR4280"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Makes the class way more than it needs to be. Doesnt record lectures which would be VERY helpful. Every other professor ive had has always recorded lecture. Makes us do silly in class activities that are a waste of time. Class goes the full time 3 hours and 30 min which could easily be an hour and a half.",
        "course": "NUR4280"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Christine is an awesome professor and really cares for her students! It is very apparent she is passionate about what she teaches! Just get to class, do the assignments (some questions taken for quizzes), and GO TO THE END OF SEMESTER KAHOOT! It will help you on the final significantly!",
        "course": "NUR4280"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Grades all of the assignments and is very helpful when asking questions. Very picky about grammar and citations. Sometimes slow on grading discussion boards. ",
        "course": "NRSADVN2440"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 2.7,
    "department": "Nursing",
    "firstName": "Molly",
    "id": "VGVhY2hlci0yNzUzMDk5",
    "lastName": "McAuley",
    "legacyId": 2753099,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. McAuley was a very kind professor and seemed very passionate about nursing. However, the lectures for this course were not very interesting, and I often dreaded going. ",
        "course": "NURS2200"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Long and boring lectures. Must read and know the material. Poor attention span of the teacher. She doesnt remember anyones names.",
        "course": "N4260"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "I had Molly, as both my professor and my peds clinical instructor. She was a decent lecturer and the class overall was easy. All the quizzes and final are online. However, she was a pretty absent clinical instructor and despite being with her for 7 weeks she never learned a single one of our names and was MIA half the clinical. ",
        "course": "N4260"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Nursing",
    "firstName": "Ethan",
    "id": "VGVhY2hlci0yOTM3NTk2",
    "lastName": "Morgan",
    "legacyId": 2937596,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Online class but learned a lot. Professor willing to provide feedback on assignments before grading. ",
        "course": "N4150"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.7,
    "avgRating": 1,
    "department": "Nursing",
    "firstName": "Courtney",
    "id": "VGVhY2hlci0yNjI3MzU2",
    "lastName": "Shihabuddin",
    "legacyId": 2627356,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst instructor ever, unprofessional, and loud. She reads straight from the PowerPoint. Difficult way of teaching. I will not recommend anyone to be in her class. ",
        "course": "NURS7450"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "She obviously doesn't care about teaching. she uses other's slides and doesn't even bother changing the author's name to herself. Will quiz you on things she doesn't talk about in class. Hard to understand her in class.",
        "course": "NURS7450"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "She has a very convoluted way of thinking and you can hear it from her lectures. She makes it very difficult to understand. She just talks and talks and talks in her lecture. She talks very fast too. Just Google it or read the textbook. They are all better than her.",
        "course": "PATHO7450"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.4,
    "department": "Nursing",
    "firstName": "Kaitlyn",
    "id": "VGVhY2hlci0yNTc0NzQz",
    "lastName": "Kolcun",
    "legacyId": 2574743,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is extremely tough and hard. She talks super fast and tries to make the quizzes hard. Class is very organized and put together. Do not like how you have to watch 3 hours of pre recorded lecture AND then 3 hours of in person lecture. She said this class should take 10 hours of your time outside class. ",
        "course": "NURS2270"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is a HARD class but Dr. Kolcun clearly cares about her students. You HAVE to be prepared before you come to class and do NOT fall behind. She is very receptive to feedback and genuinely wants us to succeed.",
        "course": "NURS2270"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Med Surg is a really hard class but Dr. Kolcun does a good job of making the content understandable. If you can make time to read the textbook it is really helpful but you don't have to to pass, all of the information you will be tested on is in the PowerPoint slides.",
        "course": "NURS2270"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Med Surg is a hard class to begin with, but Dr. Kolcun helps you get through it. She always makes sure the class is understanding the material and allows people to ask many questions. There is a quiz every week over the material learned that day so it is best to prepare for class to do well on these quizzes. Prepare to put in work for a good grade.",
        "course": "NURS6270"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "She gives 6 pop quizzes throughout the semester. She isnt very empathetic towards students. Gave us an exam over things we havent learned and made it worth 50 points. Wouldnt round my grade up 0.4% to a B-. Very frustrating class.",
        "course": "NURS2270"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Kaitlyn is a very energetic teacher and cares about the subject. There were 6 pop quizzes and class had a lot of time just sitting around (3 hour class). HESI exam was unfairly graded but she adjusted after complaints. Exams weren't too bad, she gave a study guide. Lots of lecture, got pretty boring. Overall the class is fine just not my fav",
        "course": "NUR2270"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Pop quizzes - require you to be in class. Midterm was pretty easy, BUT we had a HESI exam over material we HAVE NOT EVEN LEARNED YET and was something that we couldn't study for... Class average was 60% and she said this was to be expected... yet made it worth 50 points. So unfair, class flipped out on her. Besides this, mediocre class.. LONG (3hr)",
        "course": "NUR2270"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.2,
    "department": "Nursing",
    "firstName": "Lauren",
    "id": "VGVhY2hlci0yNTM3Mzk2",
    "lastName": "Porembski",
    "legacyId": 2537396,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I LOVED her. Pharm is a hard class but she did do her best to make it easier. My advice, charts are your best friends. Organization is key. Tests are not to bad but weekly quizzes keep you accountable for your knowledge of material. You have to watch about 1-2 hours of pre recorded material before the 3  hour in person class WHICH SUCKS.",
        "course": "NURS2410"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "She isn't very clear with her exams. I never know what to study for her exams and I feel like some of the questions are trying to trick us. She is quite lecture-heavy but they are jammed-packed with helpful information. The flipped classroom is not a good setup for this course. It is quite hard to keep up alongside my other flipped classrooms. ",
        "course": "NURS2470"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Pharmacology is a HARD class but Professor Porembski worked incredibly hard to make sure we learned the material. We had to listen to lectures before class which I loved (pause, rewind, relisten) and in class we got to apply the material to the real world. She is very fair, very kind, incredibly caring, quick to answer emails &amp; give extra help!",
        "course": "NURS4270"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "There is no textbook for this class so the lectures are very important. Professor Porembski is very intelligent and helps emphasize the content that will be important for quizzes and exams.",
        "course": "NURS2470"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was always available to answer questions during lab, explained this really well, and it was so invested in my success both in this class and as a future nurse. I could tell she was smart and really knew her stuff too! I learned so much.",
        "course": "NURS2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.3,
    "department": "Nursing",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yNTc1MTAx",
    "lastName": "Henderson",
    "legacyId": 2575101,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Sarah is a great professor for this online course! You definitely have to put in some effort, but she wants her students to succeed and is very helpful. If you do well enough on the first draft of the research paper, you can even choose to not submit a final draft! Easy way to fulfill a GE and learn about disparities in healthcare.",
        "course": "NURSING2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "This is by far one of the easiest second-year writing courses to fulfill the GE. There is one long research paper, but it is broken up into parts, which makes writing it very manageable. There are also a few quizzes and discussion posts which are easy, and then an easy Oral Presentation that you record online. Sarah is a great professor, would rec!",
        "course": "NURSING2367"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class does require a significant amount of effort. There are two papers for the class; both are very research based. You cannot get by putting in minimal effort, and you have to watch all the lecture videos. However, I think I learned a lot about the US healthcare system through this class, and would recommend it.",
        "course": "NURSING2367"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Not graded by many things. 2 papers, 2 discussion posts, and 1 oral presentation. Do NOT need books. Weekly lectures with usually two 1 hour long videos- one on writing and one on healthcare. Papers take a good time to write. First rough draft the lowest score she gave was 76, so not the harshest grader. Second paper will def be graded harder.",
        "course": "NURS2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Nursing",
    "firstName": "Kady",
    "id": "VGVhY2hlci0yNTg0OTQ4",
    "lastName": "Martini",
    "legacyId": 2584948,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "This course was about evidence-based practice and you can really see Dr. Martini's love for the subject. Her lectures are so inspirational, which only motivates me to be the best nurse I can. I wish she could teach all of my courses!",
        "course": "NRSADVN4780"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Martini is so personable and caring. She is really passionate about what she does and it translates in her lectures. She is great about communicating and is very clear about course expectations and assignment instructions. Definitely one of my favorite college professors I have ever had.",
        "course": "NRSADVN2440"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 1.9,
    "department": "Nursing",
    "firstName": "Anita",
    "id": "VGVhY2hlci0yMzcxNjM1",
    "lastName": "Zehala",
    "legacyId": 2371635,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Her lectures are very dragged out and boring, can barely hear her at times. This class would have served better if it was asynchronous. She makes her exams unnecessarily tough over easy concepts. Her exams always have some sort of mistake, such as typos or conflicting answer choices. Other than that she's nice.",
        "course": "NUR2100"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "You could tell that Anita really cares about her students and wants everyone to learn. The class was pretty boring and slow but it was okay. I had her for health assessment lab too and she was an amazing lab instructor.",
        "course": "NURS2100"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "Taking her class via zoom, which I understand changes things. However, shes extremely unorganized, misspeaks often, is unclear, and changes her mind very often on whether class is asynchronous or synchronous. Often has things in ppt that are no longer used and just goes sorry I should have looked at this before class! Draws classes out.",
        "course": "NUR2100"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "S T U P I D class. Anita is a nice lady, but gives boring lectures. With that said, she did cry on the second lecture... class felt so awkward. Useless class/ common knowledge. Could have been taught in 3 lectures-was dragged out. Went to first couple then skipped all the rest. Gives extra credit but there is no point bc everything is easy.",
        "course": "NURS2100"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "A lot of the information in this class is common sense. I tried to go to all of her lectures but had a hard time paying attention. All of the assignments and exams were easy.",
        "course": "NURSING2100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "She is a very, very nice and caring person, but her lectures were pointless (powerpoints are posted, half the time class is cancelled, homework is extra credit, online exams, no participation). Most of the class doesn't show up to lecture. Exams are fairly easy if you study a few days in advance. She is very sweet though - bless her.",
        "course": "NUR2100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "She is very bad at explaining any of the course content. You also have about 2-3 hours worth of lectures to listen to BEFORE class, usually have a quiz (tRAT/iRAT) every class, but you should leave right after because lecture is useless. You'll mainly have to teach yourself and study ALOT",
        "course": "NUR3270"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 5,
    "department": "Nursing",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yNjgwNjI3",
    "lastName": "Warren",
    "legacyId": 2680627,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Sarah Warren. She was my lecture instructor and she is definitely passionate about teaching. She is very clear and articulate, and makes sure you understand what is being taught. Gives great feedback and is always giving extra credit opportunities. We had quizzes every week and they were very helpful when it came time to study for midterms.",
        "course": "NURS2410"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "She was my clinical instructor for this course and she was amazing. We had to learn all of our skills over zoom and she managed to make it as good as she could. She also gave really great feedback.",
        "course": "NURS2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Nursing",
    "firstName": "Alice",
    "id": "VGVhY2hlci0yNzc0NTg1",
    "lastName": "Teall",
    "legacyId": 2774585,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Teall has a great compassionate manner to her and was so helpful during this class. It is asynchronous format so you meet every other week. No textbook, but she does assign some reading material which was helpful when finding EBP ideas and research. I never liked my previous nursing EBP classes or projects, but she made it fun!",
        "course": "NUR7344"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.3,
    "department": "Nursing",
    "firstName": "Amy",
    "id": "VGVhY2hlci0yMjk5MDM2",
    "lastName": "Mackos",
    "legacyId": 2299036,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "In my opinion, Tries to Roadblock student reasonable requests to get better .ppt version of lecture slides. Didn't like Her attitude; seemd she didnt want to accomm diff learning styles w reasonble requests. Saw huge discrepancies betwn lecture content &amp; course objectives; I think there were lame excuses; just clean it up. Rating Mackos poorly.",
        "course": "N7450"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "In my opinion, Tries to Roadblock student reasonable requests to get better .ppt version of lecture slides. Didn't like Her attitude; seemd she didnt want to accomm diff learning styles w reasonble requests. Saw huge discrepancies betwn lecture content &amp; course objectives; I think there were lame excuses; just clean it up.",
        "course": "N7491"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Mackos is one of the best teachers I have ever had. She is an amazing explainer, and she really cares about her students. I genuinely enjoy her lectures- she makes pathophysiology super fun and interesting!",
        "course": "N7450"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Professor Makos is all over the place in lectures She goes off topic a lot She is not specific towards the test at all She will have you do a mid semester survey and dispute everything the class ask of her This is the first class I have taken at the university where I do not feel like the professors goal is to make sure you do well in the course",
        "course": "PATHO7450"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Mackos is a good professor who has a clear and logical lecture style. She is really easy to follow and understand. She is very caring and responsive. Would definitely take classes she teaches in the future.",
        "course": "PATHO7450"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of the best teachers I've ever had. The pathophys content is difficult to digest but Dr. Mackos breaks it down into clear, palatable chunks of information. She is also entertaining and kind. Highly recommend!",
        "course": "N7450"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Mackos is an excellent lecturer and clearly knows exactly what shes talking about in regards to pathophysiology. Couldnt praise her teaching skills enough!",
        "course": "N7450"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "This course had a lot of material, and it is very difficult material. Dr. Makos is very nice and was a fine teacher, but her style of teaching did not make this material easier to understand than if I read the book or watched videos online (both of which I had to do).",
        "course": "NURS7450"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Nursing",
    "firstName": "Tara",
    "id": "VGVhY2hlci0yNzQ0OTY3",
    "lastName": "O'Brien",
    "legacyId": 2744967,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was a very interesting class. Prof. O'Brien obviously cared that everyone got full credit. I would take her class again in a heartbeat.",
        "course": "NUR8510"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.5,
    "department": "Nursing",
    "firstName": "Alendre",
    "id": "VGVhY2hlci0yNTcwOTU3",
    "lastName": "McGhee",
    "legacyId": 2570957,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE CLASS WITH THIS PROFESSOR. This was the worst experience I've ever had in college. NO live lectures or recorded lectures, you just have to teach yourself everything by reading the textbook. And then there is one midterm and one final using Proctorio. Both exams cover 30+ chapters. Completely unfair.",
        "course": "NURSING2470"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. McGhee is barely accessible via carmen; takes forever to respond (if ever). Instruction is horrible. Unclear reasoning when taking off points for answers to questions submitted correctly. I do not recommend taking courses taught by this lecturer.",
        "course": "NURS2470"
      }
    ],
    "SEI": []
  }
]