[
  {
    "avgDifficulty": 3.7,
    "avgRating": 2,
    "department": "Nutrition",
    "firstName": "Carla",
    "id": "VGVhY2hlci0yMTM3OTgy",
    "lastName": "Miller",
    "legacyId": 2137982,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Professor Miller was a tough grader and made her exams very confusing. She would also gaslight her students into thinking they were not studying enough when in reality her questions were worded poorly. She is passive aggressive and rude and would curve exams without letting us know so there was no way in knowing if you were getting the info better.",
        "course": "HUMNNTR4504"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Asks for feedback and then is argumentative. Does not listen to important class issues. Issues with the clarity of exam questions. Exam questions can sometimes be ambiguous. Arbitrarily curves exams. Was rude to a student asking for clarity on how to study for the exam by responding with \"WOW, why don't we just learn the material\". ",
        "course": "HUMNNTR4504"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "She gave a super tearjerker graduation speech on the last day of class, so you can tell she really cares about her students. Otherwise, her exam format is 20 multiple choice questions. It sounds straightforward, but because there are only 20 questions, you need to know the material well because there is only so much room for error.",
        "course": "HUMNNTR4504"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.9,
    "department": "Nutrition",
    "firstName": "Sanja",
    "id": "VGVhY2hlci0yMDg5OTQz",
    "lastName": "Ilic",
    "legacyId": 2089943,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Unfortunately this class is a requirement for many, but I wouldn't recommend it. You are graded on only 2 papers and the ServSafe certification exam. Although a 75 on the ServSafe is considered a good score (passing), many students hold themselves to a higher standard. The papers are NOT discussed in class, just in the syllabus. Average.",
        "course": "HUMNNTR2450"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher!",
        "course": "HN2450"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fun class and great instructor",
        "course": "HN3313"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I recommend this class",
        "course": "HN3313"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Fun class",
        "course": "HN2450"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "confusing questions.",
        "course": "NUT3313"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "She gives out candy in lecture for participation, which is pretty cool. There are pop quizzes, so stay on top of the material. There are also papers you have to write, but the requirements are kind of unclear because the information is just stuck in the syllabus and she does not really go over them. Otherwise, the class is not too bad if you study.",
        "course": "HN2450"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Nutrition",
    "firstName": "Kate",
    "id": "VGVhY2hlci0yNzcyODg2",
    "lastName": "Ormiston",
    "legacyId": 2772886,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures really quickly and doesn't put a lot of important information on slides. Some test questions are oddly obscure and specific. I felt that assignments were unfair at times given they covered material she barely grazed over. Overall, not bad, but could be fairer to students.",
        "course": "NUTR2314"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Nutrition",
    "firstName": "Jackie",
    "id": "VGVhY2hlci0yNDMzNDg5",
    "lastName": "Geitz",
    "legacyId": 2433489,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Bad communication for an online class, which made grade suffer.",
        "course": "HTHRHRC3400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Geitz provided many opportunities, during and outside of class, for discussion. She encouraged feedback, was receptive to the needs of the class and individual students, and altered instruction to accommodate. The tests covered dense material and required quite a bit of studying, but nothing tricky if you came to class. Overall enjoyable!",
        "course": "HUMNNTR2314"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her PowerPoint slides were just the outline and you had to take many notes to understand it. Her lectures were unclear and confused. There were many times that she changed the lecture content a few minutes before the class.",
        "course": "HN2314"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "One of the hardest and worst professors I have ever had. She was well-versed in the subject but could not communicate it clearly or thoughtfully. Class was always thrown together and powerpoints were confusing and unclear. Never had a clear plan of what she actually wanted to teach and asked the class to write exam questions for her.",
        "course": "HUMNNTR2314"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Nutrition",
    "firstName": "Julie",
    "id": "VGVhY2hlci0yNDAxNTkx",
    "lastName": "Kennel",
    "legacyId": 2401591,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Kennel is a very informed professional when discussing the basics of human nutrition. I took it online as a GE and I am glad I did. The projects were not bad at all, only thing is the exams got difficult if you didn't study. Overall good class.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very kind professor, but exams were excessively difficult and you certainly have to work for your grade. Dont take this class if you are expecting an easy A",
        "course": "HN2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3,
    "department": "Nutrition",
    "firstName": "Ouliana",
    "id": "VGVhY2hlci0xODE2MDcw",
    "lastName": "Ziouzenkova",
    "legacyId": 1816070,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Z may seem a bit intimidating at first, but she is wonderful. She cares about her students and when you reach out to her for help she gives amazing feedback and makes sure you know what is missing. She is incredibly smart and caring, don't shy away. She is there to help and she will make sure you succeed, just ask her for help! ",
        "course": "HUMNNTR2210"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is very knowledgeable and knows what shes talking about. The first reason I gave her 2 stars is because her accent is very thick and hard to understand. She also doesnt know how to teach in a way that students who have no prior knowledge of the subject need to really learn. Her exams were ridiculously difficult and took years off my life",
        "course": "HUMNNTR4610"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "4 midterms and a writing assignment given by each professor (two teach the class, switch halfway through). Dr. Z's tests were difficult  missing class really hinders your chances for success. Although she seems intimidating, all she wants is for you to understand the principles of nutrition, and if you reach out to her she will find a way to help.",
        "course": "HUMNNTR4610"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Your grade for this class came down to 3 things: research proposal (60%), attendance (20%), and the final (20%). Research proposals take time and are very long. They shouldn't be required for a 1 credit class. She attended lecture twice the entire semester. She made guest lecturers do her work every week & didn't even stay for their presentations.",
        "course": "HUMNNTR3780H"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "While she was unaware of when class started (often came in late/started class late), she really knows her stuff. The book is a must, especially if you plan on skipping a few classes; her lecture power points are not detailed in any way, so do not rely on them alone.",
        "course": "HUMNNTR4610"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "She is a good person but a bad teacher if that makes sense. Her accent is pretty thick and expects students to understand EVERYTHING she is saying.. which is impossible. If you don't understand, then too bad because she won't have any pity on you. Has class \"debates\" between groups every week. Those are a chance for her to embarrass you. Avoid!!!!!",
        "course": "HUMNNTR3780H"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is a great person to talk to, but she only has one way of explaining things and if you do not get it, oh well. Very poor at responding to emails. There is a lot of information and it moves very quickly. ",
        "course": "HUMNNTR4610"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Ouliana is an EXCELLENT teacher. I've never had a professor more dedicated to the success of her students. I learned more from this professor than any professor in my 4 years of college. Her Russian accent is pretty thick, though, so you really need to pay attention, but she always gives ample opportunity for questions. Would HIGHLY recommend. ",
        "course": "HUMNNTR4610"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "If I could make this woman my nutrition Guru guide for the rest of my life, I would. She is one of the best professors I've ever had; I would highly recommend anyone to take her if they love nutrition and have the will to learn. She will go to the moon and back to help you succeed. Her Russin accent is thick, though, so get ready to pay attention.",
        "course": "HUMNNTR3780H"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Ziouzenkova is awesome. She likes to teach material that is very comprehensive and due to this I feel like I actually learned something worth knowing 20 years from know. Furthermore she is willing to go to Earth's end to help you. Honestly an awesome teacher.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "I SUGGEST AVOIDING THIS INSTRUCTOR IF AT ALL POSSIBLE. No doubt the most inept instructor I've had. Struggles to understand basic concepts like appropriate structure of intro course, how to test students, and communication with students. Daily attendance quiz and confusion on HW/exams that were not inherently hard, only made so by her inadequacies.",
        "course": "HUMNNTR2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.8,
    "department": "Nutrition",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0yNTczODEw",
    "lastName": "Kopec",
    "legacyId": 2573810,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Most lectures were posted. One quiz a week which was very easy if you watched the lectures. Two \"big\" assignments which were really easy and did not take long.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Kopec is very helpful when asking questions and gets back very quickly. Lectures can be a bit boring but just study the lecture slides and checkpoint assignments for exams and you will be good. It can be a lot to remember but just put in the work and you will get an A, also everything is open note so use that to your advantage. ",
        "course": "HUMNNTR2210"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Loved the content of this course. But be warned that multiple times she failed to stress a concept and then it heavily shows up on exams. Take what she says lightly and make sure you are studying everything and not just what she claims will or will not be on the exam.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "She was a good teacher if you were into being there every class and really studying outside of her lectures.. reading off of the PowerPoint but attendance was mandatory via online log in.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "The check points take an absurd amount of time. Homework due before every lecture. Review session are useless. She create study guides but they dont even cover all the material on the exams.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "The most dreadful lecture to sit through, if I could skip I would (attendance is graded). 30-50 question homework from book due before every class. She leaves blanks in her slides, and expects us to know what goes in the blank WHILE she's teaching us the material (that we haven't learn yet, obviously). Just avoid taking her class if you can.",
        "course": "HUMNNTR2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Nutrition",
    "firstName": "Peter",
    "id": "VGVhY2hlci0yODc2Njg4",
    "lastName": "Madril",
    "legacyId": 2876688,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He made the course easy and understands that everyone taking it is a graduating senior and wants to be done with undergrad. ",
        "course": "hthrhsc4300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Nutrition",
    "firstName": "Angela",
    "id": "VGVhY2hlci0yMjE3OTAz",
    "lastName": "Collene",
    "legacyId": 2217903,
    "numRatings": 63,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "An incredible teacher for a 4-hour asynchronous class. There was a lot of reading, but the homework wasn't too long. Her TAs are incredibly understanding and helpful and so is she! Exams were long (75 min) but since they're open book- as long as you are familiar with the content it wasn't bad. I highly recommend this to satisfy the science credit!",
        "course": "HUMNNTR2210"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love this professor. This class is very easy if you follow the instructions in class. She is very kind professor who cares about each individual student. If you're confused and email her she will email you back super quickly with clear instructions. PLEASE take this class I had so much fun with the labs also.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Open book tests, very easy-going, easy class overall. I would take again. She also gives extra credit.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Don't take this class if you don't need to because you will not like it.  Especially if it has nothing to do with your major. Easy A class? Yes. If you do the dreadful work and labs that come with it. Teacher is not accommodating. Would not take a class from this professor again.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class is not extremely difficult but the lectures use Tophat. Angela is open to help any and all students and is super passionate about nutrition. The exams and lab assignments are online and open-note",
        "course": "HUMNNTR2410"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a great professor and I would absolutely take another class with her. 2200 was very easy and I really liked the way she sets up lectures/assignments so that you can listen to and read lectures as you answer the assignment questions. ",
        "course": "2200"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "This is a very manageable course that I learned a lot of beneficial information from. ",
        "course": "2200"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great online class and manageable amount of workload. Extra credit opportunities are available aswell. ",
        "course": "2200"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I learned a lot from this class and it was a reasonable amount of work.",
        "course": "2200"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Angela Collene was an amazing professor! Probably the best one I've had so far. Her lectures and material were very understandable and I really was able to learn the material. She is super caring. 100% recommend taking her class! She also offers several extra credit opportunities and exams are online and open-note.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "She really cared about her students and subjects. Easy class if you complete the work. None of the assignments were hard and exams were open book and note with plenty of time. Would recommend for a GE",
        "course": "HUMNNTR2410"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Easy A, as long as you complete all the assignments. All the questions and answers for exams can be found either in the textbook or with a quick google search. Although there is a participation grade, you also need to show up to ~60% of the classes and participate in lecture activities; otherwise you can just skip/catch up on sleep",
        "course": "HUMNNTR2410"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took this class for an additional natural science course with a lab. Did it online and it was actually fun and interesting. Looked forward to the weekly labs that you do at home. Exams are straightforward and you can use the textbook. She offers a decent amount of extra credit. Only thing that is a bummer is the hour and a half long homework.",
        "course": "HN2210"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved this course, it put a lot of things in perspective and she does a fabulous job at teaching it. It's definitely a little dense and homework/ lab heavy, but they aren't difficult at all.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "very great professor, definitely recommend ",
        "course": "HUMNNTR2410"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "I'm not one to write reviews on this site but I had to hop on here and tell everyone how kind and caring this professor was. She helped me on multiple occasions with extensions and gave all her students extra credit opportunities. The class is extremally easy if you put in a little effort every week and genuinely fun to learn about.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is kind, and She wrote me a recommendation letter",
        "course": "HUMNNTR2210"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very organized professor. You do have to put some work in to receive an A, but definitely recommend this class to fulfill a GE requirement.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anyone who is giving this Professor a lower than 4 rating is just expecting a good grade to be handed to them. Professor Collene is VERY organized, accommodating and she makes it extremely easy to pass her class with a high grade with minimal effort!",
        "course": "HUMNNTR2410"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 5,
        "comment": "If you need a Science Gen Ed, take this class!\n\nImpossible to score anything under a B, this class requires minimal effort!\n\nIt's COMPLETELY online, at your own pace. Just make sure you fulfill the weekly deadlines.\n\nAlso, grades aren't weighted but are instead calculated by Total Points.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "I highly recommend taking her human nutrition class! She is very caring, passionate, and knowledgeable. Even though I had this class at 8am I didnt mind going because she was engaging. The work can be a little time consuming, but its not difficult. All of the exams and homework were open note/book.",
        "course": "HUMNNTR2410"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Collene is one of the best professors I have ever had. If you hate science, Human nutrition is a great online class to take. She makes the class interesting and informative, and she is just so organized. There was about one hour of busy work plus an easy take home lab per week, and the mid terms were not difficult. Easy extra credit too!",
        "course": "HUMNNTR2310"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Collene is so nice. I have taken two classes from her and she makes it so easy to learn the material while getting a good grade. There might be a lot of work, but it is pretty easy. Prof. Collene is awesome.",
        "course": "HUMNNTR3506"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy GE. Definitely do not wait till Monday night when everything is due to start it but its easy work!",
        "course": "HUMNNTR2210"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Collene was a great HN. professor. There are weekly smartbook assignments due, along with the quizzes. The smartbook typically reflects the questions asked on the quiz. Do not mess around when completing the Food Diary (YOU WILL BE USING THIS ALL SEMESTER). Asynchronous so you can watch lectures whenever. Everything was due on Sunday",
        "course": "HUMNNTR2210"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Angela is an amazing instructor who is understanding of college students' busy lives. There are no exams in the course and the homework is textbook readings along with multiple choice questions. Overall, she makes the content relevant and interesting. Highly recommend (especially for those who want an easier science GE).",
        "course": "HUMNNTR2210"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this section fully online. Just had to complete the book assignments and weekly quiz - no final. Pretty straightforward class, not super difficult everything needed to be done on Monday. Gives one exemption to complete work per semester late so thats nice.",
        "course": "HUMNUTR2210"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class consists of lectures where you answer TopHat questions for your participation pts (really only need to show up to class 2-3 times for each unit in order to get full participation pts). There are weekly assignments (either a book chapter + questions which is just participation or an assignment graded for correctness, but super easy.",
        "course": "HUMNNTRN2100"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Collene is amazing. I took her human nutrition course and it was very well formatted, clear grading criteria, and she made it very interesting! I loved coming to class even with it being an 8am class. Her lectures aren't boring and her quizzes/hw/tests are not difficult if you attend class and complete the online assignments. 10/10!",
        "course": "HUMNTR2210"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class consisted of going online and reading through the chapter if you didn't know about the topic and then completing an assignment that you get unlimited time and tries on, then completing an open note, unlimited timed assignment over the topics on the past assignment. Not that bad at all. Very laid-back and chill professor.",
        "course": "HUMNTR2210"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Collene is one of my favorites at OSU! You can tell she is passionate about her job. Gives those of us that are trying to get into the MDN program at Ohio State a lot of courage. You can except one quiz a week with extra credit opportunities every month.",
        "course": "HUMNTR3506"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, she gives you a lot more material than what she will test you on but question are easy if you have study. no need of textbook, all in the modules/notes. study quizlet, homework and cases are important. do them and all the extra credits and you will succeed. Only class I took enjoying the subject without stressing too much!",
        "course": "HUMNTR3506"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "The most beneficial, practical class out there. I use what I've learned everyday. Dr. Collene is on top of everything, very kind, and extremely helpful. The content of the class is well organized. The workload is manageable, and the exams are very fair. Use her exam review videos to make sure you're prepared! Definitely would recommend this class.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took the asynchronous version of this class, and it was very organized. Each week, there were videos or posts about what is due, and the assignments were pretty easy to complete. Professor Collene even makes outlined notes of what you need to know for exams, posts exam review questions, and selects easy questions for each exam. Theres also bonus",
        "course": "HUMNNTR2210"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's pretty good, there can be a lot of work sometimes. There's a lot of extra credit options though which really helps with your grade. the only annoying thing about the class is the exams are on proctorio, but the material is pretty easy though so I got As or high Bs on the tests. If you do the work and put in some efforrt you'll get an A",
        "course": "HUMNNTR2210"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor ever!! She gave very helpful and detailed notes over each chapter. A lot of the topics she covered were definitely very interesting and useful too. She includes a lot of extra credit and also posts helpful reviews for exams. Definitely the most organized online class I've taken. Overall I highly recommend this class and prof!!",
        "course": "HUMNTR2210"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 3,
        "comment": "I really enjoyed this class with Angela collene. The assignments were pretty easy and she always stated what she was expecting from you for the exams. There were 3 midterms and a final. This year, the final was open not and not proctored, but the other exams were proctored with no notes. She made this class very fun and interesting",
        "course": "HUMNTR2210"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 4,
        "comment": "Super nice professor. This class is laid out in an organized and easy-to-understand way. I would take this class/professor again if I ever have the chance.",
        "course": "HUMNTR2210"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 1,
        "comment": "Literally the easiest class Ive taken at OSU. Highly recommend. So much extra credit and the tests are straight from the review video she posts. Some online work, but its not hard at all.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was awesome! I took it online, and the textbook is free. She gives a lot of extra credit and lots of assignments that help take the weight off of the exams, though those are pretty easy as well. She doesn't drop the lowest exam anymore, but she drops some other assignments! Just stay caught up with assignments and you'll be golden!",
        "course": "HUMNNTR2210"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 4,
        "comment": "This was BY FAR the most well organizes online class I've ever taken, and I've taken a few! Very clearly laid out! Some units were easier than others, but it balances out! She makes extra credit available to make up for doing not so great on exams. The exams are Proctorio, so keep that in mind! All in all, I learned a great deal about nutrition!",
        "course": "HUMNNTR2210"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "4 exams total, lots of grades dropped, extra credit available. if you just do what you're asked you should get an A. before every exam all you have to do is watch the review video and you're good to go. very, very easy science class.",
        "course": "NUTR2210"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Collene was by far my favorite professor for the 2019 AU semester. Lectures were organized very well, she came to class prepared, attendance to half the classes is necessary for TH participation points. 4 exams are combined 45% of final grade (drop lowest), tons of easy extra credit. Homework heavy but only completion. Watch review vids!!",
        "course": "HUMNNTR2210"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Angela is the sweetest lady. She is extremely well-prepared, organized, and enthusiastic during lectures. The material is simple, there are ample extra credit opportunities, and several of your lowest assignments are dropped.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 3,
        "comment": "Angela was a fantastic professor. So organized and accessible to speak to. The exams weren't difficult if you studied, and classroom activity points were easy to earn if you went to class.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you need to take a science credit but arent too interested in the field, Angelas class is PERFECT for you! Its a dense subject but she does a great job of making it interesting and doable for students, and as long as you study and do the work.. you should have no problem getting an A in the class. Shes also funny and kind which is a big plus",
        "course": "HN2210"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class, but also interesting and applicable. Online homework is easy but can be time consuming. Best way to study for exams is to listen to her recorded review sessions. Exams are taken online and remotely proctored. If you do well on the first 3 exams, you wont have to take a final. Also, there are a ton of bonus opportunities.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took her online class and it was so far the easiest class I've taken. Of course, you still need to put in the effort but the material is simple. WAY MORE EASY AND FAVORABLE THAN ANY BIO CLASS. I got A's on the first 3 midterms, the final is noncumulative but can be dropped if you're successful on the first 3 midterms. THERE'S LOTS OF EXTRA CREDIT",
        "course": "HUMNNTR2210"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took nutrition online this semester and really loved the class! Professor Collene is a great professor, even in an online setting. She sends an email with what work needs to be completed for the week and either posts or livestreams a review session before exams. Very interesting class to take and lots of extra credit!",
        "course": "HUMNTR2210"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 2,
        "comment": "She used to teach online classes, so her online skills are great. We took homework quizes online, she posts the lectures online (as she is teaching). There is also tons of extra credit, you'd have to really try to do bad in this class. Very clear on what will be on exam, even posts an online live review.",
        "course": "HUMNNTR3506"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "Angela was an amazing professor and really understands her field. I took human nutrition as an easy GE credit, and that it was!",
        "course": "HMNNNTR2210"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is one of the most amazing professors. extremely helpful, nice person in general. The class is pretty aight if just listen in class and finish the hw. pretty chill. only three tests in one sem",
        "course": "HUMNNTR2210"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class as long as you do the work and review for exams a little bit. Homework is easy. Lecture can be kind of boring especially if its not your major but helpful info. Top hat is 5% of grade. Post slides on Carmen for every class. Lots of extra credit and willing to help.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 3,
        "comment": "Collene really knows what she's talking about. In Human Nutrition, make sure you attend class or it will be hard to keep up with work. The only way she takes attendance is through participating in a certain amount of TopHat questions, so you can miss a few classes. There is weekly homework, but it's doable. Not an extremely difficult class.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 55,
        "rating": 4,
        "difficulty": 2,
        "comment": "As long as you do everything Angela tells you this class is very easy. Read and take notes on the chapters as you complete the assignments. She lets you use note cards on the second exam. Provides great online review session that encompass everything. Provides plenty of extra credit, and is very clear on what you need to do to succeed in this class",
        "course": "HUMNNTR2210"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took this class online. lots of vocabulary words to study. she does give good study guides to help you with the test. She gives lots of chances with extra credit to help with your grade.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy online GE. Online quizzes and homework--roughly a chapter each week. Tests are in person; just look over her study guides a few times and it will be easy. 2nd test you can bring notecards to use. Lots of easy extra credit (up to 60 points)!!! Most of the information is common sense. If you do the homework and quizzes, it should be an easy A.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 58,
        "rating": 2,
        "difficulty": 4,
        "comment": "The course was an online course and was the hardest I have ever taken. All of the exams are proctored despite having to teach yourself all of the material. There is plenty of extra credit but the exams are very difficult. You can meet with her but I did not find the meeting very helpful. I would not recommend this class and would not take it again.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 59,
        "rating": 3,
        "difficulty": 3,
        "comment": "The exams are taken in front of her, and are quite hard. But, she gives you a two hour online review to listen to, and a lot of study help. Everything other assignment is an easy A if you put the time in. You have a quiz and a learnsmart every week to complete, and some dietary analysis' but it takes me very little time. Easy class if u like online",
        "course": "HUMNNTR2210"
      },
      {
        "index": 60,
        "rating": 4,
        "difficulty": 4,
        "comment": "Able to get full marks from the connect learning chapters and quizzes. Tests are not easy but the review classes before the tests are very useful.",
        "course": "HUMNNTR2310"
      },
      {
        "index": 61,
        "rating": 2,
        "difficulty": 3,
        "comment": "Mediocre professor. Compared to other online Human Nutrition courses, hers are significantly harder. An open note exam was curved by 14 points, just to share with you how incredibly difficult the exams are. Review sessions are sort of helpful, but way too long. Gives a lot of extra credit so easy A, but just a lot of work.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 3,
        "comment": "I spent about two hours a week on this class. Every week you are assigned a reading (which has questions that go along side it, you just have to keep answering them until they are all correct to get full credit)  and a quiz which you have two attempts on. Exams were not easy, but the review session before them is very helpful",
        "course": "HUMNNTR2210"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great professor, and she gives you every possible option to pass. She gives several opportunities for extra credit and is generous in curving exams. She also did review sessions on Carmen, those helped a lot, and were very test-based. I went to her office hours and got one-on-one help (really a before-midterm study session.) Very helpful.",
        "course": "HUMNNTR2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.4,
    "department": "Nutrition",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0yODk1OTg1",
    "lastName": "Bird",
    "legacyId": 2895985,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really great teacher, super nice and just a good person overall. Makes all the exams easy and she give you the answer to the labs.",
        "course": "HUMNTR2210"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Highly recommend this very easy 4 credit hour GE.Professor Bird posts her lectures online, lets students out of lecture early, and goes over lab answers during lecture. There are 3 multiple choice tests total and no final. She is very caring, understanding, and passionate about what she teaches. ",
        "course": "2410"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took her for nutrition as a gen ed. It is a four credit hour class but is just two lectures a week. She let us out of lectures early every single time. Class is graded on labs and exams (50% each). She gives answers to labs in lectures which are optional. The exams aren't too hard. Overall very easy A highly recommend.",
        "course": "2410"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Attendance wasn't mandatory, but it is super helpful if you go to the lectures. The tests can be tricky sometimes but aren't too difficult. She is super kind and knowledgeable and gives a lot of easy extra credit opportunities. The labs are also pretty easy, and she gives you the answers if you stay until the end of class. Overall, amazing class! ",
        "course": "2410"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the best professor I've ever met. She is very caring person and gave some extra credits. She have great lecture skills. You can get A if u participate on classes well. ",
        "course": "2410"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Bird is a very nice woman. Her classes aren't overly difficult, and she is funny.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super easy class. Attendance isn't mandatory and all her slides are on Carmen. Exams are pretty easy as long as you pay attention a little bit, she gives you study guides for each chapter. The content was interesting too. She's very caring and simply wants you to succeed. Gives a lot of extra credit.\n",
        "course": "HUMNNTR2210"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Bird is such a great and caring professor. The exams are a breeze as long as you look over the lectures and study guides. She also gives tons of extra credit. Attendance isn't mandatory and not really necessary either because everything is online and pretty self-explanatory.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "How she doesn't have a 5/5, I have no clue. She is the best teacher I have ever had. She was knowledgeable about every topic, would answer emails quickly, and would accommodate without hesitation. The labs are very easy and she guides you through them. Exams are very straightforward and she provides detailed study guides to follow. Amazing teacher!",
        "course": "2410"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "This is the GENED Science to take. Bird is entertaining and interesting. The tests are moderately difficult but she gives you so many bonus points that it is okay. She also gives you 90% of the answers to the labs. To study for the exams just memorize the study guides.",
        "course": "2410"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Overall this class was pretty easy. The exams were just like the study guides she gave out. This is probably one of the easiest science GEs you can take. She was very flexible. She allowed me to take an exam on my own time because I had two in one day.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took this class for my science with a lab GE and it was pretty easy. The tests were a bit hard but the labs were async and a good grade booster. ",
        "course": "HUMNNTR2210"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "The tests strayed far away from what she has taught. She is a nice teacher though.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Shes super caring and willing to help. I found her lectures to be very useful and pretty helpful.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Bird was a great teacher. I found this class interesting but lectures could get a little boring. She usually ends class early. She puts all the powerpoints online and she doesnt take attendance so you dont NEED to go to class but I would suggest it. She makes a slide of the main points of the lecture but doesnt put it online.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 3,
        "comment": "Lectures put you to sleep, but she does wrap them up early. 2210 is supposed to be an easy A for non-science majors but her tests stray a little from the lecture material making it harder than it should be. Take this class online or with someone else.",
        "course": "HUMNTR2210"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is a very laid back teacher. Lectures are supposed to last an hour and 20 minutes, but she always finishes in 55 minutes. I have class 8 AM Tuesday and Thursday, but I rarely go because she does not take attendance and the powerpoints she presents in class are all on Carmen. If I had to take an 8 AM this would be the one I would choose. ",
        "course": "HUMNNTR2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "Nutrition",
    "firstName": "Mahshid ",
    "id": "VGVhY2hlci0xOTQ0MjI4",
    "lastName": "Pirouznia",
    "legacyId": 1944228,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class was very easy and conducted online. The instructor provided clear instructions and maintained high standards. All the midterm and final exams were open notes, which was great. However, I am not sure if that applies to in-person classes as well.\n",
        "course": "HUMNNTR2210"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "Taking this course online in the summer, it is now changed to 2410. I have not finished the course yet but what I will say is that she DOES NOT answer any emails whatsover. So that being said, you cannot risk missing ANY assignments because you will be unable to get a hold of her to make anything up. \n\nReally frustrating ",
        "course": "HUMNNTR2210"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was relatively easy. She gives you a chapter to read and a mini project every 2 weeks or so and 2 exams. I bought the textbook, but I didn't really need it as her lecture notes are what she gets the exam questions from. I highly recommend this class even if you're not needing it and need an easier class.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "cant get ahold professor. sent 2 emails on Carmen and 2 regular emails, she did not answer. I then messaged her again on Carmen and received an answer saying &quot;I did not get your previous messages.&quot; I sent screen shots, no answer to ?ns. Broke my back and was in the hospital the last 2 wks before sem. ended and she did not allow me to make up work.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Pirouznia is a very compassionate and understanding Professor. She cares about her student passing and she will help you if you take the time to ask for help. The class was easy, just read and study the slides and you should be fine. The book is helpful but not need, most of the questions comes from lecture slide.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very few assignments by which youre graded on with majority of points coming from two tests. Easy assignments and easy tests",
        "course": "HUMNNUTR2210"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was my first online class and it was extremely managable. Course outline given up front and modules updated weekly. Plenty of time to work on assignments and instructor gave prompt feedback. I would definitely take again.",
        "course": "HUMNTR2210"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was a nice course. Professor was upfront about expectations, syllabus, assignments and grading. Course content was interesting and relevant to human physiology. She's definitely an expert in human nutrition, and stays up to date on the latest research. Not sure why the student below thinks professors are responsible for tech support.",
        "course": "HUMNNTR2110"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "The syllabus and what's required is clear and if you have any questions she responds to emails and questions very quickly.",
        "course": "HUMNNTR2110"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "She was very unhelpful with the questions that I had, and when I asked a question she told me to call tech support and offered no help. She was lazy and unwilling to help confused students.",
        "course": "HUMNNTR2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 2.8,
    "department": "Nutrition",
    "firstName": "Julia",
    "id": "VGVhY2hlci0xODEzMjMz",
    "lastName": "Richardson",
    "legacyId": 1813233,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "the online homework was easy enough and she provided a lot of notes but her exams didn't always match what she said they would and asked for nitty gritty details that were tough to remember. if you put in the work and write out all her study tips you'll be able to get the grade you deserve.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Her class is a GE and entirely online but it is not the most simple class. There is a lot of homework and LS modules accompanied by weekly quizzes all online. You would expect the Exams to be easy but the first two are not.  The 37% comprehensive finals was pretty easy... Still me and my friends recommend a different teacher. Others are easier.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad professor overall. The online assignments are easy enough but the exams are almost impossible. The final is cumulative and it sucks. Don't take this class.",
        "course": "HUMNNTR2210"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Took the class online for an easy GE but it ended up taking up a lot more of my time than anticipated. SO many slides to study and the final is cumulative... Weekly quizzes and learning modules take upwards of an hour and a half. If you are not looking into a science type field and just want an easy GE I would not recommend taking. ",
        "course": "HN2210"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took her course online and it was awful! It was a GE that she took way too seriously. Each exam consists of about 500 lecture slides, and the final is cumulative!! took up so much of my time, would never recommend to someone. Her exams are too science based and specific for a nutrition GE",
        "course": "HN2210"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 2,
        "comment": "Took her human nutrition class online and it wasn't bad. You usually have weekly quizzes and them two midterms and cumulative finale. Exams aren't super hard if you study, but her notes are kind of confusing and don't have all the information you need to complete the online quizzes which was annoying. ",
        "course": "HN2210"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "Take many time more than 5 credit. Consume my time more than 5 credit math course. ",
        "course": "HUM2210"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class was online, so it wasn't hard. Weekly quizzes that sometimes take over an hour, but nothing too tough. Easy GE class for an A.",
        "course": "HUMNTR2210"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really easy! Quizzes every week. Usually discussions every week also. There are 3 activities you have to do and turn in the \"quiz\" format on Carmen. Midterm & final were kind of hard because its just a lot of information. I would take again!",
        "course": "HUMNNTR2210"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class. Pretty easy A-.  Took 2 tests in person but did the rest of the work online.  Midterm was ok, and final wasn't too hard.  As long as you do the simple discussion posts, take the online quizzes and study a lot for the final it's not bad.  Take it online!!!!  Friend took it in class and it was harder",
        "course": "HUMNNTR2210"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "I took this course online during the summer term. It was a lot of material but not that hard if you did the exercises that are assigned. A lot of people complained about the amount of material in the course, but compared to Intro Bio/Chem or O-chem (which are ACTUALLY hard courses) this is a piece of cake. The prof is scatterbrained but OK overall.",
        "course": "HN2210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4,
    "department": "Nutrition",
    "firstName": "Martha",
    "id": "VGVhY2hlci0xNzc1MDE2",
    "lastName": "Belury",
    "legacyId": 1775016,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Belury is a very nice professor and really wants students to do well-- she even brought snacks to lecture for students multiple times! Her exams are almost exactly the same questions as her quizzes, so make sure to review those often. There is a weekly online quiz but otherwise exams are just quizzes and exact lecture slides. Not a bad class!",
        "course": "HN3506"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Belury is an extremely boring lecturer, however her exams are made up of exactly what is posted on the slides, so memorize these!  You do not need to attend lecture to get a good grade in this class.",
        "course": "HN3506"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.4,
    "department": "Nutrition",
    "firstName": "Irene",
    "id": "VGVhY2hlci0yMDEwOTY5",
    "lastName": "Hatsu",
    "legacyId": 2010969,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr Hatsu was my favorite prof this semester. She gives you a study guide before every exam basically giving the answers away. The textbook is not mandatory, but you either need to read the book or come to class to do well. She's a lot of fun and it's not a lot of work.",
        "course": "HUMNNTR2310"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "lectures are really dry and boring, tests are annoyingly specific",
        "course": "NUTRITION2310"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Attendance is mandatory through 5 random attendance \"pop quizzes\" throughout the semester.  There are 4 tests (final noncumulative!) and she gives you a study guide before hand which is basically the entire test and helps to cut down on studying but she sometimes throws in 2-4 random questions. 1 extra credit assignment so an A is pretty feasible  ",
        "course": "HUMNNTR2310"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Tests are very specific and she expects you to know exact values. She also gives a study guide, but be prepared for any specific details from the chapters that aren't on the study guide. Also, she sometimes asks questions that aren't about anything in the chapter. Just be prepared, thats all.",
        "course": "NUTRITION2310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 2.1,
    "department": "Nutrition",
    "firstName": "Lydia",
    "id": "VGVhY2hlci0xNDIyNTky",
    "lastName": "Medeiros",
    "legacyId": 1422592,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible teacher.  Not helpful whatsoever.  Has an attitude problem.   Does NOT care about students.   She is the opposite of inspirational.  NOT respected by students.  Is almost inhumane.  Do NOT take this class.",
        "course": "NUT313"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Far too much work for 3-CH class! Just for one quiz we had to know ~200 slides worth of material! Don't print off the slides - it is a waste and would take up probably a 4&quot; binder if you printed them all off with 6 slides/pg! I will say that the info is interesting if you're into multicultural topics. Attend every class bc you may miss a quiz!",
        "course": "NUTR313"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class is seriously a joke. For 3 credit hours, it should be a 5 credit hour class. She has OVER 1500 slides in lectures and expects you to memorize them, and then gives you no outline for midterms and final. If you are not required to take this class for your major, I wouldn't do it.",
        "course": "HN313"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is a joke.She has over 1000 slides for the quarter yet deletes about half of them. The catch is that we still have to know the information on all of the slides.You must know all of the material throughout the book even if some material may not be &quot;as emphasized&quot;. I have never been so surprised and disappointed in the quality of a class.",
        "course": "HUNTR310"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Meideros is the only one who teaches this course so you will be stuck with her. She is knowledgeable but has an arrogant attitude. She thinks her ways are superior. I think she feels she needs to prove herself to people often. Anyhow, the class is interesting but a lot of material to cram. The book is only needed for assignments! Good Luck!",
        "course": "HMNTR313"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's an okay teacher but she taught material that wasn't what the class was supposed to be about.  Plus her exams were written REALLY poorly and often times there were two of the same questions on them.  It's an interesting class but if you don't need to take it, it might just be a waste of your time...",
        "course": "NUTR313"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "I liked the content of the class (found in book readings). I found it interesting how she shares about herself in class, but in office hours is very impersonal and cold. I do not feel she is very interested in helping students. She keeps all graded materials. She rates exam questions and drops those most missed.",
        "course": "HN313"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 2,
        "comment": "what a pointless class.  The class material has nothing to do with food in foreign cultures, for the most part.  She tests on obscure information and repeats herself all the time.  It's relatively easy but really not worth it.",
        "course": "NTR313"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you show up to class you won't have to look at the textbook much but it's good to have to reference things she didn't talk about for the exams.  She's willing to help if you need it bit she is a bit stuck up.",
        "course": "NUTR313"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 1,
        "comment": "This was the most pointless class ever. It was &quot;food in different cultures&quot; and we learned about everything from the ethics of the death penalty, to nazis. She uses this class to talk about issues, and then tells you stories about her life. If you don't have to take it, DONT! But if you do, do the EC because the final is optional and its an easy A",
        "course": "HN313"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "Class was ok, somethings were interesting. She had an attitude about a lot of things. It was easy, she offered two extra credit things and final is opptional if you like your grade.",
        "course": "HN313"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "She is so meany. She doesn't put up the exam keys online after it placed which means you have to go look for it during her office hours. A lot of readings. Lectures are useless and you don't learn anything. Only reason that you go there is to get participation points. Exams are confusing.Don't expect nice attitude from her",
        "course": "HUMN313"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "I have never had a &quot;profeesor&quot; like this one.  She tries hard to maintain a &quot;hard&quot; attitude which leaves students without any help.  She DID wait until AFTER assignments were turned in to explain ALL of the requirements, and then proceeded to penalize for said requirements.  She had articles from Wikepedia to read to be tested on. NOT WORTH MY $$!",
        "course": "NUTR313"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "She is TERRIBLE, she thinks she is so smart but has to ask the students if she is even right, she waits until you turn in your papers to tell you certain things that you needed to have done on THAT paper. AND SHE WILL NOT STOP TALKING ABOUT HER BORING SELF IN CLASS! Take this class if all you want to learn about is her trips to China",
        "course": "HN313"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "NUT313"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.5,
    "department": "Nutrition",
    "firstName": "Michelle",
    "id": "VGVhY2hlci0xNjkyMDE2",
    "lastName": "Battista",
    "legacyId": 1692016,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was actually pretty easy. Slides aren't the best but they have all the info for exams. The exams tested on the broader topics and were fair. My one complaint was that she came across as ditzy--misspellings, uploading mistakes on Carmen she never fixed, a few poorly worded exam Q's, and a few times there was more than one right answer.",
        "course": "HMNTR310D"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible teacher.  Its an online class so you rely on the slides she gives you.  They are incomprehensible and impossible to follow.  Don't take her class!  Exams are nothing like the quizzes she gives you.  Don't know what to study because she gives a study guide and then says \"also, know everything else on every slide\".  Terrible teacher overall.",
        "course": "HUMNR310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 2.6,
    "department": "Nutrition",
    "firstName": "Helen",
    "id": "VGVhY2hlci0xODM1MTI0",
    "lastName": "Everts",
    "legacyId": 1835124,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Even though micro can be a very detailed nutrition major class, she makes it very simple. Her slides are very straightforward and she always has a review lecture before the exam. She also writes study guides, so she definitely sets us up to succeed in the class, definitely take her for micro.",
        "course": "HN4610"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very easy class. her lectures can be a bit confusing if you miss class. But everything is explained in class. She is one of the best options for micro professors. ",
        "course": "HN4610"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "I really wanted to like this class, but it was awful. She just reads her PowerPoint slides for the lectures, and her spelling and grammar distractingly terrible. I knew the material very well but got an A- instead of an A because her exam questions were confusing and I wasn't sure exactly what she was asking. Avoid her if you can.",
        "course": "HN3506"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class couldn't have been easier. Idk what the bad reviews are about. The class is literally just lecturers from different professions who come every class and give speech about their job. There are 4 question quizzes before lecture that are taken word for word in the readings. The 4 assignments are easy and there are no exams. Boring but easy.",
        "course": "HN2295"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Honestly I loathed coming to this class. We had mando-questions online for the speaker. I don't think she ever read them, because she asked the  speaker the same generic ones each time. Quizzes and exam are very badly worded. Quiz question my include, what football team was discussed in class. Most pointless class ever. Hated it.",
        "course": "2295"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "DONT TAKE HER! Prob the worst professor I've had throughout my college career. Attendance is mandatory, she has no enthusiasm and literally reads word from word off her slides! Just terrible. Exams are ridiculously hard! May god be with you if you happen to have her",
        "course": "HN4610"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Yes",
        "course": "NUT21"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.4,
    "department": "Nutrition",
    "firstName": ".",
    "id": "VGVhY2hlci05NjgzMjk=",
    "lastName": "Disilvestro",
    "legacyId": 968329,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "I would recommend him to anyone. This course is super easy. Go to lectures, pay attention to what he says and you will be fine. He  has Three Exams(100pts). One Assignment (40pts). Eight Quizzes (10pts each), about one per week. He will let you know. Don't buy the text book. Again, go to lecture & pay attention! Easy A.",
        "course": "HUMANNUT2210"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great Class! Highly recommend to anyone looking to fill a science GEC.  Very easy! Just go to lecture and copy down the notes.  Review practice exam and notes and your golden!",
        "course": "NUT210"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor. Has a vast knowledge but sticks to pertainent information for the purposes of examinations. Overall nice guy with a usefull and easy class if you attend lecture.",
        "course": "HUMNU210"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "Extremely easy class, great professor.  Highly recommended",
        "course": "HN210"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome I enjoy your class very much.",
        "course": "HNUTI210"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really enjoyed him as a prof.  He's very entertaining...a goofy guy!! But he makes class interesting and covered a lot of things that are useful and interesting.  It's important to go to class and definitely take the practice midterm because it's basically the same as the real thing.",
        "course": "NUTRI201"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was great. Learn useful things and it's easy to go to class. Overheads aren't horrible it's a nice change of pace to not have to rely on a &quot;computer&quot; to go down. Go to class and you will pick up half of the material needed. Assignment is CAKE, instructions are VERY EASY and laid right out for you. Lots of xtra Cred. Easy A!!",
        "course": "HMN210"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "best professor I've had at osu. he is hilarious and enjoys teaching. the class is really easy and there is a lot of extra credit. He has a cough tick that is pretty funny too.",
        "course": "HUMNT210"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great guy, easy class, funny, and you learn a lot... this is a great class to take",
        "course": "HMNTR210"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 2,
        "comment": "Claims he does not go on tangents but does. Monotone voice which makes class long. Still uses overheads which are hard to read(many handwritten), unorganized and just plain old. Powerpoints would be a huge improvement. His jokes are corney but funny. Directions on project are not clear enough, but you learn valuable info in this class",
        "course": "NUTRI200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest professor ever.  Go to class and take his notes and you will ace the midterm and final.  Doesn't use the book, only for specfic readings for each quiz.  Gives bonus points too.  Easy A!!!!",
        "course": "HUMNR210"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great teacher, interesting class! Class covered the second part of Bio 101 series, very useful information, easy class.",
        "course": "NUT102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 2.5,
    "department": "Nutrition",
    "firstName": "Marti",
    "id": "VGVhY2hlci04OTg5MTU=",
    "lastName": "Andrews",
    "legacyId": 898915,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class gave me enough overall info to have enough interest to change to the HN major! Though class is boring, if you have a general interest, you will enjoy the info. Exams are SO easy, esp the final - I got a 100%. Show up to every class - even Fri -  and you will get a good amount of extra credit! I finished with a 98%",
        "course": "HUMNT210"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Super boring, reads directly off slides, but gives random extra credit if you go to class. Tests were way too hard for a GEC class, and it took her years to post grades on carmen. The final was questions directly off the tests, but that is the only easy thing about this class.",
        "course": "HN210"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 1,
        "comment": "So, she's boring, she's not very helpful, but get your hands on her old tests and she's cake. My roommates used mine to study, and she changed a grand total of 4 questions all quarter. CAKE if you can use the system to your advantage.",
        "course": "HMNTR210"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was an unnecessarily hard GEC class. The 4 multiple choice midterms require a ridiculous amount of comprehension of the slides given in class and online. The guaranteed points from class assignments and the east final are the only salvation you get in this class. Midterm averages were 68%",
        "course": "HMNUT210"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "very borrinnggg!!",
        "course": "NTR210"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "WOW yeah she's a sleeper monotone voice reads right off the slides, and puts them all on carmen. Tests are hard, but if you use her study guides you should be able to do ok, major complaint was that she missed at least 4 classes, and had her TA read for 2 of them, not my fav class, but content is interesting, watch out 4 random extra credit",
        "course": "HUMN210"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "excellent class",
        "course": "HNHN"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "WORST TEACHER EVER!!! only benefit of going to class is the occasional extra credit. You're tested over material thats not covered, she doesnt answer questions, she acts as if you're stupid, her voice is monotone, and just reads off the slides. BORING!!! drop the class if you sign up for it and take it online instead.",
        "course": "NUTRI210"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Yeah....RIGHT....she talks to you as if you don't understand anything so I guess if you like basics it's okay...reads right off the powerpoint and posts them online so its hard to want/need to go to class, she seems nice though, gives extra credit if class attendence is low so thats kinda a benefit to go to class, STUDY for tests!!BUY book to help!",
        "course": "HUMNU210"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "HNTR210"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 2,
        "comment": "Nice Lady. Class was definitely unorganized and she was kinda airy, and made random decisions.  Gave awesome extra credit opprotunities though.  Tests were semi-hard if you don't buy the book.  Class makes you very sleepy.",
        "course": "HMNTR210"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 2,
        "comment": "Worthless teacher. Seems like a nice lady but class is a mess. Slides were never put online as promised,  and we were tested over material we didn't really cover, and it just seemed very poorly run. She doesn't handle questions well. Be prepared to read a lot about worthless stuff, and realize that you'll be responsible for everything in the book.",
        "course": "HMNUT210"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 3,
        "comment": "Straight forward class.  You go into a lot of detail on stuff you will never hear again in your entire life. Lectures are very slow and make you sleepy but shes a nice lady.",
        "course": "HN210"
      }
    ],
    "SEI": []
  }
]