[
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.4,
    "department": "Persian",
    "firstName": "Mehrak",
    "id": "VGVhY2hlci0xOTM1NzYx",
    "lastName": "Sarvestani",
    "legacyId": 1935761,
    "numRatings": 34,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mehrak is a wonderful professor. Take this course!",
        "course": "NELC2244"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is the best language professor I have ever had. Very knowledgeable and respectful. ",
        "course": "PERS2105"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good instructor. ",
        "course": "PERSAIN1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "His teaching method is amazing. Take Persian courses with him! ",
        "course": "PERS1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is the best instructor I have ever had. ",
        "course": "1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is an easy grader who offers you extra credit opportunities. ",
        "course": "NELC2244"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Clearly cares about his students. He will call on you in class randomly to answer questions, translate sentences, and the like, but don't be intimidated by it; this is necessary to learn a new language well. Can be pretty funny at times when he tells stories about himself and Iranian culture. If you haven't decided on a language yet, take Persian!",
        "course": "PERSIAN1101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "His teaching method is amazing.",
        "course": "1103"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is wonderful in teaching Persian! I recommend him to all my frienfds.",
        "course": "PERS1101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Sarvestani is one of the best Instructors I had ever have.  ",
        "course": "NELC2244"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor is really great at teaching! Persian is not an easy language to learn, but he manages to make lessons understandable. However, like any other language, you have to be prepared to do some outside work and come to class prepared. ",
        "course": "1101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a great professor!",
        "course": "NELC2244"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a great professor, take it from someone who speaks farsi enough to understand how well he speaks. If you think he's talking down to you he's not. That's just how professors speak when teaching farsi at the level he's teaching the class. It's actually very nice. If you want to experience a true hard professor go to Iran. He's a happy person!",
        "course": "PERS2104"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 5,
        "comment": "Whys he treating his students as if theyre in junior high? And how did he got his PhD with that poor vocabulary?! He doesnt post stuff on Carmen and expects us to look at the syllabus for every assignment. He even sometimes change dates of the assignments by his own based on discussions in class. Overall, lots of papers and readings.",
        "course": "PERSIAN2241"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is the best professsor.",
        "course": "PRS2401"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Language class is a little home work heavy, but this was not my first language experience, so I understand that good language teachers use homework to help you to better learn the vocab. The Persian Culture class has less homework but there is a lot of reading and in-class discussions. In all, these classes are typical for college level.",
        "course": "PERSIAN2104"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 3,
        "comment": "One day he's friendly the next day he's roasting students. I don't think he understands that this is a college level course. Treats his students condescendingly and as if we are in elementary school. Confused on a particular topic? Better not ask him, for he'll get angry and tell you he's already explained the concept before. Would not recommend.",
        "course": "PERSIAN1101"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "A very good professor and course.",
        "course": "PERSAIN1102"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "why this professor is treating his student that way?",
        "course": "PERS1101"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "The worst ever! Say NO!",
        "course": "PERS2103"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "I just completed my third semester with Mehrak as my Persian professor and I have to say that while learning farsi may be the hardest thing I have ever done, Mehrak's passion for the subject and determination for you to succeed has been incredibly helpful. He does assign a lot of homework, but it is for your benefit and vocabulary-building. ",
        "course": "PERS2105"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you HAVE to take his class, then avoid asking questions at all and better ask your classmates or hire a private tutor than asking him directly! Dont embarrass yourself in class because he will get really mad at you if you ask any question and he will raise his voice to tell you in a rude way dont ask this kind of questions you just confuses y",
        "course": "PERS1101"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mehrak is an awesome professor! Sometimes lecture is a bit confusing because of the language barrier but he is very understanding and will explain things. Persian is a tough language to learn so he assigns a lot of homework so you can keep up with the material ",
        "course": "PERS1101"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mehrak was extremely dedicated to our class and always made sure that we were learning and getting something out of the course. He never ran out of the energy to work with us and make sure that no time was wasted. Mehrak is a wonderful instructor.  He is patient and organized. ",
        "course": "1101"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "I didn't like his class for two reasons first he picks out favorites students way too much, second he gets angry at students when they ask questions. Don't take it!",
        "course": "PERSIAN"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "Don't take this class! He explains nothing and gets angry when someone tries to ask him a question in class.",
        "course": "PERSIAN"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "believe or not! he will  get angry at you when you don't complete the homework he gave you!! are we in elementary school?  he REALLY assign TOO much homework more than what he explains in class! ",
        "course": "PERSIAN"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 5,
        "comment": "As far as you dont askem ANY question inside or outside the class, you will be fine! He seems to be too busy to answer his student's question!!",
        "course": "PERSIAN"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 5,
        "comment": "I don't get it! why we have this guy here? he is not helpful at all! ",
        "course": "PERSIAN"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 5,
        "comment": "No. Just no.",
        "course": "1101"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 4,
        "comment": "Mehrak isn't the best professor i've had at the university but if you ask for help he will offer it.  I don't like the fact that he tends to pick favorites in class and tends to get angry at students when they don't complete their assigned homework which he assigns EVERY NIGHT!  This isn't middle school anymore, why does he assign so much homework?",
        "course": "1103"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 4,
        "comment": "Mehrak is the best Persian professor I've had at osu. He is tough on the students, but if you're actually interested in learning he is able to teach you a lot. Don't take this class if you're just curious about the language, take it if you're planning on learning it and learning it well.",
        "course": "1103"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 5,
        "comment": "Mehrak is the worst professor I've had thus far at OSU, he takes the coursework extremely seriously and tends to verbally bash students in the middle of class.  Do not take him.",
        "course": "1101"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 5,
        "comment": "Mehrak is the worst teacher I have ever had at Ohio State, he grades very harshly and talks in persian even when we have know idea what he is talking about.  He gets angry when we try to ask him question in class while speaking in english and he assigns homework that he collects every single class.  DO NOT TAKE MEHRAK'S CLASS!!!",
        "course": "1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.6,
    "department": "Persian",
    "firstName": "Saeed",
    "id": "VGVhY2hlci0xMDM3NTQy",
    "lastName": "Honarmand",
    "legacyId": 1037542,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor ever. Hands down.",
        "course": "PERSIAN"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Great prof. This course being a literature class required a lot of reading, but all were interesting. He really stresses class discussion. We had 2 \"pop\" quizzes (he let us know when) , one paper 5-7pgs,  mid-term, and final. Some questions on the mid-term and final were kind of specific so makes sure u complete all readings. Definitely an easy A.",
        "course": "PERSIAN2701"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's an amazing teacher, very helpful and he knows his subject really well. Am glad I took his course",
        "course": "PERS2401"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Saeed is one of those rare native speakers of a difficult language who has figured out how to teach its grammar clearly and comprehensibly to native English speakers. He doesn't have much patience for lazy students who complain all the time, but that just makes me like him more. He's extremely nice and helpful - all you have to do is ask.",
        "course": "PERS1101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Saeed is an amazing professor. I've had him for language classes and for a Persian culture/literature class. He's helpful, patient, and he knows how to teach well. He's a soft-spoken and incredibly kind man. I really enjoy his classes, and am glad that he's the only Persian professor I'll have.",
        "course": "PERS241"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Saeed is by far my absolute favorite professor. Not only is he extremely knowledgable in his field, but also is able to personally relate to his students. I have not own grown academically, but as an individual through my experiences in this class. I would highly recommend taking a class taught by Saeed to anyone interested in the Middle East. Grea",
        "course": "PER104"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "By far the best teacher that I ever had the privilege of having. He really cares about his students and offers a unique perspective. He changed the way I thought. Learning extends past the study of Persian.",
        "course": "PERS101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "A good teacher, truly dedicated to his work. More than a native speaker, he's a published author in his language and is more than qualified to be an instructor.",
        "course": "PER202"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "His English is a little rusty, but it is pretty easy to understand if you actually consider what he says. This often confuses people, but if you practice and do his assignments you will learn Persian well. He'll mess with you, but he's got a plan.",
        "course": "PERS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Persian",
    "firstName": "Ben",
    "id": "VGVhY2hlci0xMjUzMTM0",
    "lastName": "Gatling",
    "legacyId": 1253134,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "PERS241"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor, he's so enthusiastic about what he teachs.  He will listen to every students' opinion in class.  The only assignments in the class are weekly online responses based on a reading assignment (they only take a few minutes!).  This class was easy and interesting if you have Ben Gatling. I highly recommend him.",
        "course": "PERSI370"
      }
    ],
    "SEI": []
  }
]