[
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Pharmacy",
    "firstName": "Janet",
    "lastName": "Antwi",
    "legacyId": 2745032,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "If you read her syllabus you'll have no problem understanding the course syllabus. She gives quizzes and exams based on what are in the slides--so read and understand your slides. If you don't understand, go to office hours (you'll see a different side of her, a fun side actually). She's a good teacher! IT IS true that her bonus are unpredictable."
      },
      {
        "index": 1,
        "rating": null,
        "comment": "She does not actually know the content she is teaching. She reads off the slides and when we a draw a mechanism in class it is like reading hieroglyphics. Almost every time you ask a question she has to look back to the notes. Multiple times throughout the course she contradicted herself. Bonus questions are random facts that were never mentioned."
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Pharmacy",
    "firstName": "Janet",
    "id": "VGVhY2hlci0yNzQ1MDMy",
    "lastName": "Antwi",
    "legacyId": 2745032,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you read her syllabus you'll have no problem understanding the course syllabus. She gives quizzes and exams based on what are in the slides--so read and understand your slides. If you don't understand, go to office hours (you'll see a different side of her, a fun side actually). She's a good teacher! IT IS true that her bonus are unpredictable.",
        "course": "3200"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "She does not actually know the content she is teaching. She reads off the slides and when we a draw a mechanism in class it is like reading hieroglyphics. Almost every time you ask a question she has to look back to the notes. Multiple times throughout the course she contradicted herself. Bonus questions are random facts that were never mentioned.",
        "course": "3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.4,
    "department": "Pharmacy",
    "firstName": "Megan",
    "id": "VGVhY2hlci0yNzg2NjE2",
    "lastName": "Mefford",
    "legacyId": 2786616,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Hardest Gen Ed grader that I have had so far in college. As a business student taking this gen ed she was a incredibly hard grader who expected perfection when it came to writing to get a decent grade.\n",
        "course": "2400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, lecutures are easy to understand and she cares that you get the topics. The tests are straight forward and she is a pretty forgiving grader when It comes to the in-class assignments. I would take a class with her teaching again.",
        "course": "2400"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lectures are very long and not super organized. Good prof and knows her stuff, very nice woman. Exams were ~40 questions. Attendance not mandatory, but there are in-class assignments that aren't published until after she is done presenting and due by end of class.",
        "course": "2400"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Coming from someone who hates long writing assignments or papers, I constantly forgot that I was taking a 2nd level writing course. Dr. Mefford is so great at keeping the content interesting while still developing your research and writing skills. If you're looking for a good 2nd level writing class don't hesitate to take this one! 10/10 prof!!",
        "course": "14077"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took Drug Use in American Culture with Dr. Mefford and she was a great professor, one of my favorites at OSU. She cares about her students and is always happy to provide help/feedback. While attendance is mandatory, I personally found the class super interesting and did not mind coming in at all (even though my section was early in the morning).",
        "course": "14077"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mefford has easily been the best professor I've had at OSU. I took her Drug Use in American Culture course for my second year writing credit and that was the best choice I could have made, her lectures are engaging and interesting, the workload is never overwhelming, and her feedback is genuine and helpful. Take the in-person class, not online.",
        "course": "14077"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a wonderful professor and the class is pretty interesting. Responds really quickly to emails, gives good lectures, and is extremely understanding about late work due to conflicts. Also, if you get sick you never have to worry because as a pharmacy professor she understands that being sick means you need to rest. Take this class!",
        "course": "14077"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.7,
    "department": "Pharmacy",
    "firstName": "Emily",
    "id": "VGVhY2hlci0yNzc1NzMx",
    "lastName": "Baker",
    "legacyId": 2775731,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was fun. Online lectures were straightforward. Luckily, there was no exams in this class. There was only discussions and weekly assignments which weren't bad. It's an easy credit booster if you are interested in pharmacy.",
        "course": "PHR3420"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Online class with very little work. I did not reach or watch any lecture videos posted. I just wrote the papers and assignments and managed good grades. Dr. Baker is a fair grader, and she will tell you how to improve. Class has weekly discussions, short writing assignments, a webinar, and a final research paper. Overall a very easy class.",
        "course": "PHR2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Baker was great to take during the pandemic because she was really caring and helped me be successful, even when I had a lot going on in my personal life. She gives a lot of feedback on your writing.",
        "course": "PHR2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.3,
    "department": "Pharmacy",
    "firstName": "Brianna",
    "id": "VGVhY2hlci0zMDAxNjMx",
    "lastName": "Thomas",
    "legacyId": 3001631,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "This is probably one of the worst classes I've taken as a GE. Not only is the class super writing base, but she breaks your writing style and gets mad when you don't write how she wants. She is a super detailed grader so one wrong thing could result in a bad grade. good luck with the 5-8 endpaper you write that is almost no one gets a good grade.",
        "course": "PHR2367"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not only is this class so much coursework for me taking it as a GE, but the grading process is also a lot. The whole class is writing-based, and if you don't write the way she wants, she takes points off. Multiple discussions, quizzes, and checkpoints are all busy work, leading to a big final paper that is 5-8 pages long. ",
        "course": "PHR2367"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was a good professor. She knows the material and is helpful when asked questions. Lots of weekly assignments; always a discussion board + response and sometimes slightly longer papers. Final paper has lots of checkpoints throughout the semester, which I found helpful. Easy enough for a writing class!",
        "course": "PHR2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Pharmacy",
    "firstName": "Darian",
    "id": "VGVhY2hlci0yNzI3Nzc0",
    "lastName": "Rostam",
    "legacyId": 2727774,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "An amazing addition to the class !! his perspectives are truthfully unbeatable and I am so fortunate to have had him. Life advice I will take with me forever",
        "course": "PHR5590"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Darian was my TA for my PHR 5590 course. He was a great guy. Always could make us laugh.",
        "course": "PHR5590"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.9,
    "department": "Pharmacy",
    "firstName": "Kelsey",
    "id": "VGVhY2hlci0yNTM0MTkz",
    "lastName": "Schmuhl",
    "legacyId": 2534193,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Schmuhl is so kind and fun. Each class consists of a lecture and an engagement activity (done in groups, used for attendance). Assignments outside of class: short module quizzes, module checkpoints (short assignments), guest speaker essay, and final project. Minimal work, low time commitment, engaging lectures. Learned lots. Highly recommend!!",
        "course": "PHR2510"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "GOATed professor she loves and cares about you so much! you get into groups and work on the engagement activity. Super easy and fun lectures. I highly recommend taking this class! She is a huge Harry Potter nerd and also a Lord of the Rings fan! ",
        "course": "PHR2510"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely iconic professor, so lucky to have had her.",
        "course": "PHR2510"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely loved Dr. Schmuhl! Even though it was a required class for my major, the class always was very interesting and minimal work. She really cares for her students and is easy to talk to.",
        "course": "PHR2510"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Everybody loves Dr. Schmuhl because she is so kind. This class is also exceptionally easy, with a minimal amount of homework each week. Would definitely recommend.",
        "course": "PHR2510"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kelsey is a phenomenal professor. She is one of the most understanding and compassionate professors I've ever had. Her lectures are always easy to follow through and the course itself is not hard-- everything was very engaging. ",
        "course": "PHR2510"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I found this class pretty easy and light, and this professor made the material really interesting and come to life. She was very accessible and very caring of her students.",
        "course": "PHARM2510"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "This is a very easy course and Dr. Schmuhl explains everything with great detail. I feel like I learned a lot in this class and would definitely recommend it. Dr. Schmuhl seems to really care about her students succeeding in her class.",
        "course": "PHR2510"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this course! There were some group projects, quizzes, and a final project. Dr. Schmuhl and her TA were super helpful! Dr. Schmuhl really cares about the course content and making it understandable to everyone in the course! The lectures were really interesting, even when they were about boring topics:) By far my fav course so far!",
        "course": "PHR2510"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is awesome! Our class was moved online this semester and she adapted to it very well! This isnt the most interesting class, but its necessary and she teaches it in a way where its not overwhelming ever. We had no tests, but some quizzes and a big final project. Overall, she is just a great person who really cares about your learning",
        "course": "PHR2510"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Schmuhl was one of the most caring professors I have ever had. She is very knowledgeable and the class is very manageable. There is almost no out of class work except for studying for the exams (which took me an hour) and attendance is not mandatory except for the in-class activity days. I recommend going though because it makes exams easier!",
        "course": "PHR2510"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.4,
    "department": "Pharmacy",
    "firstName": "Katie",
    "id": "VGVhY2hlci0yNTUwMjI1",
    "lastName": "Summers",
    "legacyId": 2550225,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Summers is super passionate about what she does, which makes her class super entertaining. Quizzes were short and super easy. For the midterm, she provided a study guide and the prompts that would be on the exam, and surprise extra credit. Attendence is only mandatory some days where there were short group worksheets but the dates are posted.",
        "course": "PHR2500"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Her lectures were easy to follow and her exams were pretty straight forward. If you're a decent writer and can pay enough attention to get a good overview of the lecture the class is easy. I enjoyed the material. Super easy to reach outside of class and very helpful with questions. ",
        "course": "PHR3708"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "3708 is split between Dr. Summers and Dr. Harris. Dr. Summer is way better than Dr. Harris but it still extremely harsh grading. You must exceed expectations to get an A which is ridiculous for an elective course. Grade is based on participation, two exams, a paper and a group project. Would not take this class again because it was boring and hard.",
        "course": "PHR3708"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Course was well organized and interesting, but the majority of the grade came from response papers that had very vague rubrics paired with tough grading. When asked in class about the expectations for the papers, Dr. Summers and her co-professor often gave conflicting answers. Usually about 2-3 hours of homework per week.",
        "course": "PHR3708"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good and organized course. Everything is posted at the start of each week, so you can work and organize however you want. Mostly videos and articles to read, and some discussion posts. Very nice and always answers emails.",
        "course": "PHR2500"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Overall very good class. It is taught with another professor, she focused on the science section of the vaccines which I thought was more interesting. There were 2 papers and a group project, make sure to ask lots of questions because the prompts for those can be unclear.",
        "course": "PHR3708"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Summers is a great professor &amp; an overall wonderful person. The class is split between her &amp; another professor, but I found her lectures to be more interesting because she discusses the science part of the course. There are some readings to skim through before her lectures which are important as she does ask questions on them in class.",
        "course": "PHR3708"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Overall professor summers is an amazing professor You will learn a lot with her. She is lecture heavy and the workload is heavy as well but completely doable if you just stick at it. I took her History of vaccines course and I would take this class again. It was useful and completely needed.",
        "course": "PHR3708"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Summers was really nice. Nothing bad to say about her. Class difficulty was about what was expected. Definitely need to set some time aside but not hours weekly. I found the second half of the class material a little more difficult since its a lot of insurance stuff. Wasnt a fan of the online lecture format (just blocks of text) though.",
        "course": "PHR2500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Pharmacy",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci0yNTc0NjEz",
    "lastName": "Lahrman",
    "legacyId": 2574613,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class for my pharmacy minor and it was pretty easy to get done. There are a few assignments due throughout the week, so you don't fall behind. There are weekly open-note quizzes but its super easy. The midterm and final are both projects that don't take too long to complete. Overall, pretty solid class. ",
        "course": "PHR2500"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Youll typically have a module open for notes, a weekly discussion board, a self-check quiz, and then a small individual assignment at the end of the week. Super manageable class, and you could realistically get a whole weeks worth of class done in a few hours if you wanted to",
        "course": "PHR2500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.6,
    "department": "Pharmacy",
    "firstName": "Nicole",
    "id": "VGVhY2hlci0xMDI4MTMw",
    "lastName": "Kwiek",
    "legacyId": 1028130,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great!",
        "course": "PHARM3400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kwiek is one of the best professors I have ever had. She genuinely wants you to understand the material and will answer any questions you have. Lecture is not technically mandatory, but she has 10 point &quot;pop quizzes&quot; that are almost always just for participation and will boost your grade. The exams are very fair and she gives a study guide.",
        "course": "PHR2010"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Kwiek was great! She had relevant topics for lecture that she updates every semester. Exams are reasonable. She does do a group project that does suck since its worth more than a test grade.",
        "course": "PHARM3400"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Kwiek is a phenomenal professor. She is immensely intelligent, but is able to explain difficult concepts with ease and make them accessible. She is also hilarious, and good natured as well as caring. As long as you show up willing to learn, you will not fail. Id reccomend her to everyone. One of the best professors at OSU!",
        "course": "PHR4300"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very good teacher, clearly mentions what to expect on the exams. The exams can be a little challenging, but if you put in the hours, it shouldnt be a problem",
        "course": "PHR4100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "One of my favorite professors at OSU. She has a genuine interest in her students and their performance. Her love of the material is obvious in her teaching. The exams can be difficult if you neglect to put in the time to study.",
        "course": "BIOCH461"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Class is tough at time but one of those foundational courses we all have to take.  very straightforward lecturer and very helpful in office hours.  all lectures are powerpoints.  she tests you on what she taught you, no tricks.  def recommend",
        "course": "PHARM461"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "A lot of work for this class but it is very interesting. Study hard to get an A",
        "course": "PHR461"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very genuine & down to earth professor. Really cared about students. Class was challenging, but knew from get go. Always helped when she could.",
        "course": "PHR461"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was one of the best teachers that I've had in the pharmacy program. Fun class, learned a lot. Exams arn't too hard, and she tells you what you need to know for them, nothing tricky. Study the rescitation problems. Also, she is probably the only good looking professor in the program (and how).",
        "course": "PHARM461"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "PHARM461"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Pharmacy",
    "firstName": "Ronni",
    "id": "VGVhY2hlci0zMDAwMDI1",
    "lastName": "Ehlers",
    "legacyId": 3000025,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Weekly modules, following modules unlocked each week on Fri @8am. Discussion + response, quiz, and sometimes a case study (2 parts, quiz + discussion). Long lecture videos. Quiz questions are asked based on info that is spoken in video, but not written on the slides. ",
        "course": "2410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 2.3,
    "department": "Pharmacy",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0yNzI1OTM1",
    "lastName": "Crawford",
    "legacyId": 2725935,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Crawford was super nice and laid back. Weekly readings with accompanying assignments that took about a half hour, not stressful at all. I don't understand these reviews at all and would absolutely take another class with her given the chance.",
        "course": "2511H"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took this class asynchronously and it absolutely helped me become a better writer. I put effort into each assignment, but because there are so few I never spent more than a few hours each week on the class. Feedback always noted things I did well as well as things to improve. She gave us resources each module to help us improve our writing.",
        "course": "PHARM2367"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly she is really kind but she is a hard grader. This was a writing class and although the information was very useful and necessary since I am a STEM major but it didnt need to be complex and super stressful to get a passing grade. I feel bad because this is a GE and she is such a tough grader. She needs to grade progress not just one try.",
        "course": "PHR236702"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "So you are ready to take your second-level writing course or need a GPA booster? DO NOT take a course with Dr. Crawford! The scope of the course is reasonable but Dr. Crawford wins the award for being the harshest grader I've ever witnessed. For a course no one truly cares about, Dr. Crawford makes the course harder than your major classes!",
        "course": "PHR236702"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "I wanted to take this class because I thought it was interesting and also needed the credit. I wish I didn't. Dr. Crawford does have a good layout of the class and provides a lot of information for students to learn about drug topics. However, I spend hours in this class for mediocre grades. I have never spent so much time on a GE class.",
        "course": "PHR236702"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "I am just finishing up this asynchronous online course with Dr. Crawford and I really think she is extremely approachable. She was extremely kind to me! However, I worked INSANELY hard to earn a good grade and it was harder in terms of grading than some of my hard ochem classes. I was disappointed with not getting the grades I thought I deserved.",
        "course": "PHR2367"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "You need a writing course? Do not take her. She is a harsh grader. No matter how many times you try you can still get a low grade. Just overall 0 stars. She isn't great, if you need this grade for your GPA do not take her class!!!!!!!!!!",
        "course": "PHR236702"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Crawford has a solid foundation of the topics discussed within the class but she is not the greatest professor. Students are just taking the class to obtain the credit, no one cares about the material. I never thought a writing class would contain so much reading and effort to receive a decent grade. She makes an asynchronous course awful.",
        "course": "PHR2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.5,
    "department": "Pharmacy",
    "firstName": "Jason",
    "id": "VGVhY2hlci0yODg2MzM3",
    "lastName": "Chen",
    "legacyId": 2886337,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome professor I really enjoyed his class. He makes philosophy really interesting to learn about and you can tell he is SO passionate about the subject. The class is really interesting, definitely don't be afraid to take it. 3 exams that are five questions! He's an amazing professor.",
        "course": "PHR3530"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is very passionate about what he teaches and makes you really think, which makes the class interesting. Lectures were a bit long sometimes. Could leave on test days after you finished. Test questions were given beforehand. Pretty easy and straightforward. ",
        "course": "PHR3500"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved his class. Exams were manageable, and as long as you paid attention to lectures/ study his study guides, you could not get anything less than 100% on them. ",
        "course": "PHR3500"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Literally one of the best profs I've ever had. It's obvious that he's extremely passionate about what he is teaching. He encourages students to think about things from many different angles and values our opinions. Each lecture is more and more interesting. Material from class is always accessible online, making exams a breeze to study for. 12/10.",
        "course": "PHR3530"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was passionate about what he was teaching, and came in with a great attitude. Definitely made me want to dive deeper into philosophy and really think about my views of life, love and everything between.",
        "course": "PHR3530"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wasn't sure what I was getting into with a philosophy class, but I love this guy. He's super engaging and fun to listen to. I would defiantly take another one of this classes. Highly recommend!",
        "course": "PHR3500"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Chen has been the best professor I've had at Ohio State. He's extremely passionate about his teaching, and made class genuinely fun to go to. Participation is the main thing in this course, and conversations are always really interesting. Easy A as long as you do the in-class participation sheets and exams are only five questions.",
        "course": "PHR3530"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 2,
        "comment": "This professor was transphobic in my class; wouldn't entertain the idea of gender-affirming care or equal care for transgender individuals in the medical field; believed doctors could ethically refuse treatment for trans people. This is not rhetoric we need to have in a classroom, especially when teaching the next generation of healthcare workers.",
        "course": "PHR3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 2,
    "department": "Pharmacy",
    "firstName": "Jeremy",
    "id": "VGVhY2hlci0yNjkxNDQy",
    "lastName": "Swisher",
    "legacyId": 2691442,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Required class but soooo boring",
        "course": "PHR1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Pharmacy",
    "firstName": "Michaela",
    "id": "VGVhY2hlci0yOTQyOTc0",
    "lastName": "Slevin",
    "legacyId": 2942974,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Slevin was an amazing and compassionate teacher throughout the semester. Would pay money to take this class again.",
        "course": "PHR3420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.3,
    "avgRating": 1.3,
    "department": "Pharmacy",
    "firstName": "Jared",
    "id": "VGVhY2hlci0yODIxMzcx",
    "lastName": "Repas",
    "legacyId": 2821371,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Had this class as an 8-week course over the summer and deeply regretted it. I took it to meet a writing GE credit and was bombarded with heavy & difficult work each week. Didn't learn much about drug use in America, felt more like a writing workshop. Does not compare to any of the other 8-week courses I have taken. ",
        "course": "2367"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you are looking for a basic writing 2 class you are in the wrong place. This was absolutely the worst class I have ever taken at Ohio State. This class was irrelevant to my major, I just needed my second writing class. By far the most work out of any of my classes which is ridiculous for an elective. Young professor who loves his authority.",
        "course": "2367"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "The amount of work that is due during the week is ridiculous. I never got a 15/15 on any discussion posts. There was always something that got points deducted. I took this course to hopefully learn about drug use in America, take some quizzes on the material, and maybe do a research paper. It was essentially a writing workshop course. ",
        "course": "2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Pharmacy",
    "firstName": "Ross",
    "id": "VGVhY2hlci0yOTA4Mjcw",
    "lastName": "Larue",
    "legacyId": 2908270,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Larue was an amazing professor to have! I would definitely recommend taking him for Pharm4600, you won't regret it!",
        "course": "Pharm4600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Pharmacy",
    "firstName": "Milap",
    "id": "VGVhY2hlci0yODk1MDgz",
    "lastName": "Nahata ",
    "legacyId": 2895083,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super easy and the nicest little man ever. A guest lecturer comes in every week and talks about a new topic and then we take a quiz for practice at the end - doesn't affect grade at all - at the end of semester there is a presentation about what you learned - great class ",
        "course": "PHR3520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Pharmacy",
    "firstName": "Margie",
    "id": "VGVhY2hlci0yMjM1Mjgy",
    "lastName": "Neidecker",
    "legacyId": 2235282,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The grading criteria for the online worksheets was sometimes a little ambiguous, so there were some instances where I lost points on questions I didn't realize she had an expectation for. Other than those rare occasions, the course was fun, easy, and useful.",
        "course": "PHR2500"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Neidecker is a great professor and is very clear with her materials. The reason I decided to write this review is to warn you of taking the class 5402. There is an unbelievable amount of outside work and it consumes so much of your time. Find something else with less work.",
        "course": "PHR5402"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Pharmacy",
    "firstName": "Laura",
    "id": "VGVhY2hlci0yNTIyMTQ4",
    "lastName": "Hall",
    "legacyId": 2522148,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor ever. Boring lecture and WAY TOO much assignment in a very short period of time. She has extremely HIGH expectation on a lecture about \"how to ask question\". she's also not helpful on answering your question. I don't know how she get the job of teaching, but she needs to so better ",
        "course": "6301"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3,
    "department": "Pharmacy",
    "firstName": "Trevor",
    "id": "VGVhY2hlci0yNjkxNDQ2",
    "lastName": "Hedberg",
    "legacyId": 2691446,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible experience. Class is way too much work for 2 credit hours. Lectures were useless and powerpoints  don't give all the information you need to study. He gives test questions before the exam for you to prep responses, but questions never fully encompass what you're expected to write for 100%. Never answers questions directly over email.",
        "course": "PHR3500"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Hedberg was a nice professor and the class was interesting. There are lots of opportunities to get a good grade if you put in the work. There was quite a bit of reading for a 2 credit class, but I didn't mind because the topics were pretty interesting. Gives you a list of all possible short answer questions so you can do good on the test",
        "course": "PHR3500"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "PHR 3530 was more based on ethics and philosophy which isn't what I expected, but it was still pretty interesting. The tests and essays were pretty tough and I needed to do a lot of studying. The lectures were longer than normal and got somewhat boring. Trevor is a funny guy that is knowledgeable, but it seems he is here for research, not teaching.",
        "course": "PHR3530"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Hedberg is a great guy. His class is very straightforward, and his tests are very clear. The issue with the class doesn't reside within Dr. Hedberg but rather the TA's. They take off points for no reason with no feedback whatsoever. Dr. Hedberg does his best to set us up for success. There is a pretty significant amount of homework, though.",
        "course": "PHR3500"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "Too much work for a 2 credit class, work given equals a 3 credit course. Lectures were long and dragged on. Discussions were more helpful to learning than the exams.",
        "course": "PHR3500"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Should update style of teaching. Throws a bunch of long readings at you and talks AT you during lectures. Class would be more interesting if it were more interactive. Least favorite pharmacy elective taken so far.",
        "course": "PHR3530"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lectures are really boring besides a group component that can be &quot;okay.&quot; He does not give any helpful feedback on your exam answers, which would be helpful considering the exams are 3/4 writing. Just do the study guides and you will get most of the credit on the exams, but Dr. Hedberg has an odd style of grading. Overall, weird class.",
        "course": "PHARM3500"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Professor Hedberg claims that students should determine their own stances on ethical issues from class, but if you disagree with his opinion he will tear your argument apart. Lots of reading and even more writing, especially for tests. Makes me angry in a way that is hard to describe.",
        "course": "PHR3530"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "I thoroughly enjoyed professor Hedberg's PHR 3530 course. While this was by no means an &quot;easy A&quot; course, he prepares you well for exams so as long as you put in the work you will do well! This is a pretty reading heavy course but many of the readings are interesting and tests are primarily based off your opinion of them.",
        "course": "PHR3530"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't take",
        "course": "PHR3530"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class was average. There is a lot of assignments and readings. It wasn't too hard but a lot of readings. Some quizzes were a little tricky with questions, but overall was not a terrible class. I did well but lots of work.",
        "course": "PHR3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 5,
    "department": "Pharmacy",
    "firstName": "Zachary",
    "id": "VGVhY2hlci0yNjA3OTMz",
    "lastName": "Woods",
    "legacyId": 2607933,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super nice professor, I took it online so didn't meet him until later in the semester. You can tell he cares about his students and wants them to succeed!  The course content is also really interesting!",
        "course": "PHR3420"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Seemed very sweet overall, and his weekly email updates were the highlight of my week. He definitely cares and is willing to give feedback and help as much as he can.",
        "course": "PHR3420"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Woods was probably one of the only professors I truly enjoyed at OSU. He constantly showed how much he cares about you as a student and also made lectures entertaining while extremely informative. He is always trying to help you so don't be afraid to ask him for help when you need it. I wish I could take more classes with him.",
        "course": "PHR4010"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Honestly; one of the only reasons i passed the NAPLEX. Was a preceptor for an APPE rotation and the mixture of fun, funny, and caring made remembering difficult topics a breeze. A real gem as a young professor",
        "course": "PHARMACYONU1"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was very interesting and Dr. Woods was an entertaining professor. The content wasn't too hard but there are a lot of writing assignments. Grading is very fair.",
        "course": "PHR3420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Pharmacy",
    "firstName": "Julie",
    "id": "VGVhY2hlci0xODQ2MTMx",
    "lastName": "Legg",
    "legacyId": 1846131,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible. Very self centered. Please do what's best for the students interest rather than your &quot;seasoned preceptor&quot;. This can help reduce the APPE Failures",
        "course": "APPE7000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "A drone for the university.  Clearly not doing what is in the best interest of the students.",
        "course": "APPE7000"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "She taught us nothing about calculations.  Did not prepare us well for clinical/real-world pharmacy calculations.",
        "course": "CALCULATIONS"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4,
    "department": "Pharmacy",
    "firstName": "James",
    "id": "VGVhY2hlci0yMTA3ODE2",
    "lastName": "Fuchs",
    "legacyId": 2107816,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Overall a good professor. He is very nice and willing to help. Material isn't the easiest but put in some work and you will be fine.",
        "course": "PHR4000"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great teacher overall. Really good at explaining things with examples. If you need extra help go to office hours. I really enjoyed him. Super nice guy. The material isn't cake, but if you put in the time you will be fine.",
        "course": "PHR4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Pharmacy",
    "firstName": "Alex",
    "id": "VGVhY2hlci0yNjkxNDQ5",
    "lastName": "Sparreboom",
    "legacyId": 2691449,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is very nice. He is very repetitive with questions which I like. I would take again.",
        "course": "PHR4000"
      }
    ],
    "SEI": []
  }
]