[
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "Pharmacology",
    "firstName": "Terry",
    "id": "VGVhY2hlci0yNTk0NTQ3",
    "lastName": "Elton",
    "legacyId": 2594547,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very interesting class! You watch two lectures a week, take a quiz, and a discussion post. His lectures can be boring sometimes but the class is very interesting. Make sure you study for the exams, but if you took behavioral neuro the class is similar to that! I would highly recommend this class, its very easy and stimulating to learn about!!!",
        "course": "PHR2400"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy GE with some work. Lectures recorded and must watch for points. Discussion boards, and some quizzes, 3 exams (no final). Exams are fair but obvi need to watch lecs and take notes to understand material. Kind professor, very accessible through email.",
        "course": "PHR2400"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "By far one of the nicest professors I have had at OSU. My section was online, but he was very understanding and caring when reaching out to him. His modules are very organized and easy to keep up with, especially since the class was online. ",
        "course": "PHR2400"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor, gives quiz answers in class, expects you to know your stuff for exams though. Writing assignments are not terrible. Very fair difficulty for a 2 credit hour class.",
        "course": "PHR2400"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.7,
    "department": "Pharmacology",
    "firstName": "Molly",
    "id": "VGVhY2hlci0yMjQxODU4",
    "lastName": "Downing",
    "legacyId": 2241858,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor and her class is nicely organized and set up. Though there might be some weeks where the workload is on the heavier side, it is all manageable and there are no exams. I would love to take her class again but I am not a health science major.",
        "course": "PHR2410"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a very tough grader that I felt like to take off points just because she wanted.For the discussion and case studies if you did not give exactly what she wanted, then you would lose significant points. I would write paragraphs researching things for her discussions and she would still take off points. ",
        "course": "PHR2410"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this asynchronous with Dr. Pekny, who is great, and Dr. Downing was featured in many lectures (also great)! Super interesting, learned important things to apply to life. Work load very manageable. Would recommend!",
        "course": "PHR3420"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super easy course, get to pick a book to read which was fun (and the book was actually good!) Everything is laid out in the rubric too so it's super easy to follow the course. Dr. Downing is super nice as well!",
        "course": "PHARM3420"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Dr. Downing last year, but she is truly one of the best pharmacy elective professors. She is understanding and compassionate. Everything I learned is applicable to the real world and I found the case studies interesting. ",
        "course": "PHR2410"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fun class and not difficult. Stimulating material!",
        "course": "PHARM3420"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Downing was so helpful through and through. Her lectures are engaging, short, and you learn about all different kinds of OTCs. I 100% learned the most in this class this semester, and I have used what we have learned for myself and my friends have asked me pharmaceutical advice for when they fall ill. 10000/10 would take again.",
        "course": "PHR2410"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great!! Definitely my favorite class. Do the work and you will do well. Very easy class. She is super nice and her lectures are entertaining. I love the case study papers we wrote. You will learn a lot. Take this class !!",
        "course": "PHR2410"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Dr. Downing. She is so sweet. I have nothing bad to say about her. I purposely look to see what classes she teaches each semester &amp; hope its something I can take. One of my best professors ever. Lectures are not terrible, pretty easy to follow and weekly quiz follows the lecture so take good notes. There was not a final exam in this class.",
        "course": "PHR2410"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "My favorite course at OSU and first online class I've taken. Very interesting to get basic knowledge of how drugs work and what specific ones are useful for. The course is really light and easy as long as you stay on top of the assignments. 10/10 would recommend taking along with a harder schedule to keep credits up but have a lighter workload.",
        "course": "PHR2410"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "best class i've taken at OSU in the three years i've been here, dr. downing is awesome and always tends to her students, i had issues with the online exam software and she was willing to extend the due date for me, great personal feedback on all written assignment, i wish i could repeat this class honestly. TAKE THIS CLASS!!",
        "course": "PHARM3420"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Downing is extremely kind and always willing to help. I actually truly enjoyed this class, I learned a lot of interesting things and the work was never too much. It is a decent amount of work, but very doable and all assignments are very clearly laid out on day one. Also extra credit is offered and can really help.",
        "course": "PHR2367"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "very interesting class a lot of assignments but easy to get done, discussions every week and other small written assignments but as long as you include what was asked there should be no issue I had a high A the majority of the class and learned a lot of interesting things about the opioid epidemic",
        "course": "PHR3420"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class contained a lot of busy work, but if you put the effort in it was extremely manageable. I could see people getting annoying with the amount of work, discussions each week and a lot of writing, but I found it all really easy. She will help you in any way possible and was always very kind.",
        "course": "PHR2367"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Downing is very helpful. If you put the time in and do the work, you will get a good grade. Discussions are very important, but make sure to follow her guidelines.",
        "course": "PHR3420"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Dowing is a tough grader who provides lots of busy work. I took her class over the summer expecting to knock out an A on an easy GE and ended up putting more time into this class than organic chemistry. Interesting material, but you'd be better off with a different prof.",
        "course": "PHR2367"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Molly is a great professor and is always willing to email back and forth to help. There are A LOT of assignments but they are not hard; lots of busy work. Mainly discussion posts. She gives great instructions and tells you exactly what to do to receive a good grade.",
        "course": "PHR2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "Pharmacology",
    "firstName": "Kelly",
    "id": "VGVhY2hlci0yODk4Mzc0",
    "lastName": "Speirs",
    "legacyId": 2898374,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Every week there's a discussion board and a quiz. Super easy. Gives extra credit. tip: enter transcript into AI and you'll have an easier time. there's NO reason you should have lower than a B-. Just stay on top of everything. once a week, take about 2 hours of your day to do everything. It's easy for students to fall off, so stay consistent.",
        "course": "2410"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took the course completely asynchronously and still thoroughly enjoyed this class. Dr Speirs really cares about her students and is passionate about what she is teaching. Information is clearly laid out, and the workload is light. Weekly, there are discussion posts and responses and a few short essays throughout the semester. I highly recommend.",
        "course": "PHR2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "GOAT. She genuinely cares about students success which is reflected in her responses, grades, and comments. 10/10 would take every class she offers.",
        "course": "PHR2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Speirs is an angel professor. She takes care of every student. The course setting is very reasonable. It could make sure students really learn the knowledge points, but also make sure that students do not work overload. There are lots of chance to get extra credit which makes me get an A!",
        "course": "PHR2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Speirs is an angel professor. She takes care to every students. The amount of work is appropriate, which can make sure that we can really learn the knowledge but not work overload!",
        "course": "PHR2367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I like Dr. Speirs very well. She is an angel professor. The course setting is very simple, and the woman is very kind. The grading is not very strict, so getting an A is not difficult.",
        "course": "PHR2367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kelly Speirs is a very amazing woman. Her course is very simple. The amount of task is appropriate, which could make sure we can learn the knowledge but not overload.",
        "course": "PHR2367"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "The professor was very good, but her homework set was always very complicated, and the TA was very eager to find a place to deduct points every time in my homework, and as a 3 point GE class, he really didn't deserve it",
        "course": "PHR2367"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I learned a lot in this course. I would recommend it to anyone who is trying to fulfil a GE requirement, a major requirement, or is just looking to become more knowledgeable more about drugstore products. ",
        "course": "2410"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Literally the best professor ever. Lets you submit assignments anytime during the semester, just make sure its before finals week. Super fun, super creative and funny. It was the only class I looked forward to.",
        "course": "2410"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "A great professor, content is clear and straightforward, lots of extra credit as well",
        "course": "2410"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is one of the best professors I have ever had! She offers extra credit and is very helpful. If you view each lecture, you'll do great! ",
        "course": "2410"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was very helpful when I needed help. It was for a course I needed to fulfill a GE, and I felt her course dove deep into the course content, a bit more than what I cared for. Not too difficult of a course but just be ready to write a bit. Memes added some character lol",
        "course": "2410"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "she was an amazing professor and had great memes ",
        "course": "37393"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's amazing and has good humor.  Communicates material quickly and effectively.  Has good memes.  ",
        "course": "37393"
      }
    ],
    "SEI": []
  }
]