[
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.2,
    "department": "Physical Ed",
    "firstName": "Amy",
    "id": "VGVhY2hlci0yMDU4NjU=",
    "lastName": "Prince",
    "legacyId": 205865,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great class, especially for people without a yoga background. Very relaxing and a good change of pace from academic classes. Never felt weird as one of the only guys in the class.",
        "course": "YOGA1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker has a great instructive style. She is very patient and clear in directions for the poses.  She is perfect for this introduction to yoga.",
        "course": "YOGA1"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker is very knowledgeable about how yoga and how to teach it. I felt comfortable asking for form corrections and my yoga practice definitely improved during the course. As for workload, all you had to do was show up to class and complete a few short homework assignments. An easy A as long as you follow the clear expectations of the class.",
        "course": "YOGA1"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very critical and impossible standards",
        "course": "YOGA1"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "Beakers class was fine. Not great, not terrible. Something about her was just off-putting. I had imagined a yoga teacher wouldn't be so up-tight. She was very cautious about covid which I respect but she took it too far at times. She does know her way around yoga though so she was good at answering questions.",
        "course": "KNSFHP119501"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "She was a weirdo. The class was easy but shes very self-important. I seriously could not stand her as a person.",
        "course": "19501YOGA"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Her real name is Amy, but she goes by Beaker. Very relaxing personality and soothing voice. Just wants you to learn and love yoga. She wants you to get something out of each class and the course as a whole. VERY caring and sympathetic. Go to class and you're fine (you can miss 2 if necessary).",
        "course": "KNSFHP119501"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker is really awesome. I wouldn't recommend taking this class if you don't care about yoga or mindfulness, but if you do have some interest and an open mind you can really benefit a lot from this class. In order to pass you can only miss a couple of classes but the two hours go by really quickly.",
        "course": "KNSFHP119501"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Don't take this class if you want it to just be a bullcrap activity class, like it should be.  She tries to make this gym class into an actual class. During class, she says so much hippie bs that I had to refrain from laughing a few times. She needs to realize it's is a bs class, not an actual academic class. No matter how much she wants it to be.",
        "course": "YOGA1"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Beaker is AMAZING. I took her Body/Mind Course in the fall and still can't get over it. I wrote the previous comment, but I've changed my mind completely. Beaker is funny, interesting, smart, and insightful. She will  make sure you walk away from class feeling like it was worth it. Minimal homework (only reading). Easy exam, final project.",
        "course": "EDUPL2241"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "Beaker is one of the most fascinating women I've ever met. I enjoyed her some days, hated her most others. She speaks in an elevated manner, and is VERY into the whole \"body/mind\" connection. Beaker is strange, but it's necessary for the course to flow superflously. Only take this course if you have a true interest. Otherwise, jump ship.",
        "course": "EDUPL2241"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "Beaker is really nice. She's very strange, but not in a bad way. Those expecting to take Yoga as a BS class will be in for a wake up call. You actually have to do stuff. :P It's still easy though. She's kind of unclear on how long your journal entries have to be, but I wrote about 3/4 page for each of mine, and I got a perfect grade.",
        "course": "YOGA1"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker is awesome! Good if you prefer a lower-key workout focusing more on bodily awareness than aerobics, though she did still kick it up a notch during each class. At times let us Sun Salutation at our own pace. I had H1N1 this quarter, and she really worked with me to make up missed classes so I could still get an 'A', even during the last week.",
        "course": "YOGA2"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was so different from my yoga 1 class that I couldn't stand it. Beaker obviously knows how to teach but she didn't teach what most of us wanted to know. We spent too much time not doing anything (literally, sometimes) instead of actually getting a good yoga workout in. I wouldn't take another class from her.",
        "course": "YOGA2"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Beaker is indubitably sweet and caring. She has put much work into organizing this course (possibly superfluously.) Don't take things too seriously, but keep an open mind and listen to what she is saying more than focusing on the guided lecture notes.  Beaker's pleasant personality will help you through the quarter. Integral yoga interest necessary",
        "course": "EDPAE601A"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "kind of odd teacher but in the cool kinda way, prolly the reason she teaches yoga. loved the relaxation part at the end of class, i often was close to falling asleep but in yoga its a good thing as opposed to falling asleep in any other class.",
        "course": "YOGA1"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 1,
        "comment": "MOvement and Self Awareness class is a very odd class",
        "course": "EDU168"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is very nice! She is all about listening to your body and the last part of class is spent simply relaxing.",
        "course": "19501YOGA"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is alot of fun.  She will remind you of a kindergarden teacher with her enthusiasm.  All in all, a very relaxing and laid back class.",
        "course": "EDU195"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "EDU"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "yoga teacher she's awesome",
        "course": "EDPL100"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "She taught the first social dance class.  It was lots of fun, but that Steve guy who also teaches and was our substitute one day is a better teacher.  Beaker's a little strange, but she's nice.",
        "course": "EDUPAES153"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.6,
    "department": "Physical Ed",
    "firstName": "Jae",
    "id": "VGVhY2hlci0yODU1ODU=",
    "lastName": "Westfall",
    "legacyId": 285585,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Love her! She's so understanding of her students circumstances. Her tips for stress management were actually so helpful and I still use many of them even with the class being over.",
        "course": "KNSFHP1104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Without a doubt the best professor I've EVER had. Such a loving professor, who has such a passion for her students and the material she's teaching. The assignments are a breeze, and are more focused on our personal growth rather than any strict material we'd need to memorize from a textbook. I would take this class a million times over if I could.",
        "course": "KNSFHP1104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Probably the best professor I've had at OSU. Class is taught for students to actually retain knowledge rather than test through quizzes or tests. The class is an easy A if you are willing to show up to class and put your phone down. Highly recommend this course to any college student regardless of major.",
        "course": "KNSFHP1104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jae is the only professor I've ever met that genuinely cares about the material and the students. The class felt more like group therapy than stress management. The final paper is an easy topic but it is extremely long and time consuming to complete.",
        "course": "KNSFHP1104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jae is probably the nicest person to walk the earth. Super kind, caring, hilarious, and generous. Always makes sure youre comfortable with anything and everything. Stress Management meditations with her were something I looked forward to. Definitely take this class, awesome on many levels!!",
        "course": "KNSFHP1104"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest A ever, plus an amazing class! This course taught me so many effective ways to handle stress. Attendance is the biggest portion of the grade, and the assignments are sooooo easy. Would 10/10 take again, and I would recommend it to every college student.",
        "course": "KNSFHP1104"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Jae is super nice and understanding but the assignments are a little hard and confusing. Other than that the class is a breeze.",
        "course": "KNSFHP2250"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jae is amazing! The fist day of class she had us all crying from laughter with her stories.  She truly cares about the topic and makes the class a piece of cake.  Her quizzes are all online and open note.  If you're someone who needs a GPA booster or wants to have a class that isn't stressful, take this class!",
        "course": "CANCERPREVENTIO"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "EDUPAES 250 - Avoiding Cancer. Interesting class with 5 assignments, 10 online quizzes, 1 project, and an online final exam. Seems like a lot of material, but they are all pretty easy to complete and do well in. Great professor who makes things interesting and worth going to class for! Easy A for anyone who needs a little GPA boost!",
        "course": "EDUPA250"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class, just buy the book and keep up on the weekly assignments.  3 credit hour class that should only take up about 30 minutes of your week tops.  Midterm/Final is open-book and you actually don't need to study for it.",
        "course": "AIDS315D"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "Ok, this wasn't the easiet 3 credit hour class but it was really interesting. The tests can be a little hard if you don't study. We had an open book midterm but there wasn't enough time to look through the book so study ahead of time.",
        "course": "EDU314"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A if u read...quizzes may be tricky but if u pay attention you should get an A with ease...and u learn a lot that u would have never thought about...great class, easy A, cant ask for much more...an its a 3 credit course that requires maybe a half hour of work a week if u pay attention..and final is all old quiz &#63;s",
        "course": "PAES314"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is awesome. take the class if you get the chance, it isnt the easiest yet it isnt the hardest it is in the middle. I guess if you read and do the work you will get the info. and do well in the class. Jae is an awesome teacher and person you will have fun no matter what!",
        "course": "EDUPAES312"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great teacher. The AIDS awareness class is so wonderful- everyone at OSU should take it. It really opens your eyes to a lot. The class is a breeze, great elective.",
        "course": "AIDS"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class, interesing and helpful...Jae was interesting in teaching us the information, didn't focus on grades, but the material.  She is so fun to listen to with all her animations and wild stories.",
        "course": "CANCER"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "dont sleep in her class - shes four years ncaa starting catcher; no one stole a base.....hey big guy how many cheeseburgers can you eat&#63;",
        "course": "AVDCANCER"
      }
    ],
    "SEI": []
  }
]