[
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.6,
    "department": "Physical Ed",
    "firstName": "Jae",
    "id": "VGVhY2hlci0yODU1ODU=",
    "lastName": "Westfall",
    "legacyId": 285585,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Love her! She's so understanding of her students circumstances. Her tips for stress management were actually so helpful and I still use many of them even with the class being over.",
        "course": "KNSFHP1104"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Without a doubt the best professor I've EVER had. Such a loving professor, who has such a passion for her students and the material she's teaching. The assignments are a breeze, and are more focused on our personal growth rather than any strict material we'd need to memorize from a textbook. I would take this class a million times over if I could.",
        "course": "KNSFHP1104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Probably the best professor I've had at OSU. Class is taught for students to actually retain knowledge rather than test through quizzes or tests. The class is an easy A if you are willing to show up to class and put your phone down. Highly recommend this course to any college student regardless of major.",
        "course": "KNSFHP1104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jae is the only professor I've ever met that genuinely cares about the material and the students. The class felt more like group therapy than stress management. The final paper is an easy topic but it is extremely long and time consuming to complete.",
        "course": "KNSFHP1104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jae is probably the nicest person to walk the earth. Super kind, caring, hilarious, and generous. Always makes sure youre comfortable with anything and everything. Stress Management meditations with her were something I looked forward to. Definitely take this class, awesome on many levels!!",
        "course": "KNSFHP1104"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest A ever, plus an amazing class! This course taught me so many effective ways to handle stress. Attendance is the biggest portion of the grade, and the assignments are sooooo easy. Would 10/10 take again, and I would recommend it to every college student.",
        "course": "KNSFHP1104"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Jae is super nice and understanding but the assignments are a little hard and confusing. Other than that the class is a breeze.",
        "course": "KNSFHP2250"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jae is amazing! The fist day of class she had us all crying from laughter with her stories.  She truly cares about the topic and makes the class a piece of cake.  Her quizzes are all online and open note.  If you're someone who needs a GPA booster or wants to have a class that isn't stressful, take this class!",
        "course": "CANCERPREVENTIO"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 1,
        "comment": "EDUPAES 250 - Avoiding Cancer. Interesting class with 5 assignments, 10 online quizzes, 1 project, and an online final exam. Seems like a lot of material, but they are all pretty easy to complete and do well in. Great professor who makes things interesting and worth going to class for! Easy A for anyone who needs a little GPA boost!",
        "course": "EDUPA250"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class, just buy the book and keep up on the weekly assignments.  3 credit hour class that should only take up about 30 minutes of your week tops.  Midterm/Final is open-book and you actually don't need to study for it.",
        "course": "AIDS315D"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "Ok, this wasn't the easiet 3 credit hour class but it was really interesting. The tests can be a little hard if you don't study. We had an open book midterm but there wasn't enough time to look through the book so study ahead of time.",
        "course": "EDU314"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A if u read...quizzes may be tricky but if u pay attention you should get an A with ease...and u learn a lot that u would have never thought about...great class, easy A, cant ask for much more...an its a 3 credit course that requires maybe a half hour of work a week if u pay attention..and final is all old quiz &#63;s",
        "course": "PAES314"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is awesome. take the class if you get the chance, it isnt the easiest yet it isnt the hardest it is in the middle. I guess if you read and do the work you will get the info. and do well in the class. Jae is an awesome teacher and person you will have fun no matter what!",
        "course": "EDUPAES312"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great teacher. The AIDS awareness class is so wonderful- everyone at OSU should take it. It really opens your eyes to a lot. The class is a breeze, great elective.",
        "course": "AIDS"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class, interesing and helpful...Jae was interesting in teaching us the information, didn't focus on grades, but the material.  She is so fun to listen to with all her animations and wild stories.",
        "course": "CANCER"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "dont sleep in her class - shes four years ncaa starting catcher; no one stole a base.....hey big guy how many cheeseburgers can you eat&#63;",
        "course": "AVDCANCER"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 4.9,
    "department": "Physical Ed",
    "firstName": "Sungjoo",
    "id": "VGVhY2hlci04MDcxNzQ=",
    "lastName": "Park",
    "legacyId": 807174,
    "numRatings": 78,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took Park at FAU but I couldnt find her there So im writing one for here here. She is so nice and a memorable professor of mine, She is super talented and has a lot of known art to her name. She will even help you with things outside of class such as life goals and how to get there.",
        "course": "EDU188"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "There are few people in this world like Sungjoo. Even fewer Teachers like him. A genuine boxing and golf prodigy. (professional in both sports in Korea)The best classes I took by far in all 5 years of my college experience.",
        "course": "PAES146"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I have greatly enjoyed his class and spending time with Sungjoo. He is everything that a teacher should be and more. I consider myself lucky to be in his class. He incorporates humor and stories to stimulate the interest of his students. He is one of the most wonderful teachers I've ever had.",
        "course": "TKD169"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Love love love this teacher. Sungjoo is definitely one of my favorite teachers. He's an outstanding teacher who truly wishes to see all of his student succeed! He is very generous with his time and always went out of his way to offer help.",
        "course": "TKD169"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "6 words. You will regret not talking him!",
        "course": "PAES146"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "fantastic. everyone has already said it all!! take his classes",
        "course": "TKD169"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "he was an amazing teacher",
        "course": "EDUPA146"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took boxing with him my last quarter of college, and I only wish I had done it earlier so I could have the opportunity to take more classes from him. Great instructor! Has a great sense of humor and can make you smile even on a terrible day.",
        "course": "BOXIN149"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. Genuinely interested in teaching and has a good sense of humor. Easy class and he makes it fun to attend.",
        "course": "PAES188"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is an excellent teacher. He is aware of his student's skill sets and abilities. He is able to teach without getting to far ahead of his students abilities. He is able to stimulate the student to the next level of progress. He knows when to push his students and when to back off and give them space to contemplate on their own.",
        "course": "BOXING146"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "For those who are fortunate enough to be in his class should consider themselves very lucky.",
        "course": "EDU157"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I think that Sungjoo is a great teacher. He is decent, likeable person in the first place. I have learned so much by having fun in his class. He has high expectations of his students and encourages everyone to always work at their best level. Take his class. It will be the best experience of your college life.",
        "course": "TKD169"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is a great instructor/teacher. He is one of those teachers that a person loves coming to class and learning from. He makes me smile even if I am in a bad mood. His class is interesting, funny, and enjoyable. He always has positive attitude and is working us hard in class. He is very nice and just a good quality teacher.",
        "course": "PAES146"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "I heard nothing but great things from classmates about this teacher, and they were spot on! I took his Fencing class, and would say you couldn't find a better instructor. A true teacher, he incorporates humor & stories to stimulate the interest of his students. I look forward to taking his class this winter again. TOP SHELF.",
        "course": "PAES154"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "I have taken 3 of his classes, Boxing, Fencing and Tae Kwon do, all of which I highly recommend. Take his class. It will be the best experience of your college life.",
        "course": "PAES169"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is really all that everyone says he is - awesome! I took boxing class with another instructor and he was absolutely horrible. Now Sungjoo is a different story. As everyone says hes the man. I think he is an amazing teacher, he makes class fun & interesting.",
        "course": "BOXIN146"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo Park is a great instructor whose passion for his subject is almost invariably contagious. As other raters said, he is a very nice person. Take all his classes. You will have a good time in his class.",
        "course": "PAES188"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am so glad to have Sungjoo as my instructor. I really loved his class. I think he has a great sense of humor that kept the atmosphere comfortable and enjoyable. I appreciated the fact that he divided the class a little to really challenge every player at their own skill levels. I'd recommend him to anyone!",
        "course": "PAES188"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely loved Sungjoo Park. Two thumbs up! He is by far the best teacher at OSU.",
        "course": "PAES146"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is a really nice guy and his teachings are very clear. He makes the class as interesting as possible and really cares about his students. I took him for both Golf and Tennis, and I wish I could have him for more classes.",
        "course": "PE157"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not only is he a terrific teacher, he is the nicest person alive. Even though tennis is my favorite sport, he makes it better. I learned a lot of little things that have really made a difference. I liked the mix of playing and drills.",
        "course": "PAES188"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is an amazing instructor. He teaches with great passion and knowledge in Golf. Before I took this class I had many golf lessons but soon found out that this class was way more informative and helpful that I ever expected. Sungjoo is a definite asset to the OSU System.",
        "course": "GOLF157"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Superb! I am always pleased with his teaching style and interaction.",
        "course": "PAESGOLF"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am graduating in about two weeks and boxing with Sungjoo was by far and away my favorite class in my four years here at Ohio State. His passion and energy undoubtedly rubbed off on the entire class and made the experience a great one. I learned a lot and improved greatly. This clearly is a testament to his expertise and interest in the sport.",
        "course": "PAES146"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "He makes the class really simple and tries his best to make sure you do your best. He is very approachable and friendly. I hated missing class because he was entertaining and taught me so much. By far the best college teacher I have encountered at Ohio State.",
        "course": "PAES154"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo officially received the teaching award which is Ohio State?s highest recognition of the exceptional teaching. He is well-deserving of this award. He goes out of his way to help. He motivated and encourages unlike any instructor. Nobody deserves this award more than Sungjoo.",
        "course": "PAES188"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class was great. He is a really good boxing instructor. I had a real good time in his class. I really learned a lot and now I can really kick some butt if I'm ever in trouble!",
        "course": "PAES146"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo was fabulous. He is one of the top three professors I?ve had here at OSU. He always helps anyone who is lagging behind a bit and covers his smiles if I look like a complete idiot! He goes well above and beyond to make sure that we learn and have fun doing it.",
        "course": "PAES154"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo was an excellent instructor and a genuinely nice man. He was extremely easy to approach and never made me feel like I was bothering him. He kept me fascinated through out the whole quarter and I now have a completely new appreciation for boxing",
        "course": "PAES146"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo makes the class fun and is an overall great guy, and most importantly, he really knows how to teach. He absolutely blew me away with how amazing of a teacher he was. He is also very helpful in and out of the classroom. I hope he will become a life-long friend.",
        "course": "EDU146"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is a ton of fun! He is extremely helpful and enthusiastic, and I'm looking forward to having him again next quarter. Very sweet guy!",
        "course": "PE154"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is an amazing! The class is so fun and he was always trying to make the class interesting. Sungjoo inspires students to do their best. Not only is Sungjoo one of the best instructors, he is also one of the greatest people we could ever meet. He is an extremely nice guy and very helpful and lenient.",
        "course": "PAES154"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love him, he is great. I had a 8:30am class and it was a joy going to his class.",
        "course": "EDU146"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 1,
        "comment": "1 word. EXCELLENT!",
        "course": "FENCI154"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is the best! I didn?t miss a single class because he is awesome. He always makes us laugh every class, and teaches well too.",
        "course": "PHYED154"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "I learned a great deal from Sungjoo and had a great time in his class. He made class fun and exciting while working one-on-one with student to make sure everyone was drenched in sweat by the end of class (Just kidding, but man is he tough!). I would recommend him to absolutely everyone interested in this class. Sungjoo rocks!",
        "course": "PAES169"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take his class! You will love him and his class.",
        "course": "TKD169"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "I've never had a teacher that cared this much about what he was teaching. Sungjoo has and bears one of the most powerful testimonies I have ever heard, and his Fencing class is an extension of his testimony. He is totally dedicated to his class and he has amazing knowledge, understanding, and ability to teach with excitement and interest.",
        "course": "FENCI154"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 1,
        "comment": "So friendly, makes all the students feel like his favorite, which is hard to do. Awesome class. I would recommend it to anyone! Take this class!",
        "course": "PAES146"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 2,
        "comment": "Sungjoo has a genuine interest in his students. He kept the class motivated and excited. He is one of the most fun teachers to work with and learn from. He is able to bring out the best in each student and pushing them to reach his or her full potential. I am incredibly glad I took Tae Kwon Do with Sungjoo.",
        "course": "TKD169"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 1,
        "comment": "My best class of the quarter. I agree with EVERYONE else. This guy is pretty amazing.",
        "course": "BOXIN146"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo knew a lot about golf and how to play the game. He has real world experience (some professors don't have any) and can really lead by example the correct way of creating a great golf swing. He is a very good golf-player and teacher.",
        "course": "GOLF157"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 1,
        "comment": "Simply a gifted teacher.",
        "course": "GOLF157"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo brouhgt a tremendous amount of energy to class every day. He always arrived early and would stay after class for students who wanted additional practice. He is clear in his instruction, even though English is not his first language. Great class, great instructor!",
        "course": "BOX146"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is an amazing instructor. He makes class a lot of fun and is also funny. I am going to take a class next quarter that I would not have taken if he was not the instructor. He is awesome!",
        "course": "PAES146"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "I have had Sungjoo Park for tennis 1 and 2. I chose to tkae tennis 2 just because I knew that he was the instructor. Sungjoo is one of the most talented and friendly people that I know. I am sure the same if you have met him yourself, unless you know some extremely extremely talanted and friendly people. OSU is very lucky to have him.",
        "course": "PAES188"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is one of the most positive-minded instructors I have had. He never shows the least bit of frustration or disappointment with any student, managing to laugh with them instead of getting angry or impatient. Sungjoo is one of those rare shining stars of an instructor whose classes I would highly recommend to my friends.",
        "course": "TKD169"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo has a reputation as one of the best PE instructors at OSU. Sungjoo is an excellent teacher for any class, golf was no exception. I've taken almost every class he teaches. I'd recommend him to anyone wanting to get in shape and to learn sports",
        "course": "GOLF157"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 1,
        "comment": "You can not go thru four years at OSU and then graduate without taking him. His class is hilarious, fun, interesting. He is becoming a celebrity on campus and you cannot register for his classes a day after registration opens up. DO try to take a class with him.",
        "course": "BOXIN146"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 1,
        "comment": "Nothing more to say...great class!",
        "course": "PAES146"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is an extremely nice person and an excellent teacher. He knows his Tae Kwon Do that is for sure and knows how to push and train each student so that they have the best chance to excel in the program. Best instructor at OSU!",
        "course": "PAES169"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is meant to be a teacher. He really knows his stuff and the way he teaches made us want to participate in class activities. In addition to his spectacular teaching style, he is one of the niceset guys I have ever met.",
        "course": "PAES157"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wow, just wow!!",
        "course": "PAESTENN"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is an all around amazing instructor. The passion he has for boxing is not only inspiring, but contagious to all of his students. In addition to learning the fundamentals of boxing, I also learned about focus, hard work, and positive interactions with others. I am very thankful to have had Sungjoo Park as my boxing instructor",
        "course": "PAES146"
      },
      {
        "index": 55,
        "rating": 4,
        "difficulty": 2,
        "comment": "I am not really into martial art, but I never minded going Sungjoo?s class. He is very friendly and personable. He has a really good sense of humor and really made the class fun.",
        "course": "PAES169"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 1,
        "comment": "I forgot how great a PE teacher can be. With Sungjoo, the issue is never how hard or easy he is. It's how inspiring he is. Actually he gives a lot of work, but I love doing it cause it's so interesting. The best teacher ever!",
        "course": "PAES146"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "Without a doubt Sungjoo is the best teacher I have had in university. I was so lucky to get into his class. He goes so far out of his way to help students learn and to make class fun and interesting that he sets new standards for instructors everywhere. Sungjoo is the best teacher.",
        "course": "BOX146"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best teachers I ever had in my student life. Great teaching strategy, very cooperative, and great motivation. Sungjoo is very friendly, personable and so cute! I recommend Sungjoo to all my friends.",
        "course": "EDU188"
      },
      {
        "index": 59,
        "rating": 4,
        "difficulty": 2,
        "comment": "Awesome phys ed instructor  Take his class!",
        "course": "PAES188"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 1,
        "comment": "I learned a great deal from Sungjoo about a topic I previously had no experience in, and I would recommend him to absolutely everyone interested in this class. Sungjoo rocks!",
        "course": "BOX146"
      },
      {
        "index": 61,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am absolutly not suprised that Sungjoo has smiley faces on every rating. He is awesome and fun.",
        "course": "TKD169"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher! One of the best!",
        "course": "TKD169"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 1,
        "comment": "amazing professor all around, I recommend taking a class just to have him before you graduate.",
        "course": "GOLF157"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 1,
        "comment": "OSU is lucky to have a teacher like Sungjoo. He is one of the best ones here if not the best. Take him if you get the chance it will be well worth it.",
        "course": "TENNI188"
      },
      {
        "index": 65,
        "rating": 5,
        "difficulty": 1,
        "comment": "You're crazy if you don't take Sungjoo for this class. I wish all instructors were like him. Not only did you have a ton of fun in class, but you learned and remembered things from that class. Coolest guy!",
        "course": "BOXIN146"
      },
      {
        "index": 66,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is clearly a highly respected professional in his area and a member of the PGA. He is so cool and relaxed about his students. He is knowledgable and very attentive. Awesome teacher!!",
        "course": "GOLF157"
      },
      {
        "index": 67,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved his class!!! The coolest guy on the face of the earth. Sweet, helpful, friendly, great teacher - one of my favorite teachers!!",
        "course": "PAES169"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 1,
        "comment": "Incredibly energetic, loves teaching, and has hilarious stories.  I wish there was a tae kwon do II to take.",
        "course": "EDU169"
      },
      {
        "index": 69,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is a fantastic fighter and teacher, makes the class fun, and isn't bad to look at either! If you want to learn more he'll stay with you after class. All around really nice guy and I would definitely recommend taking this class for a fun one credit class.",
        "course": "EDUPA146"
      },
      {
        "index": 70,
        "rating": 5,
        "difficulty": 2,
        "comment": "Not to be repetitive, but O man, so sweet and nice. But teaches a great class, too.",
        "course": "TKD169"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved Sungjoo!! He is SOOOOO HOT! OSU students get the privilege of being instructed by a seasoned ass kicker. Sungjoo is by far best TA at OSU. Enjoy your privilege!",
        "course": "PAES146"
      },
      {
        "index": 72,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sungjoo is awesome! I am 100% sure your will love him as all of students in my class did! He made learning the fundamentals in class very enjoyable. He knows how to connct with students and I think his sense of humor and teaching approach is great. As a FYI for female students like me, he is hot!",
        "course": "PAES146"
      },
      {
        "index": 73,
        "rating": 5,
        "difficulty": 2,
        "comment": "Sungjoo is incredibly nice and helpful.  He just wanted us to have fun and learn a few things before the end of the quarter.  The final is take-home and the skills test is based on your progress throughout the quarter.  Def recommend him for EDU PAES 188.01 :)",
        "course": "EPAES1881"
      },
      {
        "index": 74,
        "rating": 5,
        "difficulty": 1,
        "comment": "Adorable, so sweet and very helpful! I loved his class!",
        "course": "EDUPAES18801"
      },
      {
        "index": 75,
        "rating": 5,
        "difficulty": 2,
        "comment": "awesome!",
        "course": "EDUPAES15701"
      },
      {
        "index": 76,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "PAES146"
      },
      {
        "index": 77,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "EDUPAES146"
      },
      {
        "index": 78,
        "rating": 5,
        "difficulty": 3,
        "comment": "He makes boxing fun, and is very nice and sincere.  He'll challenge you if you show interest in boxing- he was a champion boxer in Korea and knows what he's talking about. He tells funny stories in class, and he wants to be famous!!!",
        "course": "EDUPAES146"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.2,
    "department": "Physical Ed",
    "firstName": "Amy",
    "id": "VGVhY2hlci0yMDU4NjU=",
    "lastName": "Prince",
    "legacyId": 205865,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great class, especially for people without a yoga background. Very relaxing and a good change of pace from academic classes. Never felt weird as one of the only guys in the class.",
        "course": "YOGA1"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker has a great instructive style. She is very patient and clear in directions for the poses.  She is perfect for this introduction to yoga.",
        "course": "YOGA1"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker is very knowledgeable about how yoga and how to teach it. I felt comfortable asking for form corrections and my yoga practice definitely improved during the course. As for workload, all you had to do was show up to class and complete a few short homework assignments. An easy A as long as you follow the clear expectations of the class.",
        "course": "YOGA1"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very critical and impossible standards",
        "course": "YOGA1"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "Beakers class was fine. Not great, not terrible. Something about her was just off-putting. I had imagined a yoga teacher wouldn't be so up-tight. She was very cautious about covid which I respect but she took it too far at times. She does know her way around yoga though so she was good at answering questions.",
        "course": "KNSFHP119501"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "She was a weirdo. The class was easy but shes very self-important. I seriously could not stand her as a person.",
        "course": "19501YOGA"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Her real name is Amy, but she goes by Beaker. Very relaxing personality and soothing voice. Just wants you to learn and love yoga. She wants you to get something out of each class and the course as a whole. VERY caring and sympathetic. Go to class and you're fine (you can miss 2 if necessary).",
        "course": "KNSFHP119501"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker is really awesome. I wouldn't recommend taking this class if you don't care about yoga or mindfulness, but if you do have some interest and an open mind you can really benefit a lot from this class. In order to pass you can only miss a couple of classes but the two hours go by really quickly.",
        "course": "KNSFHP119501"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Don't take this class if you want it to just be a bullcrap activity class, like it should be.  She tries to make this gym class into an actual class. During class, she says so much hippie bs that I had to refrain from laughing a few times. She needs to realize it's is a bs class, not an actual academic class. No matter how much she wants it to be.",
        "course": "YOGA1"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Beaker is AMAZING. I took her Body/Mind Course in the fall and still can't get over it. I wrote the previous comment, but I've changed my mind completely. Beaker is funny, interesting, smart, and insightful. She will  make sure you walk away from class feeling like it was worth it. Minimal homework (only reading). Easy exam, final project.",
        "course": "EDUPL2241"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "Beaker is one of the most fascinating women I've ever met. I enjoyed her some days, hated her most others. She speaks in an elevated manner, and is VERY into the whole \"body/mind\" connection. Beaker is strange, but it's necessary for the course to flow superflously. Only take this course if you have a true interest. Otherwise, jump ship.",
        "course": "EDUPL2241"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "Beaker is really nice. She's very strange, but not in a bad way. Those expecting to take Yoga as a BS class will be in for a wake up call. You actually have to do stuff. :P It's still easy though. She's kind of unclear on how long your journal entries have to be, but I wrote about 3/4 page for each of mine, and I got a perfect grade.",
        "course": "YOGA1"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Beaker is awesome! Good if you prefer a lower-key workout focusing more on bodily awareness than aerobics, though she did still kick it up a notch during each class. At times let us Sun Salutation at our own pace. I had H1N1 this quarter, and she really worked with me to make up missed classes so I could still get an 'A', even during the last week.",
        "course": "YOGA2"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was so different from my yoga 1 class that I couldn't stand it. Beaker obviously knows how to teach but she didn't teach what most of us wanted to know. We spent too much time not doing anything (literally, sometimes) instead of actually getting a good yoga workout in. I wouldn't take another class from her.",
        "course": "YOGA2"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "Beaker is indubitably sweet and caring. She has put much work into organizing this course (possibly superfluously.) Don't take things too seriously, but keep an open mind and listen to what she is saying more than focusing on the guided lecture notes.  Beaker's pleasant personality will help you through the quarter. Integral yoga interest necessary",
        "course": "EDPAE601A"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "kind of odd teacher but in the cool kinda way, prolly the reason she teaches yoga. loved the relaxation part at the end of class, i often was close to falling asleep but in yoga its a good thing as opposed to falling asleep in any other class.",
        "course": "YOGA1"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 1,
        "comment": "MOvement and Self Awareness class is a very odd class",
        "course": "EDU168"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is very nice! She is all about listening to your body and the last part of class is spent simply relaxing.",
        "course": "19501YOGA"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is alot of fun.  She will remind you of a kindergarden teacher with her enthusiasm.  All in all, a very relaxing and laid back class.",
        "course": "EDU195"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "EDU"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "yoga teacher she's awesome",
        "course": "EDPL100"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "She taught the first social dance class.  It was lots of fun, but that Steve guy who also teaches and was our substitute one day is a better teacher.  Beaker's a little strange, but she's nice.",
        "course": "EDUPAES153"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Ed",
    "firstName": "Laura",
    "id": "VGVhY2hlci04MTk0Nzk=",
    "lastName": "Mowad",
    "legacyId": 819479,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor. Easy, EASY credit. Just read the slides and check the American Cancer Society website and you'll pass the course with a 95% or more. She's lenient on late assignments. 1010 overall.",
        "course": "KNSFHP2250"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Cares about her students. Highly recommend taking.",
        "course": "KNSFHP2250"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Dr.Mowad. I think she is an amazing and strong woman, inside and out. She is smart, amiable, and fun. Together with Professor Cecil, it's a super-fun time!",
        "course": "SES2440"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She communicated the material very well, but what we covered wasn't really on the tests. The tests were more in-depth, so you might as well just read the book. Take-home final was nice as well. Not a hard class - there are a couple of papers and a presentation, but she grades them pretty easily - but having a 3 hour class is kind of rough.",
        "course": "EDUPAES103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 4.6,
    "department": "Physical Ed",
    "firstName": "Steve",
    "id": "VGVhY2hlci0yNTU3NzE=",
    "lastName": "Devor",
    "legacyId": 255771,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Devor is the best professor I have ever had. He's really into the material and that shows through his teaching style. Very theatrical, you'll want to go to class. Your grade depends only on exams but if you go to class it will be an easy A.",
        "course": "EDUPA2360"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Devor is amazing. This is my second time having him in class and wish I could have him again. He is very passionate about his field and extremely knowledgeable. He wants everyone to succeed and provides you with all the tools to do so, but makes the exams challenging and requires you to put in work and really understand the material. ",
        "course": "KNHES3414"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Always willing to help his students. Willing to make appointments outside of his office hours. Knows this subject backwards, forwards, and upsidedown and does a great job of teaching it. Doesn't talk down to, or over the heads of the class. Funny as hell too. Only lecture I ever actually looked forward to going to.",
        "course": "3414"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome teacher. As long as you pay attention in lecture and study, there is no reason why you cannot get a decent grade",
        "course": "EDUPA2360"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best Lecturer I've had at OSU. He knows his stuff backwards and forwards and encourages his students to as well.  His lectures are high energy and very entertaining. You'll WANT to go to class. He has office hours, but lets you know he's in high demand. As far as his  personality goes, he thinks he's God's gift to exercise phys., which is annoying.",
        "course": "EDPAE360"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Extremely thorough, knowledgeable, and straightforward; everything you want in a lecture.  His enthusiasm for the subject material is really motivating.  Favorite class so far!",
        "course": "EDUPA360"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Devor brings the enthusiasm every class.  Very engaging personality and explains difficult material exceptionally well.  A great class and professor!",
        "course": "EDUPA360"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Devor is awesome! Best teacher i've ever had. Really knows what he is talking about and is able to transfer that knowledge to students effectively.",
        "course": "KINES360"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great teacher, very enthusiastic about the subject.",
        "course": "KIN360"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best profs at OSU. He loves to rip into the losers at OSU and is quite funny. He moves fast in his lectures but they are laid out well so you can actually learn and understand them. No quizzes or hmwk really. Exams are pretty easy besides 1 or 2 remote questions. An A in this class is easy if you are motivated and deserving of college.",
        "course": "EXSC360"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "very fun teacher.  really knows his stuff.  make sure to go to class!",
        "course": "PAES414"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "BEST Prof at OSU, must take for any class he teaches",
        "course": "EDU360"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best professor that you will ever have. He knows his stuff and gives great lectures.  As long as you go to class and keep up with studying you will do fine.",
        "course": "PAES414"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Topic knowledge - finest, presentation first class, he make you learn.",
        "course": "PAES360"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "he is a tough proffesor but if study everything on the study guide and go to class you will get an A.",
        "course": "EXE360"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Devor was able to make a difficult subject amazingly easy to understand.  Simply going to class understanding and studying is enough to get you a good grade. Devor is kind of full of himself but he has reason to be. Very smart and funny and truthful. Take his classes",
        "course": "PAES360"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "PAES360"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing prof, knows his stuff 110% and super excited about it.  Attendance is crucial.  Very helpful if he thinks you are trying.",
        "course": "360414514"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "I agree with other raters. He is so full of himself. He is annoying and doesn't help his students.",
        "course": "EDUPAES"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "EDUPAES"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best teacher ever",
        "course": "360414514"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is so full of himself. He likes to hear himself talk and look at his 10 inch biceps in his skin tight polos. He is annoying but does know his stuff.",
        "course": "PAES360"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best professor I've ever had, definetly take his course all the way through if your in the major, and get his course if u aren't anyway.",
        "course": "KINES"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "KINESIOLOGY"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "PAES360"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "PAES360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Physical Ed",
    "firstName": "Sue",
    "id": "VGVhY2hlci04MjU5MDc=",
    "lastName": "Sutherland",
    "legacyId": 825907,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "very good professor !",
        "course": "EDUPA245"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very professional in the classroom, very personal outside of class. Exactly what you want out of a professor. I never got less than an A in her classes because she motivated students well. I will miss having Dr. Sutherland for class!",
        "course": "MANY000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher.  Voice is very soothing and lectures almost put you to sleep because of her voice.  But, she is knows what she is talking about and is an awesome professor.  Look her up and take her classes!",
        "course": "PAES307"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.2,
    "department": "Physical Ed",
    "firstName": "Melvin",
    "id": "VGVhY2hlci00Mzk0NDI=",
    "lastName": "Adelman",
    "legacyId": 439442,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Professor Adelman is a highly intellectual guy with many fascinating things to say. His lectures can be dry due to the subject matter but he has a unique and quirky way of shaking things up. He is definitely old school. He truly wants students to think for themselves and DO the hard work. He has done a great service to all students he has taught.",
        "course": "EDUPA210"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "He is a very knowledgeable man on the topic. However, his lectures are extremely boring and he does not believe in lecture slide or computer use at all. There is a ton of assigned readings (btwn 100-200+ pages a week). I would not recommend his class.",
        "course": "PAES210"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "Hes a good guy and one of the most knowledgeable people anywhere. It was my pleasure to listen to this guy talk about sports and its history. However, he is the Joe Paterno of professors. He?s lost touch with students. At times he is mean, arrogant, and borderline prejudice against some social groups. Hes a good honest man,but my respect ends there",
        "course": "PAES210"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Arrogant.  Treats students like children and is unwilling to help.  Had to deal with him personally.  He is insensitive to any issue other than his own.  Assigns an unrealistic amount of reading and then rambles incoherently in class.  A poor representation of an otherwise good University.",
        "course": "EDUPA210"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "He assigned four books to read and about 14 articles. All and all about 1500 pages of boring reading. He expects papers that should be from graduate students. I worked very hard on both papers and he said I didn't answer the question.",
        "course": "EDUPA210"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Kind of funny, but awful at teaching.  He seems smart but completely socially innept.  If you like writing papers and reading non-stop, this class is for you. Otherwise, RUN!",
        "course": "PAES210"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible would be an understatement.  First grade of the quarter was introduced in week 6 which was a 10 page paper that took him almost 4 weeks to grade.  By the time I got my paper back it was too late to drop the class.  So full of himself.  Very biased as well, if you don't use HIS book as a resource then you are bound to get a low grade.",
        "course": "PAES210"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very knowledgeable.He knows his history.Took 6 class periods to actually get to an relevance to sports.Nice guy to talk after class to, but has no sense of organization in thoughts, as he stutters through his own lectures.Very full of himself,&the purpose of his papers aren't to see whether the student has learned,but to read about his knowledge...",
        "course": "EDU210"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Ehhhh. Would never have taken his class if i would have known he does not know how to teach. Knows what he is talking about but can not get the point across to students. Hardly any grades.",
        "course": "EDU210"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "It is obvious he knows what he is talking about, but doesnt know how to explain it very well. Goes off in religous and political rants daily. Very narrow minded, and treats students like children.",
        "course": "PAES210"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "Brilliant;  Top of his field.  It takes a mature intellect to understand him, but that's the point of college.",
        "course": "PAES839"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "He knows a lot. I'll give him that. He has no idea how to teach a student anything. he thinks that by just talking at the class for an hour plus that we'll all understand what hes saying when he goes off on tangents about current politics and religious views. overall has a horriable attitude about students.",
        "course": "EDUPA210"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 2,
        "comment": "Although it is hard to understand what he is talking about in class, take the time to meet with him after class to have him explain. I also read the books for his class and my final grade was an A-.",
        "course": "EDU411"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "outstanding!",
        "course": "PE899"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 4,
        "comment": "Unbelievably horrible",
        "course": "EDUPA411"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 3,
        "comment": "ive made way to talk to him and get to know him and that has helped a lot. all in all, he is full of information but has no idea how to present it. best way to get through his class would be trying to make him laugh as much as possible.",
        "course": "EDUPAES410"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "The only reason this class was taken was because of it being required for the major!  Class was horrible, boring, and he graded hard...was told that he was biased towards females, but it isn't true.  I am a female and he tore my final apart to drop my A down to almost a C.",
        "course": "PAES410"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "horrible",
        "course": "EDUPAES410"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "NOTSOMUCH"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 3,
        "comment": "Wear a raincoat if you sit in the first three rows.",
        "course": "EDUPAES410"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Boring and uninteresting.",
        "course": "EDUPAES410"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very funny and interesting",
        "course": "PAES531"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.3,
    "department": "Physical Ed",
    "firstName": "Jackie",
    "id": "VGVhY2hlci04MjU5MDI=",
    "lastName": "Goodway",
    "legacyId": 825902,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Goodway is such an inspirational and interesting teacher. She does everything she can to make sure students understand the coursework; willing to give extra credit so students receive good grades as long as they udnerstand the material.",
        "course": "KNPE"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "not helpful, not interested in educating anyone but those that can help her get published...worst educational experience of my life",
        "course": "GRAD900"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved Dr. Goodway. Wish I could have her for another class.",
        "course": "EDU542"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Spoon feeds you through the curriculum.  Is willing to make adjustments, but is very specific with what is expected!  Highly suggest taking a class with this professor!",
        "course": "PAES74068901"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Ed",
    "firstName": "Kylee",
    "id": "VGVhY2hlci04MTg3NjE=",
    "lastName": "Studer",
    "legacyId": 818761,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor, plus she looks good while working out. I would give her an A+ for hotness",
        "course": "EDUPA148"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good class, next to no work required aside from showing up to lift. Pretty much lets you do your own thing. Definately a looker :) motivation right there to work out harder",
        "course": "EDUPAES14804"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 5,
    "department": "Physical Ed",
    "firstName": "Anthony",
    "id": "VGVhY2hlci0xMzc5Nzc=",
    "lastName": "Habart",
    "legacyId": 137977,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Tony is great - extremely helpful and patient with a great sense of humor.  I've loved every class (7!) I've taken with him.",
        "course": "SKA158"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super nice, helpful understanding, supportive, and motivative instructor! He even got breakfast the last day of class/final. I've never stepped foot on ice before this class, and by the time it was over, I've learned A LOT. Trust me, if I can learn to skate, anyone can (as I was so unwilling to FALL!). Tony is awesome! :o)",
        "course": "EDUPA162"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher! I learned a lot from him. Pretty easy going and flexible.",
        "course": "EDUPA161"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent teacher!!",
        "course": "PE2"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is so amazing! Very helpful, fun, and makes class interesting. Talk to him the first day of class and ask him to do a jump for you at the end. He will work hard for you because he cares that much about his students. Seriously - I wanted to wake up for his class!",
        "course": "SKAT167"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "HES AMAZING!!!!!",
        "course": "SKAT162"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very good instructor who has lots of experience teaching people who can't skate. He gives good pointers to help people skate better. He's very approachable and the class isn't very hard at all.",
        "course": "SKATING1"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is very nice and works with you to help you improve. Ice Skating I is a very easy and very fun class. Ice Skating II gets a little difficult, though. Tony makes it fun, still.",
        "course": "ICESKATING12"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very nice and helpful. Grades on personal improvement so you don't have to be the best in the class. If you work hard, you will pass. Fun class :)",
        "course": "SKATINGI"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.8,
    "department": "Physical Ed",
    "firstName": "Patrick",
    "id": "VGVhY2hlci01MTg0NzI=",
    "lastName": "Cherry",
    "legacyId": 518472,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "took rifle 1 and it was easy. the class is easy and he made it funny. take him",
        "course": "EDU171"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "171.03 was an air pistol class where we watched a couple short films a week and then went out on the range for about 45 minutes.The last week was the only week we shot real guns(semis and revolvers). Cherry is a funny guy who gives a midterm and open book test, both of which are easy and a skills test which we were given perfects on due to old guns",
        "course": "EDUPA171"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Archery.  He doesn't collect the HW's.  Just show up, try, and collect your A.  I took the class to learn to be a better shooter and it really was helpful.  Overall a fun class.",
        "course": "EDUPAES14201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Crazy NRA guy.  Has you watch anti gun control videos in class to show how everyone in America will be killed in genocide without weapons.  Overall, kind of funny.",
        "course": "RIFLE"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take this class if you can, its cake and its funner than you would think.",
        "course": "ARCHERY"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.8,
    "department": "Physical Ed",
    "firstName": "Tim",
    "id": "VGVhY2hlci04MjA1NTA=",
    "lastName": "Kirby",
    "legacyId": 820550,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "HPER661"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor. He enjoys his teaching and helps students. Little bit outdated tough. Very respectfull and cares about his teaching.",
        "course": "EDUPAES"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.9,
    "department": "Physical Ed",
    "firstName": "Tristan L.",
    "id": "VGVhY2hlci00MDI5MzE=",
    "lastName": "Wallhead",
    "legacyId": 402931,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "he is awsome. (: although, it is a slightly biased view, he is my cousin. hense, the 'not hot' view. sorry tris! as for the annoying accent, it's yorkshire&#63; england&#63; yeah. get a map.",
        "course": "EKG191"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great guy",
        "course": "FIELDSPORTS"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class, if you know anything about sports and take a look at the book you should have no problem.",
        "course": "PAES208"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "FIELDSPORTS"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Tristan Wallhead is the funniest name I've ever heard.  As a person, I wasn't so keen on Mr Wallhead, although my friend Chris Cousins was madly in love with him and wanted his pin.  Personally I preferred being taught by Kev Leigh, Old John Royce and Ian Lovett.",
        "course": "EDUPAES208"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "I don't really like Wallhead.  He has an annoying accent and a silly haircut.  Also, Ginners once egged his bird's house on mischeivous night and he beefed.  His catchphrase is &quot;Wilko, game next tuesday, don't tell Davison.&quot;",
        "course": "EDUPAES208"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's awesome.  Just an all around good guy , and funny.",
        "course": "PAES301"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Gotta love the accent!  His impression of American Power Walking is hilarious!  Great guy, personable.",
        "course": "EDUPAES208"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 4.9,
    "department": "Physical Ed",
    "firstName": "Chad",
    "id": "VGVhY2hlci01NTU0NTA=",
    "lastName": "Seifred",
    "legacyId": 555450,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Professor Chad for coaching the young athlete. That was a good class. For any students out there that want to learn how to be a noteable coach, this class will teach you, along with Chad as well. Exams are not too hard unless you're gifted and don't have to study. Pay attention and you'll do well.",
        "course": "EDU262"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "I had him for the college football class, and it was quite fun. take this seminar if you get a chance.",
        "course": "FRESHSMNR"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took the Freshman Seminar for College Football Playoffs, was an incredbly fun class and Doctor Chad is genuinely interested in helping his students. GREAT guy, has facebook, if I ever get the chance to take another of his classes, I will!",
        "course": "FRSEM138"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was definately like a coach.  He helped our class so much.  He came in to our class after our first instructor quit and he was such a motivating force in our volleyball skills.  Go Dr. Chad!",
        "course": "VOLLEYBALL2"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "awesome guy and tons of fun.  class was awesome.",
        "course": "VOLLEYBALL"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "PHYSICALED"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome class, all about sports, and the tests were a joke.  The final included short answers such as &quot;What can I do to improve this class&#63;&quot; and &quot;What was your favorite part of this quarter&#63;&quot;  Class announcements could be used to talk about parties.  He's the man, take him",
        "course": "EDUPAES137"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "dont think you all that cause i would beat you one on one. aight&#63; you nothing, back up ur game, if u have any, and play me. i'll beat u down dogg.",
        "course": "BBALL"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing class, he was really a coach, he taught me so much, I am unstopable in bball, no one can beat me one on one, i'm the complete package. He taught me so much",
        "course": "EDUPAES14402"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Physical Ed",
    "firstName": "Claire",
    "id": "VGVhY2hlci04MDMwNDU=",
    "lastName": "Williams",
    "legacyId": 803045,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "FIRST AID WITH CLAIRE WAS GREAT. SHE WAS SO HELPFUL AND THE CLASS IN GENERAL IS NOT HARD IF YOU WORK HARD. ATTENDANCE IS 100% MANDATORY FOR CERTIFICATION. SHE IS WONDERFUL FOR ANY CLASS.",
        "course": "PAES102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A, just go to the one class per week and pay attention. Most of the answers to the 3 &quot;quizzes&quot; you could figure out without doing any outside studying. Online assignments on carmen every week take 5-10 minutes tops.",
        "course": "EDUPAES147"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took the Conditioning Principles course along with my weightlifting course. The class wasn't the pushover I expected from a 1 credit hour course, but it wasn't difficult either. A lot of material in a short amount of time, but Claire was very willing to help the students.",
        "course": "EDPS147"
      }
    ],
    "SEI": []
  }
]