[
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Sherri",
    "id": "VGVhY2hlci0yODU5MjUy",
    "lastName": "Louis",
    "legacyId": 2859252,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Coach Sherri is amazing, she's incredibly caring and is very accepting of anything comes up. she uses videos that are very engaging and overall very supportive, definitely plan on taking this course again!!",
        "course": "KNSFHP1148"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Louis was very caring about all her students, It's a very engaging workout class, the more effort you put in the more you get out of it. she won't let you get anything other than a perfect on the quizzes, very understanding if you can't make a class, i recommend everyone to take her class!!",
        "course": "KNSFHP1148"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mrs. Sherri is an amazing instructor who genuinely cares about her students. She was accessible outside of class and made the class fun and wanted the students to view the course as a way to \"de-stress.\" Great course for 1 credit hour, you can take this course up to 3 times I believe. Aside from that, my quads grew around 1 1/2 inches",
        "course": "KNSFHP1148"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 3,
    "department": "Physical Education",
    "firstName": "Dori",
    "id": "VGVhY2hlci0yODU5MjQ4",
    "lastName": "Henery",
    "legacyId": 2859248,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "The class was easy but painfully boring. She's strict about phones, and Mondays felt like the slowest two hours of my life&#8212;endless lectures and group work. Wednesdays were an hour of stretching, making me feel both antsy and sleepy. It was the same thing every week; impossible to sit through. She means well, but makes this class a struggle.",
        "course": "KNSFHP1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a caring and respectful professor. Did a good job teaching me the basics of first aid and CPR and I feel much more confident in my abilities.",
        "course": "KNSFHP1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Kyle",
    "id": "VGVhY2hlci0yODU5MjUx",
    "lastName": "Jackson",
    "legacyId": 2859251,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kyle is a very chill and relaxed golf professor and knows what he is talking about. Can help assess your swing and help change it for the better. Kyle is very helpful with teaching the rules of golf and helping you lower your handicap.",
        "course": "Golf"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3,
    "department": "Physical Education",
    "firstName": "Bud",
    "id": "VGVhY2hlci0yODU5MjYx",
    "lastName": "Prenatt",
    "legacyId": 2859261,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Scammer $400 non-refundable and denied service. DONT TAKE",
        "course": "KNSFHP"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Bud is an amazing instructor! Skydiving seemed so terrifying but after taking his course I felt so prepared. You learn a lot of information within a few classes, so make sure to study the important protocols he stresses in class. He includes all of the information on his slides and reviews multiple times. I would recommend his class to anyone!",
        "course": "KNSFHP"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Tracy ",
    "id": "VGVhY2hlci0zMDQ3NzIy",
    "lastName": "Almanson Murphy",
    "legacyId": 3047722,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I literally love this woman she is such a good teacher and she is so understanding. I'm an out of state student so whenever I'd go home I'd have flights that would conflict with class time and she was totally understanding and is overall easy going. She's fun and helpful, I'd 100% take this class again. ",
        "course": "KNSFHP1172"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.1,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Seamus",
    "id": "VGVhY2hlci0yMjQ4NDEw",
    "lastName": "Reilly",
    "legacyId": 2248410,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This will be the easiest class you take. He is hilarious and class is fun but also not mandatory. Class is graded on three assignments and you basically get an A for writing your name. Highly recommend for a fun two credit hours.",
        "course": "KNSFHP1137"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seamus is literally the best teacher ever. I love his icebreaker questions that he does every class to get his students involved and chatting. This class is just show up, play ping pong, and have a good attitude. Seamus is a great teacher too but knows fun is the most important part. I want to take another one of his classes but they're filled :(",
        "course": "KNSFHP1185"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Will not find yourself a more enjoyable class or professor. Cares about his material and cares about his students even more. If you can find 2 hours a week to show up to his lectures I highly recommend taking to just brighten up your week.",
        "course": "KNSFHP1137"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super enthusiastic and kind. Just show up. ",
        "course": "KNSFHP1143"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sha is the best! He always makes my day so much better and I look forward to his class every week. Once a week isn't enough!I am one of the only girls in the class, but Sha always makes sure my opinions stay valid. LOVE him and I am planning on taking more courses with him since he brightens up my day! :)",
        "course": "KNSFHP1137"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "AMAZING! I would take any of his classes. He has been my favorite professor by far!",
        "course": "KNSFHP1137"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class as a fun elective and it definitely was enjoyable! It had a very laid back atmosphere and was something I looked forward to going to. Would love to take another class with Sha!",
        "course": "KNSFHP1137"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Greatest professor I've had at OSU. Genuinely cares about his class and brings passion every week. I'm a senior but I wish I had taken every class that he offers. ",
        "course": "KNSFHP1137"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was truly one of my absolute favorite classes I've ever taken and Sha is one of the best professors here. He creates a fun class environment and something to look forward to each week. One day a week of Seamus Reilly simply is not enough. I hope other people can be as lucky as me and get to enjoy having the opportunity to learn from him.",
        "course": "KNSFHP1137"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolute GOAT. If you can take a class with Sha do it. He is layed back, you just get credit to talk and you don't really need to show up. He is really funny and loves to teach.",
        "course": "KNSFHP1137"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seamus is a really great professor. Couldnt have asked for a better coach for soccer. Still in the class at the moment and enjoy every moment of it. He really works hard to engage his students, encourages teamwork, and makes sure youre having fun. Highly recommend taking a class with him if you have the chance!",
        "course": "KNSFHP1174"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved table tennis with Sha! He made the environment so much fun and told some pretty funny stories. He gives an automatic A+ to everyone, even if you don't show up but why take the class if you don't want to show up? The only thing I would say is I wished there was less talking and more playing. And it took a while to set up the tables...",
        "course": "KNSFHP1185"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seamus is hilarious. His class was basically a discussion with only three brief assignments all semester. His class was the easiest I've ever taken.",
        "course": "KNSFHP1137"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "There were 4 assignments about sports the whole semester and pretty much if you turn them in and they are a page long you get the credit. There were zooms but they were not mandatory. Never went to a class just did the assignments and got an A.",
        "course": "KNSFHP1137"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Seamus is the absolute best. I took his soccer class and he is super friendly. The classes are really fun and I learned a lot while also being allowed to just enjoy playing soccer. If you are new to soccer, you have to take this course!",
        "course": "KNSFHP1174"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "The GOAT",
        "course": "KNSFHP1137"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you don't skip class, you'll get an A. Table tennis was really fun, probably my favorite class. He is always in a good mood and is great to be around. Includes everyone. Highly recommend.",
        "course": "KNSFHP1185"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sha genuinely cares about being the best you can be. He can be a bit over the top but its all in good fun. Take a class with him. &quot;It will change your life&quot; - Sha. He lives by that, and in all honesty it will.",
        "course": "KNSFHP1137"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's the man what can I say. Really good at soccer and teaching.",
        "course": "KINS1174"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sha is the bomb. Man is a rare combo of hilarious, competitive, humble, and insightful. Took table tennis and would take any of his classes.",
        "course": "KN1185"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took a soccer class with Sha and he was absolutely amazing! Very passionate about soccer and loved getting to coach us while we learned a couple skills he wanted us to work on. Lots of play time and very fun class.",
        "course": "KNSFHP1174"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.3,
    "department": "Physical Education",
    "firstName": "Samuel",
    "id": "VGVhY2hlci0yODg5MDE1",
    "lastName": "Hodge",
    "legacyId": 2889015,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I have really enjoyed his class this semester, even at 8am. His lectures can be long sometimes, but he is always respectful about getting out of class on time or early. You can tell he truly cares about what he is teaching. Grades are pretty straight forward in exams, quizzes, and attendance. Be ready to participate in class from time to time.",
        "course": "KNPE2262"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very knowledgeable about the topic, but lectures can get drony. Exams were pretty easy and all the answers could be found in the lecture slides. Very professional, unlike other professors but justified in his reasoning. ",
        "course": "KNPE5643"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good professor who is clearly very knowledgable and passionate about the content he teaches. However, he expects a level of professionalism that I haven't experienced in other classes. Not a bad thing, just a different teaching style. All in all, worth the slight extra effort to be slightly to take one of his classes. Highly recommend.",
        "course": "KNPE5643"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Valerie",
    "id": "VGVhY2hlci0yODU5MjMz",
    "lastName": "Foito",
    "legacyId": 2859233,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved this class! Valerie is a great instructor. This course is great for beginners, and she takes the time to make sure everyone understands all of the exercises completely.",
        "course": "KNSFHP1148"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Ruth",
    "id": "VGVhY2hlci0yMzYxNTY3",
    "lastName": "Torrie",
    "legacyId": 2361567,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "she was great!! there were only 2 small assignments and everything else was just showing up to class. she genuinely cares about all her students and I highly reccommend her!!",
        "course": "KNSFHP119501"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Torrie is an incredible yoga instructor and I would take class from her any day. She's super understanding with any complications and all she really wanted was for you to put in the effort and to get something out of this class. She is so wise and gave incredible advise for mindfulness. Two \"essays\" and two 30-second skills assessments. ",
        "course": "KNSFHP119501"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "The weekly yoga lab was the 2nd part of the stress management course. All you really had to do was show up to class. Her yoga was always so relaxing and different from the normal yoga classes I've taken. 10/10 recommend. ",
        "course": "KNSFHP1104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best class and best professor ever!! She gives very few assignments that are mostly reflections based on class activities or textbook exercises (meditation and relaxation techniques). She provides personalized feedback on every assignment and shows that she truly cares about each of her students! You just have to attend the yoga class once a week. ",
        "course": "KNSFHP1104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Yoga I is an easy A and Torrie is the best professor for this class. Only two writing assignments (very easy, completed in less than 10 minutes). Attendance is mandatory because it is only one credit hour. However, after a little while, an hour and 50 minutes of yoga got a little boring. If you like yoga and want an easy A, take this class.",
        "course": "KNSFHP119501"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "TAKE THIS CLASS. It was so nice to have an easy A and relaxing class. It is the perfect break from hard classes. Her voice itself is calming and makes meditation so easy. She is so nice and calm. She really wants you to relax, succeed and enjoy yoga. Learning yoga is so beneficial to your body and mind.",
        "course": "KNSFHP119501"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ruth is truly such a sweetheart. I enjoyed her yoga class so much and hope to take another one soon! She has a very calming voice which helps when you are doing yoga and meditating. She loves what she does and always is willing to help. I appreciate her so much.",
        "course": "KNSFHP1104"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was a perfect way to de-stress and Ruth knows so much about yoga so it was a very interesting class!",
        "course": "KNSFHP119501"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was great. She takes suggestions at the end of the semester to improve the class and really cares what people think. We have weekly assignments that are easy, but she takes time to read and sometimes respond to them and she really does care what we're thinking in our responses. Super sweet lady and great yoga instructor as well.",
        "course": "KNSFHP1104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Physical Education",
    "firstName": "Nick",
    "id": "VGVhY2hlci0yODU5MjYw",
    "lastName": "Persichetti",
    "legacyId": 2859260,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "His class could've been more fun, he was a nice professor but for a 1-credit-hour class, it felt too serious and strict",
        "course": "KNSFHP1148"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Gordon",
    "id": "VGVhY2hlci0yMzQ1MTc4",
    "lastName": "Rankin",
    "legacyId": 2345178,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "What an amazing guy! He really cares about how well students are learning, and makes class so fun! There's a few quizzes for the class, they are a little technical, but not too difficult. I've had him 3 times and he's been amazing every time! Very personable",
        "course": "TUM101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Gordon is super cool and easy going, and perfect for teaching strength classes! I wish I could have taken his class in person to get to know him more and be able to get feedback right away, but the online class was still fun and I learned a lot from him. I would recommend Gordon!",
        "course": "KNSFHP1148"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "As long as you put forth your best effort in his tumbling classes, youll get a good grade. Its only 1 credit hour so take his classes because you want to learn. He gives great feedback and is willing to work with you to help you get past anything youre having trouble with. Great guy!",
        "course": "KNSFHP1158"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "He Cool",
        "course": "TUM101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Alexandra",
    "id": "VGVhY2hlci0yNzU4MTA2",
    "lastName": "Fronk",
    "legacyId": 2758106,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Health class with 5 modules over the semester. Everything's available at the beginning of the semester and easily doable within the time frame. The project at the end of the class is the only big problem, but start on it early and you won't have any problems. Easy A with unlimited time on the exams.",
        "course": "KNSFHP1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great professor. I took this course online, and it is an easy A if you're willing to put in the minimal work. All the content is interesting, and you will learn a lot of health/fitness-related things.",
        "course": "KNSFHP1147"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super caring, nice & good listener. If u want to improve ur wellbeing take this class bc it involves a lot of self-reflection & personal evaluation. Have to buy a book-thing to access the course. 4 modules w multiple chapter readings (completion), activities, a discussion, & a final reflection. Must put in effort for discussion posts. Easy A",
        "course": "KNSFHP1147"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor -- approachable, cooperative, caring. ",
        "course": "KNSFHP114804"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Alex is very approachable, and the content taught in Strength Training is extremely applicable to real life. She will help correct your form and will aide in developing your personal fitness plan. Great professor for a really fun class.",
        "course": "KNSFHP1148"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Shes a great teacher, and this is a great class. If you want to learn more about strength training, working out, or general fitness, this class is perfect. The class is set up like a gym session, where she goes over the workouts at the beginning of class. There are some short quizzes outside of class, but overall its fairly straightforward.",
        "course": "KNSFHP114804"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Allison",
    "id": "VGVhY2hlci0yODU5MjIz",
    "lastName": "Applegett",
    "legacyId": 2859223,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Allison and Rachel are great! Read your textbook and you can do all homework ahead of time. Be sure to show up for class every time and you will learn a lot. They are so helpful, especially with those of us that have never been around horses or ridden horses before. The horses are calm and safe.",
        "course": "KNSFHP116105"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.9,
    "department": "Physical Education",
    "firstName": "Leeann",
    "id": "VGVhY2hlci0xNjk5NDg0",
    "lastName": "Lower",
    "legacyId": 1699484,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "\"Sport Law\" seemed intimidating to me at first, however Dr. Lower made content easy to understand. She is such a great teacher and makes sure everyone understands what's going on. Grade was based on group participation, weekly online quizzes (multiple attempts), and a final project (easy/enjoyable). One of my favorite professors ever!",
        "course": "KNSISM4607"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Lower-Hoppe is so sweet! She cares so much and wants everyone to succeed. Weekly quizzes, show up to class for participation points, and she really tries to make lectures interesting. The semester long project is a legal debate that's kind of tedious depending on your group mates. But class is pretty easy. You can tell she loves teaching!",
        "course": "KNSISM4607"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors that I had at Ohio State. She is so nice and really cares about her students. The class i was in was a Sport Law class and the main focus is to prepare us for the Mock Trial at the end of the semester. Overall I loved the class and she really makes sure you understand the material. 10/10",
        "course": "KNSISM4607"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Ms. Lower is a very nice and understanding teacher.  She's very realistic and understanding.  I have an 8am class and she keeps me awake, which is saying a lot.  She's also not hard to look at!  Very pretty!  I highly recommend her.",
        "course": "PAES5626"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "She taught a cardio equipment class this quarter and I thought it was great.  She kept it interesting and really piqued my interest about exercising and staying in shape.  Awesome motivator, as she will do most of the exercises with the students, even the hard stuff. Definitely recommend.",
        "course": "PAES148"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Tony",
    "id": "VGVhY2hlci0yODU5MjI0",
    "lastName": "Brodie",
    "legacyId": 2859224,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Overall great human being, cares about his class and students. Highly recommend him.",
        "course": "KNFHSP1156"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This guy absolutely rocks",
        "course": "KNFHSP1156"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Sara",
    "id": "VGVhY2hlci0yODU5MjMw",
    "lastName": "Elliott",
    "legacyId": 2859230,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "First aid/cpr with Sara was great, she is nice and funny so it keeps the course lighthearted. Modules are easy and to study for exam you just read the textbook (which is a nice read not too wordy and free given to you online). 7 weeks, easy A, and you learn important skills 10/10 recommend! ",
        "course": "KNSFHP1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Julie",
    "id": "VGVhY2hlci0yNTE3NzM2",
    "lastName": "Loeffler",
    "legacyId": 2517736,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Julie was such an amazing teacher who truly cared for her girls in self-defense. I highly recommend this class to anyone who would like to learn self-defense, as Julie is open to discussion no matter what the topic is and helps her students feel comfortable. ",
        "course": "KNSFHP1172"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really liked this class. I could tell that she cared about her students and wanted them to take as much away from the course as possible. Assignments are vlogs and article quizzes which are extremely easy. The final was okay as it was hard to remember things said in the beginning of the course and there's nothing to refer back to.",
        "course": "KNSFHP1172"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am not athletic at all, so I was kind of nervous going into boxing, but Julie did a wonderful job at explaining things so that I felt more at ease. Because this class was hybrid bc of covid, it wasn't as fun as it could of been, but she did a great job despite that. I'd def recommend anyone take this class to learn a little about boxing.",
        "course": "KNSFHP1146"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Physical Education",
    "firstName": "Kim",
    "id": "VGVhY2hlci0yMzYxMDIw",
    "lastName": "Sacksteder",
    "legacyId": 2361020,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took Kim for Wall Climbing and absolutely LOVED it. She is so understanding, knowledgable, and cares so much about her students. Highly recommend.  ",
        "course": "SW4501"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Kim was an amazing professor. She was understanding and made the class fun. Grade is dependent on attendance. Three main papers to write, including midterm. She was generous on extensions and made the course work easily understandable. Her feedback was very good and insightful. I would recommend her for any class.",
        "course": "SW4501"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Physical Education",
    "firstName": "Weidong",
    "id": "VGVhY2hlci0xNzAyNzYy",
    "lastName": "LI",
    "legacyId": 1702762,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Every time I left Dr. Li's class, I felt so frustrated because we would literally use 90% of our class interpreting (not due to his accent, he was okay to understand that way) but the material he was trying to teach. It was absurd. He cares & has the knowledge, but couldn't teach it. We all left confused and knowing less. ",
        "course": "KNPE2201"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's hard to understand at times, I found it best to actually look at him when he's talking. He jokes around a lot and the class is really easy going. The material is pretty straightforward so even if you don't pay attention in class, you can pass easily. You're only allowed to miss 3 classes and that's really the only drawback.",
        "course": "KNPE2201"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr Li is my favorite professor I've ever had at OSU. He is always willing to help and just wants you to work hard and be \"professional.\" In 521 he allowed us to re-do our assignments many times to get full credit. Even though there is a cultural barrier he is actually pretty funny when you can understand him.",
        "course": "PAES521"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Physical Education",
    "firstName": "Phillip",
    "id": "VGVhY2hlci0xNzAyNzYz",
    "lastName": "Ward",
    "legacyId": 1702763,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Ward is hands down the best professor I have ever had. He thought provokes, talks about the hard things & listens intently. He learns every persons name, truly asks about your wellbeing. Every time I walked out of his class, I knew more about myself and was reminded why I went into sports coaching. He's the type that changes your life. AMAZING",
        "course": "PAES601"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "At first I didn't like him, but my perception changed quickly. He is slightly arrogant, but he stands up for his students and as long as you are serious about your work he is easy to get along with and a good guy. Pretty easy class just buy tons of ink and printer paper for the 47 lesson plans you have to print out",
        "course": "PAES601"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Physical Education",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0xMjA5MjY5",
    "lastName": "Peters",
    "legacyId": 1209269,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved her! 3 modules covered before an exam. 3 total exams and an optional final. Class is discussion based and there's not\nmandatory attendance. 2 credit hours and a good GPA booster. ",
        "course": "KNSFHP1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Completely online class, but laid out expectations very clearly, was accessible, and seemed very kind. Helped promote a cardio event I worked on, which was not something she had to do. Great GPA boost and helps you keep in shape.",
        "course": "KNSFHP1150"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very nice professor. Understands that its not a main priority class. Encourages class discussion. Asks questions throughout lectures and has every person go around to share their thoughts in front of class. She shares basic information that is important to know. The assignments were all online and took maybe an hour max each week. Easy A class.",
        "course": "KNSFHP1103"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class seems easy but exams are super specific and most of the material is not discussed in class. Peters herself is wonderful. She’s super friendly and the class itself is kind of fun. Beware that this isn’t the easy A it may seem to be. Weekly assignments are easy, exams are not.",
        "course": "KNSFHP1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jennifer is so nice and I loved taking her course! this class was easy. you had 3 modules and in each module you have 3 chapters to read, a few quizzes/surveys, and then one concluding quiz that was easy. you have a few papers to write but they are super short (like 1 page double spaced) and she grades based on effort :). also offers extra credit !",
        "course": "KNSFHP1103"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Her assignments arent just about getting to know or understand the material but applying the information to your personal life. I absolutely love the integration of this material. The written portions are graded on genuine effort on your part and the guided assignments were incredibly helpful in remembering the material. 10/10 recommend this class",
        "course": "KNSFHP1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Intro to Health is a fascinating class, and is pretty self-explanatory. You can complete assignments early, and prof is accessible if needed.",
        "course": "KNSFHP1103"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Not a lot of assignments because it is not about your intelligence, but your fitness. She is amazing at motivating people, even at 8 am. She is very kind, energetic, and understanding, but you do have to go to class. Super Easy A and I would definitely take any of her classes again. Helps students understand how to workout.",
        "course": "KNSFHP114805"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "She definitely knows her stuff. You'll definitely learn a lot. However, for an exercise class I think she assigns too many papers. We actually had to a presentation in class which I didn't do in my last exercise class.",
        "course": "KNSFHP1148"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jennifer is good at what she does. Grade wise, you may need to do is take an hour to prepare for the mid-term performance test.  The final exam is a piece of cake.  Mine was online and open-note.  Jennifer is also very nice and learns everyone's names, and gives them feedback for improvement.  It's a chill class, but you need to show up.",
        "course": "KNSFHP117001"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had her for Intro to Health which was an extremely easy class.  She is passionate about what she teaches, so she makes the lectures interesting.  There is a textbook for the class to do the online assignments, but you don't have to read it to do the homework.  It's required for some majors, but even if it's not required, I definitely recommend.",
        "course": "KNSFHP1103"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had her for kickboxing and is a really nice professor. She is very clear with her grading criteria and policies and abides by them. The kickboxing class is more like a cardio class with kickboxing elements so if you are looking for something that pertains more to fighting, you'll have to look elsewhere. Try the boxing course.",
        "course": "KNSFHP114808"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had her for racquetball. She is such a nice and helpful teacher and she makes an appoint to help you have fun and enjoy the class, even if you're not good at the activity",
        "course": "KNSFHP117001"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "She may seem kind of crazy at first, but shes really nice. Pilates can be hard at times, but shes very good at getting you to understand what shes trying to say.",
        "course": "EDUPA147"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physical Education",
    "firstName": "Dan",
    "id": "VGVhY2hlci0yNzYwOTEz",
    "lastName": "Downes",
    "legacyId": 2760913,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dan is a great teacher and a fun person to be around. I took the beginner wall climbing class with him and he made it clear what we needed to know and how to do well climbing. I would definitely recommend his class if you're looking for a fun PE class.",
        "course": "KNSFHP1141"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 3.6,
    "department": "Physical Education",
    "firstName": "Deborah",
    "id": "VGVhY2hlci0yMjIwMzg1",
    "lastName": "Snode",
    "legacyId": 2220385,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "OK for STEP Crystal-worshipper who explained that piezoelectric vibrations from crystals (a real phenomenon) has effects on your health (pseudo-scientific nonsense). Took group to OSU astronomical observatory and asked an astronomer to discuss how the alignment of the planets has effects on your health via changes in cosmic electromagnetic waves.",
        "course": "STEP0"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "DO NOT TAKE YOGA 1 FOR AN EASY A!!! This class is very time consuming and the quizzes every Friday are impossible. This course was hybrid and she would post hours of video lectures every week. Deb is such a nice lady but, she is the type of person that thinks her class is the most important thing in your life.",
        "course": "1195KNSFHP"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really enjoyed Yoga1. Learned lots of things about yoga and holistic wellness in general.",
        "course": "KNSFHP1195"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "Class is split into 2 portions: lecture &amp; yoga. Meet 2x a week: once for each portion. Grade based on attendance, weekly reflection papers, weekly quizzes on textbook readings, and one final paper. Mainly just busy work but she's an easy grader. Lectures are very boring. I suggest getting an online textbook for the quizzes so you can &quot;cntrl-f&quot; it",
        "course": "KNSFHP1104"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "I took her yoga 1 course and was encouraged to take Stress Management thinking it was easy. This class is annoying with busy work. She will not give grades or feedback until the last few weeks so if you did anything wrong you will be penalized multiple times for the same thing and lectures seem redundant. I only look forward to sleeping in the lab.",
        "course": "KNSFHP1104"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "had never taken a yoga course before and i really enjoyed her class and how she taught it. wanted you to be more leveled with your body than do any crazy poses. if you skip more than 2 classes you drop 3 letter grades. nice change of pace from regular classes.",
        "course": "YOGA1"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fantastic instructor! Had never done yoga before but wanted to try it, and definitely wasn't disappointed. Learned so many useful things about alignment, balance, etc. Keep an open mind (you may not agree with everything) and you'll get lots of helpful insight that you've probably never heard before. Such a nice lady with a knack for instructing :)",
        "course": "KNSFHP119501"
      }
    ],
    "SEI": []
  }
]