[
  {
    "avgDifficulty": 4.4,
    "avgRating": 2.8,
    "department": "Physiology",
    "firstName": "Cynthia",
    "id": "VGVhY2hlci0yMDIyMjYx",
    "lastName": "Bronson",
    "legacyId": 2022261,
    "numRatings": 164,
    "summary_comment": "The professor receives predominantly negative feedback for her teaching style, which is described as condescending and confusing. Students find her class challenging and often require significant effort to succeed. While some appreciate the potential for extra credit, many advise against taking her class unless absolutely necessary.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "She HAS to be a professor on tenure because there is no way she is still teaching when she consistently receives heavy backlash. I received an A in the class, but do not listen to anyone saying they enjoyed her and do NOT take this class unless you need to. If you ask questions to her, she responds back with a literal condescending question.",
        "course": "EEOB2520"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "I was required to take this course and everyone scared me about it but it wasn't that bad if you're willing to put in effort. Paying attention, taking notes on slides, and what she's saying not just the slides will help. There's a quiz every week but some get dropped and there was a ton of extra credit. ",
        "course": "EEOB2520"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Genuinely had to make a rate my professor account just to rate her poorly!! Her class enrages me!!! ",
        "course": "ECON2520-100"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "she pmo so bad ",
        "course": "EEOB2520"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Attendance not mandatory but if you don't show up you won't do well. She doesn't post lectures for you or notes. Questions are poorly written and confusing to read.",
        "course": "EEOB2520"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this class unless you absolutely HAVE to, I think I actually lost my will to live because of this class. The class is formatted so weirdly with the bulk of your grade relying on scantron and extra credit points. She also purposefully uses wording on exams that will trick you.",
        "course": "EEOB2520"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 5,
        "comment": "Tbh I had to take this class twice since I got a C the first time. That class was extremely difficult, but I learned more in Dr. Bronson's class than I have anywhere else. The quizzes are really tough, but she gives so much extra credit that if you get an 18/30 for all of them you'll still get an A. I know she gets a bad rep, but I respect her. ",
        "course": "EEOB2520"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't take",
        "course": "EEOB2520"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS. Dr. Bronson is the worst professor I've ever had in my life. Tests EVERY week and questions are made to trick you. I would rather run 5 marathons than take this class ever again. You can put in hours and hours of studying for the weekly tests and still fail. ",
        "course": "EEOB2520"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take her under ANY circumstances. I literally pray on my way to her class (AT SIX IN THE MORNING) that an act of god strikes me down so that I don't have to attend. ",
        "course": "EEOB2520"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. B is the best professor I have had here at tOSU. You will never learn more in a course than you do with her. The exams can be challenging but there is so much room for growth and extra credit. The information you learn will stick with you and you are given all the tools tou need and more. Highly recommend you take this course!!",
        "course": "EEOB2520"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "genuinely such an unempathetic human being. I would rather take the MCAT 10 times over than take her class again. exams are impossible and she has no respect for her TAs",
        "course": "EEOB2520"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do \"not\" take this class unless you absolutely have to.  If you take it, I guarantee it will be the most stressful experience of your life.  You will know the material inside and out, and still struggle with the way she words her questions.  It is sadistic.  Dr. B has business teaching this class for so long at OSU. ",
        "course": "EEOB2520"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Bronson's class was very hard, lots of studying and while lectures are not mandatory, they are needed to pass the class. No homework just weekly quizzes (half of which are dropped) and a midterm and final exam. Her class can be hard to follow at times so WRITE DOWN EVERYTHING! Go to the party room if you are confused and find a study buddy.",
        "course": "EEOB2520"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. B has a bad rep on rate my professor. Her class isn't easy, but if you put in the work to understand the concepts you will do fine. The mid terms and finals re-use questions from the weekly quizzes so you know what will be coming. Go to the party room, pay attention to the references she makes, there's a lot of extra credit hidden there. ",
        "course": "EEOB2520"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Despite the stories I had heard before class, Cynthia Bronson was very kind. If I could go back in time I would tell myself... Read the syllabus for extra credit on the first exam, pass the first 8 exams with good grades or do every other week, study the exams after completing them, and look through conversations through Carmen to get extra credit",
        "course": "EEOB2520"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 5,
        "comment": "She made everything difficult. Doesn't post the slides, 6:50 am Wednesday lectures, and the wording on exams will trip you over. Gladly, the extra credits secured my A for this class, the less evil thing about this class.",
        "course": "EEOB2520"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "I will die and be reborn again before retaking this class. She does not post lecture slides online, so if you have to miss class, best of luck getting notes from other people in class. Our were grades locked the entire semester, so if you want to know your grade, it had be calculated by hand. The exams were very hard and meant to trick you. 0/5!",
        "course": "EEOB3510"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "The exams are hard and worded to trick  you, but you get to drop half of them. She is amazing at explaining the content and is obviously very prepared for each lecture. If you miss class try to get a recording from someone, or at least go to the party room to make up the notes. There is SO much extra credit.",
        "course": "EEOB2520"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "She offers generous extra credit on each weekly exam and an enormous amount on the final. The weekly exams are tricky, but this class provides the tools needed to succeed. There is a tutor (party) room and weekly review session with TAs open to questions. If you put the work in, then there's no reason you can't do well. ",
        "course": "EEOB2520"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 5,
        "comment": "If you take this class, PLEASE BE AWARE, you should absolutely prioritize the midterm and final, because they are worth half of the entire course points. Do decently well on the weekly exams, but do NOT underestimate the midterm and final. Also, go to the party room, they will have answer keys for the weekly exams that your midterm/final are over.",
        "course": "ECON2520-100"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 5,
        "comment": "Seeing these reviews made me very nervous about taking this class. Seeing the professor on the first day of class was very intimidating and she is very serious about her class. This class is hard and is meant to weed kids out but overall this class made me a very productive and efficient person. The 6:50 am class time will force you to be mature.",
        "course": "EEOB2520"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 4,
        "comment": "Attendance isn't mandatory but you need to go to lectures to do okay in the class. Lecture slides are very vague so listen to what she's actually saying not just the board. I realized that the weekly exams mean nothing because the midterm and final were half of the total points for the class. You can only get out what you put into this class. ",
        "course": "EEOB2520"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "Tons of extra credit = the only reason you can do well in this class. Tricky questions on quizzes/exams that are meant to mix you up. Does not post slides so you have to go to lecture. Study a lot! Overall a caring professor and willing to help. Take notes on random things mentioned during lecture (they will most likely be extra credit questions).",
        "course": "EEOB3510"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 4,
        "comment": "Bronson's class is challenging, but manageable with dedication. Attend lectures, take detailed notes, and utilize resources like unstuck ai and review sessions to succeed. The workload is heavy, but the extra credit opportunities make it worthwhile.",
        "course": "EEOB2520"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 5,
        "comment": "why did she have to make sure the only class available was at 8 then 6:45 am on wednesday. With about 10 &#8216;phys fabs' to help you, and when you message the professor she didn't help with note during having covid. asked for me to consolidate with my peers, but they also didn't send me notes. so what am i ment to do to pass this class without the help",
        "course": "EEOB2520"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 4,
        "comment": "First of all classes are 3x a week at 8:00, 6:50, and 8:00 Tues, Wed, and Thurs, 6:50 is rough. Weekly quizzes don't impact your grade too much but I've failed probably 5 of them. Straight lecture every class, lots of bonus on the midterm and final. Overall there are lots of helpful resources to do well, but only take the class if you have to.",
        "course": "EEOB2520"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 5,
        "comment": "Purposely employs trick questions on exams with tight time limit, would not recommend. ",
        "course": "EEOB2520"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 4,
        "comment": "Her exams can be difficult and tricky, but you study for each week so it never is too much. She provides in depth lectures with good analogies, but sometimes are better than others. If you are struggling you can go to the Party Room to get help. The midterm and final are mostly questions you have seen before on the weekly exams. Very early mornings",
        "course": "EEOB2520"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 4,
        "comment": "Cynthia runs the class like it's 1910. She orders us around like puppets. I haven't used scantrons in 10 years and she doesn't know how to use Carmen. We call her coach based on her tone. Her notes in lecture are horrendous and provide no context. Good luck dealing with coach. ",
        "course": "EEOB2520"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 5,
        "comment": "I took this class in the spring semester and am here to provide some wisdom for lost students in the new semester. My advice is to take things week by week. Her awkward comments/jokes are extra credit on the quizzes. GO TO THE PARTY ROOM. I didn't have much spare time but sometimes the TAs will tell you extra credit or helpful hints. Stay strong!",
        "course": "EEOB2520"
      },
      {
        "index": 32,
        "rating": 2,
        "difficulty": 5,
        "comment": "Multiple phys fabs sanding by, but when you ask a question it's not the same explanation as hers so nothing adds up for the quiz. sure it's early, but i did not comprehend some things she would go on about. If she did it would be a bonus questions if you did not hear it you will miss out on points. Sure it's 6 dropped, but it's not worth your head.",
        "course": "EEOB2520"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 5,
        "comment": "Trump's twin sister.",
        "course": "EEOB2520"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "The professor was very helpful throughout the semester, the class is lecture heavy, she does not post the lectures online so make sure you go to class and take good notes. Taking detailed notes is the way to succeed in her class. She also gives out a lot of extra credit, at least 15 extra credit points per exam, at least in the summer semester. ",
        "course": "EEOB2520"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 1,
        "comment": "Bronson is the definition of a Boomer. Her methods are outdated and it seems like she doesn't know how to use Carmen. She makes easy topics seem difficult to make herself feel better. You're better of memorizing every word from lecture rather than understanding the material. Brain-numbing class, an intellectual desert. Ms. girl needs to chill.",
        "course": "EEOB2520"
      },
      {
        "index": 36,
        "rating": 3,
        "difficulty": 4,
        "comment": "Go to party room and ask TAs when you need help! Read the discussion board! PAY ATTENTION TO SMALL DETAILS! There's weekly exams, about half get dropped. Lots of extra credit! Content is relatively simple (I suggest having bio/chem background), but teaching style is different than I've had before, so I had to adjust! ",
        "course": "EEOB2520"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 5,
        "comment": "This class is. very difficult class in general. Overall, professor Bronson does do a good job of breaking down the complicated material into more simple terms. The class is very test heavy as you have weekly exams but half of them get dropped so think of them more as quizzes... But participate and go to the review sessions and go to the party rooms",
        "course": "EEOB2520"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. B was awesome! I was nervous about this class after reading some of these review but honestly she was great. She really cares about her students and wants them to do well. She provides so many outlets for everyone and a ton of extra credit. If you want to do well go to the party room at least 2x a week, record lectures, rewrite notes.",
        "course": "EEOB2520"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 5,
        "comment": "Anybody who says that Dr. Bronson wants you to learn is lying. She actively makes material as inaccessible as possible. The tests for this course are full of so many trick questions that, when studying for the midterm I memorized the questions and did better than the final, where I re-watched every lecture for it.",
        "course": "EEOB2520"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Bronson is not as bad as everyone makes her out to be. Her teaching style takes some time to get used to, but she's a great lecturer so if you take good notes and put in the effort you'll be fine. She gives lots of extra credit opportunities and provides resources like the Party Room and Review Sessions before exams to help you do well.",
        "course": "EEOB2520"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 4,
        "comment": "Show up to lectures & type every word coming out of her mouth. Instead of asking things in the discussion board, go to party room & ask TA's. Complete sample exams (understand why each answer is wrong & how you can fix it so it's right). Fill out scantron correctly. Focus on midterm/final. This class is more than doable even if she's not the best.",
        "course": "EEOB2520"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is not for the faint of heart. I would recommend only taking it if it's required for your major. Or if you're a masochist.",
        "course": "EEOB2520"
      },
      {
        "index": 43,
        "rating": 1,
        "difficulty": 4,
        "comment": "The content of this course is not bad, but Dr. Bronson makes the course bad. She offers very little out-of-class material to study, as well as weekly review sessions not being recorded (these happened to be during my chemistry lab time). I could go on for another few pages, but to sum it up, this is the only class I did not receive an A in. ",
        "course": "EEOB2520"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 5,
        "comment": "Join the group me, audio record the lecture, fill out your scantron correctly, look at the instructions on every exam for extra credit, she loves word play so look out for any words that doesn't seem real on exams, go to party room, study 2 weeks before midterm/final\n\nAs for the Prof: TERRIBLE, the only reason we pass is because of extra credit",
        "course": "EEOB2520"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 5,
        "comment": "honestly crapping my pants because tomorrow is the final and I have an 88. every exam is a crap shoot. i studied for so long for one and got a 17/30, i didnt study for another and got a 26. i havent retained a single thing but ive been studying for the final for the whole month of april. i hope this lady blesses me. ",
        "course": "EEOB2520"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 4,
        "comment": "Time consuming and a lot of work, but completely doable. She really wants you to know the material, not just memorize it. Go to class, actively engage in lecture, go over notes, attend review sessions, go to the party rooms, and utilize all of her resources that she provides, you will do absolutely fine! So many extra credit opportunities as well!",
        "course": "EEOB2520"
      },
      {
        "index": 47,
        "rating": 1,
        "difficulty": 3,
        "comment": "She won't post anything so you wil should record her lecture if you want to do well. She shortens every word so listen attentively to understand. The exam questions are intended to trick you which sucks bc you have no time to do the exam. The party room helps and she gives a lot of extra credit but you will be teaching yourself this entire course.",
        "course": "EEOB2520"
      },
      {
        "index": 48,
        "rating": 3,
        "difficulty": 4,
        "comment": "Here's some advice: 1.Go to the weekly review sessions 2. Study a ton for the midterm and final they are worth SO much more than each weekly exam 3. Don't stress too much about your grade bc there is an insane amt of extra credit at the end 4. Cynthia uses an extremely outdated teaching style but it's almost impossible to fail this class.",
        "course": "EEOB2520"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best class I've taken at OSU. I don't know if it was the class content or if it was the style of the class, but the studying habits and structure I've gained this semester are beyond anything in my college experience. From extra credit and nearly 24/7 party room time to weekly review sessions and a weekly, open Discussion board, I ",
        "course": "EEOB2520"
      },
      {
        "index": 50,
        "rating": 2,
        "difficulty": 5,
        "comment": "This is the worst class I have taken at OSU to date. The only reason people pass is from the immense amount of extra credit. The midterm and final are just word for word questions that were on the weekly quizzes so if you study you'll get a good grade. The weekly quizzes were worded to be funny but literally made no sense. Bronson was just OK...",
        "course": "EEOB2520"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 5,
        "comment": "I take back everything I said she blessed tf outta me on the extra credit on the final someone give this lady a Nobel peace prize",
        "course": "EEOB2520"
      },
      {
        "index": 52,
        "rating": 2,
        "difficulty": 4,
        "comment": "This was a really stressful course. I spent most of the semester convinced I would not pass. The schedule for this class is ridiculous. Dr. Bronson has an interesting way of setting up her course. Students typically love it or hate it. I went to the party rooms (study rooms) a few times and found them helpful. ",
        "course": "EEOB2520"
      },
      {
        "index": 53,
        "rating": 1,
        "difficulty": 5,
        "comment": "Does not provide lecture slides after class. Does not have a textbook. Does not provide recordings of her very fast paced lecture. Practice exams do not mimic the exams you will take. This class is hard to fail given all of the extra credit but I found the teaching style to be beyond frustrating. Every single question on every exam is deceiving.",
        "course": "EEOB2520"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Bronson is an amazing professor but the exams were very hard. As long as you go to the party room and utilize every extra credit opportunity you will honestly be fine. Also, be sure to attend every single lecture or at least listen to a recording if you cannot make it. ",
        "course": "EEOB2520"
      },
      {
        "index": 55,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Bronson is a good professor and great at lectures. Be prepared to put hours in outside of class and lectures. Especially during the summer! Over the summer, you'll have an exam every 2 days. Though there's lots of extra credit, you still need to know everything to do well. Lots of resources (party rooms). Read the syllabus and discussions!!",
        "course": "EEOB2520"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 4,
        "comment": "Her teaching style is very different from other professors, so be gracious and give yourself time to adjust to her style (and the 6:50 am classes!!). However, if you commit to studying on a daily basis and going to lecture every day and taking thorough notes, then you can succeed! I will remember more material from this class than any others. ",
        "course": "EEOB2520"
      },
      {
        "index": 57,
        "rating": 2,
        "difficulty": 4,
        "comment": "past science courses really help. weekly exams that may be hard to understand. for many people including me the class takes up a lot of study which sucks bc its only 3 credits. she does drop 6 of our exams and offers extra credit but the class may be very difficult if youre taking another heavy science class at the same time. learned a lot though. ",
        "course": "EEOB2520"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 3,
        "comment": "Bronson is a good teacher and the class is mid difficulty. If you wanna be a healthcare professional, hard work and getting up early should definitely not be what scares you off. Read the syllabus and study hard! Fun content.",
        "course": "EEOB2520"
      },
      {
        "index": 59,
        "rating": 4,
        "difficulty": 5,
        "comment": "This class is hard. It is going to take up a lot of your time BUT she really wants everyone to succeed. there is plenty of extra credit opportunities that saved my grade. if you go to lecture and stay on top of things you will succeed",
        "course": "EEOB2520"
      },
      {
        "index": 60,
        "rating": 2,
        "difficulty": 3,
        "comment": "The class all and all was not awful. The way Dr. B taught just really did not make sense to me. The only grade she gives is on weekly exams which high key sucks. Also having class at 6:50 in the morning should be a crime. The only saving grace of this class is she gives a good amount of extra credit. Good Luck!",
        "course": "EEOB2520"
      },
      {
        "index": 61,
        "rating": 2,
        "difficulty": 4,
        "comment": "Bronson's teaching style honestly makes you rely on the office hours and Carmen discussions or else you will not do well. She goes through material insanely fast and while I can't say I like it at all I do feel like I will know this information for the rest of my life ",
        "course": "EEOB2520"
      },
      {
        "index": 62,
        "rating": 1,
        "difficulty": 5,
        "comment": "This was the worst class I have ever taken in my entire life, destroyed my mental about school. You have weekly exams where she tries to trick you on every question. You rely on extra credit to pass the class. If you ask questions she makes you feel like you're stupid. If you have to take it, do it online or somewhere else. DO NOT take it with her.",
        "course": "EEOB2520"
      },
      {
        "index": 63,
        "rating": 1,
        "difficulty": 5,
        "comment": "Weekly exams. She wasn't accommodating & students had to rely on E.C. if they wanted to pass. We had no work besides weekly exams.There were no chapters in the class which made it hard for students to organize. She would not send notes or recordings if someone was sick/had an emergency, etc. Her class was genuinely the worst class I have taken.",
        "course": "EEOB2520"
      },
      {
        "index": 64,
        "rating": 1,
        "difficulty": 5,
        "comment": "The only good thing about this class is extra credit and half of the quizzes being dropped, but I'm sure she does this because 99% of the class would fail. She tries to trick you on the tests and never reviews anything. She spends the whole week of an exam teaching new information instead of reviewing. Answers questions by asking one back instead.",
        "course": "EEOB2520"
      },
      {
        "index": 65,
        "rating": 3,
        "difficulty": 5,
        "comment": "This course is very very difficult, but not impossible. Required a lot of studying time to do well, but it wasn't impossible to receive a good grade. Don't take this class unless required for major. Must go to lectures to understand material. Your grade is based off only exams. She gives lots of extra credit, but exams are very hard. 6:50am Class. ",
        "course": "EEOB2520"
      },
      {
        "index": 66,
        "rating": 2,
        "difficulty": 5,
        "comment": "She gets into her lectures and has extra credit on every quiz, which happen frequently and minimal time. The extra credit can be answered if you listen to her lectures. The questions are difficult on quizzes/exam and she will tell you to study past quizzes but then change one word to trip you up. She doesn't record the lectures or provide slides.",
        "course": "EEOB3510"
      },
      {
        "index": 67,
        "rating": 4,
        "difficulty": 2,
        "comment": "I enjoyed Dr. B.\nShe gets really into her lectures, is very expressive and her slides are put together well. She does a good job explaining difficult concepts while also keeping a fast pace. \nIf you're taking EEOB2520, there is LOADS of extra credit, 1/2 of the quizzes are dropped and answers to extra credit questions are given. ",
        "course": "EEOB2520"
      },
      {
        "index": 68,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. B has great lectures, that is the only compliment I have. Weekly exams which are set up like MCAT questions with barely any time to complete. Shady methods to earn bonus points. Unreasonably early 6:50 AM lecture on Wednesdays. I spent HOURS outside of class to grasp the content, and yet I failed. Absolutely abysmal experience.",
        "course": "EEOB2520"
      },
      {
        "index": 69,
        "rating": 5,
        "difficulty": 5,
        "comment": "Before I took this course, these ratings scared me. Take everything you read here with an open mind; physiology is an inherently difficult course. Dr. B is a very knowledge professor. I would recommend recording all lectures (do not skip any), reviewing content in office hours (at least once a week), and rewriting notes weekly. Best of luck! ",
        "course": "EEOB2520"
      },
      {
        "index": 70,
        "rating": 2,
        "difficulty": 3,
        "comment": "I don't believe her lectures are accessible to people who can't write or type fast. She also doesn't record her lectures. Her exams require very detailed notes to pass. I relied on \"office hours\" A LOT to improve my grade. That is not reasonable for those who have outside commitments. In short, excellent notetaker + investment= decent grade.",
        "course": "EEOB2520"
      },
      {
        "index": 71,
        "rating": 1,
        "difficulty": 5,
        "comment": "Never answers emails, has a sharp(overwhelming) voice, and does not make the material easy to understand at all. Unfortunate that she is the only physiology professor at OSU. Teaching is not the calling for this person.  ",
        "course": "EEOB2520"
      },
      {
        "index": 72,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor in the entire school. DO NOT take this class. It will ruin your life.",
        "course": "EEOB2520"
      },
      {
        "index": 73,
        "rating": 1,
        "difficulty": 5,
        "comment": "Not good. Prides herself on her unconventional teaching style which she feels pushes for retention over just getting a grade... but the result is you spend more time trying to master the format than the material. Inflexible, provides no material whatsoever outside of lectures (notes, textbook, supplementary readings). Awful, avoid at all costs. ",
        "course": "EEOB2520"
      },
      {
        "index": 74,
        "rating": 1,
        "difficulty": 5,
        "comment": "She was a very difficult professor to work with. She was very lecture heavy and required mandatory weekly paper exams with very little time to complete. I would not recommend this class to anyone.",
        "course": "PHYSIOLOGY"
      },
      {
        "index": 75,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is clearly very knowledgeable, and everything makes sense during class, but every test/quiz requires you to recall the smallest details, including things she only talks about for a sentence or two. Her class is engaging and entertaining enough, you just can't learn enough to pass any test or quizzes, which is your entire grade. ",
        "course": "EEOB2520"
      },
      {
        "index": 76,
        "rating": 1,
        "difficulty": 5,
        "comment": " Every week we had a test in her class that was 15 questions plus the \"extra credit\" with 18 minutes to complete it. She writes her tests to trick you and switches words around. I said \"extra credit\" as they were all ridiculous. Although she drops 6 of these weekly test grades, I think she does it so that more of her students pass.",
        "course": "EEOB2520"
      },
      {
        "index": 77,
        "rating": 4,
        "difficulty": 5,
        "comment": "An excellent lecturer, very knowledgeable about physiology. I truly enjoyed and learned a lot in her class but the exam questions were horribly worded and extremely confusing; if it wasn't for the loads of extra credit I definitely wouldn't have passed. There is no homework, only grades are exams, but heavy studying and work is recommended to pass.",
        "course": "EEOB2520"
      },
      {
        "index": 78,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. B is a very passionate professor and her lectures are interesting, however, her exams are very hard. its almost like its designed to trick you instead of testing your knowledge. she does give a TON of ec opportunities though. this class is doable if you go to lectures and \"party rooms\" she offers. takes a lot of effort for an A in this class",
        "course": "EEOB2520"
      },
      {
        "index": 79,
        "rating": 4,
        "difficulty": 4,
        "comment": "If you are required to take this class, don't let all the bad reviews scare you. I read these reviews before taking this class and was terrified. But if you are a good student you will be just fine. I think some people are taking their frustration towards the difficulty of this class out on Dr. B. She's a fine prof. Study well and you'll be OK. ",
        "course": "EEOB2520"
      },
      {
        "index": 80,
        "rating": 1,
        "difficulty": 5,
        "comment": "I have no idea how they still let her teach this course. The worst professor I've had in my life. She does not care about students and walks around the classroom like she is tenured and wants you to know it. The exams are meant to trick you by replacing minute words instead of testing your knowledge on the subject. DO NOT TAKE. ",
        "course": "EEOB2520"
      },
      {
        "index": 81,
        "rating": 1,
        "difficulty": 5,
        "comment": "No textbook. UR 100% reliant on her lecture for your material.She has the MOST convoluted tests(TAs will help you understand). I retained NOTHING from this course. You have weekly quizzes &amp; tests w/ 30 seconds/question to answer. Each Q is seen twice to give you ample opportunity to doubt yourself. Do ALL of the extra credit.",
        "course": "EEOB2520"
      },
      {
        "index": 82,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is a decent teacher but has horrible lecture times. The way she does things are just very bizzare. I found a way to take this class a cstate, so I dropped. Just try to avoid taking this class with her.",
        "course": "EEOB2520"
      },
      {
        "index": 83,
        "rating": 2,
        "difficulty": 4,
        "comment": "Although Dr. Bronson is a good professor and explained the material well I feel that this class was unnecessarily difficult. You get 20 minutes for 40 question weekly exams and only 40 minutes for 100 question midterm &amp; finals. Exams and midterm preps are the only grades given and if you have other time consuming commitments this class isnt for u",
        "course": "EEOB2520"
      },
      {
        "index": 84,
        "rating": 4,
        "difficulty": 4,
        "comment": "Personally, I think Dr. Bronson is great at teaching. But sure you take very detailed notes (some things she says but doesn't present are on the exams - also a lot of jokes and analogies she says are extra credit). This class does require a good amount of studying but it's manageable. You'll likely get better at her exams as you take more of them",
        "course": "EEOB2520"
      },
      {
        "index": 85,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worst class I have ever taken. It is a 3 credit hour class yet she expects you to put the time in like it is a 5 credit hour class. She herself is okay, class and weekly exams are terrible. Do not take at all costs.",
        "course": "EEOB2520"
      },
      {
        "index": 86,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Bronson is consistently rude to students who ask for help, if you can even get ahold of her. In a complete online section of this class she ignores emails and messages so you have no way of communicating with her. Her exams are 20 questions in 20 minutes and every question repeated. You have an exam every week and the questions make no sense.",
        "course": "EEOB2520"
      },
      {
        "index": 87,
        "rating": 1,
        "difficulty": 4,
        "comment": "The worst class I have ever taken. Took the 4 week version class, her lectures were so fast, she was rude when people would ask questions on piazza, her exams were horribly worded and the time limit to finish 60 questions was 35 minutes. You had 2 exams a week. I studied everyday I barely passed with a C. DON'T TAKE THIS PROFESSOR.",
        "course": "EEOB2520"
      },
      {
        "index": 88,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is not easy by any means and is tricky. Dr. Bronson sets this class up so well to make you succeed. Take advantage of the tools and you will get an A",
        "course": "EEOB2520"
      },
      {
        "index": 89,
        "rating": 4,
        "difficulty": 4,
        "comment": "While Dr. B makes you work for your grade, she is an excellent professor. She gives weekly exams which force you to stay on top of the work but each exam has around 5-9 extra credit questions. There are so many resources to help you succeed. Party rooms and review sessions are super helpful. If you put in the work, you'll be fine.",
        "course": "EEOB2520"
      },
      {
        "index": 90,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class consists of a weekly exam (30 pts) and a midterm/final prep (6 pts), as well as a midterm &amp; final (96) that contains past questions. Prof is VERY good at lecturing and explaining information. 6/12 of exams are dropped, and this semester due to issues 5/6 of exams were given to us for full points, so really nothing to complain about at all!",
        "course": "EEOB2520"
      },
      {
        "index": 91,
        "rating": 5,
        "difficulty": 5,
        "comment": "I went into this class very nervous about the difficulty level. I was pleasantly surprised by Dr. Bronsons lecture style. Its honestly like taking physio for dummies because she makes the concepts so simple to understand. The only thing that makes the class difficult is the style of her exam questions. Critical thinking is definitely necessary.",
        "course": "EEOB2520"
      },
      {
        "index": 92,
        "rating": 4,
        "difficulty": 4,
        "comment": "This is how I got almost 100%: Go to every lecture - she will give extra credit sneak peeks before and during lecture. Record her lectures and write down everything on the PowerPoints. After class, re-listen to her lecture and annotate your notes with extra details. Make a Quizlet and memorize everything. You have to work, but an A is very possible",
        "course": "EEOB2520"
      },
      {
        "index": 93,
        "rating": 1,
        "difficulty": 5,
        "comment": "The way Dr. Bronson has set up her class is hands down the worst Ive personally experienced in academia. Exams are convoluted and have every question repeated, so if you get a question wrong, you lose 2 points. The material gone over in class is paraphrased she doesnt put slides up to look back at. Dr. Bronson is THE WORST professor to exist.",
        "course": "EEOB2520"
      },
      {
        "index": 94,
        "rating": 5,
        "difficulty": 3,
        "comment": "I absolutely love Dr. Bronson. She is one of the best professors Ive ever had at OSU. While her class is challenging, I honestly believe it is the only class where I learned the material instead of memorizing it. I love how she actually GIVES lectures, instead of reading off of her powerpoint. My all time favorite Professor. :)",
        "course": "EEOB2520"
      },
      {
        "index": 95,
        "rating": 5,
        "difficulty": 4,
        "comment": "Learning physiology with Dr. B was amazing. Yes, you do have to work for it but my biggest piece of advice is to take VERY detailed notes (literally write down every word she says) and go to party room (they hand out tests questions and extra credit answers)!! She really knows how to link concepts together and explain them. Also very understanding!",
        "course": "EEOB2520"
      },
      {
        "index": 96,
        "rating": 1,
        "difficulty": 5,
        "comment": "The class was insanely difficult. Weekly exams with extremely confusing questioning and formatting. Would not recommend taking this unless you absolutely need to. In order to do well, you have to go to out of class time zoom calls and it just requires a lot of added credit. Wouldn't recommend it honestly.",
        "course": "EEOB2520"
      },
      {
        "index": 97,
        "rating": 4,
        "difficulty": 4,
        "comment": "Listen. She is a real general, Bronson is an extremely hard woman and. does not tolerate cheating or laziness of any kind. Shes a little awkward and her humor is. quite dry, but she is a very good lecturer. Study early, use the party room, ask questions, LOOK FOR EXTRA CREDIT. She gives alot og points and is super fair, JUST DONT BE LAZY.",
        "course": "EEOB2520"
      },
      {
        "index": 98,
        "rating": 1,
        "difficulty": 5,
        "comment": "Entertaining but her tests were very poorly written. I studied daily, did note cards, and went to the party room/ test reviews. Tests are written in cryptic fashion on subjects in detail beyond what was discussed. I tried to study previous tests with a friend who is fourth year med student she said the tests made no sense.",
        "course": "EEOB2520"
      },
      {
        "index": 99,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is a very effective teacher but her class is so time consuming and challenging. She gives weekly exams. You have to go to every lecture. Record her lectures and go to the party room as much as possible. Study everyday for this class. The exams are very hard. You have to known the info very well and then apply it.",
        "course": "EEOB2520"
      },
      {
        "index": 100,
        "rating": 3,
        "difficulty": 4,
        "comment": "I found Bronson to be a very good lecturer and actually felt like I understood the material very well after listening to her lectures a couple of times. However, her exams are very tricky. I do not mind difficult exams, but it was to the point of being difficult to understand the wording. Study a ton and use piazza! There is extra credit",
        "course": "EEOB2520"
      },
      {
        "index": 101,
        "rating": 2,
        "difficulty": 4,
        "comment": "Hate the way Bronson teaches. the material is hard enough she makes it harder. I find youtube videos that explain better than her. she likes to trick you on her weekly exams. worst part is class is at 6 am one out of the 3 days. I love learning about physiology but the way she teaches is just different",
        "course": "EEOB2520"
      },
      {
        "index": 102,
        "rating": 5,
        "difficulty": 4,
        "comment": "The only reason people fail this class would be if they don't try. Yes the lectures are very early in the morning but you get used to them and it doesn't seem bad at all after awhile. Her weekly exams and tests are hard but MANAGEABLE! She offers a ton of outside resources that are easy to use and incredibly helpful. Also a lot of EC offered.",
        "course": "EEOB2520"
      },
      {
        "index": 103,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. B has been the best professor I have had at OSU yet. This class is impossible to fail, if you use your resources properly. She gives so many opportunities to learn the material through office hours (that you actually want to go to), Piazza (online question answerer), and review sessions. Plus, a tremendous amount of extra credit.",
        "course": "EEOB2520"
      },
      {
        "index": 104,
        "rating": 3,
        "difficulty": 5,
        "comment": "Offered no sympathy or leniency towards students being affected by COVID-19. Weekly quizzes that you need to know the information like the back of your hand. It's unfortunate that she's let the power go to her head being the only professor that teaches this class. Basically it's her way or the high way. Do NOT take this class unless you need to.",
        "course": "EEOB2520"
      },
      {
        "index": 105,
        "rating": 3,
        "difficulty": 5,
        "comment": "You have weekly exams and 2 midterms and that's pretty much it for grades. I would take this class when you're going to have a lot of extra time to go to the Party Room outside of class because that's where you look over exams and ask questions. I wasn't able to use this resource often because of lack of time and it made the class extremely hard.",
        "course": "EEOB2520"
      },
      {
        "index": 106,
        "rating": 4,
        "difficulty": 5,
        "comment": "14 weekly quizzes+midterm+final Quiz are hard, aimed to 'Critical think'/tricky. She cares - participate to Party room+piazza (online class post) DO NOT FALL BEHIND EVER! Pay attention to all examplesmay be in the quiz as bonus questions. Record classes only chance to pass! READ syllabus... and PAY attention to all DETAILS, always! Enjoy &amp; Learn",
        "course": "EEOB2520"
      },
      {
        "index": 107,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class is hard. many people dropped in the first couple weeks. The exams are written to be TRICKY. she gives us two chances to answer a question but you will get half credit. iv second guessed myself which led me to lower grades than I would have gotten if she didnt use this method. I would love to take this class again but not with her.",
        "course": "EEOB2520"
      },
      {
        "index": 108,
        "rating": 2,
        "difficulty": 4,
        "comment": "Absolutely DISLIKE this professor! I am a nursing major and was so excited to take this class. She makes it harder and more tricky than it needs to be. Its a 3 credit hour course and yet I study more for this class than my chemistry class but still get low grades. she gives lots of EC because so many people fail her weekly exams.",
        "course": "EEOB2520"
      },
      {
        "index": 109,
        "rating": 2,
        "difficulty": 4,
        "comment": "she makes it harder than it needs to be. answer on quiz can be wrong depending on certain words used which trick you (ex: sometimes vs all the time) . you have to complete scantron correctly in order to get points. she doesnt record or post lectures online. Good thing is, she gives so many EC . 6:50 am classes suck. and she starts quiz 5min early.",
        "course": "EEOB2520"
      },
      {
        "index": 110,
        "rating": 1,
        "difficulty": 5,
        "comment": "The grade relies solely on weekly exams, the midterm, and the final. Notes do not get posted to carmen so if you don't go to class good luck. The material itself can be a bit challenging but its the way she words the exam questions that make it so difficult. The questiosn are long and confusing, and you have a very small amount of time to do them.",
        "course": "EEOB2520"
      },
      {
        "index": 111,
        "rating": 4,
        "difficulty": 4,
        "comment": "I didn't do well the first half of the semester, but she offered so much extra credit that I ended up with a solid A with a lot of work. Go to the party room as much as you can, record lectures, and work through all the practice exams and explain why each is wrong/how you can make them right and you will be fine. Relax and enjoy the content :)",
        "course": "EEOB2520"
      },
      {
        "index": 112,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE!!!!!",
        "course": "ECON2520-100"
      },
      {
        "index": 113,
        "rating": 3,
        "difficulty": 5,
        "comment": "this class is very hard. the professor is great and is good at helping you understand the material. but the class is exhausting. having an exam every week is RIDICULOUSLY hard and tiring and the midterms are all based on these exams. be ready to record lectures, go to the party room, ask a lot of questions and study an excess amount",
        "course": "EEOB2520"
      },
      {
        "index": 114,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful. Simply awful. Weekly quizzes that sucked and the exam is based off of most missed questions. If you do not go to the lecture and to study tables you will NOT do good.",
        "course": "EEOB2520"
      },
      {
        "index": 115,
        "rating": 1,
        "difficulty": 5,
        "comment": "For each test question, she gives you the following multiple choice options: A; B; A and B; neither A nor B. Then, she lets you choose to select one answer or you can select two answers for the question, but then if you get it right you will only receive half credit for that question. The tests are incredibly difficult.",
        "course": "EEOB2520"
      },
      {
        "index": 116,
        "rating": 3,
        "difficulty": 4,
        "comment": "Attending lecture is a MUST. Record the lectures and listen to them later to add to your notes because she only provides skeleton notes, which are hard to understand. Go to her Party Rooms and read ALL of Piazza. Know the material like the back of your hand--it makes the weekly exams so much easier. This class is manageable if you put in the time.",
        "course": "EEOB2520"
      },
      {
        "index": 117,
        "rating": 3,
        "difficulty": 4,
        "comment": "I was really worried going into this class, but it ended up being a lot easier than I expected. To do well: go to lectures, record and relisten to lectures, truly understand and be fluent with the information. This was all very time consuming, but I finished the class with above a 100%. She gives a lot of bonus which greatly helped my grade.",
        "course": "EEOB2520"
      },
      {
        "index": 118,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bronson is an awesome professor who lectures well and her class is my favorite Ive taken so far. Phys is hard, but if you put in the work you can do it. Record lecture and listen back to it before the weekly exams, go to the party room, and keep good attention to detail and you will do fine.",
        "course": "EEOB2520"
      },
      {
        "index": 119,
        "rating": 5,
        "difficulty": 5,
        "comment": "This class is a ton of work, but this is because the class has a lot of information involved in it. I thought she was a great professor and had very helpful office hours. I went to 2 hours of office hours every week. Quizzes/exams are very tough but set up so that you stay on top of the information. Class taught a lot of useful info for MCAT.",
        "course": "EEOB3510"
      },
      {
        "index": 120,
        "rating": 4,
        "difficulty": 2,
        "comment": "Ignore what people says about her. 45% of the class had A in the class. If thats not easy, I dont know what is. The way to succeed in this class is to attend, LISTEN and take notes. For quizzes and exsms, memories what on her notes and spit it off on the paper. Thats it! She might say random things in lectures and ask about it for extra credit.",
        "course": "EEOB3510"
      },
      {
        "index": 121,
        "rating": 4,
        "difficulty": 4,
        "comment": "Her analogies are the weekly tests, so know them in and out. She just tests in a weird way, not really sure if it's as much about understanding the physiology as much as her weird way of complementing it. Party room sort of helped. Get together with friends to get all the exam versions for her midterm and final, so you don't get confused.",
        "course": "EEOB2520"
      },
      {
        "index": 122,
        "rating": 4,
        "difficulty": 4,
        "comment": "Phys is a tough class hands down. Youll probably think of dropping it multiple times in your first weeks. But stick to it. It gets easier once you understand her questions and how you need to study for the class. Record lectures, re listen and take notes. Dont take it with a hard course load bc it takes A LOT of extra time. She gives lots of EC.",
        "course": "EEOB2520"
      },
      {
        "index": 123,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Bronson's class was easily the worst class I've ever had. Her lectures were fine, you can understand what she's teaching, but her tests are impossible. Her TAs forgot to put the correct answer on different versions of the test several times and she wouldn't give credit back for it because there was still a &quot;least wrong&quot; answer.",
        "course": "EEOB2520"
      },
      {
        "index": 124,
        "rating": 4,
        "difficulty": 4,
        "comment": "Some of the other reviews on Dr. Bronson have me quite confused. She is one of the best profs I've had. She knows the material, doesn't require a textbook (but provides them in the party room), and makes you work hard for your grade. Piazza is an excellent resource in this class. She genuinely cares about the success of her students, as well.",
        "course": "EEOB2520"
      },
      {
        "index": 125,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class is hard, yes, but if you actually work at it, there is no reason not to get a good grade in the class. There are so many resources (party room, review sessions, kahoot, TAs, etc.) that should be used any chance you get because they make the class so easy. Went to every review session/kahoot and the party room 2-3 times a week to get an A",
        "course": "EEOB2520"
      },
      {
        "index": 126,
        "rating": 4,
        "difficulty": 4,
        "comment": "I've taken both Physio 3200 &amp; EEOB 2520, but this course is a LOT easier. This class is a lot of work, weekly exams, 1 midterm, 1 final. She's not here to spoon feed us the material, her qs can be pointless but they help me so much with critical thinking! The midterm &amp; final is repeated qs that you've seen, and she gives us SO MUCH EXTRA CREDIT!!",
        "course": "EEOB2520"
      },
      {
        "index": 127,
        "rating": 3,
        "difficulty": 5,
        "comment": "The class presents a lot of information that should be extremely useful, however the majority of the class is based on understanding the riddles of her exams. Wording on the WEEKLY exams is extremely tricky. Going to lecture is not enough to do well in this class; must go to party room, review, and use discussion board. Too much for 3 credit hrs",
        "course": "EEOB2520"
      },
      {
        "index": 128,
        "rating": 3,
        "difficulty": 5,
        "comment": "The class itself is the HARDEST thing I have ever taken. I failed the first weekly exam and I almost switched my major and dropped the class. Don't do that, stick it out. Go to the party room and review sessions, ASK QUESTIONS, and record her lectures and re-listen. This class should terrify you, but overall it's an interesting course. Good luck!",
        "course": "EEOB2520"
      },
      {
        "index": 129,
        "rating": 4,
        "difficulty": 5,
        "comment": "She really knows the material and isn't a terrible professor. The class is just suuuper hard. Weekly 15-question exams that you take in about 15 minutes, 1 midterm, and a final. You get to drop 4 of the weekly exams. There isn't a textbook, but she provides several different types of review sessions that are really helpful. Hard class; study a lot.",
        "course": "EEOB2520"
      },
      {
        "index": 130,
        "rating": 1,
        "difficulty": 5,
        "comment": "unreasonable amount of time spent on this class. WEEKLY EXAMS, w/ an exam the same day as the midterm &amp; final. Record lectures &amp; relisten to them to help w/ studying. It feels like Dr. B wants you to fail this course. Exams feel more like you're being tested on if you can decipher the wording of the question, not material. DON'T TAKE WITH ANATOMY",
        "course": "EEOB2520"
      },
      {
        "index": 131,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class is more difficult than it should have been, considering it is only a 3 credit hour class. The Professor tests your ability to decipher her exam more than she does your knowledge of the material. She makes everything super convoluted and difficult to understand. We get it you like Ohio State, enough of the Brutus questions.",
        "course": "EEOB2520"
      },
      {
        "index": 132,
        "rating": 1,
        "difficulty": 5,
        "comment": "The only way to pass the class is going to lectures, and during lectures she will say very problematic and inappropriate things. She has found ways to bring up the necessity of building a wall along the border for protection multiple times in class when its very unnecessary. Very unprofessional and rude.",
        "course": "EEOB2520"
      },
      {
        "index": 133,
        "rating": 1,
        "difficulty": 5,
        "comment": "her class is piece of crap. you won't learn anything because you basically have to write what she says during lecture. no pictures in her Pp, only bullet points and you not allowed to take pictures to powerpoint. weekly exams are difficult (answer long confusing questions in short time). if u ever want to take physio class, take 3200; it is easier.",
        "course": "EEOB2520"
      },
      {
        "index": 134,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took A&amp;P previously at University of Cincinnati - same material and such an enjoyable course. Dr. Nodzak taught it extremely well. Cynthia doesn't do it justice. She spend so much time lecturing but half of the lectures don't even make sense. She covers main points but doesn't specify on minor detail that would help to understand info",
        "course": "EEOB2520"
      },
      {
        "index": 135,
        "rating": 4,
        "difficulty": 4,
        "comment": "she puts way too much into a three credit hour course. the tests are really confusing. they don't really test your knowledge of the material as much as your ability to memorize and solve her riddles, which is kind of stupid. the phys phabs in the party room didn't even know the answers to some of her old questions at times.",
        "course": "EEOB2520"
      },
      {
        "index": 136,
        "rating": 4,
        "difficulty": 4,
        "comment": "Weekly exams are tricky but the extra credit helps. Make sure you're writing the answers to ALL THREE test versions in the party room each week, because she likes to reuse questions verbatim on the final (but not the exact same verbatim answers, so make sure you're understanding why each answer is correct/incorrect!) You'll be OK - just study a lot",
        "course": "EEOB2520"
      },
      {
        "index": 137,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Bronson is a great lecturer making those early mornings pretty interesting with her humor. But, she makes this course way more difficult than it should be with all of her analogies trying to get the main points across and then making you decipher them to understand it. There are WEEKLY exams that are hard to understand many times. GO TO CLASS",
        "course": "EEOB2520"
      },
      {
        "index": 138,
        "rating": 4,
        "difficulty": 5,
        "comment": "the tests arent too bad but in the end i felt like i was more grubbing for points than i was actually learning. her tests dont seem to examine your knowledge of the material as much as your memory of her analogies, which are somewhat helpful but... not something i wanted to be solely tested over. party room is a must.",
        "course": "EEOB2520"
      },
      {
        "index": 139,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class sucked. I only took it cause I heard it'd help for the MCAT, because it isn't an elective for microbiology majors. It's a lot of extra work for only 3 credits, but I guess the material does stick. She could make it less annoying and probably teach just as effectively. Weekly exams? Gimme a break.",
        "course": "EEOB2520"
      },
      {
        "index": 140,
        "rating": 3,
        "difficulty": 5,
        "comment": "She knows her stuff and lectures well. I spent alot of time in party room which was the difference in my grade. If i wouldnt have gone to party room i wouldve done very poorly. For a three credit hour class I spent a ridiculous amount of time studying and stressing out over this class. Weekly tests are so hard .",
        "course": "EEOB2520"
      },
      {
        "index": 141,
        "rating": 3,
        "difficulty": 4,
        "comment": "I took this course as a freshmen since it is required for admission into OSU's nursing program. If you are a good student and put in the effort required, you will be successful in this course. Bronson is overall a good professor but her class is a lot different than a lot of professors. I wish I would have taken more time to study.",
        "course": "EEOB2520"
      },
      {
        "index": 142,
        "rating": 3,
        "difficulty": 5,
        "comment": "As a straight A student in high school, this was the first class I've really struggled in and it made me study in a different way than I've ever had to. Knowing just what she gives in lecture will not get you a passing grade. You need to understand the ins and outs of everything and why things happen the way they do. Be aware of wording on tests.",
        "course": "EEOB2520"
      },
      {
        "index": 143,
        "rating": 1,
        "difficulty": 5,
        "comment": "Medical school exam questions. Study as if you're a medical student. (Will not guarantee a passing grade for most)!!!!!",
        "course": "EEOB2520"
      },
      {
        "index": 144,
        "rating": 4,
        "difficulty": 5,
        "comment": "Only take this class if you need it. Material is pretty simple, but weekly 8am exams are written to trick you. Over time, you get used to the questions and it gets easier. Offers around 5 EC per exam. To do well, you have to dedicate all your time to this class. She does a good job of explaining material. Say goodbye to thirsty thursdays.",
        "course": "EEOB2520"
      },
      {
        "index": 145,
        "rating": 4,
        "difficulty": 4,
        "comment": "DO NOT TAKE THIS CLASS WHILE TAKING ANATOMY. They are both classes that require a lot of time to study and prepare for. She is funny is a dry way and is fair but this is basically a class teaching you how to pay close attention and read questions. Make sure to always read directions and check her posts. Application and lecture heavy course",
        "course": "EEOB2520"
      },
      {
        "index": 146,
        "rating": 1,
        "difficulty": 5,
        "comment": "Study as much as you want, the grades in this class are more based on  understanding her wording to questions and her analogies. She tests on what she think is important and leaves out the rest. I was excited to take this class but the hoops she makes you jump through for a 3 credit hour course are ridiculous. Don't take this class unless you must.",
        "course": "EEOB2520"
      },
      {
        "index": 147,
        "rating": 5,
        "difficulty": 4,
        "comment": "The material itself is pretty easy. If you aren't good at critical reasoning than I recommend a different physiology class. Had to drop my 3 exams quickly but eventually figured it out.  Had to utilize  review sessions and TA room to keep up. There's no need to shout in lecture or use terrible puns.  Take it at the 6:50 time; class is smaller.",
        "course": "EEOB2520"
      },
      {
        "index": 148,
        "rating": 3,
        "difficulty": 5,
        "comment": "Physiology was the hardest class I took here. She goes between two lecture halls, and the other lecture hall just gets a video recording of her, which sucks. Your grade is determined solely on WEEKLY(!!!) exams, and a midterm and final that are a culmination of most missed questions on the exams. If you aren't pre-health, DO NOT TAKE THIS CLASS.",
        "course": "EEOB2520"
      },
      {
        "index": 149,
        "rating": 4,
        "difficulty": 5,
        "comment": "Great lecturer, impossible quizzes. Be ready to study VERY hard. Go to all of the review sessions, take bomb notes, record lectures and listen to them later. Her quizzes are extremely difficult. There are not words strong enough to say how much I despise her quizzes. I'm a straight A student and I studied my butt off for her class just to pass.",
        "course": "EEOB2520"
      },
      {
        "index": 150,
        "rating": 5,
        "difficulty": 5,
        "comment": "Wow, as a nursing major. This will be the most difficult prereq you will have, I guarantee it. She is a great professor but her exams are ridiculously difficult if you don't spend each week studying, with that, weekly exams. Exams are the only things that are graded in this course. If you have to take anatomy as well, take that first then physio.",
        "course": "EEOB2520"
      },
      {
        "index": 151,
        "rating": 3,
        "difficulty": 4,
        "comment": "At the beginning it's hard to adjust to her testing style (test every week and hard questions). 13 quizzes and 2 midterms in total and can drop the lowest 3 quizzes. Gives out extra credit for every quiz and midterm so pay attention in class!!!! I would take advantage of the party room and reviews!!",
        "course": "EEOB2520"
      },
      {
        "index": 152,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful teacher. She uses random analogies to \"help\" you learn the material but it only adds to the confusion. You have an exam every week and when you have a midterm/final you also have the weekly exam to go along with it. You can study all you want but unless you can decipher her analogies, well good luck. I would advise you to take Physiology 3200",
        "course": "EEOB2520"
      },
      {
        "index": 153,
        "rating": 2,
        "difficulty": 4,
        "comment": "In medical school now, in undergrad this class was a nightmare. Her quizzes/exams were weirdly worded applied questions, personally it didn't asses learning of the material. I barely got a B and that was with the party room, relistening to lectures, and constant studying. Just didnt like her teaching or testing style. Also, not approachable for Q's",
        "course": "EEOB2520"
      },
      {
        "index": 154,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great teacher!!! But very unorganized when grading exams. Most people's grades are not posted if the Scantron isn't filled out correctly. Her scantron requirements are NOT normal, rows and seats are assigned to everyone. There are 400+ people in one lecture hall, and all TAs are expected to assign seats to every single person. VERY messy.",
        "course": "EEOB2520"
      },
      {
        "index": 155,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very tough class. Need to go to lecture and all extra outside of class offerings. Mostly graded by exams only.",
        "course": "EEOB2520"
      },
      {
        "index": 156,
        "rating": 4,
        "difficulty": 4,
        "comment": "Definitely one of the hardest classes I've taken. Go to EVERY lecture (yes, even the 6:50am). Pay really good attention because she will give bonus questions on all exams about random things she mentions in lecture. Exams weekly so review often! Utilize the practice exams and go to the tutor room often because exams are just plain HARD.",
        "course": "EEOB2520"
      },
      {
        "index": 157,
        "rating": 1,
        "difficulty": 5,
        "comment": "Test every week. Only grades are tests and they are HARD. Questions on test try to trick you and do not relate to material. Have to search outside of class for some information. Met with her multiple times and even got outside help from the University but still could not do well on the tests. Affected mental stability until I finally had to drop.",
        "course": "EEOB2520"
      },
      {
        "index": 158,
        "rating": 4,
        "difficulty": 5,
        "comment": "The material we cover in class seems straightforward but the weekly exams are application questions that are ridiculous scenarios that distract you from remembering what you learn. Barely had enough time to finish any of them. Another reason why it was so difficult to focus.",
        "course": "EEOB2520"
      },
      {
        "index": 159,
        "rating": 3,
        "difficulty": 4,
        "comment": "Record lecture, remember all analogies, read discussion boards, and GO TO THE PARTY ROOM. Yes, the weekly tests are hard, but Dr. Bronson gives tons of extra credit and plenty of resources to learn and understand the material. Dr. Bronson is the best professor I've had, and she is also pretty funny!",
        "course": "EEOB2520"
      },
      {
        "index": 160,
        "rating": 2,
        "difficulty": 4,
        "comment": "She doesn't give you all the information you need for the weekly exams, you have to go to the party room and get clarification or you won't do well on the quizzes.",
        "course": "EEOB2520"
      },
      {
        "index": 161,
        "rating": 2,
        "difficulty": 5,
        "comment": "This class put be at a questionable level of mental stability/health for my entire semester. You think you know the material go in and take the god awful weekly quiz and she asks the smallest detail about a topic and of course it is the one you don't have in your notes!! She has things to help you but this class does not need to be THIS difficult.",
        "course": "EEOB2520"
      },
      {
        "index": 162,
        "rating": 4,
        "difficulty": 4,
        "comment": "No lie, this is the hardest 3 credit hour class you will ever take. A quiz every week that end up being worth more than the midterm and final combined. She basically gives you 75 free points for filling out your scantron right. Try not to skip class because she doesn't post the lectures online. Keep up with studying and DO NOT FALL BEHIND",
        "course": "EEOB2520"
      },
      {
        "index": 163,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very interesting class and you learn a lot. There is indeed a quiz every week and she really makes you apply your knowledge from the class into the questions on each quiz. Really makes you think. Her office hours are amazing though, she has it almost every day. Tough class but take good notes and for sure go to \"party room\" (i.e. office hours).    ",
        "course": "EEOB2520"
      },
      {
        "index": 164,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very in depth material. Exam every week. Offers a lot of study help (via discussion boards and \"party room\"). Extra credit often pertains to something mentioned from lecture, but extra credit is given for every test. And make sure you read directions for every single thing she hands out!! Pay attention and study (DON'T FALL BEHIND) and you'll pass.",
        "course": "EEOB2520"
      }
    ],
    "SEI": [
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "15318",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "17",
        "Rating": "4.24"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "19165",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "308",
        "Rating": "3.53"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "13444",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "74",
        "Rating": "2.91"
      },
      {
        "Subject": "EEOB",
        "Catalog": "3510",
        "Class Name": "Cellular and Developmental Biology",
        "Class Number": "13443",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.56"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "13293",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "252",
        "Rating": "2.81"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "17397",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "150",
        "Rating": "3.37"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "19567",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "298",
        "Rating": "3.28"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "20255",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "152",
        "Rating": "3.38"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2520",
        "Class Name": "Human Physiology",
        "Class Number": "19901",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "302",
        "Rating": "3.11"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Physiology",
    "firstName": "Harpreet",
    "id": "VGVhY2hlci0yNjkwMDc4",
    "lastName": "Singh",
    "legacyId": 2690078,
    "numRatings": 2,
    "summary_comment": "Dr. Singh is an excellent physiology professor known for his engaging teaching style, which includes compelling stories and well-structured lectures. He prioritizes student success, often leaving class time unused for additional support. His approach involves minimal homework and fair exam questions, ensuring a positive learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very cool professor with lots of interesting stories as examples.",
        "course": "PHYSIO3200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Singh was a great physiology professor. He structured the class well and ensured that as many students succeeded as possible. Lectures were often shorter than the class time as well. Minimal homework and fair exam questions.",
        "course": "PHYSIO3200"
      }
    ],
    "SEI": [
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "27147",
        "Term": "AU 20",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "35",
        "Rating": "4.26"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "15795",
        "Term": "SP 21",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "40",
        "Rating": "4.43"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "14128",
        "Term": "AU 22",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "44",
        "Rating": "4.73"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "17129",
        "Term": "AU 23",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "45",
        "Rating": "4.64"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2364",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "248",
        "Rating": "4.52"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2194",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "241",
        "Rating": "4.24"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2369",
        "Term": "SP 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "207",
        "Rating": "3.98"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2335",
        "Term": "AU 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "221",
        "Rating": "4.26"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "6101",
        "Class Name": "Advanced Human Physiology I",
        "Class Number": "1641",
        "Term": "AU 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "33",
        "Rating": "4.58"
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Physiology",
    "firstName": "Ran",
    "id": "VGVhY2hlci0yNjc3MDg4",
    "lastName": "Zhou",
    "legacyId": 2677088,
    "numRatings": 1,
    "summary_comment": "This professor offers an extremely easy class with online, unproctored exams available over the weekend, minimal assignments, and no quizzes. Students are advised to complete guided notes and create flashcards, and to attend lectures for success.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The easiest class I've ever taken. Online unproctored exams are open all weekend so you can take them at your leisure. There are hardly any assignments, and no quizzes, so just do the work and you'll definitely pass. Filling out the guided notes will help, as well as making flashcards, and showing up to lectures.",
        "course": "PSYCH1100"
      }
    ],
    "SEI": [
      {
        "Subject": "PSYCH",
        "Catalog": "1100",
        "Class Name": "Introduction to Psychology",
        "Class Number": "21022",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "47",
        "Rating": "4.49"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "1100",
        "Class Name": "Introduction to Psychology",
        "Class Number": "34359",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "41",
        "Rating": "4.59"
      }
    ]
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.7,
    "department": "Physiology",
    "firstName": "Leslie",
    "id": "VGVhY2hlci0yMzQ3MjU3",
    "lastName": "Rudy",
    "legacyId": 2347257,
    "numRatings": 10,
    "summary_comment": "Dr. Rudy is highly regarded as one of the best professors, known for her engaging and clear lectures, and her supportive approach to student participation and well-being. She offers numerous extra credit opportunities and makes class fun and interactive, though attendance is crucial for success. Her grading can be challenging, especially for those who miss classes or face emergencies, but she is generally fair and understanding.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "The BEST professor I've had. So engaging, so clear, really kind and encourages participation. Class notes were posted for extra credit, so attendance wasn't mandatory, but was really helpful. ",
        "course": "PSYCH3551"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love Dr. Rudy. She's my favorite professor at OSU. Attend classes, read the textbook, and you'll do great!",
        "course": "PSYCH3550"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Rudy is an awesome lecturer. Her lecture slides have everything you need to know for the exams, so if you don't read the textbook there is still a lot of chance to get a good grade. There are a lot of extra credit opportunities and she makes class fun. I am taking PSYCH 3551 with her next semester and I would recommend you do the same!",
        "course": "PSYCH3331"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "The course is informative and she is really easy to approach. The online course is easy to interact with and I have learned a lot. When I was faced with a family issue she was helpful and caring, but also made it easy to stay up to date. I love this course and would recommend it to everyone. Definitely need to be self-sufficient and study though!",
        "course": "PSYCH3340"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Dr. Rudy is an unfair grader if you have a medical emergency. She has the authority to give you the chance to earn full credit, but she won't. I missed a midterm due to an anaphylactic reaction, and she let me take it at half credit. Even if I got a 100% I would have failed. She's albeist and quite frankly rude. Lots of busywork in the course.",
        "course": "PSYCH3331"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lots of presentations and projects, but no exams! She's an amazing lecturer and you can tell she really wants to help us. Attendance is definitely a must though or you won't do well. She's a pretty generous grader and is generally very understanding. Worth noting: she handled the COVID-19 situation amazingly and was very clear &amp; open about changes.",
        "course": "PSYCH3331H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Shes definitely one of the best lecturers Ive ever had. She makes you really want to engage with the material and it is insanely easy to get an A. Youll hate her if youre the type to not show up to class since its mostly designed around participation and in-class work. Ive taken other courses she teaches and I very strong recommend them too.",
        "course": "PSYCH3551"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Rudy is the best professor I have come across. Her lectures are heavy and she doesn't post lecture slides or study guides for the exams. She gives extra credit opportunities if you have an idea for one. She also has some pop quizzes now and then which are quite easy, frankly but be ready to attend all the lectures. I personally love her.",
        "course": "PSYCH3331"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "took psych 2367.02 and she made it entirely too difficult. tough grader on all papers. participation AND attendance affect your grade, so skipping class hurts you twice. not worth it for a second year english class. the final is with other sections. she didnt prepare well for it.",
        "course": "PSYCH2367"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "Lots of papers, super picky grader. Midterm was too hard for a GE. Didn't seem to be too happy when lots of questions asked",
        "course": "PSYCH2307"
      }
    ],
    "SEI": [
      {
        "Subject": "PSYCH",
        "Catalog": "7187",
        "Class Name": "Introduction to Clinical Practice",
        "Class Number": "18874",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3331H",
        "Class Name": "Abnormal Psychology",
        "Class Number": "35131",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.85"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3340",
        "Class Name": "Introduction to Life Span Developmental Psychology",
        "Class Number": "34442",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "65",
        "Rating": "4.48"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3340H",
        "Class Name": "Introduction to Life Span Developmental Psychology",
        "Class Number": "35130",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.88"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "4555",
        "Class Name": "Adolescent Sexuality",
        "Class Number": "19231",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "51",
        "Rating": "4.78"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3331",
        "Class Name": "Abnormal Psychology",
        "Class Number": "29353",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "72",
        "Rating": "4.46"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3340",
        "Class Name": "Introduction to Life Span Developmental Psychology",
        "Class Number": "29303",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "100",
        "Rating": "4.62"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3551",
        "Class Name": "Psychology of Adolescence",
        "Class Number": "29285",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "101",
        "Rating": "4.11"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "N/A",
        "Class Name": "Abnormal Psychology",
        "Class Number": "23635",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.93"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3340",
        "Class Name": "Introduction to Life Span Developmental Psychology",
        "Class Number": "35584",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "78",
        "Rating": "4.55"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3550",
        "Class Name": "Psychology of Childhood",
        "Class Number": "23637",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "81",
        "Rating": "4.31"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "4555",
        "Class Name": "Adolescent Sexuality",
        "Class Number": "17255",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "66",
        "Rating": "4.59"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "N/A",
        "Class Name": "Abnormal Psychology",
        "Class Number": "16473",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.92"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3550",
        "Class Name": "Psychology of Childhood",
        "Class Number": "33973",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "69",
        "Rating": "4.49"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "3551",
        "Class Name": "Psychology of Adolescence",
        "Class Number": "34577",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "111",
        "Rating": "4.52"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "5684",
        "Class Name": "Psychology of Delinquency",
        "Class Number": "35336",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "5"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "7187",
        "Class Name": "Introduction to Clinical Practice",
        "Class Number": "24138",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "7188",
        "Class Name": "Practicum in Clinical Psychology",
        "Class Number": "27931",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "PSYCH",
        "Catalog": "7188",
        "Class Name": "Practicum in Clinical Psychology",
        "Class Number": "22335",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Psychology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Physiology",
    "firstName": "Jidong",
    "id": "VGVhY2hlci0yNjkwMDgw",
    "lastName": "Fu",
    "legacyId": 2690080,
    "numRatings": 1,
    "summary_comment": "Dr. Fu was an excellent lecturer, effectively covering exam material and including questions to ensure student understanding. He focused on making sure all students grasped essential concepts while also providing additional depth for those interested in pursuing advanced studies in medicine.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Fu was a great lecturer. He covered what would be on the exam well, and had questions throughout to ensure each student understood his points. He wanted his students to understand what was important, but also expanded on his teachings to better students who want to go into the medical field.",
        "course": "PHYSIO3200"
      }
    ],
    "SEI": [
      {
        "Subject": "MCDBIO",
        "Catalog": "7890",
        "Class Name": "Seminar in Molecular, Cellular, and Developmental Biology",
        "Class Number": "21411",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "20",
        "Rating": "4.55"
      },
      {
        "Subject": "MCDBIO",
        "Catalog": "7891",
        "Class Name": "Presentation in Molecular, Cellular, and Developmental Biology Seminar",
        "Class Number": "21412",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "7",
        "Rating": "4"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2227",
        "Term": "AU 20",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "238",
        "Rating": "4.4"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2364",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "239",
        "Rating": "4.39"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2194",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "235",
        "Rating": "4.18"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2369",
        "Term": "SP 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "207",
        "Rating": "3.83"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2335",
        "Term": "AU 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "222",
        "Rating": "4.16"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2318",
        "Term": "AU 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "238",
        "Rating": "4.17"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Physiology",
    "firstName": "Megan",
    "id": "VGVhY2hlci0yNDczMjI5",
    "lastName": "Ackermann",
    "legacyId": 2473229,
    "numRatings": 1,
    "summary_comment": "Dr. Ackermann is highly accessible and serves as the course director for Physio 3200, though her lectures on the material can be枯燥无味。然而，只要学生出席课堂，她会提供重要的考试复习反馈。",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Ackermann is extremely accessible and is the course director for Physio 3200. The material she lectures over is pretty boring but if you go to class she gives you feedback on what is important for exams.",
        "course": "PHYSIO3200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 2.5,
    "department": "Physiology",
    "firstName": "Loren",
    "id": "VGVhY2hlci0yNDczMjMz",
    "lastName": "Wold",
    "legacyId": 2473233,
    "numRatings": 2,
    "summary_comment": "Dr. Wold's teaching quality varies widely among students; while some find him friendly and engaging, others criticize him as arrogant and lacking practical knowledge, advising against taking his courses.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Arrogant, egotistical, and a total lack of real world knowledge. The total cliche of a college professor lives in Dr. Wold. Do not take a course by this guy.",
        "course": "PHYSIO3200"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Wold is one of my favorite lecturers for Physio 3200. His material is kind of complicated but he is friendly, approachable and makes lecture more interesting. Go to class because he will tell you what's important to know for the exam!",
        "course": "PHYSIO3200"
      }
    ],
    "SEI": [
      {
        "Subject": "BIOMSCI",
        "Catalog": "2900H",
        "Class Name": "Biomedical Science Laboratory Techniques",
        "Class Number": "2794",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "Biomedical Education & Anatomy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.92"
      },
      {
        "Subject": "BIOMSCI",
        "Catalog": "N/A",
        "Class Name": "Biomedical Science Laboratory Techniques",
        "Class Number": "2799",
        "Term": "SP 22",
        "College": "The College of Medicine",
        "Department": "Biomedical Education & Anatomy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.42"
      },
      {
        "Subject": "BIOMSCI",
        "Catalog": "2900H",
        "Class Name": "Biomedical Science Laboratory Techniques",
        "Class Number": "2786",
        "Term": "SP 23",
        "College": "The College of Medicine",
        "Department": "Biomedical Education & Anatomy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4"
      },
      {
        "Subject": "BIOMSCI",
        "Catalog": "2900H",
        "Class Name": "Biomedical Science Laboratory Techniques",
        "Class Number": "2736",
        "Term": "SP 24",
        "College": "The College of Medicine",
        "Department": "Biomedical Education & Anatomy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.63"
      }
    ]
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4.5,
    "department": "Physiology",
    "firstName": "Mark",
    "id": "VGVhY2hlci0xOTI3OTI3",
    "lastName": "Ziolo",
    "legacyId": 1927927,
    "numRatings": 12,
    "summary_comment": "Dr. Ziolo is highly regarded for his engaging and humorous teaching style, which significantly enhances the learning experience. Students appreciate his clear explanations, passion for the subject, and ability to make complex material accessible. His approachable nature and light-hearted attitude contribute to a positive classroom environment, though some note that the class can be challenging at times.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "I don't know how many more lectures I can sit through listening to this man whose sense of humor is just making fun of his ex-wife.",
        "course": "PHYSIO3200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "So funny! I actually enjoyed his lectures because of his jokes. Best professor of the course!",
        "course": "PHYSIO3200"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "very attention-grabbing, funny, does not read directly off slides. seriously knows what he's talking about and can tell he's passionate ",
        "course": "PHYSIO3200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "AMAZING DUDE! SO funny and the best physio professor by far this semester :) WE LOVE YOU ",
        "course": "3200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Dr. Ziolo for physio 3200 and now I have him for physio 3203, the lab. I absolutely love him. He is super chill and really has a light hearted attitude. You have one assignment outside of class and everything else is done in class. Labs don't take the whole time and it Is really interesting. Wish I could have him for more classes.",
        "course": "PHYSIO3200"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Ziolo is by far my favorite professor in the course series. He explains course content really well and is clear about what material will be covered on the exam. His jokes and delivery make the class more enjoyable.",
        "course": "PHYSIO3200"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy is the best professor so far in phys 3200. He's the only one that clearly explains the material, and was real with you when you asked if you needed to know certain topics or details. He was very funny and his lectures were fun. I hate this class, but I genuinely loved this prof.",
        "course": "PHYSIO3200"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "Approachable and funny. Homework can be done in a day. Gives extra credit so be sure to show up to class. Of course the class is taught by several professors, but as long as you study consistently you will be fine.",
        "course": "PHYSIO3200"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Different professors for the entire course is disorienting because by the time I figured out their teaching style, there was a new one. Overall the course had good information and with studying (10-15 hours per exam) I scored over 100% in the class. If you put in the work, you can get an A.  Ziolo wasn't always there for office hours though. ",
        "course": "PHYSIO3200"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "9 different professors, all of them are boring, every lecture is a power point that has over 30 slides (so you have to study sometimes over 300 slides for an exam), doesn't give extra credit cause he says that class is too big which makes no sense,only 5 exams for the class, don't take this class,Why give a new prof almost every week?",
        "course": "3200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "I LOVE THIS GUY!!!",
        "course": "ENG3U1"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class has 9 different professors for one semester. Dr. Ziolo is the best, by far. He only teaches the cardiovascular system for a total of 10 lectures, but he makes lecture interesting and teaches you exactly what you need to know. The material and tests are tough,  but fair (which can't always be said for the rest of the class).",
        "course": "3200"
      }
    ],
    "SEI": [
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2227",
        "Term": "AU 20",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "239",
        "Rating": "4.57"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2364",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "164",
        "Rating": "4.59"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "8101",
        "Class Name": "Advanced Cardiac Physiology",
        "Class Number": "2365",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2194",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "235",
        "Rating": "4.47"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2369",
        "Term": "SP 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "205",
        "Rating": "4.5"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2335",
        "Term": "AU 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "222",
        "Rating": "4.71"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3203",
        "Class Name": "Human Physiology Laboratory",
        "Class Number": "36653",
        "Term": "AU 22",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.78"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2359",
        "Term": "SP 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "240",
        "Rating": "4.72"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3203",
        "Class Name": "Human Physiology Laboratory",
        "Class Number": "36019",
        "Term": "SP 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "40",
        "Rating": "4.65"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "8101",
        "Class Name": "Advanced Cardiac Physiology",
        "Class Number": "2360",
        "Term": "SP 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.33"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2318",
        "Term": "AU 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "238",
        "Rating": "4.68"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3203",
        "Class Name": "Human Physiology Laboratory",
        "Class Number": "3500",
        "Term": "AU 23",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "57",
        "Rating": "4.8"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3200",
        "Class Name": "Human Physiology",
        "Class Number": "2323",
        "Term": "SP 24",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "243",
        "Rating": "4.64"
      },
      {
        "Subject": "PHYSIO",
        "Catalog": "3203",
        "Class Name": "Human Physiology Laboratory",
        "Class Number": "3435",
        "Term": "SP 24",
        "College": "The College of Medicine",
        "Department": "Physiology and Cell Biology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "52",
        "Rating": "4.81"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.6,
    "department": "Physiology",
    "firstName": "Carmen",
    "id": "VGVhY2hlci0yNTg5MjA4",
    "lastName": "Swain",
    "legacyId": 2589208,
    "numRatings": 11,
    "summary_comment": "Professor Carmen Swain is highly regarded for her passionate teaching style and engaging material, making the class particularly appealing to students interested in health and fitness. While some find the lectures and class content easy, the overall consensus is that consistent engagement with the assigned readings and discussions leads to success. Students appreciate her responsiveness and willingness to provide additional support outside of coursework.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class, but the lectures are boring.",
        "course": "KNHES2995"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really enjoyed this course with her! weekly discussion posts. weekly quizzes on articles she assigns, not hard though! Exams were timed and you couldn't change answer once selected and couldn't even skip questions and go back. You will be okay if you read all of the articles and watch all of her lectures. I personally did not and still did fine. ",
        "course": "KNHES2995"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Should be an easy A! This class was interesting though, especially as an exercise science major. Expect about 3 assignments / week. Can't wait to have her in the future. ",
        "course": "KNHES2995"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "easiest class i have ever taken.",
        "course": "KNHES2995"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I'm so glad I signed up for this class! I think all students should take this before graduating. Dr Swain is passionate and cares about students.",
        "course": "KNHES2990"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "The best professor at Ohio State. She responds quickly to questions. She provides help above and beyond coursework. She often gives outside experiences that can help you gain experience. I loved her class and her passion!",
        "course": "KNHES5685"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class with Carmen Swain! I took it online. The content is all health-related and very interesting. If you enjoy fitness or want to know more, definitely take this class. It should be an Easy A if you do the work.",
        "course": "KNHES2990"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Passionate professor who loves what she teaches. Interesting material, easy assignments and exams.",
        "course": "KNHES2990"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I have had. I genuinely enjoy this class and it gives you a lot of info to apply to your health I feel like this should be required to graduate. Do the work and stay on top of lectures and you will get an A. She grades easy on assignments as long as they are completed and turned in on time. Would take another class w her.",
        "course": "KNHES2290"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor! Tests are pretty easy. If you take good notes and review them, its an easy course!",
        "course": "KNHES5685"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Swain is very passionate and will take yearsss to get through lectures. She says she only cares about big picture ideas, but her tests often include specific numbers and percentages. Really try hard to study for exams because they are worth a very large amount. She tests over material that she talks about in class but that aren't on the notes",
        "course": "KNHES5500"
      }
    ],
    "SEI": [
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "33451",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "31",
        "Rating": "4.8"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "36081",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "L",
        "Responses": "14",
        "Rating": "4.69"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "36119",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "L",
        "Responses": "17",
        "Rating": "4.53"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5500",
        "Class Name": "Science of Physical Activity for Health Care Professionals",
        "Class Number": "13329",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.86"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5685",
        "Class Name": "Adult Exercise Programming-Implementation",
        "Class Number": "13477",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "88",
        "Rating": "4.76"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "33920",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "44",
        "Rating": "4.74"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "35676",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "L",
        "Responses": "8",
        "Rating": "4.25"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "35748",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "L",
        "Responses": "13",
        "Rating": "4.62"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5500",
        "Class Name": "Science of Physical Activity for Health Care Professionals",
        "Class Number": "7579",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "55",
        "Rating": "4.73"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "33400",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.63"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5500",
        "Class Name": "Science of Physical Activity for Health Care Professionals",
        "Class Number": "33158",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "31",
        "Rating": "4.63"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5685",
        "Class Name": "Adult Exercise Programming-Implementation",
        "Class Number": "32570",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "94",
        "Rating": "4.87"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "34074",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "49",
        "Rating": "4.82"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "34266",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "L",
        "Responses": "8",
        "Rating": "4.38"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "34278",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "L",
        "Responses": "12",
        "Rating": "4.45"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5500",
        "Class Name": "Science of Physical Activity for Health Care Professionals",
        "Class Number": "32932",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "59",
        "Rating": "4.58"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "14565",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "L",
        "Responses": "17",
        "Rating": "4.71"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "36016",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "L",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "36148",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "49",
        "Rating": "4.85"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5500",
        "Class Name": "Science of Physical Activity for Health Care Professionals",
        "Class Number": "14552",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.54"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5685",
        "Class Name": "Adult Exercise Programming-Implementation",
        "Class Number": "14240",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "87",
        "Rating": "4.93"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "15106",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "43",
        "Rating": "4.65"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "15245",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "L",
        "Responses": "11",
        "Rating": "4.64"
      },
      {
        "Subject": "KNHES",
        "Catalog": "2990",
        "Class Name": "Movement is Medicine: Your Rx to Health",
        "Class Number": "15256",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "L",
        "Responses": "16",
        "Rating": "4.81"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5500",
        "Class Name": "Science of Physical Activity for Health Care Professionals",
        "Class Number": "14927",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "53",
        "Rating": "4.51"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5685",
        "Class Name": "Adult Exercise Programming-Implementation",
        "Class Number": "14627",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "113",
        "Rating": "4.9"
      },
      {
        "Subject": "KNHES",
        "Catalog": "5685",
        "Class Name": "Adult Exercise Programming-Implementation",
        "Class Number": "36969",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Physiology",
    "firstName": "Anasuya",
    "id": "VGVhY2hlci0yMzEzMTkw",
    "lastName": "Sarkar",
    "legacyId": 2313190,
    "numRatings": 1,
    "summary_comment": "Dr. Sarkar excels in teaching with a strong focus on student success, initially appearing tough but genuinely caring and supportive. She invests in helping students develop essential study skills and consistently looks out for their best interests, making her a highly effective and approachable instructor.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Sarkar is the course director for this class. She comes off at first as a tough cookie, but she genuinely cares about students success and is willing to help you develop the study skills needed to do well in the course. She is looking out for your best interest, and if you seek her out, you will not regret it. Wonderful lady!",
        "course": "PHYSIO3200"
      }
    ],
    "SEI": [
      {
        "Subject": "BSGP",
        "Catalog": "7070",
        "Class Name": "Fundamentals of Grant Writing",
        "Class Number": "1174",
        "Term": "AU 20",
        "College": "The College of Medicine",
        "Department": "School of Biomedical Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "8",
        "Rating": "4.71"
      },
      {
        "Subject": "BSGP",
        "Catalog": "7070",
        "Class Name": "Fundamentals of Grant Writing",
        "Class Number": "33703",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "School of Biomedical Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "BSGP",
        "Catalog": "7070",
        "Class Name": "Fundamentals of Grant Writing",
        "Class Number": "3286",
        "Term": "AU 22",
        "College": "The College of Medicine",
        "Department": "School of Biomedical Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "6",
        "Rating": "4.6"
      },
      {
        "Subject": "BSGP",
        "Catalog": "7070",
        "Class Name": "Fundamentals of Grant Writing",
        "Class Number": "3250",
        "Term": "AU 23",
        "College": "The College of Medicine",
        "Department": "School of Biomedical Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "9",
        "Rating": "4.75"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "27147",
        "Term": "AU 20",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "35",
        "Rating": "4.24"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "15795",
        "Term": "SP 21",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.17"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "10002",
        "Term": "AU 21",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "34",
        "Rating": "4"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "7451",
        "Term": "SP 22",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "49",
        "Rating": "3.92"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "14128",
        "Term": "AU 22",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "44",
        "Rating": "4.39"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "16525",
        "Term": "SP 23",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "55",
        "Rating": "4.35"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "17129",
        "Term": "AU 23",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "46",
        "Rating": "4.28"
      },
      {
        "Subject": "PHR",
        "Catalog": "3100",
        "Class Name": "Human Physiology and Disease",
        "Class Number": "17026",
        "Term": "SP 24",
        "College": "Pharmacy",
        "Department": "Pharmacy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "62",
        "Rating": "4.27"
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.8,
    "department": "Physiology",
    "firstName": "Lyn",
    "id": "VGVhY2hlci0xNjI2NTU5",
    "lastName": "Jakeman",
    "legacyId": 1626559,
    "numRatings": 2,
    "summary_comment": "The professor is highly regarded for her comprehensive and easily understandable slides and notes, making the class largely self-sufficient. She is described as an enthusiastic and supportive instructor who teaches straightforwardly, with fair exams, though attendance is not strictly necessary due to the detailed materials provided.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great Prof. Has very comprehensive and understandable  slides. The notes provided are so good class is not really necessary. I usually went but had to miss a good stretch for med school interviews. I highly recommend her and this class series over the EEOB physiology",
        "course": "PHYSIO3101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Jakeman is an enthusiastic professor who is willing to help.  She teaches very straightforward and you just have to fill out fill in the blank notes.  The midterm exam was fair and the information in the class isn't too difficult.",
        "course": "PHYS311"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Physiology",
    "firstName": "Laura",
    "id": "VGVhY2hlci0yMTkwNjQ1",
    "lastName": "Wallace",
    "legacyId": 2190645,
    "numRatings": 2,
    "summary_comment": "This professor is widely regarded as one of the best instructors, known for her thorough review sessions and genuine care for students' success. She effectively teaches complex material in an accessible manner and her passion for social psychology is evident, making her courses highly recommended.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's the best teacher I've had since middle school. She reviews a ton and actually cares about you and your grade. Three exams, easy if you study. A couple projects, automatic A if you do them on time and correctly. She's a cutie and I hope I get her for another class.",
        "course": "PSYCH3325"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professor I ever had.  The course material and her way of teaching is very pedagogic, and her genuine interest in social psychology easily rubs off. I highly recommend taking any of her classes.",
        "course": "PSYCH3325"
      }
    ],
    "SEI": []
  }
]