[
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.1,
    "department": "Public Policy",
    "firstName": "Stephane",
    "id": "VGVhY2hlci0xNzc5MzEz",
    "lastName": "Lavertu",
    "legacyId": 1779313,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I would highly recommend Stephane whether you're taking a higher or lower level class. He really makes the lectures interesting and engaging. You can tell hes very genuine and makes it very easy to participate. Definitely best quality is that he's understanding and approachable. Seriously can't stress that enough he wants to help.",
        "course": "PA4011"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "I did not enjoy having Stephane as a professor. He grades way too harshly for such a low level course and does not have clear grading criteria. The course was online but we had to schedule a time to take exams in person at the testing center, which is tough for people with tight schedules.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "IMO the online lectures are very hard to follow because he rambles a lot. Not very interesting either and very time consuming course.",
        "course": "PUBAFFRS2110"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "He turned a topic I didnt care the slightest about into something accessible and actually pretty interesting. You can tell he cares about making sure his students do well.",
        "course": "PUBAF2110"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is obviously very knowledgeable in his field and attempts to convey this knowledge onto his students. However, his grading criteria, especially for the papers, is not very clear. It is best to set up meetings with him or to go to office hours to really understand what he is looking for. He gives a test bank for exams.",
        "course": "PUBAFFRS2110"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Mr. Lavertu is a great teacher don't get me wrong but he is extremely difficult at grading and he doesn't cut you a break. The final exam questions are very tough to understand. He is a great teacher but I don't recommend him due to his extremely difficult grading style. Take someone else who is easier if you can.",
        "course": "PUBAF2110"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really loved Stephane! Such a great guy and presents dull information in an interesting way. 2110 is really easy and he makes an effort to know all of his students.",
        "course": "PUBAFFRS2110"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great professor - really passionate about making sure students know the information in addition to passing the class. He's understanding and reasonable about grading. If you show up on the review day, he'll pretty much tell you exactly what he wants you to say on the exam. ",
        "course": "PA2110"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is one of the most interesting professors I've ever had. He has made boring policy lessons, lectures that were some of my favorites for the year. Overall he is an outstanding professor and incredibly knowledgable on his subject.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Easily the best class and professor I've had so far. He is very engaging, extremely knowledgeable, and fair. I learned a lot and never had to stress out over anything in the class. ",
        "course": "PUBAFFRS2110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Stephane is the best! He is knowledgeable and very helpful. As long as you participate and study you will pass. He's not super easy but he's also not hard as long as you do the basic studying (nothing crazy)!",
        "course": "2110"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Tough grader wants more than what is needed. Tried really hard to only receive a B+ ",
        "course": "PUBAFFRS2110"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Stephane is easily the best professor I've ever had. He's fair, absolutely hilarious, and is always willing to help you out. Great person overall and great professor! His class is definitely difficult if you skip it because all material is covered in the lecture, and his lectures really aren't bad to sit through at all.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class! He is that rare type of professor that gets you excited about the material. It's clear he loves his subject and he's awesome about answering questions and interacting with the students. Take good notes and you'll do fine.",
        "course": "PA2110"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "Prof. Lavertu makes the class interesting. Make sure to take down all notes he writes on the board because that is basically his exam. Beware though that he's a tough grader. As long as you put thought into your work you should be fine. If you're ever stuck, go to office hours. He loves to help his students.",
        "course": "PA2110"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely loved this class. Stephane was extremely engaging and found the perfect mixture of between having fun in class and learning the material. He sometimes rambles, but it's an endearing sort of teaching that normally leads to some laughs.",
        "course": "PUBAF2110"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was great! Loved the class. He is very energetic and makes the topics interesting. Take his class!!",
        "course": "PUBAF2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.5,
    "department": "Public Policy",
    "firstName": "Noah",
    "id": "VGVhY2hlci0xODEyNDM0",
    "lastName": "Dormady",
    "legacyId": 1812434,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Dormady does a solid job teaching PUBAFRS 3000. The only homework is a policy brief every 2-3 weeks, which you can do with a partner. The exams are straightforward. He also offers lots of extra credit.",
        "course": "PUBAFRS3000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Professor Dormady is not accommodating to students at all throughout this pandemic. He refuses to post things on Carmen, and gives out papers in class, so if you are unable to attend, you dont get the materials needed. He gives assignment after assignment without telling you the grades of assignments youve already turned. Goes too fast in excel.",
        "course": "PUBAFFRS3000"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "One of the worst professors Ive ever had. I got put into quarantine for COVID &amp; he tried to force me to take the class pass/fail because I was in quarantine during a midterm. He wasnt willing to work with any students or accommodate &amp; his grading was super-specific. I would give him a negative rating if I could. Also called on men more than women",
        "course": "PUBAFRS3000"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Dormady really knows how to teach the class. It is enjoyed to take his course and his course is well-organized and easy to understand.",
        "course": "PUBAFRS3000"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you have to take this course virtually, post-pone it if you can. Noah Dormady clearly doesn't want to be a professor and his teaching reflects it. He knows the material and structure of the course is reasonable, but during the 2020 Pandemic he failed to meet the needs of his students while raising expectations. V.L. exacerbated the issue.",
        "course": "PUBAFRS3000"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of extra credit is offered so it is fairly easy to obtain a good grade. However, participation is important! As a shy person that doesn't enjoy speaking up in class, my grade suffered the most in that aspect. You can make it by without doing the assigned readings (but this does help during class discussions)",
        "course": "PUBAFF3000"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Dormady is awesome! He REALLY knows his stuff, and cares a lot about student success. If you pay attention and engage in lecture, you will be well prepared for exams, and will get a good grasp on applied policy analysis skills. There is also a generous amount of extra credit that makes an A in his class very achievable. Great class!",
        "course": "PUBAFRS3000"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Dormady truly cares about the subject matter and his students. The class is very lecture heavy so attendance is important. Will call out people who do not actively participate to ensure they are engaged. Lots of extra credit that drastically can improve your grade. I would take as many courses with Dr. Dormady as possible!!",
        "course": "PUBAFRS3000"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "You can tell that Dormady truly cares about this subject matter.  The class is tough, but if you did well in the prerequisite classes you should be fine. You must do the readings and take thorough notes if you really want to do well! Also, go to office hours and ask for help outside of class. Participation is key!",
        "course": "PUBAFFRS3000"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Lectures are very informative and it's easy to tell Professor Dormady cares about the subject matter. Offers to help outside of class via office hours and wants to make sure the students actually comprehend the class material. ",
        "course": "PUBAFRS3000"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very knowledgeable professor. Public Affairs 3000 is a tough course which provides a rigorous examination of policy analysis. The course material itself is challenging, but Noah demonstrates subtle arrogance, however he offers abundant extra credit and is helpful during office hours. You will learn a lot during this course.",
        "course": "PUBAFFRS3000"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "Tough class but he's a fair grader. Very formal delivery, well-prepared, and the lecture slides are posted online.",
        "course": "PUBAFF3000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.7,
    "department": "Public Policy",
    "firstName": "Aditi",
    "id": "VGVhY2hlci0yNDYyMjM5",
    "lastName": "Thapar",
    "legacyId": 2462239,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Aditi is a great instructor and cares about students' well-being. She made the process of writing a capstone very low-stress and was willing to take time outside of class for (lengthy) Zoom meetings with students to talk about capstones. She was a bit disorganized and chaotic, but I appreciated that she was flexible and empathetic.",
        "course": "PUBAFRS4011"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very passionate & sometimes overly passionate, but ultimately I respect her for being herself & making her class feel like a safe space. Graded mostly by tests & quizzes that are not difficult. Straightforward lectures with lots of examples from current events. Class discussions are fun. Aditi very clearly cares about her job & her students.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Aditi is a phenomenal instructor who clearly cares a lot about her students. She solicited midterm feedback and actually changed the structure of the course to reflect what we wanted. Despite the shift to online classes, she made capstone a lot less stressful. Her feedback is extremely detailed and helpful but it takes a while to get grades back.",
        "course": "PUBAFRS4011"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Aditi is a treasure. In class, she's very snarky and has a self-deprecatory sense of humor that tends to be a little too relatable. She cares deeply about each of her students and is there to help when life gets in the way of learning. Low-stress environment. Some students thought the class was a touch chaotic, but welcome to public policy honestly",
        "course": "PUBAFFRS2110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Aditi is the best teacher I've had! I switched to the public policy major because of her class. Straightforward lectures with lots of examples grounded in current events. Feedback on assignments was helpful. She was accessible outside class and willing to go the extra mile to help students! Offered a couple of extra credit opportunities.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Most of your grade is based on the tests",
        "course": "PUBAFRS2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Public Policy",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNjgyNjQw",
    "lastName": "Barbash",
    "legacyId": 2682640,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Barbash really cares about the subject matter of the course and is excited to share his knowledge. Semester-long work on analyzing the budget of an Ohio city with two long projects/papers. Lots of group work and case studies. Guest speakers were great.",
        "course": "PUBAFRS4030"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had Mr. Barbash for Public Budgeting, and I really enjoyed the class. The assignments consist of issues briefs, projects, and lecture quizzes. While the writing assignments are relatively intense and require research/time, the grading process was very fair and straightforward. Also, the assignments were interesting and useful. ",
        "course": "PUBAFRS4030"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof Barbash clearly cares a lot about his students. His projects and papers weren't hard, just a little time consuming, but he graded everything easily and if you tried you got a good grade. Would recommend.",
        "course": "PUBAFRS4030"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 3,
    "department": "Public Policy",
    "firstName": "Andrea",
    "id": "VGVhY2hlci0yNTc1MDcx",
    "lastName": "Headley",
    "legacyId": 2575071,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class was paper/ weekly assignment heavy. Feedback took to long to come out and pretty tough grading. I did enjoy the material and Dr. Headley as a person but could have been less rigid. I personally improved alot in my writing, expectations were clear.",
        "course": "PA3500"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "INCREDIBLY HARD grader. Makes assignments that should be easy both difficult and time consuming. Very large assignments with very short deadlines, plus little relevance to class work.",
        "course": "PA3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 3,
    "department": "Public Policy",
    "firstName": "Aiden",
    "id": "VGVhY2hlci0yNDcwMzI0",
    "lastName": "Irish",
    "legacyId": 2470324,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Aiden 's class was tough. However, he gives solid feedback on writing assignments and is accessible if more help is needed. My writing definitely improved throughout the semester and I got the hang of the assignments after the first few. He's energetic, but the class was pretty dry. Not the class for you if you want an easy A for the 2367 GE.",
        "course": "PUBAFRS2367"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "I worked my butt off for the grade I got in this class. He was extremely harsh when it came to grading, expected too much from his students, and made a GE feel like it was a class taken for a major. Do not take this if you are looking for an easy writing class. Only thing I learned from this class is how to put in 110% effort &amp; receive a bad grade.",
        "course": "PUBAFFAIRS2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Policy",
    "firstName": "Daniel",
    "id": "VGVhY2hlci0yNDE0MzQ1",
    "lastName": "Baker",
    "legacyId": 2414345,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Daniel is a phenomenal instructor. He provides invaluable feedback and will go the extra mile to make sure that you actually learn and develop your writing skills in his class. The classroom environment is incredible.",
        "course": "PUBAFRS2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Policy",
    "firstName": "William",
    "id": "VGVhY2hlci0yNDI5MjU4",
    "lastName": "Ashley",
    "legacyId": 2429258,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is very structured and I really liked that. You always know what you're supposed to do and exactly what is going on. Lots of writing assignments, but they're all short and you end up with a portfolio of writing samples at the end of the semester. A great professor and just an all-around great person.",
        "course": "PUBAFRS2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "William's lectures were organized extremely well and he was always very clear. The class is set up so that you end up with a portfolio of writing samples at the end of the class so it is a lot of writing. Overall, I loved this class and William as a professor. He's super cool and easy-going. A great teacher and class.",
        "course": "PUBAFRS2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Public Policy",
    "firstName": "Mark",
    "id": "VGVhY2hlci0zMDg2Mzg4",
    "lastName": "Gaspar",
    "legacyId": 3086388,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof G was very nice and definitely cared about the subject he was teaching. He left positive notes on each assignment. This class is simple if you do all the homework, which isn't hard. The rubrics are super clear. There are a lot of readings, but you only have to understand the main idea. I highly recommend this class to public affairs students. ",
        "course": "PUBAFRS5545"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 2.5,
    "department": "Public Policy",
    "firstName": "Caroline",
    "id": "VGVhY2hlci0xNzAwNzM5",
    "lastName": "Wagner",
    "legacyId": 1700739,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dropped the class in week 3. This woman was the reason I changed my specialization to something else for OSU's MPAL program. She isn't clear on assignments. Will re-grade but set the tone with you can get a lower grade than your initial grade if I do this. People averaged 60% on assignments. She complained about the complaints. Worst professor.",
        "course": "PUB7910"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very knowledgeable expert but inefficient teacher. Assignments are often shortly communicated and there's frequent course page errors. Class feels disjointed and surface level but a decent introduction to policy analysis and public speaking.",
        "course": "PUBAFR2367"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Horrible ",
        "course": "PA2130"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wagner is a bit eccentric and that's about the worst thing about her. She is a great professor that know their material and really cares. If you have to take this or any course she's the professor to go to. During the COVID19 virtual transition she was more than understanding, accommodating and helpful. A real gem.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Wagner's class is boring and her tests are hard in that they do not cover material from her lectures/presentations. Instead, she generates tests based off of 2 books that she barely bothers to refer to in any of her lectures. She is very unclear on expectations from assignments and grades very hard. Unnecessarily hard class but a qualified prof",
        "course": "PUBAFRS2130"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Caroline has more qualifications than any professor you'll meet. She genuinely cares about her students and will help out whenever she can. Lectures are long and boring but it's an easy A course and you'll learn real-life information.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Wagner is so awesome. She is brilliant, and she really cares about her students. She is also, however, a bit scatter-brained, and she has a tendency to be incredibly unclear about exactly what she wants on tests and in papers. But if you talk to her, she will work really hard to help you out. She sends a ton of email reminders too!",
        "course": "PUBAFRS2130"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Honestly, she's pretty middle-of -the-road. She's definitely passionate about her work and does a good job of getting students to think for themselves. I think a reason she may come across as unorganized or unclear is that the subject matter is all qualitative. This is a course on leadership theory, so don't expect hard and fast rules.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lectures are the longest 60 - 90 minutes of your life, all straight out of the driest book in the world. She is disorganized, unhelpful, and extremely inconsistent. Be very careful on your assignments. Study your book-- sometimes you literally should know it word for word.",
        "course": "2130"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Wagner is passionate about her work, and has extensive experience that is both impressive & helpful, especially if you are taking this class for the major. It wasn't my favorite PA class, but she grades pretty easily.  If the TA grades & you disagree w/ your grade, she will regrade.  She is unorganized though, but didn't effect my grade.",
        "course": "PA2130"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 1,
        "comment": "Extremely unorganized and repetitive. Attendance is mandatory but there really is no point in going to class. She seems genuinely interested in Leadership but is not great at teaching it. Does not reply to emails. Not clear on grading for class project. If you want to set up an appt with her outside of class, forget it. Does not reply to emails.",
        "course": "PA2130"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Long lecture format for class. Lecture slides are online, but readings from assigned books are also required. Class discussion can be interesting. Group projects towards the end of the year are more fun. Midterm and finals are info straight from class.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very unorganized. Seems extremely left of the road. Does not respond to emails.",
        "course": "PA2130"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 3,
        "comment": "Extremely unorganized. She is the worst professor I have had in my four years of college.",
        "course": "PA2130"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very confused, unhelpful, unresponsive and unpredictable professor. Avoid her class if you can. She is the worst.",
        "course": "PUB7910"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Has real world experience, good class",
        "course": "PUBAF678"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.9,
    "department": "Public Policy",
    "firstName": "Judith",
    "id": "VGVhY2hlci0yODY3Nzk0",
    "lastName": "Zimomra",
    "legacyId": 2867794,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I've had. She is very understanding and will grant extensions if needed. Participation is a big part of the class and papers are a big part of the grade. This class challenged me in a good way. I am a better writer and public speaker because of Professor Zimomra.",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Zimomra's Capstone course was my favorite class I took at OSU. The class isn't easy, but I learned more from it than most of my undergrad classes combined. She is extremely knowledgeable & passionate about Public Affairs & gave amazing personalized feedback. The writing/research skills I learned from her course have helped me a ton in my career",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Zimomra was amazing!",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was excellent. Great lectures, with the requirement of student engagement in just about each class. Thought provoking assignments that may take time, but she offers great feedback and allows you to submit until you get the grade you want. No quizzes/test. Very accessible outside of class. Truly wants you to succeed both in her course and life.",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "This course had nine writing assignments throughout the semester, some short and some long. Each class had a group exercise. Prof gives good feedback if things are turned in early and gives you the option to revise each assignment after grading has been released. ",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Instructor Zimomra was one of the best professors I have had at OSU. She is dedicated to helping all of her students, and while the class is writing-heavy, she is lenient on assignment dates, gives you class time to work on papers, is very clear with instructions, and reviews your drafts with you to ensure you get a good grade. ",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Zimomra does everything in her power to make sure that you get an A as long as you put the effort in. She makes herself available to give feedback on every single assignment and is constantly giving advice for improvement on your communication skills. Although she can come off as intimidating, she is an incredible and caring professor!",
        "course": "PUBAFRS-2367"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Professor Zimomra for Public Affairs 2367 and she was awesome. Very experienced in the public sector and acts like a coach when giving you advice on how to improve your communication skills. The class was not too difficult and even though attendance was a big part of the grade the lectures were always engaging. ",
        "course": "PUBAFRS-2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.7,
    "department": "Public Policy",
    "firstName": "Edward",
    "id": "VGVhY2hlci0yMjk0MjU2",
    "lastName": "Hill",
    "legacyId": 2294256,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Weekly paper due, lectures with posted slideshows every day for class, attendance is graded, exams aren't hard but will affect your grade a lot. ",
        "course": "PUBAFRS2110"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "If you are taking this class I would take it with another professor, I've heard the other professor usually has higher grade averages for the tests. He is super knowledgeable but lectures are dense and he goes on tangents a lot. Tests are in person and pretty specific so you have to study a lot. Homeworks saved my grade.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Even though the class is 3 credit hours you're basically hearing these same discussion points 5 hours of the week. Regularly goes over time and goes off into specific tangents that are literally no help. I found myself almost waiting for class to end all the time and zoning out. Quizzes were pretty specific so it required full attention though :/",
        "course": "PUBAFRS2110"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "I took this class hybrid with lectures online and in-person recitation. The recitation was fine, but the lectures were the absolute worst. They supposed to be about an hour-long but almost all of them ended up being at least two. He doesn't really stay on topic and he talks so incredibly slow that even putting it on 2x speed is still too slow.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "I took this class AU20 and it was SO disorganized. Long lectures were posted late many times, which was disrespectful to my time. I don't feel that I got much out of this class. I am super grateful for the TA helping us out. Hopefully this class will be better online in the future because the lectures are recorded now.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Despite his clear enthusiasm for what he is teaching, I dreaded coming to his class every week. There are no projects or papers- the only grades you will receive are for attendance, lecture summaries, and exams. Unless you are a public affairs major and are required to take this course, do yourself a favor and don't. Huge waste of time.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Really gets into the topics but I feel like sometimes he forgets that it is just an intro class and will use very specific and detail oriented examples that only the mayor of the city he is talking about would even kind of understand what he is referencing",
        "course": "PUBAFRS2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.7,
    "department": "Public Policy",
    "firstName": "Joseph",
    "id": "VGVhY2hlci0yNDI5Mjgw",
    "lastName": "Henry",
    "legacyId": 2429280,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "So many homework",
        "course": "PUBAFFRS2120"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Joe was not a terrible professor. The class was not too hard but there are three papers, which he can be nitpicky about. Also, he has everything due by the time class starts instead of 11:59pm, which is kind of annoying. However, everything else in the class is easy. Quizzes were online and had unlimited attempts. I got over 100% on the exams.",
        "course": "PA2120"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good professor. Cares and puts a lot of effort into teaching.",
        "course": "PA2120"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Joe was a great professor. He really cared about his students and put lots of effort into his class. He make sure to mix it up so it was not 90 min of lecture. Readings were not bad and the workload was reasonable. BIG fan of Joe and his dry wit.",
        "course": "PA2120"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "First zoom class I took that required cameras on and attendance, but I truly enjoyed lecture. I dont think Ive ever gotten more out of a course (and Im a senior). Definitely recommend taking a class with Joe, he has such clear expectations and wants you to succeed (and gives you everything you need to do so)",
        "course": "PUBAFRS2110"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Okay prof but you can tell he's full of himself. Puts a lot of weight on the class so if you're not super passionate about public affairs it might give you the ick. Annoying grading because he focuses so much on writing instead of content. Made us keep cameras on in lecture for attendance, very annoying. It's literally the bottom of all PA classes.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Public Affairs 2110 was one of the most flexible and enjoyable classes I had this semester. Professor Henry was very flexible with all of the extenuating circumstances with COVID/the basic difficulties of online learning. There are 3 tests, extremely fair with very helpful study guides. There are also weekly current events reflections. Great class!",
        "course": "PA2110"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "Grades harder for 2000 level courses than any of my higher level classes. If you care about your GPA beware.",
        "course": "PA2120"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "The content of the class was very interesting but the professor was extremely boring. If you missed your coffee one morning don't bother coming because you will fall asleep. He's pretty young and tries to make the class fun but his extreme monotone demeanor makes it hard to focus. My advice? Come prepared, read the books and lectures beforehand",
        "course": "PUBAFFRS2120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Public Policy",
    "firstName": "Desiree",
    "id": "VGVhY2hlci0yOTIyMTU3",
    "lastName": "Tims",
    "legacyId": 2922157,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "If you want an easyish grader and resume booster, then take this class. But you will be dealing with an uncommunicative professor that will not respect your time/work. You will work on assignments and never get feedback/know if they were actually used. The structure sucks and you will feel like you worked hard for nothing after the semester ends.",
        "course": "WGSST3385"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took WGSST 3385, which is an internship course taught by women in legislature.  Prof Tims is one of the most UNCOMMUNICATIVE professors I've ever had--she doesn't clearly outline her grading criteria, yet grades harshly on small things such as formatting.  She is difficult to contact outside of class, and hostile to clarification questions.",
        "course": "WGSST3385"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.9,
    "department": "Public Policy",
    "firstName": "Timothy",
    "id": "VGVhY2hlci0yNjI1MTQ0",
    "lastName": "Jaquet",
    "legacyId": 2625144,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "He was fine, but doing well was honestly hard. I had a bad group for one project and he wasn't really willing to consider that, and there were very few opportunities to gain points. The class content sort of felt messy and all over the place. He was very nice and I chatted with him outside of class a couple of times, just a tough grader.",
        "course": "AEDE2580"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Tim is a good professor but an absolutely horrible grader. He is very judgmental of the way students word their papers and will often deduct points for very small errors. When asking for help, he can be very unclear about what you need to do and often says things that are not helpful at all. He has a very high ego and has his favorites. Sus assess",
        "course": "AEDE2580"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Tim is very passionate about both the material and the current events surrounding the material. Due to the mask mandate being lifted and some minor friction surround immunocompromised students, the class was online after spring break. Tim got right back with the material after just 1 lecture. He did cancel around 5 classes throughout the semester.",
        "course": "AEDE2580"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Had Tim for 2 classes and thoroughly enjoyed his classes. Content can be hard but I went to office hours and he was willing to help and listen to the class. Overall would take another class with him again.",
        "course": "AEDE3103"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Jaquet was clearly passionate about the subject and teaching, but definitely inexperienced. His lectures were confusing and he often assumed we knew more than we did. He was willing to help and offer feedback, and he graded pretty fairly, but compared to the rest of the Glenn College, not sure he stacked up.",
        "course": "PA3000"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not a bad guy but definitely not up to par with the other public affairs professors I've had. He acts as though most topics are common knowledge and doesn't give many explanations. Expectations for assignments were unclear and deadlines got moved around a lot which made things more confusing. Also seemed unsure about the material at times.",
        "course": "PA3000"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "First of all, he seems like a really nice person and interested in the topic. However, hes the kind of professor who is so deep into his own knowledge that he fails to understand students are not at his level. So many topics are breezed through as if we are taking a review course, not actively learning for the first time.",
        "course": "PUBAFRS3000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.3,
    "department": "Public Policy",
    "firstName": "Kim",
    "id": "VGVhY2hlci0yMzMwOTU3",
    "lastName": "Young",
    "legacyId": 2330957,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best professor I have ever had. Although some content is difficult, she will do anything to help you understand. Take a class with Dr. Young if you can, you wont regret it",
        "course": "PUBAFRS4310"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved Dr. Young. The class is lots of reading/lectures, but she's clear in lectures and offers multiple ways to learn. Even while asynchronous, there was lots of practice before exams, and she holds tons of study sessions. She offers decent amounts of extra credit that are largely effort-based. The tests and quizzes are a time crunch for sure.",
        "course": "PA4310"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "State and Local Gov Finance can be difficult. You definitely need to take good notes and study for the tests. The lectures can also be sometimes boring. However, she is a great teacher who cares a lot about the subject and about her students. She is great to talk to in Office Hours and knows what she is talking about. Also great with extra credit!",
        "course": "PA4310"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Online class is horrible. You have two assignments due every week in addition to an insane amount of lecture. She made three assignments due Thanksgiving and the week of finals, which was one day later.",
        "course": "PUBAFF6030"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I can't say enough good things about Dr. Young. She is so funny and sweet and understanding but also commands so much respect, and has so much knowledge. She did her PhD here, and really cares about her students and the college. She is fantastic, doesn't show her political leaning, and knows how to teach well, even if you don't understand econ.",
        "course": "PA4310"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Young is the best professor I've had so far in the Glenn College. She works hard to connect what we're learning in class to real life. The lessons are very straight forward, and if you go to class it's not difficult to predict what will be on tests. On top of that, she offers a ton of extra credit!",
        "course": "PUBAFRS4310"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2.5,
    "department": "Public Policy",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci0yOTYwNjI2",
    "lastName": "Kemper",
    "legacyId": 2960626,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Kemper was a solid. Open Note Take Home Exams (3) (13 question max), I believe the other sections take theirs in person closed note. There is an attendance policy but she is just going to read the slides. Lot's of group work. One page paper reflection on current event each week. One project not bad at all. Scored out of 100 (Exams 60).",
        "course": "PUBAFRS2110"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "Professor Kemper is really nice but has boring lectures and talks super fast. She's a slide reader that sometimes adds side comments that can be confusing and terminology-heavy. There are weekly reflections, 3 open-note take-home exams, a mini project, and 3 extra-credit opportunities. Minimal effort to get to know students and lots of group work. ",
        "course": "PUBAFRS2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Public Policy",
    "firstName": "Whitney",
    "id": "VGVhY2hlci0yNzYwODg0",
    "lastName": "Brown",
    "legacyId": 2760884,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Whitney is one of the sweetest professors I've ever had. Homework in the class was very minimal and can be completed early on, so I finished classwork in early November. She was super helpful in scheduling and always answers my questions promptly!",
        "course": "PUBAFRS1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had this professor for my survey class and it was a very easy class. The professor was energetic, spent time talking about what we needed to know, and definitely cared about all of her students.",
        "course": "PUBAFRS1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Public Policy",
    "firstName": "Esra",
    "id": "VGVhY2hlci0zMDgzOTA2",
    "lastName": "Gules-Guctas",
    "legacyId": 3083906,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very easy class took it to fulfill  the citizenship for a just world GE",
        "course": "36224"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.7,
    "department": "Public Policy",
    "firstName": "Megan",
    "id": "VGVhY2hlci0yNDE2Mjc4",
    "lastName": "Lepere-Schloop",
    "legacyId": 2416278,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Lepere-Schloop is well respected by all her students. She cares about students' mental health and is very understanding. A large grade in the class comes from a semester-long, three-part paper that can be added to a professional portfolio. Every assignment in this class feels meaningful to the class and our professional careers. ",
        "course": "PUBAFFRS3500"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved Dr. LePere-Schloop! The class is build-your-own, so you can focus on the topic you like. There are three big papers, but each builds on the other, and then a large cumulative project you work on throughout the semester. You have to do the readings because there are weekly reflection papers on the material. Great professor!",
        "course": "PUBAFFRS3500"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Lots of reading due before the first class every week and a reflection paper that is graded way too harshly. She does want you to do well and cares about her students, but not an easy A. Lectures are boring.",
        "course": "PUBAFFRS3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 1.8,
    "department": "Public Policy",
    "firstName": "Kip",
    "id": "VGVhY2hlci0yNzY5NDM0",
    "lastName": "Holley",
    "legacyId": 2769434,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Had Kip for 2120 last year. Definitely does not deserve all the 1star reviews!! I will admit, his lectures were kinda monotonous, but the class concepts were interesting. However, Kip is a really chill guy, not overly professional/pretentious like some ppl in academia, which is awesome. For ex, tells us to call him Kip.",
        "course": "2120"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Kip was late to class half of the time. He says he does not come from an educational background which really becomes pretty obvious as the semester goes on lol. Kip is the worst prof I've had in my college career and I've went to two schools.",
        "course": "2120"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Be aware, most boring class I have ever taken.",
        "course": "2120"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "I had Kip for Public Affairs and his lectures are so boring, to the point where only 5 kids in the class are actually paying attention. The whole class is graded by 100 points which sucks. He also doesn't even grade any of the work that we do in class he has someone else do it for him. I would not take him class royal was essential in his class.",
        "course": "2120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Public Policy",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0yMTgxOTA4",
    "lastName": "Gajary",
    "legacyId": 2181908,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I LOVED Lisa! She was so caring and so nice. You can tell she loves her job and loves to help students. She lays the class out very clearly, gives you a lot of assignments and quizzes (all online though) and gives A TON of extra credit! She responds quickly to emails & even offered to call me on the phone to help me with a paper. I HIGHLY recommend",
        "course": "PUBAFRS2110"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hands down the best teacher I've had at OSU. She gives extra credit options almost weekly and she provides not only constructive criticism but is really encouraging with positive feedback as well. Pay attention to weekly assignments and you'll ace the exams! She brings in really interesting guest speakers too. TAKE HER CLASS.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lisa's class isn't the most interesting class I've taken. However, the class is very easy. The exams and assignments are very straightforward and she cares more about making sure students understand the concepts then about grades. She was always very sweet and willing to help and emailed back quickly. Such a wonderful woman!",
        "course": "PUBAFRS2110"
      }
    ],
    "SEI": []
  }
]