[
  {
    "avgDifficulty": 3.6,
    "avgRating": 2,
    "department": "Public Policy & Administration",
    "firstName": "Russell",
    "id": "VGVhY2hlci0yNjkyMTYw",
    "lastName": "Hassan",
    "legacyId": 2692160,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "You meet once a week, and the lecture is 2 hours long, so it can be hard to focus. He covers a lot, so preparing for exams and quizzes can be hard. There are weekly discussion posts based on the material for that week and three papers. The exams are worth 60% of your grade. It can be hard to prepare for his class, but I finished with an A. ",
        "course": "PUBAFRS2130"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Good Professor, poor course. Weekly discussion post with 3 film analysis papers.  Lectures are way too long and boring. You are never sure what is actually covered on each quiz (5). Midterm / Final aren't super difficult, but they make or break your grade. Harshly graded discussion post by grader. Few assignments. Doesn't follow syllabus grading. ",
        "course": "PUBAFRS2130"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "I was excited to take this class but honestly, Dr. Hassan made me not like it. He was disorganized and seemed like he hated teaching the class. All of his powerpoints still had the Cengage logo on them. All the powerpoints he took from a publisher and just read them out loud. He did not teach he read from a PowerPoint.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class had zero organization or direction. There were slides but were loosely used and were all stuff I already knew (things like &quot;what makes a good leader&quot; or &quot;diversity&quot;). Questions were hyper-specific and annoying on tests, it's so easy to get a 70 on all of them. The final project is stupid and the prof gives zero help through the semester.",
        "course": "PUBAFRS2130"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Prof seems wholesome, but this simply was not a good class. The lectures were disorganized, boring, and hard to engage with. Despite doing a lot of busy work, I didn't feel like I learned anything. The last straw was when we received virtually no guidance for the group project at the end of the semester and we got no feedback (no group got a 100).",
        "course": "PUBAFRS2130"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Public Policy & Administration",
    "firstName": "David",
    "id": "VGVhY2hlci0yODk3NDc5",
    "lastName": "Landsbergen",
    "legacyId": 2897479,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Landsbergen is a tough professor but I feel like I learned a lot. I didn't like the hybrid model, we had to do everything on our own. Many graded questions are broad but he is looking for very specific wording on answers. Study study study!!! Book is an easy read but not the most useful for exams; use his online flashcards & PowerPoints. Study!",
        "course": "PA-6010"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Public Policy & Administration",
    "firstName": "Tasha",
    "id": "VGVhY2hlci0yNzkyMjcy",
    "lastName": "Perdue",
    "legacyId": 2792272,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "The exams are very easy and she grades easily. She is an extremely nice woman and gave us candy once. She is a good teacher and her research outside of class is interesting. Easy class with a nice teacher.",
        "course": "123565"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Public Policy & Administration",
    "firstName": "Alexander",
    "id": "VGVhY2hlci0yNzIyMDkz",
    "lastName": "Roberts",
    "legacyId": 2722093,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Overall, Dr. Roberts did a good job. He performed no less than and no greater than expected. This isn't a bad thing! I have high expectations. I think a professor's job should require them to give feedback but also give enrichment if you ask for it. He was a bit strict regarding deadlines and can be a bit of a hard grader. Teaches through feedback!",
        "course": "2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Public Policy & Administration",
    "firstName": "Charity",
    "id": "VGVhY2hlci0yNzk1OTg4",
    "lastName": "Scott",
    "legacyId": 2795988,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely caring and kind. Attendance is mandatory but the lectures are very interesting, discussion-based, & inclusive. A lot of papers but clear grading criteria & she wants you to succeed. Available outside of class. You will learn a lot about civic engagement. Go to class, participate, and ask questions when you need to & you'll be just fine. ",
        "course": "PUBAFRS2120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Public Policy & Administration",
    "firstName": "Amy",
    "id": "VGVhY2hlci0yNzQ5OTYz",
    "lastName": "Elliot",
    "legacyId": 2749963,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic professor. Incredibly accessible and helpful. Makes difficult or complex concepts digestible.",
        "course": "PUBAFRS6080"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Elliot is fantastic. Incredibly nice and very concerned about helping students understand the concepts she teaches, her class was very informative and the structure definitely made foreign and difficult concepts simpler to understand. She makes it very clear how to do the things required of the class.",
        "course": "PUBAFRS6070"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Public Policy & Administration",
    "firstName": "Chris",
    "id": "VGVhY2hlci0yNzQ5OTQy",
    "lastName": "Glaros",
    "legacyId": 2749942,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Group projects are tied to individual assignments for this class. Gives freedom to complete projects that is refreshing but sometimes confusing. Draws a lot from examples and has lots of personal experience in the field.",
        "course": "PUBAFRS6500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Policy & Administration",
    "firstName": "Nego",
    "id": "VGVhY2hlci0yNzQ5OTY3",
    "lastName": "Jovanovich",
    "legacyId": 2749967,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Nego helps make Excel understandable, and is very willing to help clarify assignments or concepts.",
        "course": "PUBAFRS5513"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Public Policy & Administration",
    "firstName": "Tricia",
    "id": "VGVhY2hlci0yNzQ5OTUy",
    "lastName": "Petras",
    "legacyId": 2749952,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Weekly homework is related to but does not quite match what is discussed in lectures. The midterm and final cover each half of the semester. It's a slog to get through this class if you aren't into econ. She tries to help make it as painless as possible and she does give extra credit options.",
        "course": "PUBAFRS6030"
      }
    ],
    "SEI": []
  }
]