[
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.2,
    "department": "Public Administration",
    "firstName": "Jill ",
    "id": "VGVhY2hlci0yMDAyMjAz",
    "lastName": "Clark",
    "legacyId": 2002203,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "The professor knows her stuff, however, doesn't know how to format the course into an entry level class. It shows that she should be teaching upper-level classes only. Be prepared for pop quizzes and harshly graded papers.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Clark assigns a lot of reading outside of class and gives pop quizzes- however, you do get to drop two quiz scores. She gives engaging lectures that helps clarify reading material, but she does veer into a lot of talking about herself. She's a tough grader on papers + tests are not easy, but she will work with you to make sure things feel fair.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clark provides a wonderful space for discussion and collaboration among her students. She is informed and passionate about her field and is an engaging lecturer. She is flexible and understanding with assignments, don't be afraid to ask for extensions. Be on time to class for pop quizzes tho. Amazing prof and person and great class environment.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Clark was amazing! Her lectures were very easy to follow and she wrote out notes explicitly for the class so we knew exactly what was on the tests. There are only 2 exams, and several papers--otherwise homework is very limited. She is always willing to give extensions and loves to meet with students if they have questions. Fairly reading heavy.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Able to explain a topic that might seem boring at first but is actually very interesting and impactful. Papers can be rather difficult but feedback is thoughtful and very accessible outside class too. Lectures are engaging and gives breaks.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr clark is ok. she is nice and not too difficult but i took this class as a theme for citizenship and i my opinion, it was annoyingly difficult for a theme class. there are 3 essays and i final and quizzes for the readings ",
        "course": "PUBAFRS2120"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Clark provides good feedback, but her PUBAFRS 2120 should not be taken as a GE. I am a public affairs major, and I had difficulty keeping up in class. She makes you hand-write notes and has tough pop-quizzes. She also doesn't explain basic public affairs knowledge to those who don't know was PUBAFRS is. ",
        "course": "PUBAFRS2120"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Clark is very personable and tries very hard to make sure students understand what she is teaching. Weekly assignments do require paying attention to the literature assigned.",
        "course": "PUBAFRS6000"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Weekly reading and questions but it's not bad at all. Some papers to write and one final exam, but if you pay attention in class it's nothing. She made one day synchronous and one asynchronous, so it was nice and flexible. Very funny and caring, and the class should be relatively easy and interesting if you work just a tiny bit.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Jill serves as an amazing moderator and guide. The subject matter is consistently thought provoking. The class activities serve as a representative tour of a broad subject. I will definitely apply the skills acquired.",
        "course": "PUBAFRS7573"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Jill is really awesome! She's a solid professor and clearly has a passion for her field. She made a kind of boring subject pretty interesting, and takes the time to engage students individually. I would definitely take a class with Jill again!",
        "course": "PUBAFRS2120"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "The class material seems repetitive at times, but Dr. Clark is great. She's enthusiastic, understanding, and creates a very enjoyable classroom atmosphere. Attendance isn't mandatory, but if you miss quizzes you damage your grade. Overall, I highly recommend her as a professor. ",
        "course": "PUBAFRS2120"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "5775",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.85"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6000",
        "Class Name": "Public Policy Formulation and Implementation",
        "Class Number": "5811",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "33",
        "Rating": "4.88"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "6243",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "49",
        "Rating": "4.65"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "6405",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "32",
        "Rating": "4.19"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5573",
        "Class Name": "Qualitative Methods in Public Affairs Practice",
        "Class Number": "36814",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "6345",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "57",
        "Rating": "4.62"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Erin",
    "id": "VGVhY2hlci0yNDg4NzI1",
    "lastName": "Scott",
    "legacyId": 2488725,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Erin is so amazing! I learned so much from this class and would take more with her if they were offered. You are pretty much only graded on papers and participation, so be careful with this class if you aren't good at writing. Her teaching style is so effective and even though attendance was mandatory, I really wanted to be there. ",
        "course": "PUBAFRS2150"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Erin is absolutely amazing. She has a lot of guest speakers that really teach you a lot about different experiences in the nonprofit sector. Erin's also a great resource and respects her students as much as they respect her. Literally can't express how much her teaching style did for my development.",
        "course": "PUBAFRS2150"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "5755",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.93"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "5781",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Nonprofit Organizing for Diversity and Justice",
        "Class Number": "6076",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.83"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7533",
        "Class Name": "Nonprofit Financial Management",
        "Class Number": "37040",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Public Administration",
    "firstName": "Edward Ned",
    "id": "VGVhY2hlci0yMjQwOTUy",
    "lastName": "Hiill",
    "legacyId": 2240952,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "It was a little harder than it should have been, mainly because of the way Prof Hill made us use his own terminology and had us scroll through 50 slides to study for each exam, but it wasn't too bad overall. Weekly papers seemed like a lot at first but just regurgitate lecture info and hit the word requirement and you'll get a good grade.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Hill is a great person to get to know outside of class. There are two midterms and a final in this course and none come with a study guide but if you manage your time well and create your own study guide you will do fine.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "Great guy out of class to find a connection with or just network, but as a professor, he's absolutely awful. I'd stay off his Intro to public affairs course because his exams are impossible without a study guide. Also, he is just unreasonable sometimes and kinda rude.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Literally this is the worst class I've ever taken. It was an intro course and the average on exams was often a high C. All examples were extremely obscure and required too much knowledge on Ohio politics. If you have the option, take this course with another professsor.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "People say he just rambled on about himself and his stories/accomplishments. He did talk about them but he was engaging, telling the class his experience and what he has done, opening to students to talk to him after class so he could help them pursue their interests in public administration. I really enjoyed his lectures, very fun professor.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Waste of time. He's clearly passionate about what he's doing but he just rambles about nonsense that no one understands and uses his professor platform to boost his own life accomplishments. Unfortunately I couldn't tell you one thing I learned other than I would never take this course again.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "He is okay, but his lectures are very anecdotal and really just uses class time to talk about all of the things he has done in his life and career. It is not super clear why his stories are important and he says a lot of somewhat offensive statements and just rambles on. He is not the worst teacher, but not great.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's good",
        "course": "PUBAFRS2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 1,
    "department": "Public Administration",
    "firstName": "Ken ",
    "id": "VGVhY2hlci0yOTIyNTIy",
    "lastName": "Poland",
    "legacyId": 2922522,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "I took Public Affairs 3000 with Ken. He is fantastic in class and gives time to help out each student. However, HE DOES NOT RESPOND TO EMAILS. I emailed him several times (grading issues, HW questions, etc.), and of the 6-7 I sent I got a response to maybe 3 and that was after at least 6 days and 2 follow-ups.",
        "course": "3000"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "3000",
        "Class Name": "Public Policy Analysis",
        "Class Number": "4560",
        "Term": "SU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3000",
        "Class Name": "Public Policy Analysis",
        "Class Number": "4661",
        "Term": "SU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      }
    ]
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.4,
    "department": "Public Administration",
    "firstName": "Jos",
    "id": "VGVhY2hlci0xNjkyNzAz",
    "lastName": "Raadschelders",
    "legacyId": 1692703,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jos makes his opinions very known, but he's not the kind of guy to grade you worse because yours differ. Barely any work outside of class, but attendance is graded and participation within class discussions is needed.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Raadschelders was a great professor. He is very knowledgable, which is apparent in his lectures. Readings are provided, but never included on exams. Only assignments are a one-page weekly reflection paper and one longer essay towards the end of the semester. Grade is very dependent on exams, but if you review the material it is very manageable!",
        "course": "PA2110"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "You can tell he is passionate about his work, so as a result he tends to talk... A LOT. There is a one page refection every week that can basically be about anything. There is a longer paper towards the end of the semester, but it is graded easy. There are three exams. The bold on the lectures is your study guide. Exams are wighted very heavy!",
        "course": "PUBAFRS2110"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "I instantly respected Dr. Raadschelders from lecture 1. He listens, cares, and teaches in a way that is so unique to him.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "He is a nice teacher, and you can tell he cares about his students and what he teaches. He would often get off on a tangent during class. He says he doesn't provide a study guide but his PowerPoint slides are a study guide. I don't think you need to do the readings for the class either. ",
        "course": "PA2110"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Raadschelders was very engaging and I loved his class. The lectures were sometimes tough because he often talked the majority of the class, but his discussions were very fun and thought-provoking. Weekly readings of about 40 pages but they weren't horrible and 1 page paper every week -- also not bad. He is very funny and a sweet guy, too.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "Prof. Raadschelders loves the sound of his own voice. He often went on tangents highly unrelated to the lecture topics at hand, and he did little to hide his blatant political alignments. Not too bad in terms of difficulty. Review the lectures and the reading questions. There are weekly reflections and two 3-page papers, none graded too harshly.",
        "course": "PUBAFRS3210"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Raadschelders is extremely passionate about public affairs and cares about his students. I have taken another class with him and would recommend that everyone takes a class with him. He is very entertaining and offers insight into current events from a European perspective which was always interesting to hear. ",
        "course": "PUBAFRS3210"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "I wish this prof. would be my permanent PA teacher. His intro course is amazing and really shows you the world of Public Affairs. Very engaging and not a very demanding class. His required weekly reflections however require you to write but you have a lot of freedom in it and are not that bad. Surprisingly funny and sharp, Would highly recommend",
        "course": "PA2110"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Overall really good professor you are going to learn a lot from him. The class is just long and sometimes boring. ",
        "course": "PUBAFRS3210"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Raadschelders is an engaged, caring professor who wants to think critically about the role government plays in society. He does take attendance for his lectures and the exams can make up a big part of your grade, but as long as you read the material given and review the slides, you should be able to do well in the class.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Raadschelders cares about students learning to be informed citizens and critical thinkers. The class is a very broad overview of public administration so the material can be a bit abstract. Grade is exam heavy, but all exam information comes directly from the slides, so if you look over those you will be fine.",
        "course": "PA2110"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Raadschelders is a nice, loud guy but the way he taught the material sucked. It was boring and hard to connect, seemed like random info. Calls out names for attendance every class. Not a tough grader, but exams are the majority of your grade. Exams will make or break you. They aren't bad if you memorize all of the slides. Go to office hours.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "I didn't enjoy this class a whole lot, but I would say that was more to do with the subject matter than Dr. Raadschelders himself. He is very friendly and passionate about the material and his students, but also can drift off into weird tangents that shorten his time with the actual class material. Exams weren't bad.",
        "course": "PA2110"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "This professor is amazing and really challenges you to think about social issues in a respectful class environment. Overall, Jos is AMAZING!",
        "course": "PA200"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Raadschelders is probably my favorite professor I've ever had. The criteria isn't always clear, but he's willing to help if you need it, and he's an incredible and hilarious man. The class was a good amount of work but not too stressful, and he managed to keep it interesting. Truly a delightful man that I hope to take more classes with.",
        "course": "PA2110"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Raadschelders was really entertaining and makes you really excited for public affairs. Discussions are fun and really get a lot of participation going. However, he does not give A's out. You really have to work for them. Also, no lecture slides and doesn't use Carmen. All notes have to be taken from what he says making studying and exams hard.",
        "course": "PA2110"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jos was a great professor and really light to ignition in my public affairs fire. He normally only teaches graduate level classes so this was a good experience. ",
        "course": "PA2110"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Raadschelders is both highly qualified and personable. Not only does he give a thought-provoking lecture, he is also very funny and can keep even the most tedious discussion engaging and light-hearted. He does expect high quality work and participation.",
        "course": "PUBAFRS6000"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome Professor. Definitely one of the best in the Glenn School. Mostly Lecturing-but he keeps it very engaging.",
        "course": "PUBSAFRS6000"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Raadschelders is extremely knowledgeable and is entertaining.  His demeanor is contagious and his discussions get you thinking. I am searching as hard as I can do get him again! He is not the easiest, but you learn a ton, and if you legitimately try and work hard, you will get an A.",
        "course": "PA200"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Raadschelders is so entertaining! He has this boy-like charm about him that makes him so endearing, yet engaging. He is very approachable and really challenges you to think through things. I enjoyed his class immensely. There was a lot of work for the class, but even it was entertaining.",
        "course": "PPM801"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "Public Administration",
    "firstName": "Erynn",
    "id": "VGVhY2hlci0yMzMzNzA5",
    "lastName": "Beaton",
    "legacyId": 2333709,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Don't buy the textbook you can find a PDF online. I really enjoyed having Beaton as a professor, the class is valuable information, but she does grade writing harder than I think she should for a GE. If you're a business student I think this is a valuable GE that actually applies to your major.",
        "course": "PUBAFRS2150"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Beaton is amazing. She is caring, attentive, and understanding. It is clear she really appreciates feedback and applies that to the course. Attend class and you will do fine. She uses TopHat during her lectures so you can get easy points from the readings. ",
        "course": "PUBAFFRS2150"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Professor Beaton for Public Affairs 2150 and she was great. Knows a lot about the nonprofit sector and has really engaging lectures that always include a class debate. Lots of reading out of the textbook and attendance points but honestly, they are easy money. Overall cool class. ",
        "course": "PUBAFRS2150"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Erynn is a great professor. She clearly cares about the subject matter and helping her students! The class isn't hard at all, and as long as you at least scan the readings beforehand you should be fine. Attendance is mandatory, but the classes are interesting so you probably would have shown up anyway!",
        "course": "PUBAFRS2150"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really cool and clearly cares about the subject matter. The class is pretty easy as long as you attend lecture and do the readings. Daily debates keep things engaging and are super useful to applying how to concepts we have learned are relevant to current events or policy in the U.S. Erynn is very understanding, and always willing to help students.",
        "course": "PUBAFRS2150"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Beaton is really easy-going and genuinely nice. The class is interesting, and she makes things less boring by adding debates. The reading is super light, and the papers are spaced out nicely. She knows a lot about the subject, and will meet with you outside of class if needed. She is easy to talk to and is a fair grader.",
        "course": "PUBAFFRS2150"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "5887",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.94"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "5910",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.94"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7573",
        "Class Name": "Qualitative Methods for Public Policy and Management",
        "Class Number": "34210",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7950",
        "Class Name": "Capstone: Nonprofit Topics",
        "Class Number": "5764",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.83"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "5867",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.94"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "5890",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.8"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7194",
        "Class Name": "Group Studies",
        "Class Number": "36470",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7950",
        "Class Name": "Capstone: Nonprofit Topics",
        "Class Number": "5790",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "6248",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.88"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Introduction to Nonprofit Organizations",
        "Class Number": "6269",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7573",
        "Class Name": "Qualitative Methodologies for Public Affairs Research",
        "Class Number": "35793",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7950",
        "Class Name": "Capstone: Nonprofit Projects",
        "Class Number": "6085",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Nonprofit Organizing for Diversity and Justice",
        "Class Number": "6409",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.71"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2150",
        "Class Name": "Nonprofit Organizing for Diversity and Justice",
        "Class Number": "6428",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.88"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5120",
        "Class Name": "Social Change Advocacy: Organization, Mobilization, and Activism",
        "Class Number": "35748",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5120",
        "Class Name": "Social Change Advocacy: Organization, Mobilization, and Activism",
        "Class Number": "36456",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.2"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7950",
        "Class Name": "Capstone: Nonprofit Projects",
        "Class Number": "6246",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2.6,
    "department": "Public Administration",
    "firstName": "Neil",
    "id": "VGVhY2hlci0xOTgzNjQ4",
    "lastName": "Hooker",
    "legacyId": 1983648,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Exams were pretty easy, and while his lectures aren't the most engaging, the content was useful for the assignments. As long as you show up to class and take advantage of office hours, he is very helpful and its pretty easy to get a good grade",
        "course": "PUBAFRS4000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Does not listen to students or teach anything in anyway ",
        "course": "PUBAFRS4010"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I learned a lot in his class and loved doing so. He brings an excitement to class that many professors lack and if you take the time to talk with him it is very fulfilling. ",
        "course": "PUBAFRS4000"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Awful and rude. He doesn't care about student concerns and does nothing to address student needs or to help students in the slightest. His lectures have nothing to do with the assignments, therefore it is not clear what is expected of students and takes points off without explaining why. Very disrespectful and would never take again.",
        "course": "PUBAFRS4000"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "He does not tell you how to do your assignments so when it comes time to grade, he takes points off for things you did not know you were supposed to cover in said assignment. Even in the case of family death or other outside of class emergency he has still expected students to turn in their work. He assigns groups. If they don't do the work? Sorry!",
        "course": "PUBAFRS4010"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Lisa",
    "id": "VGVhY2hlci0yODUxMzI4",
    "lastName": "Frazier",
    "legacyId": 2851328,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absurdly easy class&#8212;just make sure to show up, participate from time to time, and be a decent group member for the overarching final project.",
        "course": "PUBAFRS2620"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "3000",
        "Class Name": "Public Policy Analysis",
        "Class Number": "6357",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "4.91"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2620",
        "Class Name": "Contemporary Issues in Science, Engineering, and Technology Policy",
        "Class Number": "33498",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2620",
        "Class Name": "Contemporary Issues in Science, Engineering, and Technology Policy",
        "Class Number": "6337",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "31",
        "Rating": "4.84"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Public Administration",
    "firstName": "Trevor",
    "id": "VGVhY2hlci0xNDIzMjky",
    "lastName": "Brown",
    "legacyId": 1423292,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Brown is very interested in teaching and enjoys the material. He is responsive to emails (which is impressive since he is the Dean after all) and does want students to success. Only complaint is the group projects weren't really the type of projects ideal for group collaboration.",
        "course": "PUBARFS6050"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trevor was awesome; brought a lot of current events into class discussion, taught real-world skills that are usable outside of class (ie. technical writing) and he has real world experience to back up what he is teaching. 3 case studies (drop lowest grade), group debate, congressional testimony simulation, and final/paper were the only grades.",
        "course": "PUBAF5700"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Couldn't be more satisfied with professor Brown. Brought in several engaging lectures, has plenty of personal experience to draw from, and a good guy with a sense of humor. Readings are on Carmen. Recommend scheduling an apointment if you want to see him, not always at office hours.",
        "course": "PUBAF200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor - engaging lectures, clear expectations about assignments, excited about his field. Great way to kick off the major.",
        "course": "PUBAF200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "This course is a public policy/International Studies, and students in this class are mixed of graduate and undergraduate. There is only one optional final exam. This teacher and his TA were very knowlegable about this course. Professor Brown is a great teacher with a passion in his field!",
        "course": "PP670"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "7650",
        "Class Name": "Public Management in a Hybrid World",
        "Class Number": "4918",
        "Term": "SU 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6050",
        "Class Name": "Managing Public Sector Organizations",
        "Class Number": "4342",
        "Term": "SU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.96"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "8040",
        "Class Name": "Seminar in Organizational Theory",
        "Class Number": "34219",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.91"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6051",
        "Class Name": "Into to Public Affairs and Orientation to the Program",
        "Class Number": "5948",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.75"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6550",
        "Class Name": "Public Management Communication in a Hybrid World",
        "Class Number": "36866",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.71"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6550",
        "Class Name": "Public Management Communication in a Hybrid World",
        "Class Number": "37126",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5700",
        "Class Name": "Rebuilding Failed and Weak States",
        "Class Number": "6064",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.25"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5700",
        "Class Name": "Rebuilding Failed and Weak States",
        "Class Number": "6074",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7650",
        "Class Name": "Public Management in a Hybrid World",
        "Class Number": "22840",
        "Term": "SU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.63"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Public Administration",
    "firstName": "Robert",
    "id": "VGVhY2hlci0xODY3NDUz",
    "lastName": "Greenbaum",
    "legacyId": 1867453,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Greenbaum's economics class ended up being my favorite course of the MPA curriculum.  He makes the material interesting by using current and humorous examples during his lectures.",
        "course": "6030"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "Nice guy but seemed to confuse a lot of students by providing unclear explanations, constantly shifting topics, and never telling people who answer questions that they are wrong - he always tried to spin an answer for such a student in a way that it would be right",
        "course": "PA6030"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Good class. He does a good job of explaining very difficult material.",
        "course": "PUBAFRS6030"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Erica",
    "id": "VGVhY2hlci0yNDg0Mjgw",
    "lastName": "Wicks",
    "legacyId": 2484280,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Passionate about her job, and talks about heavy issues.",
        "course": "PUBAFRS2120"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "5800",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.52"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "6117",
        "Term": "SP 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.52"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Kimberly",
    "id": "VGVhY2hlci0yNTcyMjA1",
    "lastName": "Young",
    "legacyId": 2572205,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Young is one of those professors that makes you want to change your major. She makes more than enough time for her students and will help you catch up if you have not taken an econ class in ages. A+++++++ would take again!",
        "course": "PUBAFRS4130"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "such a great instructor. i enjoyed taking her class. shes an easy grader and truly wants her students to succeed. gives much of her time to help and also will provide some extra credit. take her class!!",
        "course": "PA4310"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "4310",
        "Class Name": "State and Local Government Finance",
        "Class Number": "5823",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "40",
        "Rating": "4.85"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5513",
        "Class Name": "Excel Basic Skills",
        "Class Number": "5912",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.75"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5513",
        "Class Name": "Excel Basic Skills",
        "Class Number": "35602",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6030",
        "Class Name": "Public Sector Economics",
        "Class Number": "5832",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.26"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6030",
        "Class Name": "Public Sector Economics",
        "Class Number": "4338",
        "Term": "SU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.73"
      }
    ]
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 3.4,
    "department": "Public Administration",
    "firstName": "Alannah",
    "id": "VGVhY2hlci0yNjAyODUy",
    "lastName": "Glickman",
    "legacyId": 2602852,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really liked prof Glickman. She is always very willing to help with papers and any other questions you have about the class. If you need to take this course try to take the class with her!",
        "course": "PUBAFRS2120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Glickman is great. She is super passionate about the subject and does what she can to keep people engaged. She is very understanding and approachable, and I felt comfortable going to her outside of class. If you stay on top of readings, the class is very manageable.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 5,
        "comment": "A lot lot lot of heavy reading. Nothing is easy about this class. Gives barely enough time for homework/exams.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Glickman is incredibly passionate about public affairs and helping her students. She's willing to talk to students outside of class about grades, papers, anything else. She's fairly flexible with deadlines and attendance, especially during these quaren-times. The class is reading heavy, but not too much work beyond that. 110% would take again.",
        "course": "PA2120"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "There's not really anything good I can say about her.",
        "course": "PA2120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3,
    "department": "Public Administration",
    "firstName": "Angie",
    "id": "VGVhY2hlci0yNjkzNTM1",
    "lastName": "Westover-Munoz",
    "legacyId": 2693535,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class was almost all lecture and group work. The professor knew what she was talking about but the lectures were not super exciting. There are no tests and the readings aren't discussed in class (read as: don't do the readings), so the workload is very doable. She's willing to offer help outside of class and the grading all seems pretty fair.",
        "course": "PA3500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.3,
    "department": "Public Administration",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yNTU5NDU0",
    "lastName": "Rea",
    "legacyId": 2559454,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Rea's class was engaging and practical to public service and public affairs. He does a nice job applying sociology theories to practical forms of public participation, social movements, and more. There are weekly readings and five short papers.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Rae was an excellent instructor. The material was interesting, and he let us apply it to real-life. The work was reasonable, and you can tell how passionate and knowledgeable he is in the material. He made us excited to come to class. If you are passionate about the subject, this is the only professor to take for it. He will make you love it ev",
        "course": "PUBAFRS2120"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "This professor ignored emails NUMEROUS times, he will not respond in a timely manner. He put a 0/1 on multiple assignments that were given an extension and won't respond to any emails. Does not have notes or any sort of structure for this class, if you skip, you won't have notes and won't understand ANYTHING.",
        "course": "PUBAFFAIRS2120"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best professors I have ever had!",
        "course": "PUBAFRS2120"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I am taking Dr. Rea's class right now and love it. He is knowledgeable and communicates with us like people and equals. We discuss real-world stuff, not just meaningless theories and vocabulary terms. I look forward to taking many more courses with him in the future. Great class.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Will ignore your emails for weeks on end when you ask for help. Do not take his classes.",
        "course": "PUBAFFAIRS2120"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very fun environment in class, good for discussion and helping build the foundations of the major. Very accepting and chill. The difficulty/specificity of the class does take a sharp turn upwards very quickly at the end of the semester, though - more unnaturally so than most classes. Cares about his students and works to help them.",
        "course": "PUBAFRS2120"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Rea is the best professor I have had during my time at Ohio State thus far. He is extremely knowledgeable about the public sector, citizen engagement and our countries history. I was eager to attend class each week knowing I'd leave with new perspective. I would highly encourage taking any class he offers.",
        "course": "PUBAFRS220"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Rea was delightful! His lectures were very engaging and interesting. The grading was very fair. He was approachable and really cared about student feedback. In fact, he made a lot of adjustments based off of feedback that made an already enjoyable class even better. He invited really cool speakers that made the class more interesting.",
        "course": "PUBAFRS2120"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "5882",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.88"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "5920",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.63"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5800",
        "Class Name": "Special Topics Seminar in Public Affairs",
        "Class Number": "5739",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5800",
        "Class Name": "Special Topics Seminar in Public Affairs",
        "Class Number": "5743",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "5862",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.82"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2120",
        "Class Name": "Public Service and Civic Engagement",
        "Class Number": "5900",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5350",
        "Class Name": "Governing the End of Nature? Environmental Policy in the Anthropocene",
        "Class Number": "35516",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2110",
        "Class Name": "Introduction to Public Affairs",
        "Class Number": "6283",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.3"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6000",
        "Class Name": "Public Policy Formulation and Implementation",
        "Class Number": "6193",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.25"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2110",
        "Class Name": "Introduction to Public Affairs",
        "Class Number": "6440",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.83"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6000",
        "Class Name": "Public Policy Formulation and Implementation",
        "Class Number": "6357",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.64"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5120",
        "Class Name": "Social Change Advocacy: Organization, Mobilization, and Activism",
        "Class Number": "35749",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6000",
        "Class Name": "Public Policy Formulation and Implementation",
        "Class Number": "6162",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4,
    "department": "Public Administration",
    "firstName": "Beth-Anne",
    "id": "VGVhY2hlci0xNjkyNzAw",
    "lastName": "Schuelke-Leech",
    "legacyId": 1692700,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "Classes are more of a workshop, and you need to be on-point requesting guidelines of what she requires/expects from your assignments, since little feedback is clear from the get-go. Other than that, this course was pretty loose and dependent on student engagement. Disappointing for those with less experience or that prefer a more structured course.",
        "course": "INDE8430"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you attend class and take good notes you will do well in the class.  She is understanding and helpful. A great class to start off the public affairs major.",
        "course": "PUBAFRS2110"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "I love her. She's incredibly intelligent and has an interesting history in engineering and other fields. She's passionate and very helpful in class. Of all of my professors, she was most kind- she lent me a DVD to use outside of class and returned a book I left behind to the library for me. Wow. Soo nice.",
        "course": "PUBAF2110"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "May seem like a dull professor at first, but BASL is extremely knowledgeable about Public Affairs and what occurs in the government and policy process. Extremely helpful. Easy grader. Attendance wasn't mandatory but I learned a whole lot by going!",
        "course": "PUBAF2110"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Au 2011 was only her first time teaching at OSU. She seems to care about how her students do but she is terrible at explaining herself, often explained topics incorrectly and had to re-teach, very confusing. I have her again and everyone in class is having the same problems. She also teaches from texts she doesn't provide or require",
        "course": "PPM830"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "AU 2011 was her 1st quarter of teaching & I think she did a fine job. There were a lot of people in the class who felt otherwise; the types who complain all the time if the professor isn't easy. If you do the work & talk with her, you will do great. She is really smart & doesn't care if your answer is the same as hers as long as you can justify it.",
        "course": "PPM830"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.5,
    "department": "Public Administration",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0yMzAwMjcw",
    "lastName": "Girth",
    "legacyId": 2300270,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Girth is deeply experienced and full of knowledge. It is obvious she is passionate about the subject, but doesn't quite understand how to translate that to students. She refuses to use Carmen, therefore grades are unknown. She is a tough grader on assignments and there are few. She is very lecture heavy and they are normally quite dry.",
        "course": "PA3500"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Poor instructor. Knowledgeable about her field but fails to lay foundation for students. Appalled that she verbally encouraged rote memorization for her final exam. Education research clearly states rote memorization does not lead to learning. Fails to articulate what she is looking for on assignments. LV 5 difficulty due to teaching not content",
        "course": "PUB3500"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Girth is very traditional in class style, participation, and expectations. She requires readings before every class with a quiz over the reading material. I learned a lot in this class! Lots of group discussion and case studies that really drive the concepts home. She is passionate about the subject and is very accessible office hours",
        "course": "PA3500"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved Amanda's class! She is very engaging in lectures and expects student participation. Attendance is taken every class, but she gives you two free absences. The rest of your grade is made up of a group activity, online discussion post, midterm, final, and reflection paper. I highly recommend her class. I'm excited to have her again for 3500!",
        "course": "PUBAFRS2130"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really enjoyed having Dr. Girth as a professor. She clearly knows what she's talking about and places special emphasis on finding ways for students to connect class material with their lived experiences. My only complaint is that she doesn't enter grades into Carmen. I'm excited to take 3500 with her next semester!",
        "course": "PUBAFRS2130"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amanda is amazing. She can involved everybody in the learning process, a lot of creativity, open and friendly atmosphere. Her Leadership classes are strongly recommend :)",
        "course": "PUBAFRS2130"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "7600",
        "Class Name": "Federal Policy & Administration",
        "Class Number": "5995",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7900",
        "Class Name": "Capstone:  Research Paper in Public Affairs",
        "Class Number": "34725",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7600",
        "Class Name": "Federal Policy & Administration",
        "Class Number": "5968",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7900",
        "Class Name": "Capstone:  Research Paper in Public Affairs",
        "Class Number": "33676",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Carla",
    "id": "VGVhY2hlci0zMDM1MTA4",
    "lastName": "Elliot",
    "legacyId": 3035108,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr Elliott deserves all the credit. What an amazing professor!!!",
        "course": "ESHESA2570"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy and laid back. A friend that doesn't take class too seriously but I still felt like I learned stuff. ",
        "course": "ESHESA2570"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best professor that I have ever had at Ohio State. Very forgiving and understanding if you can't make it to class or something goes wrong.",
        "course": "ESHESA2570"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Carla is one of the nicest and caring professors I've ever had! She really cares about her students and her classes are in a small class setting. She really tries to make the class interesting for students and there's a lot of collaboration. Would love to have her again!",
        "course": "ESHESA2571"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 1.9,
    "department": "Public Administration",
    "firstName": "Tina",
    "id": "VGVhY2hlci0yNTI0NTQ3",
    "lastName": "Pierce",
    "legacyId": 2524547,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "Tina Pierce is likely a bad professor if her work as a board member of Columbus City Schools is any indication. Very Corrupt. How she is allowed to teach future policy makers is beyond scary. She should teach a course in covering up scandal and corruption. That would fit her skills much more accurately.",
        "course": "POLISCI4140"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I LOVE Dr. Pierce, she is such an engaging professor and I love the topics of discussion that she has us do. Would reccommend!",
        "course": "POLISCI4140"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Ngl the other reviews aren't entirely wrong but personality wise I really liked her as a professor and thought the class was stimulating. As long as you get those 5-page papers in on time the rest is a breeze and basically just class discussions and readings. The class definitely made me more resilient with papers now lol. Hard work but rewarding!",
        "course": "POLISCI4140"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Nah. 5 page single spaced paper four times throughout the semester. Dont do it.",
        "course": "POLISCI4140"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "in our mid-semester evaluation, some ppl said she went too slow, others said she went too fast. Her response? To do a class extremely slow and constantly apologize to those who found it boring. she assumed we knew everything already, and was extremely condescending when we had a tough time with things we were literally in the class to learn about",
        "course": "PUBAFRS3140"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor in the Public Affairs Department I have ever had. Unclear expectations and deadlines. Her exams are completely memorization-based. She expects you to know everything she taught or did not even mention in class. She's very unorganized and responds very aggressively when someone asks for leeway or assistance. Stay away from her.",
        "course": "PUBAFRS3140"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Pierce was one of the worst professors I've had, she is very unorganized and never provided us with clear criteria for our papers. When we asked for clarification, she gave little to none and said we were college students and we could figure it out on our own. She gives weekly quizzes on Carmen and grades them so unfairly. Don't take her class",
        "course": "PA3500"
      }
    ],
    "SEI": [
      {
        "Subject": "POLITSC",
        "Catalog": "4140",
        "Class Name": "Black Politics",
        "Class Number": "36528",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Political Science",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.18"
      },
      {
        "Subject": "POLITSC",
        "Catalog": "4175",
        "Class Name": "Women, Government, and Public Policy",
        "Class Number": "36691",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Political Science",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "2.4"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3110",
        "Class Name": "Education Policy in a Changing World",
        "Class Number": "35834",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "3.78"
      },
      {
        "Subject": "WGSST",
        "Catalog": "3385",
        "Class Name": "Women in Political Leadership Internship",
        "Class Number": "34717",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4513",
        "Class Name": "Women, Government and Public Policy",
        "Class Number": "23577",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.67"
      }
    ]
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.3,
    "department": "Public Administration",
    "firstName": "Jason",
    "id": "VGVhY2hlci0xMjU1MzE2",
    "lastName": "Seligman",
    "legacyId": 1255316,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "While Seligman's lectures tended to get a little long and off-topic, it didn't matter too much because he's so engaging and knowledgeable. Doing the readings and participating are both important; and while the assignments are time consuming, the grading is fairly easy. I learned more in Seligman's class than any others in the program. ",
        "course": "PA6040"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "I'm not really sure why he has such poor reviews on here. He's one of the easiest graders I've ever come across -- I don't know anyone that got below an A- in the class -- and is always willing to take time to help you understand a concept. Very funny. Sometimes his assignments are vague but they are clearly designed intentionally that way.",
        "course": "PUBAFRS6040"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Hard class, but a great professor!",
        "course": "JGSPA6040"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "The class was extremely challenging,you are expected to come to class having done the readings (Duh). Seligman challenges students but allows their ideas to be heard. If yo uhave questions go to his office, he is extremely helpful. Also ask a question in class, he likes it and it helps clarify things. He jokes a lot but ask him to stop and he will!",
        "course": "FINAN1"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "This professor teaches a difficult and confusing subject in a way which challenges his students. If you don't put in the work, you won't get the grade. No freebies here. If you don't read the book you won't understand what's going on. If you do, his jokes are pretty funny.",
        "course": "PPM730"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not clear with lectures in class and tests are not reflective of what is on syllabus",
        "course": "FIN730"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Public Administration",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0xOTM4ODM2",
    "lastName": "Record",
    "legacyId": 1938836,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Genuine good guy. Good luck in Cali!",
        "course": "PA2110"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "AMAZING. He's so willing to sit down with you outside of class, he literally taught me how to use google scholar for research. Also, challenged my thinking a ton by always playing devil's advocate / bringing up the other side of a topic. Great class, great professor",
        "course": "PA2120"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great class discussions. Very helpful. A lot of feedback on papers. Just about the best professor I've had so far in my Public Affairs courses.",
        "course": "PA2120"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Matt is my favorite instructor I've had in the John Glenn College. His lectures are so easy to listen to & jam packed with interesting facts. Matt has very interesting theories that are new and will stick with you. He is also a very understanding teacher with grading and assignments. Definitely worth taking any and all classes he teaches.",
        "course": "PA2120"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Can get sidetracked but only because he wants the lectures to be interesting. He's definitely very knowledgeable. Would recommend.",
        "course": "PA2100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely everything that could be on the test is given in a review sheet before hand. Matt gives great examples that really help to clarify the material. If you show up to class and go over the review sheet, the class seems like a pretty easy A.",
        "course": "PA2110"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's the bomb. Serious, Matt is so funny and will never give you excessive work. He's always really willing to help, and makes everything really easy to understand. Come to class. You won't regret it.",
        "course": "2110"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is great! He's very articulate, personable, and downright hilarious. If you go to class and listen (which you'll want to anyway) you'll do fine in the course and learn quite a bit. What I've learned in that class has proven to be very practical in everyday conversation regarding government.",
        "course": "2110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Maria",
    "id": "VGVhY2hlci0yMjcyOTU5",
    "lastName": "Armstrong",
    "legacyId": 2272959,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Armstrong's class was the best course I have taken. You will learn a lot about law and more importantly a lot about yourself.",
        "course": "PA4510"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 2.8,
    "department": "Public Administration",
    "firstName": "Craig",
    "id": "VGVhY2hlci0xNzI3OTA3",
    "lastName": "Boardman",
    "legacyId": 1727907,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Talked A LOT about how he was supposed to be doing research but got roped into teaching our class. It kind of felt like he didn't want to be there. He's a nice guy and  laid back. I felt like it was easy to approach him with questions and he's helpful if you have them. Assignments are comprehensive so make time for them.",
        "course": "PUBAFRS6060"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "Great class--pretty easy and much better if you take advantage of his office hours.",
        "course": "PUBSAFRS6080"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Boardman was a great prof! I really enjoyed his class and he was always willing to help or explain things multiple times till we all understood the concepts. If you take his class definitely take advantage of his office hours. I would recommend his class!",
        "course": "PA6080"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "The worst professor I have ever had. Leaves class for extended periods of time, doesn't follow syllabus, and admits to his own poor planning when class goes awry.",
        "course": "6080"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Stephanie",
    "id": "VGVhY2hlci0xNjkyNzAx",
    "lastName": "Moulton",
    "legacyId": 1692701,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Moulton is great! She is fiery and challenging, but not overbearing. Very clear on expectations and fair on grading, and can make a boring subject interesting.",
        "course": "PUBAFRS6050"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a great professor. I can't believe there aren't other reviews of her! She knows the material well, and is very engaging. She is also really helpful and responsive to email. I would take her for a class again. She is the best professor at the Glenn School as far as I am concerned.",
        "course": "PA810"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "4010",
        "Class Name": "Public Affairs Decision-Making",
        "Class Number": "5822",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.64"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "4010",
        "Class Name": "Public Affairs Decision-Making",
        "Class Number": "5797",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "8000",
        "Class Name": "Public Policy and Management: Foundations and Approaches",
        "Class Number": "5818",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7900",
        "Class Name": "Capstone:  Research Paper in Public Affairs",
        "Class Number": "6314",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "8000",
        "Class Name": "Public Policy and Management: Foundations and Approaches",
        "Class Number": "6364",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.5,
    "department": "Public Administration",
    "firstName": "Lathania",
    "id": "VGVhY2hlci0yMDUwNDIy",
    "lastName": "Brown",
    "legacyId": 2050422,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lathania overall is very passionate and is one heck of a teacher. ",
        "course": "PA3000"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lathania is a great person but struggles with delivering the topic. Exams are insanely long (hardly anyone finishes) and are nothing like the study guides at all. She makes up for it with extra credit opportunities but not many",
        "course": "PUBAFRS3000"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "As a person, she's not bad. But as a professor, she struggles. There are no clear guidelines, exams are too long to complete, and she is defensive when questioned about change.",
        "course": "PUBAFRS3000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Public Administration",
    "firstName": "Nicole",
    "id": "VGVhY2hlci0yNzk3MTU4",
    "lastName": "Rodriguez Leach",
    "legacyId": 2797158,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Class is homework heavy because of no tests and you'll do random, irrelevant busy work. Nicole is knowledgeable but lets her own opinion affect the class, and she comes across very rude. She makes you feel judged so her class didn't feel like a safe learning environment. Probably wouldn't take a class with her again.",
        "course": "2120"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yNjQwODQ5",
    "lastName": "Gray",
    "legacyId": 2640849,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great professor! The class is split into 3 sections where you learn about different policy topics. Attendance is mandatory but the lectures are awesome because it is more discussion-based and she wants you to participate. There are numerous writing assignments but she gives you time, explains them clearly and you get to pick your topics.",
        "course": "PUBAFRS2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof Gray is a great professor. The class is split into 3 sections where you learn about different policy topics. There is a lot of discussion in the class. You will learn several different ways to communicate effectively including press releases, presentations, speeches, policy briefs, and testimonies. She is a great prof!",
        "course": "PUBAFRS2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I very much enjoyed her class last semester. The material was straight forward, and her lectures were structured. While the lectures got boring at times, I never felt like I was lost at any point in the semester. The class was helpful in introducing me to a professional environment that would be found in the adult working world.",
        "course": "PUBAFRS2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is so sweet, understanding, and passionate about the subject. This class was super interesting and relevant, a great intro to public policy and communication. If you go to class and do the assignments based on her directions, you'll do great. There isn't too much homework and there are no tests or exams just written assignments.",
        "course": "PUBAFRS2367"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2367",
        "Class Name": "Writing and Communication in Public Affairs",
        "Class Number": "34264",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.69"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2367",
        "Class Name": "Writing and Communication in Public Affairs",
        "Class Number": "5780",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "3.82"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Public Administration",
    "firstName": "Sonja",
    "id": "VGVhY2hlci0yNjgzMTIz",
    "lastName": "Simpson",
    "legacyId": 2683123,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Simpson was a really great professor, especially for an upper division course. She has lots of experience within public policy, had connections in the industry and brought those people in as guest speakers, and really wanted us to succeed. There were only a few assignments throughout the course, mostly papers.",
        "course": "PUBAFRS3500"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "3500",
        "Class Name": "Public Management",
        "Class Number": "5914",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.13"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7557",
        "Class Name": "Strategy for Public Organizations",
        "Class Number": "5817",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "3.36"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "3500",
        "Class Name": "Public Management",
        "Class Number": "5894",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "3.67"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7557",
        "Class Name": "Strategy for Public Organizations",
        "Class Number": "36653",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "3"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Jim",
    "id": "VGVhY2hlci0yNDY0MzYx",
    "lastName": "Landers",
    "legacyId": 2464361,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Provides video explanations for concepts, and was willing to make new ones to help clarify if the content is confusing. Definitely cares about his students learning the material.",
        "course": "PUBAFRS6040"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "4030",
        "Class Name": "Public Budgeting",
        "Class Number": "5921",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.05"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "4030",
        "Class Name": "Public Budgeting",
        "Class Number": "34061",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.64"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6045",
        "Class Name": "Fundamentals of Budgeting and Financial Administration",
        "Class Number": "21764",
        "Term": "SU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6040",
        "Class Name": "Public Budgeting and Finance",
        "Class Number": "5761",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.61"
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Public Administration",
    "firstName": "Katie",
    "id": "VGVhY2hlci0yNzI2MzMy",
    "lastName": "Vinopal",
    "legacyId": 2726332,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Excellent professor. High standards for her students. Very approachable and helpful. Readings were plentiful but all were relevant and fairly short.",
        "course": "PUBAFRS5250"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "6070",
        "Class Name": "Public Affairs Statistics",
        "Class Number": "5835",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6075",
        "Class Name": "Data, Models and Evaluation",
        "Class Number": "34708",
        "Term": "AU 20",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.56"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5250",
        "Class Name": "Poverty, Inequality, and Public Policy",
        "Class Number": "33837",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5250",
        "Class Name": "Poverty, Inequality, and Public Policy",
        "Class Number": "33838",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6070",
        "Class Name": "Public Affairs Statistics",
        "Class Number": "5718",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.89"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6075",
        "Class Name": "Data, Models and Evaluation",
        "Class Number": "35597",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "36",
        "Rating": "4.94"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6075",
        "Class Name": "Data, Models and Evaluation",
        "Class Number": "36321",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5250",
        "Class Name": "Poverty, Inequality, and Public Policy",
        "Class Number": "33613",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.7"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5250",
        "Class Name": "Poverty, Inequality, and Public Policy",
        "Class Number": "33614",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6070",
        "Class Name": "Public Affairs Statistics",
        "Class Number": "5744",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.93"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6075",
        "Class Name": "Data, Models and Evaluation",
        "Class Number": "6349",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "35",
        "Rating": "4.76"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "6075",
        "Class Name": "Data, Models and Evaluation",
        "Class Number": "6361",
        "Term": "AU 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.73"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "7571",
        "Class Name": "Multivariate Regression Analysis",
        "Class Number": "37149",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "8890.01",
        "Class Name": "First Year Doctoral Seminar",
        "Class Number": "36711",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "8890.03",
        "Class Name": "Third Year Doctoral Seminar",
        "Class Number": "6365",
        "Term": "AU 23",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5250",
        "Class Name": "Poverty, Inequality, and Public Policy",
        "Class Number": "35750",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "5250",
        "Class Name": "Poverty, Inequality, and Public Policy",
        "Class Number": "36457",
        "Term": "SP 24",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.71"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3,
    "department": "Public Administration",
    "firstName": "John",
    "id": "VGVhY2hlci0yNTUwNDAw",
    "lastName": "Begala",
    "legacyId": 2550400,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Begala's class was very lecture heavy with some in class discussions. Two short journals or exercises per week and one final paper at the end of the semester. No exams, attendance is mandatory and makes up large chunk of grade. Lectures could be boring but Professor Begala has tons of knowledge and experience to share.",
        "course": "PA2130"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was so painful, it's a miracle I made it lol. SO boring, all the material is basically memorizing adjectives. Not only does attendance disproportionately weigh the class, he also grades hard for literally no reason.",
        "course": "PA2130"
      }
    ],
    "SEI": [
      {
        "Subject": "PUBAFRS",
        "Catalog": "2130",
        "Class Name": "Leadership in the Public and Nonprofit Sectors",
        "Class Number": "5776",
        "Term": "SP 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.06"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2130",
        "Class Name": "Leadership in the Public and Nonprofit Sectors",
        "Class Number": "5916",
        "Term": "AU 21",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "3.25"
      },
      {
        "Subject": "PUBAFRS",
        "Catalog": "2130",
        "Class Name": "Leadership in the Public and Nonprofit Sectors",
        "Class Number": "5805",
        "Term": "SP 22",
        "College": "John Glenn College of Pub Aff",
        "Department": "John Glenn College of Pub Aff",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.25"
      }
    ]
  }
]