[
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.4,
    "department": "Religion",
    "firstName": "Reuben",
    "id": "VGVhY2hlci00MTg2NDY=",
    "lastName": "Ahroni",
    "legacyId": 418646,
    "numRatings": 5,
    "summary_comment": "Professor Ahroni is known for his fairness and wisdom, though his teaching style can be intimidating. Students appreciate his detailed notes and strong emphasis on class participation, which he consistently follows through with. His thick accent, while challenging at times, does not detract from his ability to convey important information thoroughly.",
    "summary_comment_short": "Professor Ahroni is known for his fairness and wisdom, though his teaching style can be intimidating. He emphasizes class participation and has high expectations, which can challenge students but also leads to significant learning.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Intimidating but fair and wise.  Will not tolerate hogwash.  When he says he will remember those who participate, he means it.",
        "course": "HEBH370"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "His teaching style is reasonable and good notes help a lot.  The problem is that he has a very heavy accent, and you will find that he is a lot easier to understand when he speaks Hebrew, whether or not you do.",
        "course": "HEBREW378"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 1,
        "comment": "If you take decent notes it is extremely easy to do well. His accent takes some time getting used to. He loves class participation, he'll force it.",
        "course": "HEBREW378"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "fairly difficult to understand. if you know Bible stuff you'll do well, but if not I wish you the best of luck. everyone in the class who was jewish did very well but anyone who didn't know the old testament by heart got very low grades",
        "course": "CS272"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Good teacher; I learned a lot of biblical wisdom that I never knew before. He is elderly, but that experience makes him that much wiser. He is from Israel, so he has a thick accent and is hard to understand, but he does go through everything in detail.",
        "course": "HEB378"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Religion",
    "firstName": "J",
    "id": "VGVhY2hlci03MjIwOTI=",
    "lastName": "Marino",
    "legacyId": 722092,
    "numRatings": 2,
    "summary_comment": "Professor Marino is highly regarded for his engaging teaching style, able to make boring subject matter seem interesting. Students find his classes easy to pass, earning them an \"easy A.\"",
    "summary_comment_short": "Professor Marino is highly regarded for his engaging teaching style, able to make boring subject matter appear interesting, and students find his class an easy path to an A. However, one student did not provide any comments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is seriously one of the hottest professors I've ever had. The subject matter is boring, but he makes it seem more interesting. Its an easy A.",
        "course": "COMPS367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "COMPSTD270"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.2,
    "department": "Religion",
    "firstName": "Tanya",
    "id": "VGVhY2hlci01Nzg5MzI=",
    "lastName": "Erzen",
    "legacyId": 578932,
    "numRatings": 13,
    "summary_comment": "Professor Erzen is generally regarded as a competent and approachable instructor who provides ample extra credit opportunities and ensures fair grading. However, her lectures are often described as boring and occasionally repetitive, which can lead to difficulty staying engaged. Despite these challenges, many students find value in her classes and appreciate her clear expectations and supportive demeanor.",
    "summary_comment_short": "Professor Erzen is generally considered an effective instructor who provides ample extra credit opportunities and maintains fairness in grading. However, her lectures can be quite dull and she tends to read from slides quickly, which may lead to students feeling bored or sleepy.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Most students of CS 270 will not notice the jarring errors and subtle prejudice she exudes. I took this course to fill a req, but already knew the subject she was teaching- it turns out, better than she does. Good course if all you care about is the grade- except, of course, when she yells at you for taking notes (I wish I was kidding).",
        "course": "CS270"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent teacher.  Class is a little boring, but not bad.  Lots of extra credit opportunities.  Very fair grader.",
        "course": "COMP270"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class is very easy as long as you go to lecture and take notes. If I didn't I would have failed. The lectures aren't posted, and the book isn't used much. As long as you go, this class will be an A. The lectures are ok as long as you participate. She is very academic in her study of religion, so don't worry about being offended.",
        "course": "COMP270"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Erzen is great!  Even when she was pregnant, she was so calm and held things together so well.  I learned so much from her, but I never felt like the class was too work intensive at all.  Take Comp Studies H270 with her if you can!",
        "course": "COMPH270"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you show up and do the homework you'll probably get an A.  It was actually an interesting class, but the writing sometimes gets repetitive.",
        "course": "CMSTD308"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "She was very nice and I think I learned a good deal about other religions, but I felt that she graded too hard.  It was an honors class, but it was also an intro class and her comments made me think that she expected as much out of our class as she would out of a higher level class.  Lectures got kind of boring halfway through the year.",
        "course": "CSH270"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Interesting but extremely boring. She was nice but really quiet and had trouble allowing students to have their own opinions.",
        "course": "RELIH270"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 1,
        "comment": "She is a very nice person, but her lectures are very boring. She also reads off the slides way too fast. On the flip side she gives lots of extra credit opportunities. So getting an A is not hard.Just be prepared to fall asleep in lecture as she is boring.",
        "course": "COMPT270"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "great prof, great class",
        "course": "WRITIN"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "Such a sweet woman!  This was easily the best, most interesting class I have taken at OSU.  I learned so much, not only about my religion, but others as well.  To make it even better, the class is incredibly easy :)  DEFINITELY take it with Prof. Erzen!",
        "course": "CS270"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent prof.  Very organized.  You will learn a lot in her class.",
        "course": "SOCIALMOVEMENT"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good professor.  Go to class, participate, read and write your essays and you will get an A.  Very helpful with essays, will meet with you multiple times to help you improve it.",
        "course": "COMPSTDS3670"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "lectures were very informative, but she goes way too fast through her slides. she gives a pretty decent study guide for midtermand final. tests were long and kinda rough, but i did ok",
        "course": "CS270"
      }
    ],
    "SEI": []
  }
]