[
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Religious Studies",
    "firstName": "Issac",
    "lastName": "Weiner",
    "legacyId": 2900803,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 0,
        "rating": "5.0",
        "comment": "Dr. Weiner was my first professor at OSU and I couldn't have asked for a better start to my time at OSU. The class is structured to allow students to succeed and the lectures and easy to understand while being engaging. I heavily recommend this class for the GE Race, Ethnicity and Gender Diversity."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Great professor and a very easy class. There are no exams, just a few 3-5 page papers along with the normal reflection posts and 8-10 question quizzes on Canvas. He is extremely caring and understanding if you have to miss class and is open to helping you in circumstances outside of the class even if you just want to talk. HIGHLY RECOMMEND!"
      }
    ]
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.9,
    "department": "Religious Studies",
    "firstName": "Isaac",
    "id": "VGVhY2hlci0yNDgzNTE5",
    "lastName": "Weiner",
    "legacyId": 2483519,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Doctor Weiner is one of my favorite professors at OSU. He truly cares about his students and has an absolute wealth of knowledge about religion and world history. There are a lot of \"assigned\" readings for this class but honestly you do not have to read them as long as you make sure to reference lectures in your papers you will get good grades. ",
        "course": "RS3680"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Overall a great professor. Nothing to really complain about and he definitely cares about his students. Class was set up well and everything was communicated clearly.",
        "course": "RELSTDS2370"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Weiner was a good lecturer, and the class is set up super easy. Interesting ideas are discussed, and was an easy credit for the race, gender, and diversity GE. Really nice guy.",
        "course": "RELSTDS2370"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Weiner was one of my favorite teachers that I have had so far during college. He really loves what he teaches about which makes lectures so much more interesting. There are weekly discussion posts and a few essays, but as long as you take them seriously, you will have no problem getting a good grade.",
        "course": "RELSTDS3680"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class to fulfill my \"race, ethnicity, and gender diversity\" GE requirement. This will be one of the easiest classes on your schedule. Plenty of different grades: 2 light papers, weekly reflection posts, TopHat attendance codes, 5-6 online quizzes, and 3 \"case studies\" from chosen lecture topics. Submit everything and you will get an A.",
        "course": "RELSTDS2370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Weiner is undoubtedly the best professor I have  had in my life. Super passionate about what he teaches, and left every class feeling smarter. Would take this class again in a heartbeat. \n\nIf it matters to you, the class is an easy A. No tests, quizzes, midterm or final. Graded on 2 papers + 1 project, but those are graded pretty light. ",
        "course": "RELSTDS3680"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Weiner is a really good professor who cares about all of his students. While attendance is mandatory, he is very understanding and willing to bend the rules if you communicate with him. He prioritizes giving good feedback and you can tell he's genuinely passionate about what he teaches. ",
        "course": "RELSTDS3680"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Weiner really cares for his students. His content can be challenging to understand but he makes it manageable for all students. Mix of discussion posts and a few papers but nothing to worry about if you space the work out. Great guy, good option for GE requirement.",
        "course": "RELSTDS3680"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors, he offers really interesting topics for discussion. Course is challenging, but hardly impossible. It's asynchronous, so don't worry about logging on at a specific time unless you want to. Overall, super smart and knowledgeable guy, committed to making the material accessible. Would definitely take this class again!",
        "course": "RELSTDS3680"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing course! Amazing professor! You will learn a lot and actually enjoy it the whole time!! Awesome.",
        "course": "RS3680"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.4,
    "department": "Religious Studies",
    "firstName": "Spencer",
    "id": "VGVhY2hlci0yNjI3MTEx",
    "lastName": "Dew",
    "legacyId": 2627111,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I would 100% recommend taking a class with Professor Dew. This class is very discussion-based, which was a refreshing break from the typical lecture-heavy format. His teaching skills are amazing, and he knows how to engage the class and get everyone excited about the material we were reading. Put in the effort, and you will earn an A.",
        "course": "AFAMAST2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Second class I have taken with Dew. He is hilarious -- attendance not mandatory, but always had a good time when I showed up. Low key insane amount of reading expectations though. I liked the readings (they were always interesting), but you can get by skimming the books. Easy exams / projects.",
        "course": "AFAMAST3440"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very caring and tries to make class discussions engaging. Supportive outside of class. Workload is not too bad and is a fairly easy grader. Wonderful professor overall!",
        "course": "RELSTDS2370H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was great at picking insightful texts and getting us involved in the discussions. The class is entirely discussion based from readings we do for homework, but the readings are very enjoyable. Other than that, there are just three papers which you can be creative with and share your own opinions with. Definitely recommend!",
        "course": "AFAMAST2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Dew was a really good professor this spring. I had him for African American Lit and while I didn't know what to expect in this class at first, he made it fun and insightful. He definetely talks more than her should and sometimes interrupts the discussion but it's not intentional. He does a good job leading and only assigned 3 essays",
        "course": "AFAMAST2367"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Dew is amazing as both an academic and a person. My only complaint is that the Carmen for the course is a bit confusing.",
        "course": "AFAMAST2367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Dew is super passionate, and it reflects in his teaching. The class is pretty much all discussion, but not graded discussion. The readings can be kind of a lot, but class is effective at clearing up confusion. \n\nGrading is really lenient, except maybe the midterm and final, but those don't count for much compared to most other courses.",
        "course": "RELSTDS2370H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Dew is awesome. He is enthusiastic about his classes.b Lecture and discussion based which were well done and engaging. Really responsive to emails, easy to reach, flexible and understanding. Do the work, give your best effort, and you will get a good grade. He is currently an OSU prof, visiting prof at Kenyon where I took his class.",
        "course": "RLST291"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Spencer is easily my favorite professor I have had at OSU. He is definitely picky with his grading, but his lectures are always extremely helpful, and he is easy to access outside of class. The class itself is based off of 4 papers, and since he is a picky grader, they can be intimidating, but the class is so interesting and definitely worth taking",
        "course": "RELSTDS2102"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lectures were pretty boring, not going to lie. But Prof. Dew is a good professor in discussions about the book and making you understand it better. In order to do well in this class you will have to read, in my section we read about 5 novels and wrote 4 essays. Only graded by these essays and discussion board posts.",
        "course": "RELSTDS2102"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 1,
        "comment": "Interesting class. It was his first time teaching it at OSU and it was not what I was expecting, but in a good way. Learned a lot you wouldn't normally learn in this type of intro class. Confusing in class, but great convos in office hours. Easy grading, pretty lax with it too. Discussion boards, one quiz, and a hefty research project for grades.",
        "course": "RELSTDS2370H"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 1,
        "comment": "The guy is interesting and clearly very smart, but something about him is a little annoying to me. He likes to hear himself talk. Never answers questions helpfully, just goes off on tangents. Grading was confusing, couple tests and a project. The way he built the class was great though. Not your average comparative religion class--I learned a lot.",
        "course": "RELSTDS2370H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Religious Studies",
    "firstName": "Issac",
    "id": "VGVhY2hlci0yOTAwODAz",
    "lastName": "Weiner",
    "legacyId": 2900803,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Weiner was my first professor at OSU and I couldn't have asked for a better start to my time at OSU. The class is structured to allow students to succeed and the lectures and easy to understand while being engaging. I heavily recommend this class for the GE Race, Ethnicity and Gender Diversity.",
        "course": "RELSTDS2370"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor and a very easy class. There are no exams, just a few 3-5 page papers along with the normal reflection posts and 8-10 question quizzes on Canvas. He is extremely caring and understanding if you have to miss class and is open to helping you in circumstances outside of the class even if you just want to talk. HIGHLY RECOMMEND!",
        "course": "RELSTDS2370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Religious Studies",
    "firstName": "Andreas",
    "id": "VGVhY2hlci0yNjI2NDI0",
    "lastName": "Chavez",
    "legacyId": 2626424,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Chavez was an okay instructor. The course is set up nice with the fact that there are weekly exams instead of midterms and finals, but the material is a lot to learn every week. Also, the \"lectures\" are just a review of the pre-recorded lectures from other professors that he makes us watch, instead of teaching us the material himself.",
        "course": "EEOB3310"
      }
    ],
    "SEI": []
  }
]