[
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.7,
    "department": "Russian",
    "firstName": "Greg",
    "id": "VGVhY2hlci0yMDIwMzQ0",
    "lastName": "Ormiston",
    "legacyId": 2020344,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Probably the best Russian instructor I have had thus far. Greg is very helpful and classes are engaging and enjoyable.",
        "course": "RUSS1103"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Greg is a babe, pure and simple. Aside from his cute face and butt, he is a good teacher and is clearly interested in helping students understand the material. Participation in class matters, complete the homework assigned, and study vocab and this class will be a breeze. There was one group project, but it was very easy, and he is an easy grader.",
        "course": "RUSS110201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Greg is a great professor! He is very helpful in answering any questions you may have. If you are taking a Russian class, look for him! ALSO very attractive. ",
        "course": "RUSSIAN1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Greg was awesome! Best Russian professor have had thus far. He was super helpful, posted all the powerpoints after class, and we always watched a Russian cartoon at the end of class on Fridays to help with new vocab. You have to go to class for participation points. He was very knowledgeable and an overall great teacher. I would HIGHLY recommend.",
        "course": "RUSS110201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4.5,
    "department": "Russian",
    "firstName": "Joseph",
    "id": "VGVhY2hlci0yMTgxODk5",
    "lastName": "Schlegel",
    "legacyId": 2181899,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I really liked Schlegel! He's a knowledgeable professor that wants you to understand the material. He gives extra credit when earned, will work with you outside of class, and will grade for accuracy but not too harshly.",
        "course": "RUS1101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Uses a lot of hands on activities. Is willing to work with you outside of class. Overall not bad, I'm taking the next level with him next semester",
        "course": "RUSSIAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.7,
    "department": "Russian",
    "firstName": "Irene",
    "id": "VGVhY2hlci0xNjYzMzM0",
    "lastName": "Delic",
    "legacyId": 1663334,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is so intelligent and knowledgeable about all things Russian: language, literature, history, culture, etc.. As long as you pay attention in class and skim the book (or sparknotes) you'll do fine in the class. She is very forgiving on quizzes and enjoys novel, even if inaccurate, ideas. More than willing to help students.",
        "course": "RUSS250"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Delic was really knowledgable.  Super friendly, too, & always willing to talk over material/your work in office hours.  The readings were challenging and time consuming, but pretty interesting/relevant.  If you aren't a stellar writer or willing to invest a lot of time in understanding the era then the class will be a bit hard.",
        "course": "RUSS251"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great reading lists and interesting lectures. If you do not like russian literature or can't read a 500 page novel in less than two weeks, then this class isn't for you. But then, russian literature might not be for you. All of her classes are wonderful, and she's very nice.",
        "course": "RUSSI520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Ana",
    "id": "VGVhY2hlci0xODkzMTQ2",
    "lastName": "Kabakova",
    "legacyId": 1893146,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ana was genuinely interested in making sure her students succeeded. She was always patient and willing to work with students in class and during office hours to ensure we understood the material. she is also very familiar with the material and therefore gives clear explanations.  Overall, one of the best instructors I have had at Ohio State.",
        "course": "RUSS2104"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.3,
    "department": "Russian",
    "firstName": "Marcela",
    "id": "VGVhY2hlci05Nzg4MDk=",
    "lastName": "Michalkova",
    "legacyId": 978809,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super nice, very helpful, makes sure you understand your mistakes without taking points off for them. Russian is her second language also, so she understands the difficulty in learning the language. Would gladly take more of her classes.",
        "course": "RUSS104"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy professor. You'll watch some movies, discuss them, read 2 short novels (although I didn't). MUCH LESS writing that other similar courses. Few 1-2 assignments. Her quizzes and exams are very easy. You'll learn a lot too about Czechoslovakia",
        "course": "CZECH245"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lovely",
        "course": "RUS135"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "i heard this class was easy but it def was not.  There was a ridiculous amount of information to learn for the tests especially number 2.  she had to curve the second one and probably the final too.  you should never have to curve a GEC.  there has to be something easier to take that fulfills this requirement, i've heard eastern lit is easy",
        "course": "RUS135"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "RUS135"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1,
    "department": "Russian",
    "firstName": "Curtis",
    "id": "VGVhY2hlci0xNTkwMzcz",
    "lastName": "Drummond",
    "legacyId": 1590373,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "A very poor teacher overall.  He provides little to no insight into films, he does not control members of his class and agrees with all opinions regardless of whether or not they even make sense.  He tests are not based on the work that we do in class or any of the assigned readings. Unless you are a Russian or film major you will struggle.",
        "course": "RUS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.9,
    "department": "Russian",
    "firstName": "Susan",
    "id": "VGVhY2hlci0xMTA5NTkw",
    "lastName": "Vdovichenko",
    "legacyId": 1109590,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Susan is awesome! Class isn't anything strenuous. If you keep up with the readings (2 books and a few short stories) and participate every now and then during class you should be good. Three exams and a final paper during finals week. Great class even if you aren't interested in Russian Lit",
        "course": "RUS250"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "great teacher, friendly, creative, fun. really prepares you for her tests, great study guides. just a good class and teacher in general!",
        "course": "RUS235"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful and interested in teaching. Willing to spend extra time on topics that are difficult to students. Many extra credit opportunities and tries to make class interesting and fun. Her personal experiences help us understand the culture behind the language.",
        "course": "RUS103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She tells you exactly what is expected of you and really that isn't too much.  If you put in enough effort to read the stories and go to class, you'll most likely get an A.  The midterm/final have some lengthy essays but even as an engineering student, it wasn't bad.  If you were having any trouble I'm sure she'd jump at the opportunity to help you",
        "course": "RUS135"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Outstanding professor.  Really passionate about the subject. Genuinely cares about each student. Highly recommended!",
        "course": "RUS135"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teahcer, Very entertaining and helpful. She is very hot and makes the class fun and interesting.",
        "course": "RUSS101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very clear and concise teacher especially valuable when trying to learn a new language, the class is a lot of fun and she does a very good job of using outside source such as youtube to teach the class.  One warning though is that she will give you a bunch of tiny paper handouts that are helpful, but eventually will fall out after your notbook fill",
        "course": "RUSSN102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Ryan",
    "id": "VGVhY2hlci0xMDgzMzA5",
    "lastName": "Walker",
    "legacyId": 1083309,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ryan is an excellent teacher. He makes Russian literature come alive--no easy task mind you! He has a dry sense of humor, but is quite funny. I had never ready ANY of the books before this quarter, so everything was totally new. I will never forget Crime and Punishment!!",
        "course": "RUS250"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ryan is a great teacher. I've taken 2 classes with him and would take another if I could. He is extremely enthusiastic about Russian culture and language and conveys that to his students. You need to do the work and show up for classes to get an A. The work, however, is not difficult. He is very helpful outside of class as well. Highly recommended!",
        "course": "RUS135"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. Took my first Russian class with him and he made it really easy and a lot of fun. He was really helpful and would meet outside of class if you needed it.",
        "course": "RUS101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took russian lit as a freshman, loved the class and discussions and that is a rarity. Interesting topics and grades easy.",
        "course": "LIT333"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ez class, great professor. The readings are easy and even interesting. Will get an A guaranteed if you read,show up to class and participate.",
        "course": "RUS250"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ryan is a great professor. He's really engaging and a pretty easy grader! Read the books and you'll get an A. If you don't read the books, you'll still probably do okay just by showing up to class but you'll probably only get a B.",
        "course": "RUS250"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4.2,
    "department": "Russian",
    "firstName": "Polina",
    "id": "VGVhY2hlci0xMDYzNDEz",
    "lastName": "Rikoun",
    "legacyId": 1063413,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "She was very arrogant I thought and obnoxious with her work. Went in several time for extra help and was a waste of time for both of us. She seemed annoyed. I think she knows her stuff, but doesnt have good relationship with her guy students especially.",
        "course": "AHUM2097"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "loved it. adorable professor, great class, read lots of unfamiliar books. she really is a great great professor, and truly wants to help her students become more attentive readers and better writers. any class with her should be good.",
        "course": "RUSS521"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Polina was a great teacher. I really enjoyed the classes and the readings. If you have any interest in literature, take her class.",
        "course": "RUS521"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.6,
    "department": "Russian",
    "firstName": "Sara",
    "id": "VGVhY2hlci0xNDA3Njgy",
    "lastName": "Orr",
    "legacyId": 1407682,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "I am not a Russian major and I took this class for a GE. Sara made Russia easy for any student. She is extremely sweet and a very easy grader. Her enjoyment for the Russian culture made me enjoy the class and I would take it again any day. You do have reading heads up, but you can skim and be ok. She goes over the important parts in class.",
        "course": "RUSSIAN2335"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Sara is great. 2335 could have been better had she had helpful powerpoint presentations with words but other than that the class wasn't hard. I didn't study for the midterm and got an A. She's a great teacher who knows here stuff and even when she's unsure of a topic, she looks it up for us. I'd take a class with her again.",
        "course": "RUSSIAN2335"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "I LOVE SARA. She's a great teacher and extremely helpful and understanding. If you put in the time and effort to do the homework, participate, and go to class, you'll be able to pass with no problem. My only issue is that I wish she would write more of the spellings either on the board or in her powerpoints. Overall, great lady. ",
        "course": "110101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher & class! Very helpful, very available to ask questions. She assigned homework that helped you understand the lecture, always provided study guides, was very clear when teaching grammar. Very patient. Her in-class activities always helped me understand. Class was easy if you STUDIED AND TRIED. I recommend it to anyone taking Russian!",
        "course": "RUSSIAN110101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great teacher.  I went in not sure how I would feel about Russian, but she is very helpful, fun, and knowledgeable about Russian.  She has helped me become interested in this language.  A great teacher that I highly recommend.",
        "course": "RUS1101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is very nice and very interested in learning. She helps in in way she can, and will answer any question you have even if it's not class related. The class is easy as long as you attend and ask questions when you're confused. The book is only useful for the 'end of chapter overview'.",
        "course": "RUS103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 3.7,
    "department": "Russian",
    "firstName": "Ryan",
    "id": "VGVhY2hlci0xOTc2OTg0",
    "lastName": "Perkins",
    "legacyId": 1976984,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "class: 37 out of 37 jon snows personality: a solid 25 out of 37 jon snows go to russian table because it is fun and you get to meet cool grad students",
        "course": "11011"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's awk in the best way. Get ready for a fun time and maybe learn some Russian woohoo",
        "course": "11021"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Tests aren't hard but the quizzes ARE (and they're graded harder). You won't necessarily be reminded of exactly when they are either, so check the syllabus. He doesn't really like a lot out for you or pass out handouts that explain, so get ready to write down basically everything he says. GO TO RUSSIAN TABLE. Other than that, pretty easy A.",
        "course": "24410"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 4,
    "department": "Russian",
    "firstName": "Ekaterina",
    "id": "VGVhY2hlci0yMjU2NDYx",
    "lastName": "Kibler",
    "legacyId": 2256461,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "Best Russian teacher I have had. She takes time to go over everything and really goes out of her way to help you succeed. I highly recommend her.",
        "course": "RUSS1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0yMTEzNjAz",
    "lastName": "Lane",
    "legacyId": 2113603,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher! Homework wasn't especially difficult, and she used enough Russian in the class to keep us learning without the lessons becoming indecipherable. Would recommend!",
        "course": "RUSS1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great instructor, one of my favorites! Of course, you are learning a new language, so you will have to put in work, but homework assignments are relatively short. She is good about speaking in Russian during class so that you have the chance to become accustomed to hearing it. She is super nice, fun, and always willing to help!",
        "course": "RUSSIAN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.7,
    "department": "Russian",
    "firstName": "Robert",
    "id": "VGVhY2hlci0xNjk2NTY4",
    "lastName": "Mulcahy",
    "legacyId": 1696568,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's is one of the most attentive and caring professors I've ever met at W&amp;M.",
        "course": "RUS101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's now at W&M, not Ohio State. I've taken several classes with Robert, both in Russian and English, and they've all been fantastic. It takes a bit to warm up to his cynical personality, but once you do, I promise his classes will be some of your favorites, even if you're not interested in Russia. He's a fair grader with reasonable expectations.",
        "course": "RUSN202"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great Russian teacher. He's very amusing and makes studying the language very interesting. I plan to stick with him for the next few semesters.",
        "course": "RUSN102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher. Plan on taking again.",
        "course": "RUSSIAN1103"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "He was a helpful teacher. He took a deep interest in some of his students. He knew a lot about Russian film!",
        "course": "RUSSIAN3460"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great lit class. Really interesting books & stories to read. Not too much work. Participate in class & prepare for class. Watch two movies and learn a lot about Russian history and culture. Great class and amazing professor. He explains things well and is VERY helpful.",
        "course": "RUS2250"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Good guy, pretty good teacher. Homework every class, but not an unbearable amount. Knows Russian well, some issues in translating between the two languages, but he's a teacher, not an interpreter. Tests are fair and cover what was covered in lecture. I'd take another class with him.",
        "course": "RUSS401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Russian",
    "firstName": "Stephen",
    "id": "VGVhY2hlci0xMDE5MjA1",
    "lastName": "Robinson",
    "legacyId": 1019205,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I LOVE Spencer Stepanovich! He is a terrific teacher, very helpful, extremely knowledgeable, and very friendly and funny! One of the best teachers in the department, you will for sure leave the class with your Russian greatly improved and have the tools to advance in the language. I would give anything to have in again!!",
        "course": "RUSS402"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is the man. He is probably the nicest person I have ever met. He is willing to go the extra mile to help his students. There was little homework and tests were open notes. The lectures were a tad boring, though",
        "course": "RUS135"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Russian",
    "firstName": "Justin",
    "id": "VGVhY2hlci0xNjAyNzA3",
    "lastName": "Wilmes",
    "legacyId": 1602707,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Justin is very helpful and knowledgeable about Russian. He doesn't give much notice on assignments and presentations, but he is a fair grader. He allows a little too much English in the class, but makes up for it with many authentic texts and films and songs. And he's hot.",
        "course": "RUSS4101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really passionate about the subject. He encourages participation and it's worthwhile if you do the reading and participate because there is a lot to be gained from the course. He leads discussion well and keeps students engaged.",
        "course": "RUSSIAN2250"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Favorite teacher I've had so far in any class let alone Russian.  As has been said he is patient, understanding, easy-going but also keeps the class moving.  If you see him assigned to a class, take it.",
        "course": "RUS2104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely patient, helpful, and knowledgable. Expects you to be prepared and participate, but because of this it is easy to do well. Very engaged and interested in seeing his students succeed. I had him for 101 as well as 102.",
        "course": "RUSS101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Teacher! Very helpful to students, answers any questions you have.  Teaches the whole class in Russian which makes it easier to learn.  Expects you to be prepared and participation.  Very clear on everything you have to know.",
        "course": "RUS101"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great teacher. Really clear with everything he teaches.  Teaches the whole class in Russian so you pick up on it easier.  Answers any questions that anyone has.  Expects participation and for you to be prepared.  Overall a great teacher.",
        "course": "RUS101"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "New teacher. Young and laid back. Asks a lot of questions and expects students to be prepared. Easy to follow.",
        "course": "RUSS360"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.3,
    "department": "Russian",
    "firstName": "Jeff",
    "id": "VGVhY2hlci0xNDE1OTgy",
    "lastName": "Parker",
    "legacyId": 1415982,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "He's super nice, easy to ask questions, and is an awesome professor! He teaches over everything you need to know, plus throws in cool, interesting topics.",
        "course": "LING2000"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Good teacher definetly cares about his students!",
        "course": "LING2000"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jeff is great! he is very interesting and very nice. I am really glad that i'm in his class.",
        "course": "LING2000"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great teacher who puts a lot of effort into lectures, but can be a little monotonous. He's entertaining, but not worth suffering early mornings or hangovers for.",
        "course": "RUSS104"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a great prof. He is studying linguistics so he uses it a lot in class. Take his class, he'll confuse and entertain you at the same time.",
        "course": "RUS102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.5,
    "avgRating": 1.5,
    "department": "Russian",
    "firstName": "Anastasia",
    "id": "VGVhY2hlci0xNjgyMTM4",
    "lastName": "Kostetskaya",
    "legacyId": 1682138,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "this class was ridiculous!!!! its Russian culture not Russian history from day one to now!!!! holy crap!!! there was soooo much reading and the test were pretty much irreverent to everything important to know in this class. study the thing you think are stupid and pointless because thats what the test will be on!!!! worse class ever!!!",
        "course": "2335"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Absolutely ridiculous. There was hours upon hours of readings every night. Pop quizzes on those said readings that were between 2-4 questions a pop. You get one question wrong, you fail. Way too much information presented all at once. Most of her class even said it was getting to be too overwhelming. I dropped as soon as I could.",
        "course": "RUS2335"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.5,
    "department": "Russian",
    "firstName": "Zoran",
    "id": "VGVhY2hlci0xNDczOTk5",
    "lastName": "Panjak",
    "legacyId": 1473999,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bad professor!!!",
        "course": "RUS250"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "A great experience, Zoran is a laid back, hilarious teacher who really knows how to make material interesting. On the first day of class he makes it crystal clear that if you show genuine interest in the material and are willing to engage in discussion, then the grade will be secondary to actually learning something new.",
        "course": "RUS250"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Took Russian Lit with this guy (he's a TA). Excellent leader of class discussion. Entertaining and knowledgeable.  Unbelievably tall. A bit on the politically incorrect side...",
        "course": "RUS250"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.7,
    "department": "Russian",
    "firstName": "Ray",
    "id": "VGVhY2hlci0yMTAwNDI0",
    "lastName": "Alston",
    "legacyId": 2100424,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very cool guy. Knows tons about Russia and loves a good laugh. Subject matter was very interesting as well. The class was not too difficult, there are regular readings but you can usually get by without them. Workload is about average. As long as you keep up with assignments and show up to class you should be fine.",
        "course": "RUS2335"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Alston is an amazing person and professor and I wish I could take every class with him. The class is very discussion heavy focused on the readings from the night before. Attendance is mandatory but you won't get heckled if you miss, but rather he asks to make sure everything is okay. He memorizes everyone's name and always asks how things are.",
        "course": "RUSSIAN2335"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Taking a language course requires constant review. This professor was horrible at returning homework for student use. He is a kind and funny professor but his lack of organization and ability to grade and return papers timely negatively impacts the students opportunity for success.",
        "course": "RUS1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ray is a really great teacher. He is very creative in his teaching style and it helps you remember the concepts and words. His class inspired me to declare Russian as my second major.",
        "course": "RUS1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "RAY IS THE BEST!! He is an amazing instructor and I learned so much from him. He looks like Harry Potter, sings like an angel, and is the funniest instructor I have had AND he is very knowledgeable and helpful. He is also starting to teach Russian 2250, a literature course which I would suggest. Get ready to learn a lot and enjoy class.",
        "course": "RUSSIAN1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ray is an incredible teacher. He explains the material very thoroughly, using clear examples and drilling the grammar and vocab needed for the basis of the Russian language. He keeps the class engaged and is hilarious, as well as preparing for the tests very well. I'm taking another class with him this semester.",
        "course": "RUSSIAN1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.3,
    "department": "Russian",
    "firstName": "David",
    "id": "VGVhY2hlci0xMjU1MTk0",
    "lastName": "McVey",
    "legacyId": 1255194,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "McVey is a great guy and a good prof. Material is genuinely interesting and the lectures directly coincide with exams.",
        "course": "SLAVIC223O"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Hes literally so nice, you have to read a lot but everything is very interesting. Hes very passionate about the subject and seems like he really enjoys teaching the material. You can take the quizzes late for partial credit, and the exams are pretty easy as long as you study. Its a very easy GE class and I would recommend everyone take it.",
        "course": "SLAVIC2230"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Russian Culture class Online-I think there was a language barrier i.e we watched a movie were a guy was awarded a metal in a war &amp; later on found a homeless boy and took him in. Question was &quot;was the guy awarded a son&quot; I said no. The correct answer was yes because the narrator award him a son. We also had a 2-3 hour movie to watch each week.",
        "course": "RUSSIAN2335"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Does not go over material in class as mentioned solely in the book. Slides he posts are just pictures and mostly useless. Asks to do exercises which require knowledge of verbs and conjugation not previously learned. This is Russian 3! If I could do the difficult exercises you request in the homework, I would not be in Russian 3.",
        "course": "RUSSIAN110301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "I always forget to fill these out, but in hearing comments from my fellow Russian students about their professors, I find myself extremely grateful to have had McVey as an instructor. If you want to learn Russian &amp; and you have the opportunity to learn from McVey, take it! I hope I have the opportunity to take another of his classes in the future.",
        "course": "RUSS1102"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 4,
        "comment": "Prof. McVey was a great professor. Very knowledgable and passionate about Russian.  There is homework everyday but it was only graded for completion.",
        "course": "RUSS1103"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Cares about teaching, but you gotta put in the work yourself or else youll struggle. Dont miss class and do all the homework",
        "course": "RUSS103"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "I had David as a Russian instructor at IU's summer language program (SWSEEL). He's a very competent instructor, and he is very good at explaining things to students. He can be a little hard to relate to - class is extremely professional, but not personable. You will learn a lot - a great teacher, but extremely vanilla.",
        "course": "SWSEEL500"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is a review for Slav140 at the University of Kansas. McVey is very passionate about what he teaches, and he's a good teacher. It was the easiest, and the most interesting class that I've had so far at KU, which is probably why I enjoyed the course so much. My only complaint is that he sometimes overrides presentations & he is overly political.",
        "course": "SLAV140"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher...really took the time to try to make class fun.  He loves what he teaches and that makes it better for us",
        "course": "RUS360"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "He was a great teacher who knew what he was talking about.  I went to every class and easily got an A on every test.  I ended up getting an A for the class and didn't have to do a lot of extra work outside of class.  If you can watch some movies and listen to David then you'll be fine.  Easiest A that I've gotten at OSU so far.",
        "course": "RUSS360"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 3,
        "comment": "horrible",
        "course": "RUS360"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "David has by far been my favorite instructor at OSU.  He is always willing to help and is excellent in explaining concepts!  I highly recommend him!",
        "course": "RUSS103"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "I love David! He's so much fun and an amazing instructor. My entire class loves him and several of us chose him for 102 and are hoping to have him for 103. He's very animate and will do anything to help you learn.",
        "course": "RUSS101"
      }
    ],
    "SEI": [
      {
        "Subject": "RUSSIAN",
        "Catalog": "3101",
        "Class Name": "Third-Year Russian I: Contemporary Russian in Cultural and Literary Contexts",
        "Class Number": "22439",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.13"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "1101.01",
        "Class Name": "1st-Year Russian I (Classroom Track)",
        "Class Number": "21696",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3102",
        "Class Name": "Third-Year Russian II: Current Events through the Russian Media",
        "Class Number": "21702",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "2365.01",
        "Class Name": "Sports, Socialists, and Society in Russia and Eastern Europe",
        "Class Number": "35879",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "2365.99",
        "Class Name": "Sports, Socialists, and Society in Russia and Eastern Europe (Online)",
        "Class Number": "35606",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.56"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "3310",
        "Class Name": "Science Fiction: East vs. West",
        "Class Number": "23859",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "14",
        "Rating": "4.64"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "3310",
        "Class Name": "Science Fiction: East vs. West",
        "Class Number": "34112",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.53"
      },
      {
        "Subject": "WGSST",
        "Catalog": "3310",
        "Class Name": "Science Fiction: East vs. West",
        "Class Number": "26265",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "18",
        "Rating": "4.56"
      },
      {
        "Subject": "WGSST",
        "Catalog": "3310",
        "Class Name": "Science Fiction: East vs. West",
        "Class Number": "35276",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Russian",
    "firstName": "Marina",
    "id": "VGVhY2hlci0xNjkxODk5",
    "lastName": "Pashkova",
    "legacyId": 1691899,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a good professor. We do a lot of the learning outside of the classroom and practice inside. The homework is a bit unreasonable, at least two hours every night, and quizzes almost everyday which got very frustrating. The homework is most of the time useful, sometimes not.",
        "course": "RUSSIAN4101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I transferred to another Big 10 school and no one in the Russian department comes close to Marina. If you can, take her classes. She's amazing.",
        "course": "RUS2104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best instructor I've ever had. Intentionally scheduled three semester so that I could take Russian with her. Knows exactly how to teach the language and help students improve. The daily homework is designed to help you develop your skills effectively and it really works. 100% amazing!",
        "course": "110132104"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Native Russian speaker, but speaks English very well. She wants to see you succeed and is always there to help. She is nice, but will call you out if you're slacking. Do your homework, participate, and you will get a good grade. I would recommend her to anyone taking Russian. ",
        "course": "RUSSIAN1103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher, fun class.  Really learn a lot and always have a great learning experience with her as a teacher.  Fav. professor at ohio state.",
        "course": "RUSSIAN1102"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "great teacher, very fun and nice.  if you go to class, and pay any sort of attention you should end up with an A, no problem.  You will learn russian and get a good grade with Pashkova.  favorite teacher i've had at Ohio State.",
        "course": "RUS1102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Another Great semester with here! I went out of my way to get her for another class. I hope to hell I get her for Russian III! The final was super hard, for some reason though.",
        "course": "RUSSIAN1102"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "She genuinely wants to see her students succeed and learn the material. She takes it at a reasonable (if not slow) pace so no one is left misunderstanding anything. She's also really nice and straightforward.",
        "course": "RUSSIAN11012"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Has a genuine interest in teaching and helping you learn.",
        "course": "RUSSIAN1102"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best professors I have had at any level of education. She is extremely intuitive to her students and is genuinely interested in teaching and the language. She is a great native speaker, speaks flawless English, and really makes you want to learn. Would recommend to anyone taking Russian",
        "course": "RUSSIAN1102"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Amazing professor. My professor last semester taught so much wrong…Marina fixed my problems in three weeks! Gives great feedback and you know what to expect from her. Learning Russian from a native Russian is the only way to do it. I have a lot more confidence in my Russian and I know I'm learning the correct thing. Thank you Marina!",
        "course": "RUS1102"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is probably the best teacher I've had at OSU! She has a passion for teaching, and communicates the material very clearly!",
        "course": "RUSSIAN110101"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "A delight! A patient, helpful, charming native-speaker with linguistic expertise. The only drawback to having her at 1000 level is that you don't yet know enough to take full advantage of her knowledge. She is eager to help sate your curiosity, though!",
        "course": "RUSSIAN1101"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marina is one of the BEST instructors I have ever had. She is extremely helpful and encourages questions constantly. She knows if things are clear to the class or not. She is really good at explaining difficult concepts. She's not easy, she gives lots of homework and is a bit of a stickler, but she is understanding at the same time. One of the best",
        "course": "RUSSIAN3102"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely fantastic professor. She is very clear with what she is talking about and answers your questions. She is always willing to help and she really wants you to succeed. Plenty of homework but it is usually very helpful and I don't mind doing it. I actually changed my schedule for next semester just so I can have her again. Highly recommended",
        "course": "RUSSIAN110101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "She really understands language and is always willing to help.  Generally has a lot of homework at the beginning of the semester and it tapers off a lot by the end. If you actually do your work you're fine but don't expect her to curve grades if no one in the class studies and does badly. Very good Russian teacher, best I've had at Ohio State.",
        "course": "RUSSIAN3101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Victoriia",
    "id": "VGVhY2hlci0yNjUwNjIw",
    "lastName": "Kim",
    "legacyId": 2650620,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Victoriia is so kind and helpful. I am god-awful at language, but she was very encouraging of my progress through the course and was never condescending towards my many mistakes. Grading wasn't too hard, she is one of the best parts of the Russian department!",
        "course": "RUSSIAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Anastasiia",
    "id": "VGVhY2hlci0yMTQxNzQ0",
    "lastName": "Gordiienko",
    "legacyId": 2141744,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Hilarious, very sharp, helpful, &amp; gorgeous!!!",
        "course": "RUS1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great, outgoing professor and it easy to stay engaged in class. I would highly recommend her! There are a lot of readings for homeworks and weekly quizzes. As long as you go to class and do the readings it's an easy A.",
        "course": "RUS2335"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is an extremely helpful, funny, and talented professor. Highly recommend!",
        "course": "RUSSIAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best language teachers I have ever had.",
        "course": "RUS1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Jay ",
    "id": "VGVhY2hlci0yOTgxMTE4",
    "lastName": "Hadfield",
    "legacyId": 2981118,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor!!! Will help you on the spot when you ask, and his lectures are super clear and will do anything to clear confusion. Very cool to see how passionate he is about Russian. Easy quizzes if you try in class, and he is understanding of students busy schedules and only assigns around 30-45 minutes of homework a night.",
        "course": "1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Michelle",
    "id": "VGVhY2hlci0yOTc0NTAy",
    "lastName": "Verbitskaya",
    "legacyId": 2974502,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a native Russian speaker, and she is so good at teaching the language to low level Russian students. She is super accommodating and kind, just be prepared to participate in class a lot and get comfortable with speaking in front of others. Overall she teaches a great class and you will do well on the exams because of her teaching style!",
        "course": "1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "A native Russian, very well spoken and easy to understand. She is a very sweet professor with a large heart. She is accessible outside of class and very accommodating. Just be prepared for a lot of writing and homework to practice your Russian.",
        "course": "1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Randall",
    "id": "VGVhY2hlci0yMzE3NDU1",
    "lastName": "Rowe",
    "legacyId": 2317455,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor. Ask for help if you need it, he will help you. Had a lot of fun in his class, but you have to put the work in and want to be there. ",
        "course": "RUSSIAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "SUPER nice guy! Definitely cares about his students. Took Russian 1 with him and it was such a good time. Very laid back but also professional. Weekly vocab quizzes and lots of in class activities. Wish he would go over things a little longer and explain some grammar things a little better but over all a good instructor.",
        "course": "RUSSIAN1101"
      }
    ],
    "SEI": [
      {
        "Subject": "RUSSIAN",
        "Catalog": "3355.99",
        "Class Name": "Vodka in Russian Society and Culture: Deconstructing Myths",
        "Class Number": "21328",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "27",
        "Rating": "4.59"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3355.99",
        "Class Name": "Vodka in Russian Society and Culture: Deconstructing Myths",
        "Class Number": "21440",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.4,
    "department": "Russian",
    "firstName": "Lilia",
    "id": "VGVhY2hlci0yOTA1MDIw",
    "lastName": "Caserta",
    "legacyId": 2905020,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lilia is a phenomenal professor. Her lessons are HIGHLY engaging, and you'll look forward to coming to class every day. Homework most nights but she offers corrections to earn back points on missed objectives, so everything is very low threat. Take a class with Lilia if you want to enjoy learning Russian and earn a good grade in the process. ",
        "course": "1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Caserta cares a lot about this class and our ability to speak Russian. If you're confused, she offers specialized practice worksheets to help you with whatever skill you need help with. She gives out daily homework and a weekly quiz, but if you study it's not that difficult. She's overall a great professor! ",
        "course": "1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She speaks only Russian and involves everyone in conversation. This class has advanced my use of verbal Russian. If she corrects you it's only for your best interest and if you don't understand what she is saying all you have to do is ask! This class is about strengthening the speaking, listening, and reading skills of Russian. I love her teaching!",
        "course": "1103"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "She assigns homework every day and weekly quizzes, but it's manageable. She could be a nice person outside of class, however, the way she teaches her class is condescending, and expects students to know concepts but does not explain things clearly, although the class itself is relatively easy.\n",
        "course": "1101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Caserta genuinely cares about her students She assigns homework after every class but it is usually pretty easy to manage and doesn't take long. The exams are pretty much everything you already do in class and the oral exams are a breeze if you prep at least the day before. Love this teacher and I didn't even need this course for credit!",
        "course": "1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great teacher, really passionate about teaching Russian. Pretty upset I couldn't take her for my second semester Russian. Gives a lot of homework, but that is expected- I mean it is Russian. If you make mistakes on the homework she allows corrections for full points back. Really want to emphasize her care for student's learning. If you study = A. ",
        "course": "1101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Caserta is an amazing professor! She drills us in our vocab and pronunciation in class and assigns enough homework to make sure we are learning. Although she can be a bit of a tough grader, she is very patient and gives us opportunities for extra credit and options to re-do our work. ",
        "course": "1101"
      }
    ],
    "SEI": [
      {
        "Subject": "RUSSIAN",
        "Catalog": "1101.01",
        "Class Name": "1st-Year Russian I (Classroom Track)",
        "Class Number": "21170",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3460.99",
        "Class Name": "Modern Russian Experience through Film",
        "Class Number": "27631",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "3.2"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "1101.01",
        "Class Name": "1st-Year Russian I (Classroom Track)",
        "Class Number": "21936",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      }
    ]
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.7,
    "department": "Russian",
    "firstName": "Alisa",
    "id": "VGVhY2hlci0yNjI3Mzk5",
    "lastName": "Lin",
    "legacyId": 2627399,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The online class is well-set up, and you know what is expected of you every week. She has a 48 hour deadline extension for any assignment -- its very clear she cares for her students.Good amount of reading/watching materials weekly. This is the best elective I have taken at OSU. I went in with no knowledge on the subject and still did great. ",
        "course": "RUSSIAN3480"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "I did like this class and Dr. Lin is a nice professor but it was definitely work heavy. You definitely need to watch the movies/videos assigned each week, and the tests and homework assignments require you to write about what you watched. I also felt like she didn't grade completely fairly. ",
        "course": "RUSSIAN3480"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you can take her class, do it. You'll get an A. Everything is so organized and she automatically grants a 2-day extension for any reason. I enjoyed the content, learned a lot and never felt overwhelmed. No textbook and lots of movie watching. She's a sweetheart and really cares about her students.",
        "course": "RUSSIAN3480"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "A great professor",
        "course": "RUSSIAN3480"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "I LOVE Dr. Lin! She is honestly THE most caring professor I have ever had. She does these periodic surveys to check in on your mental health, and she is one of the least intimidating people I have ever met. You can go to her to talk about anything, whether it be school work or mental health. The only thing, you watch movies pretty much every week.",
        "course": "RUSSIAN3480"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very caring prof. Willing to work with you and actually cares about how you are doing as a HUMAN. 10/10 recommend if you need this GE!",
        "course": "RUSSIAN3480"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is one of the most genuine teachers i have ever had at OSU. She understands that students are put through a lot and is willing to work with students on deadlines. She sends out a survey every couple weeks and one week students said they were stressed so she extended a module and essentially canceled a week. Take this class.",
        "course": "RUSSIAN3480"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy A and a super nice professor",
        "course": "RUSSIAN3460"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took the Russian film class as an elective. The class is organized and everything you needed to do was easy to understand. She understands and cares a lot about the mental health of her students. I found the class a lot of fun and would definitely take her class again!",
        "course": "RUS3460"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Lin is amazing! This is the best online class I've taken. She is so involved and really cares about her students. Everything is organized and the course is based on watching movies and group discussion boards. She comments on every discussion post and is so encouraging of her students. She is very flexible and willing to help.",
        "course": "RUSSIAN3480"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Lin was fantastic! She genuinely cared about each of her students. The course is mainly watching assigned movies or shows, reading a bit, taking a quiz (unlimited attempts), and a few assignments that don't take much time. If you stay current, the course is extremely easy. Dr. Lin was also very communicative and her expectations were clear.",
        "course": "RUSSIAN3480"
      }
    ],
    "SEI": [
      {
        "Subject": "RUSSIAN",
        "Catalog": "3480.01",
        "Class Name": "The Russian Spy: Cultures of Surveillance, Secret Agents, & Hacking from the Cold War through Today",
        "Class Number": "34136",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "76",
        "Rating": "4.93"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3460.99",
        "Class Name": "Modern Russian Experience through Film",
        "Class Number": "33172",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "5"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3480.99",
        "Class Name": "The Russian Spy: Cultures of Surveillance, Secret Agents, & Hacking from the Cold War through Today",
        "Class Number": "33169",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "37",
        "Rating": "4.97"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3480.99",
        "Class Name": "The Russian Spy: Cultures of Surveillance, Secret Agents, & Hacking from the Cold War through Today",
        "Class Number": "34020",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "103",
        "Rating": "4.97"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "5250.04",
        "Class Name": "The Russian Writer: Nabokov",
        "Class Number": "36093",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3460.01",
        "Class Name": "Modern Russian Experience through Film",
        "Class Number": "21897",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.56"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3480.99",
        "Class Name": "The Russian Spy: Cultures of Surveillance, Secret Agents, & Hacking from the Cold War through Today",
        "Class Number": "29807",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "100",
        "Rating": "4.86"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "3480.99",
        "Class Name": "The Russian Spy: Cultures of Surveillance, Secret Agents, & Hacking from the Cold War through Today",
        "Class Number": "29096",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "40",
        "Rating": "4.93"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "6253",
        "Class Name": "Issues in 20th- and 21st-Century Russian Literature",
        "Class Number": "29748",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "6000",
        "Class Name": "Slavic Literature, Film, and Cultural Studies Professionalization Forum",
        "Class Number": "19368",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.17"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "6457",
        "Class Name": "Film Theory, Gender, and National Identity in Slavic Cinema",
        "Class Number": "34138",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Lang&Cul",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "SLAVIC",
        "Catalog": "2345",
        "Class Name": "Introduction to Slavic and East European Literature and Culture",
        "Class Number": "36124",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.81"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Leija",
    "id": "VGVhY2hlci0yODk3NjM0",
    "lastName": "Veskovic",
    "legacyId": 2897634,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Veskovic, is a foreign professor from the Balkans with an interesting background diplomatic relations, propaganda, and Slavic studies. Class consists of analyzing famous spy films, soviet era articles, and cold war propaganda. Offers a 48-hour automatic extension on any assignment upon request. Easy-A, best class I took this year. 10/10",
        "course": "3480"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Russian",
    "firstName": "Lejla ",
    "id": "VGVhY2hlci0yODU4MzIz",
    "lastName": "Veskovic",
    "legacyId": 2858323,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Veskovic, is a foreign professor from the Balkans with an interesting background diplomatic relations, propaganda, and Slavic studies. Class consists of analyzing famous spy films, soviet era articles, and cold war propaganda. Offers a 48-hour automatic extension on any assignment upon request. Easy-A, best class I took this year. 10/10",
        "course": "3480"
      }
    ],
    "SEI": [
      {
        "Subject": "RUSSIAN",
        "Catalog": "3480.99",
        "Class Name": "The Russian Spy: Cultures of Surveillance, Secret Agents, & Hacking from the Cold War through Today",
        "Class Number": "18444",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      }
    ]
  }
]