[
  {
    "avgDifficulty": 3.5,
    "avgRating": 3.6,
    "department": "Scandinavian",
    "firstName": "Merrill",
    "id": "VGVhY2hlci05Mjk1MTE=",
    "lastName": "Kaplan",
    "legacyId": 929511,
    "numRatings": 42,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Easily the worst class and professor I've ever had. Usually you want someone who is passionate but it seems like she doesn't even know what she is talking about. She is a very strict grader and if you don't share during class she won't want to give you a good grade. She isn't too nice and the class is extremely boring. Do no take!",
        "course": "COMPSTD2350H"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "The teacher is sweet and loves the topic but there is no streamlined discussions in class and she bounces from one topic to the next without giving any indication that a switch was made. The teaching is hard to follow, the teacher grades harshly with little explanation for why points were taken off, and few assignments leave no room for error. ",
        "course": "SCAN3350"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took as a GE, so I wasn't that interested in the material, I enjoyed class and Prof. Kaplan's discussion-based teaching style. Very knowledgeable but down to earth. Being a shy person I rarely participated in discussions but didn't end up being an issue, also never went to office hours but considered since she's a really cool person and offered",
        "course": "COMPSTD2350H"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Prof. Kaplan is passionate about the subject and will share her knowledge if you're interested. Her course was outlined well and she was very easy to work with. Two readings per week with discussion heavy lectures, but pretty fun and an easy A if you pay attention. Will be boring if your class is not active and you're not interested in the subject.",
        "course": "COMPSTD2350H"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "There are discussions every class, with articles to accompany each one. As long as other people talk, you won't have to. There aren't many assignments, and they're not super hard. The \"Items of Folklore\" assignments are a little annoying to complete though. Discussions are pretty boring most times, but she's very passionate and knows her stuff.",
        "course": "COMPSTD2350H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Old Norse is fascinating. Dr. Kaplan is a true grammar nerd and will actually covert you if you bring maturity and focus. This course is intense, not for the faint of heart. Prof. Kaplan makes the material relevant and interesting, has a sharp wit and will stretch your sophistication. A true pleasure! A challenge that is inspiring, amazing class.",
        "course": "SCANDVN5150"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Kaplan is the real deal. If you are a mature student, you will get it. Lots of reading for this class since it is the LotR and The Hobbit books. There is a wealth of lore and language in the lectures which expand beyond the books. Prof. Kaplan has a strong wit which challenges you to reach a little further into sophistication. Great lecturer!",
        "course": "ENG3372"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "She seems nice, but her lectures are a tiring and boring. She repeats the same thing over and over again in slightly different ways and spends 20 minutes on a point that could be condensed to 2 minutes. This was for Tolkien's monsters, which is an exciting topic, yet it was made boring by her methodology.",
        "course": "ENG3372"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Having Prof Kaplan was a great experience, she's extremely knowledgable and passionate. Though I didn't pay attention much during lectures (they're dry at times, really interesting at others) I got a good grade in her class through the readings. She doesn't care about people being on their phones, and is a really rad lady",
        "course": "SCAN3350"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "She is extremely knowledgeable with the language and mythology, but is also easily taken off topic. If you're interested in the stories you're better off reading them on your own, roughly 1/3 of the class is spent with her trying to relate the millennia old stories into current political events or rants. That said I enjoyed the class when on topic",
        "course": "SCAN3350"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took a Tolkien's Monsters class with her and the lectures were very interesting and held my attention. She's very knowledgeable on the subjects of folklore, fantasy, and monstrosity as well as how the multiple subjects connect. There's a lot of reading, but as long as you pay attention to the lectures you can skip the reading.",
        "course": "ENG3372"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 3,
        "comment": "Not understanding whatsoever. Often made you feel stupid for asking questions or saying something incorrectly.",
        "course": "SCAN3350"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Took this for Lit GE, really enjoyed her lectures. She is very funny & knowledgeable on the topics.  Took time out of class once or twice to address important current event issues. However, she is kind of unorganized and very hard to contact, doesn't really respond to emails. Best bet is to catch her after class or go to her office hours",
        "course": "SCAN3350"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 4,
        "comment": "Her class was actually very interesting, but her disorganization ruined the experience. She doesn't respond to emails, which became a problem when she didn't confirm my paper topic until the week before the due date. Also, she doesn't follow her syllabus, which led to her assigning multiple things after class was over for the semester.",
        "course": "SCAN3350"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Course seemed fun and easy but I found out quick how disorganized/unhelpful Prof. Kaplan was.  The entire class is based off of two books and the lecture itself is pretty useless. There are no tests, only online short writings assigned VERY randomly with no grade/feedback. Kaplan is very knowledgeable but I feel she has no idea how to run a course.",
        "course": "SCAN3350"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Doesn't respond to emails, but great nonetheless",
        "course": "SCAN3350"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is a really interesting teacher. She is super into what she teaches and it makes it all the more entertaining. Quite the nerd, for both Norse Mythology and in general and it's really fun.",
        "course": "SCANDVN3350"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "Difficult teacher to rate, can be funny, interesting to listen to. Her lectures (which are on the assigned readings) are unorganized, but do help. But READ!! Big negative is her tendency to go overboard when calling students out (any phone usage).  Makes class super awkward and more embarrassing for her. Somewhat condescending, but humorous too  ",
        "course": "SCAN3350"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class was awful; Prof. Kaplan seemed disorganized and her notes and power-points were anti-helpful. If you don't have prior Norse Myth knowledge, avoid this class. I've seen her consistently insult students who use phones or wear headphones (neither of which I do). I am a usual A-student, and if you don't readteach yourself, its a dead end! ",
        "course": "SCAN3350"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a great professor who has a genuine interest in her subject matter, but also in our ability to learn the subject matter. It felt like she jumped around a lot in her lectures, which made it difficult to have organized notes, but she was very clear as to what was important. You do need to work to get the A in the class, but it is possible.",
        "course": "SCANDVN3350"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 5,
        "comment": "Professor Kaplan is literally the most interesting person in the world. Her passion for everything Scandinavian so is contagious. Favorite class I've ever taken ever. She expects a whole lot though, this is the real deal. And a warning: she will not answer emails, and I've heard she is not always at her office hours. So good luck contacting her.",
        "course": "SCANDVN5150"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Online discussion posts and in-class discussions are the main things graded. Doesn't post grades on Carmen until finalized at end of term. Doesn't respond to emails. Just read the assigned readings, take notes on genealogy if possible, and be open minded to literary analysis. The whole class is a discussion among her and each other. Speak up.",
        "course": "SCAN513"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "Excellent class and professor. The course relied heavily on reading, with minimal writing requirements. As long as you're willing to participate in class discussions, this class shouldn't prove to be any type of problem.",
        "course": "SCAN513"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "This was my least favorite of the courses I have taken taught by Professor Kaplan. While I still find her to be an amazing professor, I think the class size and the lecture (as opposed to discussion) basis of the class reduced the easiness, helpfulness, and clarity. The efficacy of her teacher methods were reduced due to those same reasons.",
        "course": "SCAN222"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was a challenging course, but Professor Kaplan adjusted the grading accordingly. The material was not as crystal clear in this class as it had been in other classes, but Professor Kaplan was able to make sense of all the readings.",
        "course": "ENG577"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite course at OSU so far, and Professor Kaplan was a major factor in making in that way. I was interested in the subject material beforehand and she explained it very well, providing very much information and background that was not included in the readings.",
        "course": "SCAN513"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Class Awesome Professor! An exceptionally intelligent and beautiful woman. In class discussion was great! Her knowledge of and love for the material was inspiring. However: She did not follow the syllabus with regard to writing assignments. She provided no feed back on writings. 4th day after final and I have not seen one grade. :)",
        "course": "SCAN513"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 4,
        "comment": "Awesome Proff but hard class. Unless you have an insane interest in Scandanavian Mythology do not take this class. Studying like crazy is a must for exams because there all short answer and the paper...well thats impossible.",
        "course": "SCAN222"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "Kaplan taught a very interesting class. Everything one could want to learn about Norse myths is covered. That said, unless you have a strong interest in the subject, I wouldn't recommend the course. Some of the lectures could be a bit long winded and the reading could be a bit heavy and the paper was a bit difficult. The tests were manageable.",
        "course": "SCAN222"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 4,
        "comment": "I was interested in Norse mythology prior to this class, but unless you are a diehard fan of old Norse, I do not recommend taking the class. Prof Kaplan is good at explaining, but sometimes her lectures just get so long that it's hard to concentrate.  There are very few graded things, so it's not worth risking your GPA.",
        "course": "SCAN222"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 5,
        "comment": "Awesome professor, but very tough grading! Unless you're REALLY interested in the material, do NOT take this class. Memorizing a bunch (!) of names is basically all you will do here. Not worth bringing your GPA down because of a GEC for which you couldn't memorize the meaning/significance of a 15-letter Norwegian word with 20 accent marks.",
        "course": "SCAN222"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof Kaplan taught me to swear in old Norse! Although near the end of the quarter, the class descended into silliness, the subject matter was absolutely delightful and was delivered in a pristine and captivating manner. This course is a must.",
        "course": "SCAN500"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 2,
        "comment": "Good class and good teacher.  Prof Kaplan is definitely passionate about the subject!  A lot of reading, but it's interesting and there's a lot in it.  Sometimes I had to force myself to do the reading but now that the class is done, I find myself missing it.  Recommended :)",
        "course": "SCAN500"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 5,
        "comment": "The class, like any other, works best when everyone's done the readings and ready to contribute",
        "course": "ENG577"
      },
      {
        "index": 35,
        "rating": 3,
        "difficulty": 5,
        "comment": "I really hate to give her a bad rating, but this class just wan't too good. Especially if you want to maintain a nice GPA. The grades come from a term paper, a mid-term, and a final. All of which are hard and are really bad if you have trouble with essays. The class itself is kind of fun but can be boring if you already studied the material a bunch",
        "course": "SCAN222"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 5,
        "comment": "Professor Kaplan is quite interesting and fun.  I enjoyed going to class, but the grading is a bit tough.  Try getting into the subject a little and you shouldn't have too much trouble.",
        "course": "ENG577"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sit up front, take notes. It's a 200 level class, there's no reason why everyone can't get an A unless you're asleep, reading the newspaper, or too lazy to show up. She's not going to give you notes on a ppt or tell you the essay questions ahead of time. But, really, that's NOT her job.",
        "course": "SCAN222"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lots of multimedia (pictures/music), a pop culture class.  Qtr starts with historical stuff for foundation.  Assigned reading not well organized, but it was a new class.  Lectures always interesting and informative; pay attention! - important for tests.  Requires exams and an easy paper.  Recommended - fun, but not a blow-off class.",
        "course": "GER250"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 4,
        "comment": "Lots of multimedia (pictures/music), a pop culture class.  Qtr starts with historical stuff for foundation.  Assigned reading not well organized, but it was a new class.  Lectures always interesting and informative; pay attention! - important for tests.  Requires exams and an easy paper.  Recommended - fun, but not a blow-off class.",
        "course": "GER250"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 5,
        "comment": "Kaplan is a kind of strange woman, but she is really interested in her subject matter, so that makes it a little more interesting. Her little side stories and tangents were pretty hilarious, but she graded pretty hard.",
        "course": "ENG577"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 4,
        "comment": "Highly intelligent, fun to take a class with due to her overwhelming passion for and knowledge of her subject. Occassional tangents are interesting and informative. Is funny and understands complications during the term.  Expects a lot from students; little to grade aside from long thesis paper and 2 exams req. comprehensive & detailed knowledge.",
        "course": "SCAN222"
      },
      {
        "index": 42,
        "rating": 1,
        "difficulty": 5,
        "comment": "Most likely the most poorly taught class i've ever taken.  No use of outside tools (powerpoint, other teaching methods).   She stands and talks very fast for 2 hours.  Taking notes in her class is difficult because she simply writes a name on the board and rambles on about other stuff.  Grade based on midterm, paper, and final, which are HARD!!!",
        "course": "SCAN222"
      }
    ],
    "SEI": []
  }
]