[
  {
    "avgDifficulty": 3.3,
    "avgRating": 2.9,
    "department": "Science",
    "firstName": "Hans",
    "id": "VGVhY2hlci01MTI4Nw==",
    "lastName": "Klompen",
    "legacyId": 51287,
    "numRatings": 62,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hans was very passionate about the material being taught which made the class very interesting. He was a fair grader and allowed me to make up assignments I had missed. Overall very good professor.",
        "course": "EEOB2270"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "His lecture materials are a little tough because he throws in a lot of unfamiliar vocab and he's kind of monotone in his lecture and mainly reads off the slides. But he's actually really nice and willing to explain any concept until you understand if you ask in office hours. He's also very accommodating and gave me a little boost in final grade",
        "course": "BIO3401"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr Klompen taught module 2 on Malaria. Compared to the 1st module, this one was much more intense. His wording and expectation of knowledge for weekly quizzes is tough but if you prepare by reviewing everything you will be okay. His class is not easy but it is doable. Never miss recitation, those are the easiest points but a lot of group work.",
        "course": "BIO3401"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic. The best teacher OSU has to offer. Very refreshing from the usual professors.",
        "course": "EEOB2270"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Pretty easy class overall if you half-pay attention. Quizzes every week are 2 questions, open note/open book (drop your 2 lowest quiz scores). A pretty big percentage of the grade is from completing weekly discussion board posts. He is obviously very passionate about parasites which translates into engaging and entertaining lectures.",
        "course": "EEOB2270"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Super unclear on grading and vague, rambles about things that won't be on the test. He reads off the slides which don't make any sense. Very harsh grader, looks for key words not concepts so right answers will be counted wrong if its not the answer he is looking for.",
        "course": "BIO3401"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "In class worksheets for every class, so you can't skip. Not very clear instructions for in class work. Recitation is all group work and completion. Final has an essay that had an average of 68% that was due earlier and final exam was all application and over nothing from powerpoints.",
        "course": "BIO3401"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Clear, organized lecture slides and mostly reasonable questions on quizzes and midterm. In-class questions were confusing at times. Overall a decent professor.",
        "course": "BIO3401"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "Kind of funny. Pretty harsh with grading criteria. For the exam it seemed several answers could have been right. In lectures you need to bring a specific paper for short responses that are over something covered in class that day.  You lose points if you use a paper provided. Not unreasonable, but not great. This class makes me dislike biology.",
        "course": "BIO3401"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "He has pop quizzes on material covered that day in class which are confusing. Essays for exams are take home but he grades them harshly.  Exam questions are more difficult than anything covered in class. I would take the class with a different professor, if possible. However the bio department overall isn't the best so good luck",
        "course": "BIO1114H"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Outlines were useless, tests were difficult and he speaks in riddles",
        "course": "1114H"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Klompen is a good professor, and likes to give random quizzes. If you read the book every once in a while and go to lecture you will be fine. He's pretty funny and likes biology.",
        "course": "BIO1114H"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "It was fun to attend class because he was extremely funny and did well in keeping the students attention, but he is a hard grader, which is annoying. If you ask for feedback he gives it to you, which is always a plus.",
        "course": "BIO401"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "I really enjoyed Dr. Klompen. He was genuinely interested in what he was teaching and really seemed to want to help students. His assignments were meaningful and not busy work, unlike assignments from previous professors in the other modules.",
        "course": "BIO401"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "LOVED Dr. Klompen!  He's very personable and is genuinely interested in what he's teaching.  Taught the malaria module, which I found fascinating.  Best teacher out of this class.  Responded to emails very quickly and was very helpful.  Breath of fresh air after the cancer module.  Lenient grader, too!",
        "course": "BIO401"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "He was an alright teacher. Not too great, not too bad. He taught the Malaria module which was pretty boring; it would be interesting if you had malaria or needed to study it for high research purposes. Was pretty clear, nice guy, exams were pretty fair, lot better than some of the other professors we had for this class for mixed modules.",
        "course": "BIO401"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Go to class. That's really all there is to it. Go to class and pay attention and you'll get an A in lecture. Just hope you don't get a idiot for lab like I did.",
        "course": "BIO114"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "I like that he provides a lecture outline for you to print and jot notes on. Not really an amazing or terrible professor... takes a lot of information from the book, but for some reason grades how well you take notes in lecture. Only bad aspect was my foreign TA who didn't really... understand much/wasn't very helpful.",
        "course": "BIO114"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "meh.  Not the worst ever but given the choice between him an an unknown, I'd take the unknown.  Many test questions tend to come from random tidbits from the book that may or may not have had an oblique mention in class, which you will be to asleep to hear anyway.  Only thing that saved me was that the lab grade is half the final grade.  Great ta's",
        "course": "BIO114"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Klompen is a great lecturer.  He presents the material well and is always helpful to students.  Clearly some of these bad reviews are based on bad student performance.  He is straight with his students and does not use tricky questions in the exams.  I give him an A.",
        "course": "BIO114"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "You can barely understand what he says during lectures. His lecture notes are outlines and he says his exams come straight from his outlines, but if you only study the outline, you'll fail the exams for sure! The outlines don't explain anything you need to know for the exams. He's terrible at explaining everything! Avoid this teacher!",
        "course": "BIO114"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 4,
        "comment": "Tests were random, lectures were sedating. My TA taught alot more and was waaaay better. Rock On, Josh Harris, Rock On!",
        "course": "BIO114"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "I don't know how Hans got all these bad reviews.  I felt he was a really great prof and an interesting lecturer.  All you need to do is go to lecture and you will be fine.  An &quot;A&quot; is very possible, and you don't even need to read to get one.  Go Hans!",
        "course": "BIO114"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible professor!!  Did not explain the material well at all.  His tests are very unfair.  He says that all you have to do is read the lecture notes and you'll do fine, however, the majority of the questions on the tests were from out of nowhere!!!  He doesn't follow the book either so that is no help.  Don't take his class if at all possible.",
        "course": "BIO114"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "Def took class thinkin that as a bio major, if i put in a good amount of study time n went to every lecture would do ok.No matter how much studied w/ lect notes and book, received a flat 70 on every test.He just plain expects you to pick up EVERY detail.Basically impossible to get an A unless you memorize EVERYTHING you read and hear.",
        "course": "114"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 4,
        "comment": "This professor may as well not even show up to his own lectures, he does not help his students and would probably rather spend all day with his precious mites.",
        "course": "BIO114"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 4,
        "comment": "DON'T TAKE THIS PROFESSOR.  Just don't.  You're asking for trouble.  The tests are based on lectures, so if you don't understand everything in lecture and go to your book for solace, you're in for a rough ride.  I also got the impression that he was there to do research, not teach.  Try to get another prof. if you want a decent grade.",
        "course": "BIOLOGY114"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "I feel Hans is a very unfair teacher.  He made an introduction biology class very difficult.  I agree that it definately feels as though he does not care much about teaching and is here mainly for the research.  I really think it is fun for him to make this class difficult.  Try to avoid.",
        "course": "BIO114"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 4,
        "comment": "This guy plain and simple is a horrible prof. AVOID AT ALL COST. I liked bio before this class. On one of the midterms I answered a question correctly and answered everything the question asked for, but I still got it wrong because Klompen wanted people to explain more. How are we suppose to know that if the question doesnt ask it&#63; VERY VERY BAD!!!",
        "course": "BIO114"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 2,
        "comment": "Bio 114 is an easy class.  But Dr. Klompen likes to make things harder on students.  How does he do this&#63;  By basically not giving out answers to any of the practice or graded exams.  Great guy.*(sarcastic)*",
        "course": "BIO114"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 3,
        "comment": "This professor thinks that he enhances student understanding by creating obstacles to learning (he does not tell students what questions that they have missed on his tests).",
        "course": "BIO114"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love Hans!  His tests are not terrible, but just a little tricky.  I really enjoy going to lec (even if it's early) because he's interesting and makes me laugh.  Plus, if you just go, you'll do fine on the tests.  His jokes are geeky, so if your somewhat geeky, he is funny.  Whatever, he's cool.",
        "course": "BIO114"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 4,
        "comment": "Maybe his teaching strats. have changed but for those of you who enjoyed him I'm suprised.  He gave me a strong vibe that hes not here to teach but just here for research.  His tests were horrible, and more so because I do not feel he prepares you even close to enough. Easy schedule take him, but if you have harder classes find another Bio Section.",
        "course": "BIO114"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is very unfair with his exams. He says he only tests on the lecture notes. But so far both midterms have been about 1/3 stuff only in the book and or stuff he says only ONCE during lecture, thats not in the book. Hard to understand him. Seems like he enjoys making people suffer. DO NOT take his class if you can.",
        "course": "BIO114"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 2,
        "comment": "This guy loves biology! Kinda geeky, and his notes that are posted online don't cover EVERYTHING but that's so you go to class.   Sweet class.",
        "course": "BIOLOGY114"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took his class a few quarters ago and really enjoyed it. I liked it so much I signed up to do personal research with him in entomology 693. I've continued this for 4 quarters. He's interesting in lecture and you hardly have to read the book.",
        "course": "BIO114ENT693"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "I thought he was pretty good. His lectures were interesting (although I did see other people sleeping) and he is interested in the subject. He is European, if that makes any difference to you. I didn't think his tests were bad, and I found the TA's  to be helpful.",
        "course": "BIO114"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very good professor, but if you take him, you absolutely HAVE to go to every lecture. His TAs are the worst I've ever had, and he gives quizzes in lecture that you aren't allowed to make up.",
        "course": "BIO114"
      },
      {
        "index": 39,
        "rating": 1,
        "difficulty": 3,
        "comment": "Klompen was awful. I'm a biology major, and he made biology boring for me by throwing out random facts in lecture and failing to go into the subject any deeper. He expressed little in-depth knowledge about biology beyond insects. Tests were unpredictable and straight memorization.",
        "course": "BIOLOGY114"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class is not as bad as everyone says!  I am a SPANISH major and got a B, without reading all the material, half assing lab worksheets, and not going to any office hours or anything.  If you work a sufficient amount, you will get a good grade.  And there's a curve.",
        "course": "BIO114"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 4,
        "comment": "This is a TERRIBLE teacher. He's extremely unhelpful, won't ever answer emails, and doesn't care about students. He's lazy, and if you don't sit close, his voice sounds blurred. His tests are irrelevant to his vague notes. GET OUT NOW!!",
        "course": "BIO114"
      },
      {
        "index": 42,
        "rating": 2,
        "difficulty": 4,
        "comment": "His tests covered way too much information and you had no idea what to study. Attending lectures is a must because that is the only source of information for the tests. The labs are not interesting or graded fairly. There's too many things to complain about for this class.",
        "course": "BIO114"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 4,
        "comment": "He is an absolute terrible teacher. His tests are not an accurate reflection of material studied. I had to seek help from higher faculty memebers many times. Additionally, his TA choice is next to nothing, they are the worst at this university. DO NOT TAKE THIS CLASS with this man.",
        "course": "BIO114"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is very thorough in lecture.",
        "course": "BIO114"
      },
      {
        "index": 45,
        "rating": 3,
        "difficulty": 3,
        "comment": "He is ok at lecturing, kinda crazy sometimes. But when it comes to the tests, he doesnt give a good idea on what to focus on. Tries to pick out little details on tests to trick you. Going to class is a must for additional notes, but sometimes boring.",
        "course": "BIO114"
      },
      {
        "index": 46,
        "rating": 2,
        "difficulty": 5,
        "comment": "This is one of the worst professors I've ever had.  No matter how much I studied for anything, I always found a way to screw up thanks to his inablity to create tests.  I would avoid him at all costs if it is possible.",
        "course": "BIO114"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 3,
        "comment": "Can keep my attention for the whole hour and 15 minutes.",
        "course": "BIO114"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 4,
        "comment": "For as much material as he has to cover he does a good job, going to lecture is a mus, he gives addtional notes. I studied so hard for the midterm, but it was just over so much! I got a D+...not a bad professor, he tries, and makes things clear and is fun.  It's Just a bad couse if general.",
        "course": "BIO114"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 5,
        "comment": "i studied my balls off for the midterm and i got a D because everything i studied was not on the test (he tested on freakin 14 chapters out of that monster bio book which equates to about 300 pages of information)... he lectures okay but his tests are poorly made - you have no idea what to expect",
        "course": "BIO114"
      },
      {
        "index": 50,
        "rating": 3,
        "difficulty": 4,
        "comment": "His tests are not fair.  I studied my ass off and knew about everything and his tests reflect nothing he lectured on.  Not a good teacher.  He thinks everything is &quot;cute&quot; and &quot;pretty&quot;",
        "course": "BIO114"
      },
      {
        "index": 51,
        "rating": 1,
        "difficulty": 5,
        "comment": "he is the worst teacher i have ever had, he is a  total lazy human, and his tests are not a reflection of his study, FIRE THIS PROF!!!",
        "course": "BIO114"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 1,
        "comment": "Notes are on WebCT, but additional notes in lecture always find their way onto exams, so it is necessary to attend lecture if you want an A.  This guy is good, he knows his stuff.",
        "course": "BIO114"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 2,
        "comment": "ZZZzzzz....  severely boring. Class is not all that hard but no curves.  His notes are on the web.  Don't bother going to class.",
        "course": "BIO114"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's a cool guy, lecture's are NOT bad, too many people just sleep at this school at any chance. Bad part is what to study for exams, and his short answer questions tend to be a bit hard.",
        "course": "BIO114"
      },
      {
        "index": 55,
        "rating": 3,
        "difficulty": 4,
        "comment": "Good teacher but sooo much info with no help as to what to concentrate studies on",
        "course": "BIO114"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very informative, nice guy!",
        "course": "BIO114"
      },
      {
        "index": 57,
        "rating": 1,
        "difficulty": 5,
        "comment": "Boring and hard",
        "course": "BIO114"
      },
      {
        "index": 58,
        "rating": 2,
        "difficulty": 3,
        "comment": "BORING!!! Lectures consist of reading the notes on Web CT.",
        "course": "BIO114"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 3,
        "comment": "Truly enthusiastic about the material! He provides amusing quotes for your profile!",
        "course": "BIO114"
      },
      {
        "index": 60,
        "rating": 3,
        "difficulty": 2,
        "comment": "All he talks about is termites.  Get the notes from a friend!",
        "course": "BIO114"
      },
      {
        "index": 61,
        "rating": 2,
        "difficulty": 2,
        "comment": "No need to go to Hans' lectures. All material on WebCT",
        "course": "BIO114"
      },
      {
        "index": 62,
        "rating": 2,
        "difficulty": 4,
        "comment": "Only take biology from him if you like long naps",
        "course": "BIO114"
      }
    ],
    "SEI": [
      {
        "Subject": "BIOLOGY",
        "Catalog": "3401",
        "Class Name": "Integrated Biology",
        "Class Number": "13211",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Introductory Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "108",
        "Rating": "4.05"
      },
      {
        "Subject": "EEOB",
        "Catalog": "2270",
        "Class Name": "Parasites and Evolution: How Worms, Mosquitoes, etc. Manage Their/Our World",
        "Class Number": "27639",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Evolution, Ecology & Org Bio",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "50",
        "Rating": "4.55"
      }
    ]
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.1,
    "department": "Science",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0zNjc0ODQ=",
    "lastName": "Simcox",
    "legacyId": 367484,
    "numRatings": 29,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Simcox is a very nice person. She tries to make her quizzes/tests as far as she can. There are no things that need to be purchased for this class which is helpful.",
        "course": "BIO3401"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Simcox is as interesting as having the textbook read back to you in a British accent. You'll definitely learn, it'll be kinda fun at first, but pretty quickly you'll get bored. The exams are very straightforward and the questions can honestly be pretty entertaining. She can be boring, but it's clear that Dr. Simcox cares about her students.",
        "course": "BIO1113H"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Simcox is nice but her lectures were nearly worthless. She either repeated ideas from the book or talked on and on about her research with Drosophila flies. Unfortunately, TopHat scores are a large part of the grade so skipping class would be killer to your grade. Good intentions but uninteresting lectures. Tests were largely easy.",
        "course": "BIO1113H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mandy's module was on stem cells. She was an excellent lecturer. She was very fair and pretty much told us exactly what was going to be one each quiz and exam. I highly recommend her for this class.",
        "course": "BIO3401"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "Her lectures are near impossible to follow.  She's all over the place and I often find myself questioning whether she actually knows the material or not.  Read the book and the note hand outs she provides, and you'll be fine.  Lecture was next to worthless.",
        "course": "BIO1113H"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "You will not get an A.  The kids in the class are by far among the smartest taking an honors bio class and around 90-95% of them didn't get an A.  Good luck if you take this class.",
        "course": "BIO115H"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "Simcox was more interested in talking about fruit flies and her research than what she was supposed to teach. Her midterm was MUCH harder than Ding's. You'll need to read to succeed. I appreciate that she knew the research side of bio, but it didn't help me on the midterms/final.",
        "course": "BIO115H"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 5,
        "comment": "Seemed like she was more interested in talking about her own personal research and making little online presentations than actually teaching. Her test questions were ridiculously specific, and sometimes about material that wasn't even covered in the text. Lab was even more useless. Kind of makes me wish I'd taken the regular version.",
        "course": "BIO115H"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "I loved Dr. Simcox. She has a very interactive class and breaks up the standard lecture with videos and demonstrations. She also will discuss science in the news, which was cool because it showed how what we were learning could be applied to real issues. Her test was challenging, but fair. I wish she taught more of Bio 115H.",
        "course": "BIO115H"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Simcox teaches H115 half and half with Dr. Ding. It's too bad, because she's intelligent, funny, and a gifted teacher, and he's not. Her midterm was extremely hard, with an average 20% lower than his, so be warned and study extra for hers! Her lectures are great, and reasonably interactive if you consider the massive class size.",
        "course": "BIOH115"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "her study guides are long and her tests are hard",
        "course": "BIOH115"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "She's a tough cookie but science is her career! I enjoyed her upper level classes immensely and her dedication to bringing high-level science into high schools is commendable.   PS: If you can't hack Bio113 you'd better not plan on taking anything more advanced!  Science takes work to wrap your head around all the concepts!  WORK!",
        "course": "MG601"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "I've never had her as a professor but I've spent one day with my entire AP Biology class with her doing two DNA labs. She was great! I loved the simulation, but it gets so difficult with the technical stuff. We ran out of time at the end, so she didn't have time to explain the math and what's involved, so my entire class was basically clueless. *_*",
        "course": "APBIOSECT"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Okay, nobody told me she was British.  She is so much fun to listen to because of her accent.  I thought her exams weren't too bad, but you MUST read the book to supplement her lectures.  I would love to take another class with her.",
        "course": "BIOH114"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Simcox was very interested in the &quot;research&quot; side of Biology more so than the &quot;memorize all these enzymes&quot; side of it.  The questions on her exams are very tricky, and if you plan to do well on the exams you should have a mastery of the classic experiments the textbook covers.  The examples she carried out in class came back up in the exams.",
        "course": "H115"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 4,
        "comment": "I could not follow her lectures and everything that came out of her mouth just wouldn't &quot;click&quot;--I understood the material much better by reading it in the book.  I would definitely not recommend her as a professor, and if you have no other choice, read the book thoroughly in order to grasp the material and do well on the exams.",
        "course": "BIO113"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is a ton of fun in the Lab class because she's pretty laid back.  She usually makes a video and it's pretty amusing too, but her exams are hard.  Definitely Study, and get a good lab partner.",
        "course": "MG601"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 1,
        "comment": "Tricky",
        "course": "BIO113"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 5,
        "comment": "She's tough but at least makes lectures mildly interesting.",
        "course": "BIOLOGY113"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "BIO113"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 4,
        "comment": "Her lectures weren't bad but the exam was really really hard and was on the most detailed stuff",
        "course": "BIO113"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 3,
        "comment": "Decent Teacher, the exam sucked because major error (read below). However, she does a pretty good job of lecturing fairly interesting even though some of the topics are not. Just hope they don't mess up your exams and it'll go ok.",
        "course": "BIO113"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 5,
        "comment": "Difficult exams. That's the most difficult one I ever had at OSU for low level courses.",
        "course": "BIO113"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is extremely helpful and very nice, I really liked her.  She makes things seem easy and as if you don't need to know all the details, which is a little miss leading.  Did not have enough midterms for everyone the first time so the actual one was tough.  KNOW EVERYTHING INSIDE AND OUT!!",
        "course": "BIO113"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 5,
        "comment": "Worst professor by far at OSU.  Exam was insane.  It was nothing like the study guide.  She said know the study guide and you will get an A.  Definately not the case.  Also they did not have enough copies made for the second midterm.  Half the class short, unbelieveable.  She sucks!!!!",
        "course": "BIO113"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 5,
        "comment": "Stay away! Tricky exams! Our TA was totally inept,not to mention that the 2nd midterm exam was postponed because of their incompetence to assure that there were enough exams to go around; the retake was even more difficult because we &quot;had more time to study for it&quot;, verified by the TAs. What BS.",
        "course": "BIO113"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "Could not understand one word she said... I only went to 3 of her lectures because I couldnt sit in there any longer",
        "course": "BIO113"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "although she has a british accent and sometimes sounds monotone, she really explains things using more than just notes. she makes hard topics seem easy. exam questions are usually straightforward. helpful study guides. great lecturer!",
        "course": "BIO113"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's a very helpful prof, she always tried to help with study guides and sample problems.  I liked how she used interesting teaching methods to break up the monotony of lecture.",
        "course": "BIO113"
      }
    ],
    "SEI": [
      {
        "Subject": "BIOLOGY",
        "Catalog": "3401",
        "Class Name": "Integrated Biology",
        "Class Number": "21538",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Introductory Biology",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "67",
        "Rating": "4.12"
      },
      {
        "Subject": "BIOPHYS",
        "Catalog": "7600",
        "Class Name": "First-Year Student Orientation",
        "Class Number": "11357",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Division Of Sensory Biophysics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.57"
      },
      {
        "Subject": "BIOPHYS",
        "Catalog": "7600",
        "Class Name": "First-Year Student Orientation",
        "Class Number": "15483",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Division Of Sensory Biophysics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "2",
        "Rating": "4"
      },
      {
        "Subject": "MCDBIO",
        "Catalog": "7600",
        "Class Name": "First-Year Student Orientation",
        "Class Number": "14723",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "3.83"
      },
      {
        "Subject": "MICRBIO",
        "Catalog": "7600",
        "Class Name": "First Year Student Orientation",
        "Class Number": "18596",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Microbiology",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "1",
        "Rating": "3"
      },
      {
        "Subject": "OSBP",
        "Catalog": "7600",
        "Class Name": "First-Year Student Orientation",
        "Class Number": "1429",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "Graduate School Admin",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "OSBP",
        "Catalog": "7600",
        "Class Name": "First-Year Student Orientation",
        "Class Number": "1578",
        "Term": "AU 22",
        "College": "The College of Medicine",
        "Department": "Graduate School Admin",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "3",
        "Rating": "4.33"
      }
    ]
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.4,
    "department": "Science",
    "firstName": "Smita",
    "id": "VGVhY2hlci0zMTM3MDI=",
    "lastName": "Mathur",
    "legacyId": 313702,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very sweet professor and outlines material well. Class is easy and every lecture is recorded if you want to view later. An easy class that will blow your mind.",
        "course": "ASTRON1141"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Extremely easy class, you don't have to attend lecture and she wasn't a very good lecturer anyway. Just use the PowerPoints for the quizzes and exams and you'll easily get an 100.",
        "course": "ASTRON1141"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy GE. Exams and quizzes are straightforward if you have reviewed the slides. Attendance not mandatory, can watch lectures on your own time. Weekly quizzes and only 3 exams no final. ",
        "course": "ASTRON1141"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "You will have to watch (or attend) all of the lectures and take meticulous notes or else you wont do well on the exams. The weekly quizzes can sometimes be tough, but the exams are pretty hard (however many of the exam questions mirror the questions asked in class). Every lecture is an overload of information as well.",
        "course": "ASTRON1141"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lecture slides are posted online, along with an optional weekly homework. She does a good job of explaining the concepts during lecture, which I recommend you attend. But attendence is optional and the material isn't too hard to learn on your own.",
        "course": "ASTRONOMY1143"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Smita is a pretty solid teacher. Boring class, and attendance isn't mandatory, but I would highly recommend going because she does make the concepts very clear. This class isn't the easiest A and a good bit of studying is needed for the exams, but as long as you really understand everything in the lecture slides you'll be fine. Take this class.",
        "course": "ASTRON1143"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Smita tries her best to help you understand the material. Class was intellectually stimulating but required a lot of work especially if science isnt your strong suit. She posts the slides online but her lectures, review notes, and optional homework was extremely beneficial. Exams have a lot of homework qs and the final repeats a lot from old test.",
        "course": "ASTRON1144"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "The lectures are pretty long and boring if you are someone who is not interested in science, but I truly recommend going. She posts her lecture slides online, but she goes in depth during class to help you understand the concepts better. She posts homework online, but its not for a grade. The only grades are 3 exams and a final.",
        "course": "ASTRONOMY1143"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "She posts study guides for her \"History of the Universe Class\". The study guide normally contains questions that are on the test. GO OVER THE STUDY GUIDE WELL. She post optional homework every week that also tend to end up on the exams. Attending lecture was not necessary because she posts the notes online, but she is extremely passionate about it.",
        "course": "1143"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "She really loves the topic that she teaches and it shows. Seeing as she taught a science class for non science majors it would have been easy for her to blow it off but she really tried to make sure that everyone learned something. Class is easy but being there for her lectures is essential to understanding the material. DO NOT BUY THE TEXTBOOK",
        "course": "ASTRONOMY1143"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "Had a great time in this class, at first I was worried because the material is based on extremely complicated concepts but Smita went above and beyond to get everyone (at least those to who pay attention) to understand what she was teaching. I genuinely enjoyed this class, even if it was just for a gen ed and will honestly recommend it to others",
        "course": "ASTRONOMY1143"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved her class; She was crystal clear for the most part and really cared about teaching us. I looked forward to coming to class everyday and while I didn't to AMAZING A++ in her class, I learned something and enjoyed it. I didn't think the class was hard at all and I never studied, if I did I'd have gotten that A. I'd definitely recommend it.",
        "course": "ASTRO162"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Helpful note: she tells you not to study off the review guide but I recommend going through it thoroughly and filling it out. this will help you organize your notes and prepare for the exam. also go over the homework q's (even if they're not graded)as I have noticed that she uses those on the exams.",
        "course": "ASTR162"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "good professor. She does try hard to help students understand the material and is successful at it. COME TO CLASS. even if you have a friend 2 take notes 4 you, you will understand them a lot better if you show up. Dont bother with the txtbook. you wont need it. theres a copy in the office if you happen 2 miss a class but its not helpful anyways.",
        "course": "ASTR162"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "GO TO CLASS!! Smita does not post her notes online and the book is useless. Make flash cards and study hard the day/night before exams and you will be golden! Use the internet to help you with your homework... it is 15% of your grade!",
        "course": "ASTRO161"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very good teacher. I heard astronomy was a difficult class, but she makes it interesting & does not use any math in her teaching.Go to class to get the notes, do the homework, and study for the exams and you will do well; it really is not difficult! The final was straight up the 3 exams copy and pasted.",
        "course": "AST161"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "As long as you come to every lecture and do the simple homework assignments, this class is an easy A or B. You definitely do not need the book. She has an accent, but is still easy to understand. She also makes concepts extremely easy to grasp. I strongly recommended this professor.",
        "course": "AST162"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "She was hard to understand, and couldnt really understand student.  Exams were mildly difficult.  Go to class, it will help a lot.",
        "course": "ASTRO162"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "I found she was very interesting in lectures.  I am interested in Astronomy already so that may have helped. Only study notes for tests.  I never opened my book one time, so dont buy it.  Lots of wrtiting but everything is on power point.",
        "course": "ASTRO162"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT SKIP CLASS! If you skip class you will be totally lost. She doesnt put the powerpoints online so if you miss class get the notes from someone! She has a very heavy accent and is hard to understand... if you can take this class with someone else, you should!",
        "course": "ASTRO162"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Teacher does a very good job explaining concepts and drilling important facts.  The subject is boring.  Use the book and go to lecture to get an A",
        "course": "ASTRO162"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "semi-interesting class. she seems to want everyone to understand, and makes it a little easier by handing out homeworks. Tests aren't too bad, and she will work with you if your having difficulty. Her accent is annoying at times.",
        "course": "AST162"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is pretty easy and requires little studying. She's an interesting teacher--makes really funny analogies which are made even funnier by her thick hindi accent. Sit in the front row and pay attention and it won't be too hard.",
        "course": "ASTRON162"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "incredibly bad teacher",
        "course": "AST162"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 3,
        "comment": "Boring, sometimes hard to understand class. Her accent doesn't help (where is she from anyways) - like everyone else here has said, don't buy the book and don't miss lecture (although if you do you can go to her office and copy the notes - sneak over to the copier in the room she takes you to!)",
        "course": "ASTRONOMY162"
      },
      {
        "index": 26,
        "rating": 1,
        "difficulty": 3,
        "comment": "Got a B+, and did not work very hard.  She sucked as a lecturer and used tests from the test bank, which made her tests very different than the class or the book.",
        "course": "ASTRON162"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very unsympayhetic, doesn't really seem to care if people learn or not.  Doesn't beleive in power point and yet gets annoyed if you take too long writing the notes down, god forbid.  Buying the book is also a waste of money, but don't skip any lectures if you can help it.",
        "course": "AST162"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "wow yeah if you skip lectures you will be taking this class again, dont buy the book.  At times very hard to understand, got a B.",
        "course": "ASTRON162"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 2,
        "comment": "whoa.  be prepared to be bored.  she doesn't believe in using power point, so be ready for some scrawly notes on an overhead sometimes.  Her accent is a bit thick but whatever.  you should get a class buddy so you dont have to go every day.  trust me.",
        "course": "AST122"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 3,
        "comment": "Has no sympathy for anyone.  Has a hard time explaining herself due to heavy accent, and makes no effort to help condense the loads of facts put forth in her lectures.  Definitely don't skip the lecture, but don't buy the textbook either.",
        "course": "ASTRON162"
      }
    ],
    "SEI": [
      {
        "Subject": "ASTRON",
        "Catalog": "1102",
        "Class Name": "From Planets to the Cosmos (No Lab)",
        "Class Number": "22883",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "66",
        "Rating": "4.02"
      },
      {
        "Subject": "ASTRON",
        "Catalog": "1141",
        "Class Name": "Life in the Universe",
        "Class Number": "11110",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "80",
        "Rating": "4.36"
      },
      {
        "Subject": "ASTRON",
        "Catalog": "1102",
        "Class Name": "From Planets to the Cosmos (No Lab)",
        "Class Number": "21659",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "Distance Enhanced",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "63",
        "Rating": "4.4"
      },
      {
        "Subject": "ASTRON",
        "Catalog": "1141",
        "Class Name": "Life in the Universe",
        "Class Number": "15237",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "76",
        "Rating": "4.47"
      },
      {
        "Subject": "ASTRON",
        "Catalog": "1141",
        "Class Name": "Life in the Universe",
        "Class Number": "17484",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "47",
        "Rating": "4.57"
      },
      {
        "Subject": "ASTRON",
        "Catalog": "1143",
        "Class Name": "Cosmology: History of the Universe",
        "Class Number": "18161",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4"
      },
      {
        "Subject": "ASTRON",
        "Catalog": "2141",
        "Class Name": "Life in the Universe",
        "Class Number": "18159",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Astronomy",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.59"
      }
    ]
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.8,
    "department": "Science",
    "firstName": "Dick",
    "id": "VGVhY2hlci01MTI0NA==",
    "lastName": "Furnstahl",
    "legacyId": 51244,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "God of Physics and knows the Art of teaching.",
        "course": "PHYSICS5300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a physics genius. He writes and speaks clearly. He is always prepared for class and does a lot of work to keep the website updated. He makes difficult concepts very easy to understand. Highly recommended.",
        "course": "PHYSI132H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Excellent teacher. Immensely interested in helping students; he literally sticks around the physics lounge every day to address homework questions. Class is always interesting. Tests focus on truly understanding the material, but were never particular difficult.",
        "course": "PHYS133H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "One of the best professors I ever had while at OSU",
        "course": "PHYSICS"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "great great teacher.",
        "course": "HYSICS263"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Not many people can say that a college professor was the best teacher they ever had, but he most definitely was.  Perhaps the most caring professor you'll ever meet.",
        "course": "PHYS2613"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "PHYSH132"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "AMAZING",
        "course": "263"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Always helped with homework/questions; fun&interesting; class hard for nonmajors",
        "course": "PHYH132"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "PHYSICS26"
      }
    ],
    "SEI": [
      {
        "Subject": "PHYSICS",
        "Catalog": "5300",
        "Class Name": "Theoretical Mechanics",
        "Class Number": "23084",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.86"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "8820",
        "Class Name": "Special Topics",
        "Class Number": "19507",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "5"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "5300",
        "Class Name": "Theoretical Mechanics",
        "Class Number": "17210",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "5"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "7501",
        "Class Name": "Quantum Mechanics 1",
        "Class Number": "20510",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.76"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "5300",
        "Class Name": "Theoretical Mechanics",
        "Class Number": "23267",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "5"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "7701",
        "Class Name": "Analytic and Numeric Methods of Physics",
        "Class Number": "23096",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "5"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "8820",
        "Class Name": "Special Topics",
        "Class Number": "23773",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.88"
      }
    ]
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.4,
    "department": "Science",
    "firstName": "Harald",
    "id": "VGVhY2hlci0zMTY2MDU=",
    "lastName": "Vaessin",
    "legacyId": 316605,
    "numRatings": 40,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "his lecture is boring and most of them are NOT connected to the exam, you have 4 midterms and 1 final, 50% of the questions in the exam are come from test bank around 5000 questions, 1000 per module, and if you didn't do it before, you won't even know what the questions are asking about. you will struggle at the end of the semester. memorize all Qs",
        "course": "MOLGEN4500"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Vaessin is a great guy that cares about your success. However, he is not the greatest at teaching, nor is his class set up that well. I struggled big time in this class. Many of the below reviews sum his class up, go read them. Read the text and do the self evaluations (dozens of times). Work hard because this class was not easy.",
        "course": "MOLGEN4500"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "As for his accent, it honestly didn't take away from the class. His long spiels are meant to interest us and connect class topics to real-life scenarios + there are MANY chances to succeed: test corrections, the final exam repeating questions, self-evaluations, one exam being dropped, etc, just come to class. Best professor for MOLGEN there is!!",
        "course": "MOLGEN4500"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Vaessin was very clear about what would be on exams. There were self evaluation modules for each exam so you could get familiar with questions. There was also an exam drop. He also offered bonus points for watching videos and there was pack back and mastering required. He sometimes went on tangents during lecture and had to leave early sometime",
        "course": "MOLGEN4500"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "The class material itself is not necessarily difficult. It is pretty straightforward. Dr. Vaessin is a scientist by heart, but he is not meant to teach. Yes, he knows his stuff. However, the dude STRUGGLES to teach it in a way that makes sense. I often found myself just trying to find the point of why he was going on a 10-minute history tangent.",
        "course": "MOLGEN4500"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Graded aspects: Need 80% attendance. Weekly Packback posts. Packback is a company that scams students. Don't take classes that use Packback. Four exams. One will be dropped. These exams are the majority of your grade. Read the book because his lectures have NOTHING to do with the exam questions. \n\nYou will struggle in this class, guaranteed.",
        "course": "MOLGEN4500"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "There are 4 midterms and a final, with the lowest midterm dropped which will save you. He doesn't grade any homework until the very end so you never know your grade. Most of the lectures are off topic. Lots questions on exams come from the self evaluations he gives before so study those, but a majority will be stuff you have never heard in class.",
        "course": "MOLGEN4500"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "I liked him! A majority of his lectures come straight from the book, so if you pay attention in class and read the book at home, this class shouldn't be particularly difficult. You do have to do a good amount of work, but Dr. Vaessin is fair. There is a test bank, but if you study the book and notes, you don't need to memorize every question",
        "course": "MG4500"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "5 exams all semester, all the questions taken from a test bank, not from what he covers in lecture. Do his optional Carmen self assessments for practice questions, just like the exams. Online homework and learning curves not related to material on exams. This class is poorly structured &amp; exams are tough. Dont take this class unless you HAVE to....",
        "course": "MOLGEN4500"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very difficult to pay attention during lecture; he just isn't very captivating. His accent was a little tough for me to understand at time. My success in the course was to use the practice quizzes on carmen. Supporting staff were pretty terrible: vague in their answers or just plain wrong, uninterested, and inconsistent grading. Good luck!",
        "course": "MOLGEN4500"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 4,
        "comment": "As a bio major, I was already interested in this class to begin with which made studying for it less rough. At the end of the class he awards a few extra points and if he likes you he will bump you a letter grade if you were on the edge. Reading the book and going through power points is the best way of studying. Don't rely on his practice tests.",
        "course": "MOLG4500"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 4,
        "comment": "Vaessin started off teaching well, then ended up flying through the notes. The homework is a joke and memorizing the test bank is the only way to pass the exams. Make a Google doc for the final and get students to put their exam Q&A's in it because the final is HARD. Study early because the test bank for each exam is a PowerPoint of 500 slides.",
        "course": "MOLGEN4500"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Thank God this class curved! Test questions rarely come from lecture or book. You have to be able to read his mind! There are \"module\" exams every 3 or so weeks and they're worth most of your grade. He is not approachable or available outside of class. Online homework is mandatory and useless (must purchase access code). Uses TopHat for attendance.",
        "course": "MOLGEN4500"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "Makes the class hard in all the wrong ways. Copies questions for his exams off of biol sc that are not in the book or the 300 pp slides he expects you to know by heart every 3 weeks. Most of the questions on the exams are too specific and are not covered sufficiently in his notes or the book which is another 150 pages to read every 3 weeks.",
        "course": "MOLGEN4500"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class was very engaging  and he always asked questions which forced students to think through the experiments. He was very keen on knowing why we were performing certain steps, and if you took good notes, the final was a breeze.",
        "course": "MOLGEN4501"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Some days I'd learn a lot from him, other days I'd walk out of lecture not knowing what was going on. How to succeed:  get a question bank, take self-evaluations, study his lecture slides (because he likes to pull stuff from those too), read book about concepts you don't understand. Cannot stress the test bank though, it saved my MolGen life. ",
        "course": "MOLGE4500"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 3,
        "comment": "Nice guy, HORRIBLE lecturer. Tests Qs come out of a test bank (either get the bank from friends or take his self-evals 5+ times). The textbook, MasteringGenetics, and lectures will NOT help much with the tests. Also takes attendance via TopHat (need 80% attendance) which you have to purchase. Testing format is in class via Carmen quiz (hated this).",
        "course": "MG4500"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 2,
        "comment": "When I took 4501, it was the first time the course was offered, so practically no one knew how to teach it. But Dr. Vaessin made an effort to teach it the best he could. Besides the fact that we ran out of time and didn't complete portions of labs (especially the last lab), I felt that he was a good teacher. TAKE NOTES AND PAY ATTENTION THOUGH!!",
        "course": "MOLGEN4501"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "great prof, he was obviously interested in the material, and explained topics clearly. only covered important topics during lecture, so reading the book is highly advised.  Not really a fan of the online testing system, but it worked fine (something like comp. breakdown was just ANOTHER thing to worry about during the exam)",
        "course": "MOLGEN4500"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had Vaessin for Molgen. Although the testing system is not ideal, I thought he was very interested in teaching and it was evident that he really liked genetics.  Apart from the online testing, I really liked the class.",
        "course": "MOLGE500"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "Vaessin was usually a pretty friendly guy. He's passionate about genetics and at least tries to do a good job teaching. The class itself is pretty horrible, though. The test bank they reuse year after year seems to stunt the creativity and dynamism of the class. Take practice tests over and over; get an A.",
        "course": "MOLGE4500"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 3,
        "comment": "Harald is a nice guy if you make the effort to get to know him. Class is set up so that the professors can spend the majority of their time in their research labs. The tests are based on a question bank that are never discussed in lecture, but lecture is mandatory. Not necessary Harad's fault, but the class itself hurt my interest in genetics.",
        "course": "MG4500"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is absolutely HORRIBLE. He doesn't teach, he just stands in front mumbling to himself and waving his laser pointer around. The only reason I passed this class is because their testing system is a joke. As far as retention... NONE. Learned nothing. Thank you Dr. Vaessin. I appreciate you wasting my money.",
        "course": "MOLG4500"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible prof. Like the others said the class is essentially useless as the tests come from the book and questions off of online self evals about things never discussed in class. Impossible accent to decipher with his mumbling, and his cell phone went off at least once a week!",
        "course": "MGEN500"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 4,
        "comment": "Oh Dr. Vaessin. I liked him as a person but teaching is not his strong point. He could be hilarious at times with how he said things but he's a tough professor. My suggestion is to reread the chapters and know the experiments well that he goes over. Get help from the learning center if you need it!!!",
        "course": "MG500"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 2,
        "comment": "I learned absolutely nothing from him. Everything I learned was by spending time with the book. The tests aren't bad if you do the self-evals. Lectures are useless, but you gotta go because the clicker questions are ~10% of your grade.  Overall, the class was just really frustrating. Hurt my interest in genetics.",
        "course": "MG500"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is worthless.  Do the online self evaluations and read the book to teach yourself.  He is unreasonable and will not help students.  Do not take him!! The only reason I did was because there was no other prof teaching the class the quarter I needed it.",
        "course": "MOLGE500"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "easy teacher, easy class. his accent is pretty bad, but i would by no means say he is a bad teacher like the previous reviews. I thought he was a really great teacher. He made it easy to understand, and had organized notes that he posted online.",
        "course": "MOLGE500"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 4,
        "comment": "For someone who pays $40,000 a year to attend school, the way Harald taught this class was like a slap in the face.  He was very vague on the fact that his lectures were useless and only those who read the book could do well.  I still did fine in the class, but the total frustration that resulted from taking him was easily not worth the A.",
        "course": "MOLGEN500"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "He was a hard teacher to understand, but if you do the self-evaluations and online tests you should do decent. Did pretty well in the class.",
        "course": "MOLGEN"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 4,
        "comment": "I can't even begin to describe how terrible this class is and how bad a professor he is.  Maybe the fact that out of 280 students only approx. 40 bother showing up to class should tell you how bad he is.  Can't understand him.  Just take self evaluation tests over and over to learn the material and read the book.",
        "course": "MOLGN500"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 2,
        "comment": "Many students don't give Dr. Vaessin a chance because he has a thick accent. However, it isn't all that difficult to get used to it, and in my estimation he does quite a good job of explaining things. Give him a chance and listen to him well, and you may learn quite a bit.",
        "course": "MOLGE500"
      },
      {
        "index": 33,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is terrible, if you can even stay awake in his lectures, you'll find that his accent is horrible, no one can understand him, and it is pointless to attend his lectures... know the practice problem sets he gives out (use the TAs) and read the book, and you'll do well on his tests",
        "course": "MOLGE500"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 3,
        "comment": "Why would Ohio State hire someone so horrible&#63; They could have saved their money on this guy. If you learn anything during his class it won't be from him it will be from the textbook and the textbook alone.",
        "course": "MG500"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 4,
        "comment": "One of the worst foreign teachers that I have had so far. I couldn't sit through his lectures because of the way he spoke. The exams were not very difficult, but he wasn't very clear about what to study. Stay away from this professor.",
        "course": "MOLGEN500"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 3,
        "comment": "He presents the material in an easy way and the exams are out of his lectures and book problems",
        "course": "MOLGEN500"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 3,
        "comment": "I have had some foreign teachers in the past, but this guy has to be the worst. He is exremely hard to understand and is really boring.",
        "course": "MOLGEN500"
      },
      {
        "index": 38,
        "rating": 2,
        "difficulty": 3,
        "comment": "I thought he was a very fair teacher.  He is kind of difficult to understand at times.  I had two teachers that taught this class and he was better than the other one. It was hard to adjust because they switched off and on.",
        "course": "MOLGEN500"
      },
      {
        "index": 39,
        "rating": 2,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "MOLGEN500"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "MOLGEN500"
      }
    ],
    "SEI": [
      {
        "Subject": "MOLGEN",
        "Catalog": "4500",
        "Class Name": "General Genetics",
        "Class Number": "23196",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "40",
        "Rating": "4.65"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "21968",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "25347",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.5"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "27756",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.45"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4500",
        "Class Name": "General Genetics",
        "Class Number": "21219",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "41",
        "Rating": "3.41"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "19991",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "19471",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "21877",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.44"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4500.01",
        "Class Name": "General Genetics",
        "Class Number": "24735",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.18"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4500.01",
        "Class Name": "General Genetics",
        "Class Number": "34889",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "83",
        "Rating": "2.61"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "23629",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "3.43"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "7890",
        "Class Name": "Molecular Genetics Seminar",
        "Class Number": "19186",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "4.5"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "25394",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.33"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "27654",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "3.2"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4500.01",
        "Class Name": "General Genetics",
        "Class Number": "30438",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "60",
        "Rating": "3.55"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "26103",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.43"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "7890",
        "Class Name": "Molecular Genetics Seminar",
        "Class Number": "21990",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4500.01",
        "Class Name": "General Genetics",
        "Class Number": "24927",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "47",
        "Rating": "3.85"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "25316",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.33"
      },
      {
        "Subject": "MOLGEN",
        "Catalog": "4501",
        "Class Name": "General Genetics Laboratory",
        "Class Number": "27450",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Molecular Genetics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.5"
      }
    ]
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 4.3,
    "department": "Science",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xMjYxNTk=",
    "lastName": "Lisa",
    "legacyId": 126159,
    "numRatings": 58,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "PLEASE DO NOT DROP THE MAJOR!!! CLASS IS NOT LIKE REST OF THE DEGREE!!!",
        "course": "PHYSICS2300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lisa is one of the best professors I've ever had. 2300 is a difficult class, but if you read the textbook, attend lectures, and pay attention, you'll be just fine. Exams are rough, but final grades are curved accordingly (for example, in AU24, a 75% rounded to an A). And he's a Cavs fan, so thats a win. #LetEmKnow",
        "course": "PHY2300"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "His office hour is always helpful. The homework and exams have a suitable difficult-level. The final grades will be highly curved.",
        "course": "PHY2300"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "He's passionate about pushing kids further than they've been pushed before. It would've been better executed if he was less condescending and more encouraging. The exams being so obscenely difficult resulted in a lot of students feeling not smart enough for the class (even though they were above the average). My C rounded to an A-, so huge curve. ",
        "course": "PHYSICS2300"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "The organization of the lecture is not very good, the homework is difficult, and the exams are also difficult, but the curve is very generous!",
        "course": "PHYSICS2300"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 5,
        "comment": "Lousy teaching, difficult exam, but a generous curve.",
        "course": "PHYSICS2300"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 5,
        "comment": "Mr. Lisa is a very solid professor. He knows very deeply in Physics. However, the difficulty of the Physics 2300 course is high, but he will provide the curve based on the difficulty of his exams. Therefore, you do not need to worry about your grade if you learn hard on Physics 2300. Highly recommend Mr. Lisa!",
        "course": "PHYSICS2300"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "Prof. Lisa is charming when he gives lectures. In some way, he actually made me more passionate about physics. Yet, I hate the flipped mode so much. It doesn't make any sense to watch the videos before the lectures and go to the lectures only for group discussions. I prefer the traditional lectures. Also, the midterms and quizzes are challenging.",
        "course": "PHYSICS2300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very solid professor. He makes such a difficult course easy-understanding. Although the homework, quizzes, exams are very challenging, you could still get a good grade if you put effort in because of the curve.",
        "course": "PHYSICS2300"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 5,
        "comment": "PHY2300 was the hardest class I've ever taken. Prof. Lisa didn't assign too much homework, but it took a long time to complete. He was also very generous with partial credit on the exams, and the final grade got curved up quite a bit. Try to read the book and watch the lectures before going to class, practice problems at home, and you'll do fine. ",
        "course": "PHY2300"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "It's the best prof and I love to take his class cuz he got a vivid class where all have chance to follow up and ask question. He is very patient and enthusiastic over physics, which I think the most important factor ",
        "course": "PHY2300"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 5,
        "comment": "Lisa cares greatly for his students. That being said, Physics 2300 was the hardest class I've ever taken. I would frequently spend 8-10 hours on a single homework assignment, and recieve grades of 50% on tests.",
        "course": "PHY2300"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Mikey knows how to teach an honors-level introductory class. He chose to teach an introductory course instead of being forced. Expect him to have some fun lectures and some boring ones. Don't understate his exams and quizzes. Be careful because you are expected to put in the work and show that you can for a grade. Please call him Mikey",
        "course": "PHYS1250H"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Lisa is an excellent honors professor who asks very thought provoking and difficult questions that challenge you more than you would expect from a typical physics class. He is always very clear, has a definite plan before each class, and is very open to any questions from students and answers them well.",
        "course": "PHYS1250H"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Lisa is a solid professor. He is very helpful: he would answer basically any question anyone had in class. He is also very accessible and approachable during office hours. As another commenter has said, the class was curved substantially, but you will have to work hard regardless. It is a tough class, but Dr. Lisa makes it more bearable.",
        "course": "PHYSICS1250H"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "The class is hard, but he's a very effective teacher and the info is there if you put the work in. Genuinely wants students to understand physics principles. The grading seemed tough at first but easy to adjust to the system. Hinted at a very large curve to avoid failing a bunch of kids (some of whom deserved it). Bit of a strange dude but funny.",
        "course": "PHYSICS1250H"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Lisa is a really great lecturer. He is incredibly smart and funny at times and he is really good at keeping the class engaged during lecture. His exams and quizzes though are super hard so be sure to really understand the concepts and how to do problems.",
        "course": "PHYSICS1251"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Lisa is an incredible smart man, so smart, that I think he often forgets practical capabilities of students at my level (freshman physics major). His lectures are pretty good, and his homework and quizzes are reasonable, but when it comes to midterms and the final I had a lot to complain about; they are unnecessarily difficult/calc heavy.",
        "course": "PHYSICS1251"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lisa gave great lectures and is a very intelligent man, but his tests were impossible. Going to lecture is important, but I found that reading the book and doing practice problems helped the most. He is known to use problems from the book on quizzes. He can be a little conceited at times and doesn't care that his tests are extremely difficult.",
        "course": "PHYSICS1251"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Super great lecturer, very passionate about what he is teaching and sharing his knowledge. Office hours were also helpful, but his tests and quizes are notoriously difficult with questions you haven't seen before. Good luck if you're in 1251...",
        "course": "PHYS1251"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Lisa is probably the best Physics prof. at OSU. This does not mean that he is going to make the class easy. He has a true passion for physics and what he teaches. The main thing is that Physics 1251 is an extremely hard subject and you have to put a lot of time and effort into the course. Just having Prof Lisa doesn't guarantee a good grade!!!",
        "course": "PHYS1251"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 5,
        "comment": "Professor Lisa is a good instructor. However, I think the way he teaches us is wrong somehow. The quizzes and midterms are much harder than those from other professors. My roommate can get an A but I only got a C+. There is no lecture notes posted on Carmen, so you have to attend the lectures. C+ affects the GPA that enter my major.I have to retake",
        "course": "PHYSICS1251"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "So some people have rated Dr. Lisa as average/bad  because the class is hard and you actually have to go to class-It's physics. Expect it to be hard. Dr. Lisa is the BEST professor this school has to offer. He is extremely engaging, brilliant, and funny. He is very approachable and explains things VERY well. If you are taking physics, he is a MUST",
        "course": "PHYS1251"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 4,
        "comment": "Michael is a great professor; however extremely difficult, possibly because it is difficult material in the first place. I recommend taking this professor, lectures are interesting and fun because he has such a passion for physics.",
        "course": "PHYS1251"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 4,
        "comment": "You have to go to lecture to pass this class with Lisa. Its your only source of information of what will be on the test because he deviates from the textbook occasionally. The clicker questions in class and the homework on webassign are good indicators of what tests will be like. Lisa is good at explaining things, not great at writing them down.",
        "course": "PHYSICS1251"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing prof, one of the best ive had at OSU. His examples make sense & are so helpful u find urself later referring to your notes because theyre actually of use. If you ask a question in class, no matter how stupid, he'll answer it very well & incorporate it into the lecture, he even follows up w/ u later. Very fair w/ midterms. And hes hilarious.",
        "course": "PHYSICS1251"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Lisa can inspire students even about physics E&M, which is a major accomplishment.",
        "course": "PHYS1251"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 4,
        "comment": "He's a great lecturer, I currently have him for Physics EM (1251). The tests are pretty hard, but I'm assuming he will curve them somewhat. One complaint is no equation sheets are given for quizzes which is really tough, but they are provided for exams.",
        "course": "PHY1251"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lisa is the best professor that I ever meet in OSU. He's patient with repeating the examples and explaining them clearly when someone doesnt understand. His quizs are fair, not hard and not easy. The second one is a bit challenging coz magnetic field is so tricky.  He really helps a lot in lecture. And he's pretty hilarious.",
        "course": "PHYSICS1251"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 3,
        "comment": "Physics of Sports was a great class.  I only took it because I needed a GEC. I didn't like physics in high school, so I hoped it wasn't really physics.  But it was, and it wasn't too bad. It was cool to use forces and energy and math to understand sports. The book was cool. The tests and homeworks were pretty hard but he curves a lot at the end.",
        "course": "PHYS1100"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 5,
        "comment": "Lectures were long and boring for what you would think is going to be an interesting course about the physics of sports. Book used for class is one of the worst things ever written. Quizzes and homework problems are very confusing and difficult. This guy is the king of curveballs.",
        "course": "1100"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Lisa was one of the best lecturers I've had at OSU. His lectures are extremely helpful and, while he does ask some tricky concept questions on exams, he always makes sure to explain the concept before the test in lecture, SO GO TO CLASS!",
        "course": "PHYS1200"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is a great professor who makes the class interesting even though physics is the worst subject known to man kind. His exams are difficult but he curves them after",
        "course": "PHYS1201"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "Physics of Sports was great with Prof. Lisa.  Made his own textbook out of the slides he used in class.  Weekly homework was very similar to questions in class. He was very clear about specific principles and concepts he guaranteed to be on quizzes+midterm. Offered a group project instead of taking a final,was very helpful w/ developing the project",
        "course": "PHYS110"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 3,
        "comment": "Spoke clearly. Really helpful demos. Said funny things. Exam 2 was difficult. I would recommend him to another student! Quiz easiness was hit or miss. TA was really good and cared about students a lot. Lab was pointless. Take Prof. Lisa if possible!!",
        "course": "PHYS1200"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Lisa is one of the best lecturers I've had in my time at OSU. He is very clear in presenting the material and though his class was difficult, he made it thoroughly enjoyable. His sense of humor during lectures didn't hurt my interest level either.",
        "course": "PHYS132"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 5,
        "comment": "this professor is cold hearted. his exams are so hard for no reason. the average is so low that he has curve the class. take someone else if you can.",
        "course": "PHY133"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great professor! He speaks loudly and is able to make complicated material easy to understand. Test and quiz averages were fairly low, but he curves up to an 80% so that's awesome",
        "course": "PHYS113"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor.  Makes quantum physics and relativity interesting.",
        "course": "PHYS113"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 4,
        "comment": "Explains things very clearly.  Checks to make sure students understand.  Loud voice.  Tests are hard, but are curved at the end.  Good prof!",
        "course": "PHYS133"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 4,
        "comment": "I hated this class - he had two T.A.'s and taught one of the sections himself. His sections averaged much better on the exams than those of the T.A.'s because there were questions he went over himself but NOT in lecture.",
        "course": "PHYS111"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 5,
        "comment": "great teacher. Exams and quizzes very difficult. Mid-term median was 38 out of 100. Curve was 39 points. He explains the basics very well, but tests on complicated problems. It really makes you think, which is what makes him a great teacher, but also gives you an ulcer. Even though the tests are that difficult, I'd take a class from him again.",
        "course": "PHYS111"
      },
      {
        "index": 43,
        "rating": 4,
        "difficulty": 4,
        "comment": "i did not like his teaching style. dr.lisa was the only prof that did NOT allow us to use notes and homework on the weekly quizzes which was bs. every other prof allowed it. and the midterm average was a 38/100 because the thing was IMPOSSIBLE. no wonder he had to curve it 40%.",
        "course": "PHYS111"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 3,
        "comment": "100% English-speaking professor.\r \r He is a very energetic prof with a projecting voice which makes it easy to pay attention. He will gladly answer any question you have. Exams are fair and represent the material well. Webassign sometimes had material on it that was not yet covered.\r \r Overall a very good professor. Recommended!",
        "course": "PHYS133"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is challenging but fair. He gears his quizzes and midterms toward comprehension of the concepts in the class, not just knowing how to use equations. He is an energetic lecturer and manages to keep class bearable. He addresses all questions thoroughlyr Sometimes interjects political opinions, but only as a joke or side note.",
        "course": "PHYSICS111"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 3,
        "comment": "A few of his test questions were completely unlike those presented in class/homework.  Quizes & tests were difficult.  Professor generally explained material well and in an interesting manner.",
        "course": "PHYS133"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a very good professor. Tests were fair and his recitations are worth going to.",
        "course": "PHYSICS133"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 4,
        "comment": "great teacher.  very enthusiastic and wants to help.  go to lectures and study, though, because tests and quizzes are hard.  I had him before, though, and with the curve the grades are fair at the end.",
        "course": "PHYS133"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 4,
        "comment": "Made me interested in Physics, I hated it before.  Great notes, and good all around",
        "course": "PHYS133"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is very willing to help, I thought he really was interested in teaching",
        "course": "PHYSICS131"
      },
      {
        "index": 51,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Lisa is a very cool individual-someone you may like to go have a beer with. But he will screw you in his class. He tells you a lot of stuff you don't even need to know-and tests you on stuff that you did not even talk about in lecture. The class was a nightmare!",
        "course": "PHYSICS133"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good professor, the first midterm was cake, the second was average, the final was the hardest test I've ever taken, the class is curved though so it doesnt really matter.",
        "course": "PHYSICS133"
      },
      {
        "index": 53,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dude, like, totally awesome prof! Helped in explaining abstract stuff in Physics 132.",
        "course": "PHYS132"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nice guy, Hard and challenging test, but fair either way.",
        "course": "PHY132"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had him last quarter and he was great!  Always wanted made sure the class understood, and he obviously loves physics.  The class was alot of work, but fair.  Always helpful, especially if you ask.  (Plus he's hot!  another reason to go to office hours!)",
        "course": "PHY132"
      },
      {
        "index": 56,
        "rating": 1,
        "difficulty": 5,
        "comment": "worst class i've taken so far.  i used to like physics but now hate it.  grading of tests unfair, time for tests not nearly enough.",
        "course": "PHYSICS"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy is a stud.  But test and quizzes are hard as hell.",
        "course": "PHY132"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 4,
        "comment": "lectures very clear, and prof. is very helpful.  tests are hard but fair",
        "course": "PHY132"
      }
    ],
    "SEI": [
      {
        "Subject": "PHYSICS",
        "Catalog": "1250H",
        "Class Name": "Honors Physics: Mechanics and Conservation Laws; Special Relativity",
        "Class Number": "18442",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.73"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "N/A",
        "Class Name": "Honors Physics: Mechanics and Conservation Laws; Special Relativity",
        "Class Number": "16466",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "2300",
        "Class Name": "Intermediate Mechanics I",
        "Class Number": "20267",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "31",
        "Rating": "4.07"
      },
      {
        "Subject": "PHYSICS",
        "Catalog": "2300",
        "Class Name": "Intermediate Mechanics I",
        "Class Number": "22881",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Physics",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "36",
        "Rating": "3.86"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Science",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xMzY5MDc=",
    "lastName": "Mangino",
    "legacyId": 136907,
    "numRatings": 58,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I was hesitant to take this class after reading some of the reviews on rate my professor, but I honestly enjoyed the course material, and he was lenient toward the end on grading - offered a few bonus opportunities and curved the class a couple of percentage points. Only complaint is that I earned a 92.7% and he would not round it to an A",
        "course": "FDSCTE2200"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Not the easiest A but still possible. The only complaints I have are that his notes are very confusing and poorly ordered. Tests are harder than they should be with awkward wording as well.",
        "course": "FDSCI2200"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "This is not an easy A class or teacher. He gives a lot of info at once. Stay on top of reading and actually learn the material. cramming and having notes on exam are not going to guarantee a good grade. the quizzes are a lot easier than the exam. the question from the quizzes don't appear on the exam. ",
        "course": "FDSCTE2200"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "I honestly didn't hate his class, he's a great instructor. The quizzes were extremely helpful however the exams were extremely difficult. I made very extraneous study guides for the exams and still couldn't manage to get an A. ",
        "course": "FDSCTE2200"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class as an easy A, but it was actually a lot harder than I thought it would be. He organizes the class really well but his notes on each section are SUPER long and impossible to memorize before the exam. Take this class but just make sure to review the notes a before the exams because they're harder than you think (especially exam 1)",
        "course": "2200"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Read the material study a few hours before each exam and allow time to do the project and this class is a easy B, an A with some effort and studying. DONT think the first exam will be easy. Lowest class average on the first exam.",
        "course": "FDSCTE2200"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is really easy to get a B in but extremely difficult to get an A in. Exams are super hard and there's not a lot you can do to offset a poor exam grade. Take this class with a few friends and do the exams together!",
        "course": "FDSCTE2200"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "Definitely not an easy class if you don't attend or study in advance for midterms. Somehow got a B in the class without doing well on any of the tests.  Nice guy and tries to make it interesting",
        "course": "FDSCTE2200"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "He does a pretty good job with the online version of the course. You can't just skate through the class, but as long as you read the material carefully and take notes, an A is well within your reach.",
        "course": "FDSCTE2200"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "I took FDSCTE 2200 & got an A , n then took FDSCTE 1120 (wine and beer culture) online and got a B. he's a great guy, but the class isn't easy by any means. For the 1120 class, I went in office hours for help & he actually ended up boosting my grade at the end to a B (from a C). Just be personable & try. Not horrible or horrific at all",
        "course": "FDSCTE2200"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is super easy. I don't know what everyone is talking about. As long as you actually read, highlight, and make some side notes, you should be able to retain the information well. The info isn't even hard to follow. The only mistake I made was underestimating the first midterm and not reading the material, which got me a final grade of A-",
        "course": "FDSCTE2200"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "poor quality. not recommend",
        "course": "FDS2200"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 5,
        "comment": "Took his class online and it was horrific. All you have in the class is 10 quizzes worth 5 points a piece and three exams worth the majority, and the exams are impossible. 50 questions in 45 minutes, and half of them you have never seen in your life. Online class that I actually tried in and got a C.... Dude's terrible",
        "course": "FDSCT2200"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very nice instructor and loves the field.",
        "course": "FS201"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 3,
        "comment": "Mike has to be the worst professor in the biological sciences department. He's extremely interested in the subject which makes class tolerable but he sounds like brad pitt from snatch. You can maybe understand half of the words that come out of the man's mouth. For that reason, attendance isn't mandatory. You can get the notes off carmen.",
        "course": "FDSCI201"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "good guy, pretty helpful",
        "course": "FST201"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 4,
        "comment": "Clearly a subject he enjoys. But not the best at teaching it. The tests are worded so tricky that they are hard even if you study night and day. Not a bad guy, just not a good teacher. Not an easy A GEC if that's what you're looking for",
        "course": "FDST201"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "Not an easy GEC class.  Although midterms are multiple choice, you have to know a lot of information for them.  Good about getting back to questions on carmen, but sometimes a little rude.  Learned a lot, but a pretty in depth class for a GEC.  And not an easy A.",
        "course": "FDST201"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 3,
        "comment": "I thought this class would be easy, since I was told he only puts everything written in red on the lectures on the exam. I studied a lot and still ended up getting b's on the exams. Some of the exam material he writes in a tricky manner, and its definitely not just what is in red. he's also pretty rude when you try to ask him something.",
        "course": "FSCI201"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you're looking for an easy A or GEC (or elective for the public health minor) and are good at learning/memorizing info this is the class for you. 2 midterms, 1 final, 10 online quizzes, and a food chart assignment. Exams are easy and straightforward if you study!",
        "course": "FDST201"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 3,
        "comment": "Though I'd heard that Mike was a great online teacher, I decided to take his class for Food Science in person. Some of the information taught was interesting, but I found him to be a very hard teacher to follow. He was clearly passionate about his topics, but he often went off on tangents and was unclear about what to study.",
        "course": "FDTSE201"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 4,
        "comment": "Horrible. Simply horrible. Take this class online if you can because coming to class literally does nothing because he can't teach. You can't understand a word he says and he goes on random tangents that don't contribute to learning at all. He's super rude when you have a question and his sarcasm is terrible. Don't do this section in lecture form.",
        "course": "FDTSE201"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very clear on what he wants you to study. Everything you learn in this class is useful information about Food Science.  If you read all the material you can get an A.",
        "course": "FDSCT201"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you need a GEC, this is it. Take it online. You memorize the concepts and definitions and then take the exams whenever you want. The class is super easy and I actually learned some really useful stuff about food safety, biotech, etc.",
        "course": "FDSCT201"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Is a good online teacher.  Makes things pretty easy...makes it pretty clear what is on exams.  most of the material is pretty interesting...covers a lot of the same material as human nutrition 210.",
        "course": "FDSCI201D"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 1,
        "comment": "This guy is a great online teacher, gives ample time to read assignments and take quizes, great flexibility for project and quizes you can take them whenever you want. 3 attempts per quiz, straight forward exam questions. Defiantly recommend.",
        "course": "FDSCI210D"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "online class is amazing.  read the material, study a few hours for the tests.  no tricks on tests.",
        "course": "FDSCI201"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 3,
        "comment": "Mike is very nice, and really wants everyone to do well. I took the class online, you have to have the discpline to study the material! He gives you different options of times to take the test! Very Helpful",
        "course": "FST201"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 2,
        "comment": "Makes the material easy to understand and responds quickly to questions.  It's easy to do well, but you'd have to study extra hard if you want an A.",
        "course": "FST201D"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very easy class online class but you have to discipline yourself and really study the material prior to your exam. Dr. Mangino is an awesome teacher and wants everyone to clearly understand the covered material as well as get a good grade. Great course to take!",
        "course": "FST201D"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 1,
        "comment": "Pretty solid professor. He puts the readings on carmen and without reading them you will fail the exam. Take the quizzes and make you know them forwards and back because they will make up almost half of the exams. Food chart and quizzes are easy. Overall very easy class with minimal work.",
        "course": "FST201D"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 1,
        "comment": "Easy easy class.  BUT you must study for the exams.  It is an easy course but you will not do well unless you study.  Easy Science GEC!  And Mangino is very understanding and flexible",
        "course": "FDSCI201D"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took the online class, was a piece of cake.  Had to take the tests on campus but all were totally multiple choice and based on questions from the quizzes/sample exam.  Great teacher - show him some interest and it'll reflect in your final grade.",
        "course": "FST201D"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "This guy was pretty funny. To be honest I can count the number of times I went to class on one hand. I ended up with a C+ because I just couldn't grasp the material that well. I should have went to class more because this was probably an easy A. The class is worth taking and it's easy going. Just make sure you try to go at least most of the time.",
        "course": "FDSCI201"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took food science online from Mike. No book needed, he has all the lecture material online, gives Carmen quizzes (you have 3 chances to score a perfect) and many test questions are taken from the quizzes. One project, 3 tests.  I'm getting an A with minimal effort (doing the study guides the day before the tests to study).  Take it Mike is great !!",
        "course": "FDSCI201D"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 2,
        "comment": "loved the class....funny guy...interesting material and learned a lot!",
        "course": "SCI201"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best teachers I have had at Ohio State. Make sure you sit in the front so you can hear all of his funny jokes he says under his breathe. He is super-helper, and his tests are very fair. Take the Food Science 201 with him!",
        "course": "FDSCI201"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is a total BA.  He uses hilarious examples in class and pokes fun at himself all the time (he knows he's old and he used to be fat makes us laugh because of it).  The topics can be dull, but hey, its school, what can u expect&#63; I look foward to this class every week just to hear what outrageous stuff mangino is going to say next. TAKE FD201",
        "course": "FDSCT201"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 3,
        "comment": "Lecture were lively and did not seem to be phoning the class in at all.",
        "course": "FDSCT201"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class is a mixed bag.  There's lots of interesting stuff here, but it is very easy to be sucked into complacency regarding it.  There are only a few grades, and if you bomb one mid-term, you will be scrambling to make it up in the other two.  It seems like an easy class, but there is a lot of memorization.  Short and frequent studying works.",
        "course": "FDSCI201"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class wasn't insanely easy like I thought it would be when I came in; I tried reasonably hard and only got a B, but that's not his fault. He's a pretty good teacher. My advice to you: STUDY!!!",
        "course": "FDSCI201"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 2,
        "comment": "There are only a couple things I did not like about this class. The tests cover random things that were occasionally never even discussed in class (and I never missed a lecture), and Mike is awesome, but Stephanie was kind of boring. Other than that this class is great! I wish I had studied a little bit more!",
        "course": "FST201"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 3,
        "comment": "You don't need to buy a textbook and all lecture notes are posted online.  Be warned though-there is stuff on tests that you'd need to be in class to know.  Majority of grade comes from exams, so do well on them.  They actually grade the other hw kinda tough, so put some effort into them for extra points.",
        "course": "FST201"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mike is a really great professor.  He cares a lot about the subject, and really wants the students to understand it well.  Do not overlook the tests though, because one bad test means a bad grade.  That is also a good part about the class: very few graded materials.  It is really easy though, also easy to skip.  Just study hard",
        "course": "FST201"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very easy class.  Just make sure you do the practice exams, provided on the website and in the course note packet.  Also, recitation provides a few answers on the exams, regarding cheese, ice cream, and others.  Attendance was never taken.  Very nice teachers. (Mike and Stephanie Smith).",
        "course": "FST201"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great Class, Him and Stephanie Smith combo was great. You really don't need to go to recitation other than for a question or two on the midterms and the midterms stick straight to their review sheet. Definately take this class if you can.",
        "course": "FST201"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class. Tells you exactly what will be on the exam before he gives it. Shouldn't be too difficult to get an A or B.",
        "course": "FST201"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 2,
        "comment": "There are a couple easy assignments, 2 midterms, and a final. The tests are not as easy as you may think. 50 multiple choice. Gives study guide right before test which is nice because you will want to skip lecture. Class is boring, but definitely take it instead of Bio 102. He's sort of funny but not worth sitting thru his one hour class to hear hi",
        "course": "FST201"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 3,
        "comment": "Class was a very BIG disappointment!! He is NOT helpful at all. He is NOT caring. When u go to him for help he makes YOU feel stupid. Test are harder than they should be. BOo HIss!!!",
        "course": "FST201"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super Easy class.  Tests come directly from class material.  All memorization.  It was one of the easiest A's ever.",
        "course": "FDST201"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really funny guy, I liked him a lot.",
        "course": "FDSC201"
      },
      {
        "index": 52,
        "rating": 3,
        "difficulty": 2,
        "comment": "Mike is a really good guy. The midterms were harder than I expected simply b/c they are only 50 MC questions and there are at least a few that aren't really covered in class or the book.  However, there is very little work in the class and a nice little curve at the end.  Good 2nd Bio class.",
        "course": "FST201"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good class. Mike is great and he knows that not everyone is going to be a food science major which helps.  Definately take it for a bio sequence!",
        "course": "FST201"
      },
      {
        "index": 54,
        "rating": 2,
        "difficulty": 3,
        "comment": "This class was a huge disappointment, and the instructor is surprisingly unapproachable in my opinion. The class is basically a memorize and forget class, so if you want to learn absolutely nothing and have very little fun doing so, take this class. He complains way to much about his wife!!!",
        "course": "FST201"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class. Very easy if you pay attention.",
        "course": "FST201"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 1,
        "comment": "lots of fun",
        "course": "FS201"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class.  SOOOO easy",
        "course": "FDSCI200"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "FST200"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 3.1,
    "department": "Science",
    "firstName": "Gary",
    "id": "VGVhY2hlci01NDkwMg==",
    "lastName": "Steigman",
    "legacyId": 54902,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "didnt go to lecture once - got an A. Easy teacher, class could easily be hard af considering you learn quantum mechanics but really doesn't challenge you at all. if you don't care about physics, take steigman.",
        "course": "PHYS133"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Steigman derives stuff in class so that you can understand it. He goes over basic examples in class, so you won't learn how to do the hard problems. His exams and quizzes are extremely easy if you know how to do the homework. His exams are very similar to the practice exams, so put them on your cheat sheet and you'll be golden!",
        "course": "PHYS133"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Drink some coffee before lecture and make sure to jot notes on the conditions of what he says, because he used different notations than the book. Examples in class usually from the book, but can be confusing when he explains it, so I'd say read how the book explains it first before class. Straightforward show-work quizzes & tests.",
        "course": "PHYS133"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "I sat in the front row every lecture 6 feet from him and still always fell asleep. Lectures are very boring and repetitive but he gets the point across. Class is generally very easy but he throws a few curveballs on the midterms and a lot on the final.",
        "course": "PHYS133"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lectures started off confusing as he bounced around and derived equations without exactly explaining where they came from. Lectures eventually got better to complete understanding by the end of quarter. Midterms are a rehash of the quizzes and sample test. Does include material you may have just learned before exam. Reading the book is required.",
        "course": "PHYS131"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 2,
        "comment": "His lectures aren't all that useful, he spends lots of time on one example and you get behind in the material.  To do homework/quizzes it's just as easy to read the section of the textbook.",
        "course": "PHYS131"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "he doesn't use the mic but which sucks because the lecture hall in Smith is huge. he explains everything well and is redundant which is good because some of the ideas are complicated but it does get very boring. quizes are cake and the midterms and final are just like the practice exams.",
        "course": "PHYSI133"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Steigman is a good teacher. Lecture is not required but it's nice to go every now and then. Quizzes aren't bad and the midterms are easy. Just make a good cheat sheet with every formula he gives in class and the ones in the book. The exams are exactly like the practice exams.",
        "course": "PHYS133"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Pretty boring lecturer, but if you attend class you'll have a general idea of what's on the quiz. Also, his exams do reflect on the practice exams he provides you, so be sure to take advantage of those. He's rather straightforward, so don't ask questions you can figure out for yourself. He'll outright refuese to answer them in lecture.",
        "course": "PHYS133"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 1,
        "comment": "doesn't know how to lecture... get barrett in recitation or read the book; only reason he gets good ratings is because his midterms are what is on the practice midterms. don't expect to learn a thing in this class",
        "course": "PHYS133"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 1,
        "comment": "Boring lectures, but it's better than reading the book. You can write ANYTHING on your one page &quot;cheat sheet,&quot; including sample test questions and answers, which happen to be very similar to the test problems themselves (usually just changed numbers).",
        "course": "PHYS133"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class was an interesting, in that the book for the course and the formulas and equations used in it were almost completely different. Going to lecture, then reading the book was very confusing. In my opinion choose one or the other (I preferred the book). Quizzes were generally difficult, but exams were not so bad if you use practice exams.",
        "course": "PHYS133"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very helpful in office hours. Really cares about teaching and making sure you understand the information. Pressure's taken off by allowing a 1 page cheat sheet on the exams, which are nearly identical to the practices.  Good class.",
        "course": "PHY133"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "He could be a little boring at times, but his equations and examples were very helpful. The quizes were similar to the examples from class and the homework. The midterms and final were very similar to the sample tests posted online. You were also allowed a one page cheat sheet for the exams.",
        "course": "PHYSICS133"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "the formulas he gives you on quizes are almost usesless. but his lectures are great and his jokes are funny.",
        "course": "PHYS133"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 1,
        "comment": "This guy is boring.  I found it impossible to stay awake in lecture, making going to lecture a complete waste of time.  Tests are just like practice therefore all tests/quizzes are very easy.  Recitation was far more helpful than lecture.",
        "course": "PHYSICS133"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Over all a very boring class. He took interesting information and made it so boring. You will find it hard to stay awake with useless deminstrations. His exams are strait forward, but the final you get little help.",
        "course": "PHYSICS133"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 4,
        "comment": "really boring lecturer...clear lectures, but u will have to mix and match a few of the million formulas he comes up w/ on quizzes and exams to do well on the problems, which can make it hard...miss part A and u'll get burned by either B C or D (if not all of them)...practice exams are very helpful",
        "course": "PHYSICS133"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Steigman is a boring lecturer.  However, you should still go to the lectures since he simplifies things.    Found the quizzes and midterms extremely easy, assuming you do the homework.  The two midterms are nearly identical in form to the practice tests on the course website.",
        "course": "PHYSICS133"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "Man, I wish I went to lecture more often for this class, and I would have if Dr. Steigman weren't so BOOOOORING!  I'm sure he means well and knows the material, but I'd rather watch paint dry than attend a physics lecture with him teaching it.",
        "course": "PHYS133"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 5,
        "comment": "Average professor. I found it really hard to stay awake in his class. He explains clearly but they wont help u in quizzes. u will have to study on ur own.",
        "course": "131"
      },
      {
        "index": 22,
        "rating": 1,
        "difficulty": 5,
        "comment": "BAD GUY",
        "course": "PHYSICS13"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good professor.  Everything was straight foreward.  I messed up the first midterm, killed the second one and the final and got an A.",
        "course": "131"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "PHYSICS13"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 4,
        "comment": "Unfortunately, I can't mark that hes retired.  Because thats what he should be.  He takes WAY to long to explain things, and he doesn't even explain it well.  I'm getting an A in the class, due to my recesstation instructor.  Avoid STEGMAN!",
        "course": "PHYSICS131"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 2,
        "comment": "This guy and the way his course was structured did nothing for my brain. I learned nothing!",
        "course": "131"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "great professor, I enjoyed his 133 class, makes the course material easy to understand, explains things clearly",
        "course": "PHYS133"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "Did a pretty good job of making Physics interesting.",
        "course": "PHYS132"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4,
    "department": "Science",
    "firstName": "Mitch",
    "id": "VGVhY2hlci01Mzk0Mg==",
    "lastName": "Masters",
    "legacyId": 53942,
    "numRatings": 33,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've taken a total of four classes with Dr. Masters.  He is a very knowledgeable professor.  This class had a LOT of very technical information, but Dr. M was good about explaining it in understandable terms, and his exams were very fair.  As long as you attend lecture and study, you will do well in any of his courses.",
        "course": "EEOB632"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor. Very interested in the subject and knowledgeable. Assigns interesting articles to read for recitations. Test are all fill in the blank/short answer with a few mult. choice, but provides practice exams which help immensely. Don't really need the book, as he provides the important figures on his notes on Carmen. Interesting class!",
        "course": "EEOB410"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Enthusiastic prof who knows a lot about what he teaches, which makes him great to listen to. Tests are easy, and the lectures are fun. I had to make up a test and he was very accommodating. His sweaters are delightful.",
        "course": "EEOB410"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "Interesting professor. He showed a lot of interest in teaching but goes off on a lot of tangents.",
        "course": "EEOB405"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 4,
        "comment": "He spends most of the time prodding the class to figure out the etymology of a word in a lecture. He seems like a nice guy, but he definitely didn't show much interest in teaching this class. Meh. So-so.",
        "course": "EEOB405"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Maybe this class style is better suited for a different type of person.  I just didn't like the discussion based style of learning.  Also, the students really don't get to choose when the tests are... we had the choice of Thursday or Monday.  We picked Thursday, and it was every other Thursday from then on.  He's a really nice guy though.",
        "course": "EEOBH410"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "You have to take this professor.  Hes such a nice guy.  The class decides when tests are (which they are often moved around to suit the class) and we did the homework in class collectively!  haha, we had some great convos in this class and its easy to get off topic with him.  Beware, if u like lots of structure, hes not ur prof, hes real laid back",
        "course": "EEOBH410"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "You have to take this professor.  Hes such a nice guy.  The class decides when tests are (which they are often moved around to suit the class) and we did the homework in class collectively!  haha, we had some great convos in this class and its easy to get off topic with him.  Beware, if u like lots of structure, hes not ur prof, hes real laid back",
        "course": "EEOBH410"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "Great professor, this class was small discussion format is excellent with this guy. Just make lots of interesting comments and he will discuss them into unprecedented levels of digrssion, all of which is interesting. The material is interesting because the ramifications can be seen in everyday life, particularly if you are an athlete. Easy A.",
        "course": "EEOBH410"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Small class in a  discussion format. No curve but there's two extra credit points you can earn. Class average for the five tests are in the range of 85-95. He's a nice guy! I recommend taking this class, it was an easy A, which means you don't study crazy long hours but still get an A.",
        "course": "EEOBH410"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Straight-forward lecturer who is passionate about his field.  Labs are easy as long as you go. Quizzes and exams are taken from class notes.",
        "course": "BIO114"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Quizes were very tricky. Strange format for us, no midterms but 9 mini midterm quizes. Dont know if I liked that or not. Pretty decent teacher all around. Lab practical sucks",
        "course": "BIO114"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "A great lecturer. He is very straight forward and presents good notes. His tests are fair and balanced. Highly recommended",
        "course": "BIO114"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best in honors classes",
        "course": "BIOLOGY"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite professors so far.  He explains things well and communicates well with students.  He replies to e-mails quickly.  The class isn't that hard but the lab practical was a ****.",
        "course": "114"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "He was a good professor.  The quizzes are very tricky!!  If you think you should deserve more ponts, turn it into the head TA and usually get points.  He says stuff only covered in lecture wil be on the quizzes, which is true for the most part but they are tricky and hard.  He is entertaining and not that boring.",
        "course": "BIO114"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class overall is a bit dry but Dr. Master's clearly explains the material.  He also seems to genuinely care tat students understand the information.  He is really good about answering questions and getting back to you.  His quizzes were based only on notes and overall the class was not that difficult.",
        "course": "BIO114"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 3,
        "comment": "Some of the examples he gives in this class turned out to be problems that appeared on the Biology GRE.  I'm glad I had him.",
        "course": "EEOB410"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "he is a very nice guy and cracks a joke here and there. he started a new system in which he gives quizzes every week; which is kind of a bummer because you have to study every weekend to get a good grade. also the labs are kind of useless. but i still highly recommend this guy.",
        "course": "114"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "very nice guy and very helpful.  his tests are fairly easy if you just go over the notes.",
        "course": "BIOH116"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 3,
        "comment": "He was an okay prof, he tried to keep the class awake, but it is a boring subject.  I liked how he actually responded to the class message boards.  His tests were for the most part fair, but T.A.'s graded differently.",
        "course": "BIO114"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 3,
        "comment": "He is a very nice guy, but in terms of a professor, he does not communicate the matter clearly. It's a class that you can fall asleep no matter what. And, Nicole Placek was the worst TA ever!",
        "course": "H116"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Although the material in this course is not the most interesting and the lectures were long, he tried his best to make the majority of the lecture stay awake.  He is very helpful and his exams are very relevant.  I definitely reccommend him.",
        "course": "BIO114"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "his exams were relevant and he made me laugh... I couldn't ask for anything more. He is also genuinely concerned that everyone is learning.",
        "course": "BIO410"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "Boring class, but nice guy.  Ask him about bats.",
        "course": "EEOB410"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 3,
        "comment": "The course in general is pretty boring, so lectures are pretty boring and long too. His exams are very fair. He provides lecture notes on line, and you rarely have to read or refer to your text.",
        "course": "BIO114"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wonderful, wonderful teacher. Very concerned that all students understand the material. Willing to spend time getting to know students. Makes boring stuff fun.",
        "course": "BIO114"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 2,
        "comment": "Looked like Charles Darwin and taught a class about evolution.  Can you say irony&#63;",
        "course": "BIO114"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "he looks like an owl, but was good, he went to slow sometimes",
        "course": "BIOH116"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 3,
        "comment": "yawn... cant put into words how bad a teacher he is",
        "course": "BIO114"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 3,
        "comment": "A delight",
        "course": "BIOH116"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "BIO114"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 3,
        "comment": "A delight, shares and infuses a passion for the subject",
        "course": "BIO114"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 3.2,
    "department": "Science",
    "firstName": "Andrew",
    "id": "VGVhY2hlci01MzI1OQ==",
    "lastName": "Gould",
    "legacyId": 53259,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 5,
        "comment": "Ok, so just save yourself the hassle and take another class. Especially if you have no interest in astronomy like I did. He makes it hard to fail the class if you give it a solid effort, however the workload is just too stressful and you are better off in some other GE class for your science.",
        "course": "ASTRON2161H"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Professor Gould is honestly one of the best professors I've had.  He makes you think and guess.  Try your best to extrapolate information from his lectures.  These classes are hard, but if you try your best and do everything an A- is almost guarantee.  Some homework were near impossible without his help, so go to his office hours.",
        "course": "AST1161H1162H"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is so awesome! An amazing teacher in every way. He philosophizes about life while teaching astronomy. It is a refreshing difference for us humanities majors. Tests are hard but it doesn't matter cause of the curve. So cooky and super endearing.",
        "course": "H161H162"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great professor, he truly made me a smarter person. I wish every class was taught in this way. We actually learned to think instead of just memorizing information. Tests are very difficult but he gives you an A or B in the class if you do the work. Dont buy the book, he doesnt reference it or use it all and it wont help you.",
        "course": "ASTR1161"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "The lectures are usually interesting, but the homework assignments, while often amusing (think, &quot;Newton, Ptolemy, and Galileo all walk into a bar...&quot;) are SO HARD. The only thing worse than the homework are the TESTS, which are ridiculously difficult. They have almost nothing to do with anything you learn in class. But, he's gives a great curve.",
        "course": "AST161H"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Teaches his class in a way that when he asks you if you have any questions, you're so lost you don't even know what questions to ask. Tests are designed for science graduate students rather than the poor non-science majors forced to take the course. Show up for every class, don't bother buying the book and ask questions if you can come up with any.",
        "course": "ASTRH161"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "I took H161 and H162 back to back, and they are by far, THE most difficult classes you will ever take in your whole life. You will understand NOTHING...but prof Gould rocks my socks! He is hilarious, and nerdy, and I just adore him. Go to office hours!! I averaged about a 50 on all exams and got an A- and an A respectively. Don't buy the book.",
        "course": "ASTROH161"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is useless. There are two midterms and a final, plus eight homework assignments, most of which are impossible to complete. Don't even bother buying the book, and why study when you aren't going to get better than a 50% anyway&#63; Doesn't even bother to show up on exam day, and lectures are useless. Show up for the exams.",
        "course": "ASTROH161"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "Andrew Gould is a conundrum wrapped in an enigma. He teaches his class as if it were full of science graduate students, when in fact it is full of humanities and business Honors kids who just want to fulfill a GEC. Funny guy, in a 'wears-shorts-when-it-snows' way. Very tangential. Don't expect to understand 40% of his lectures. Curves heavily.",
        "course": "ASTROH161"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "Tests are impossible. The average is usually a 40%. Homework is easier, but still hard. He'll give you some BS at the beginning of the class about &quot;teaching you to think in a new way.&quot;  Don't believe it.  The upsides are you don't have to show up (since you'll do awful on the tests anyways) and he curves generously at the end of the quarter.",
        "course": "ASTRNH161"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best prof I've ever had.  Extremely smart and funny.  Test was worth 200 pts, but he took it out of 100 cause we all would have failed.  It's tough, but if you come every day and participate he will like you and give you a good grade.",
        "course": "ASTROH161"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "He has an abstract way of teaching. He wears shorts as long as its 25 degrees and up. His test are literally designed for you to fail, but its purpose is to challenge you. Take him if you're willing to not know your grade until its posted at the end of the quarter (no real grading scale).",
        "course": "ASTRONH161"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class was a challenge.  Go to class, you cannot get by just reading the book (I wouldn't buy it).  The homework is ridiculous sometimes, but the professor really cares about his students learning to approach things scientifically.  Curve at the end of the course is easy, but you feel like an idiot after every test.",
        "course": "ASTROH161"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took his class a while ago, and it was an EARLY class. I hate those mandatory GEC courses, but I loved this prof. I thought he was a terrific teacher - very helpful, inspiring, creative - and recently he discovered a new star, so hats off to Andy all around!",
        "course": "ASTRONOMY"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 5,
        "comment": "difficult, but worth it.",
        "course": "121"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Brilliant man.  Will intellectually challenge you.  Slackers need not apply.",
        "course": "161"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "I took this class a while ago, but I really enjoyed him.  The class is an easy B, but I wouldn't suggest taking it in the morning if you can avoid it because it can be hard to stay awake.",
        "course": "AST161"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "For one, he really doesn't lecture too well.  What's worse, when we asked him questions, he seemed to get irritated by our lack of &quot;understanding.&quot;  On the other hand, he gives no less than a &quot;B.&quot;  So if this is acceptable for you, tak",
        "course": "ASTRH161"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 5,
        "comment": "HE is Andy and my relative so you better give him a great rating.",
        "course": "161"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "interesting person",
        "course": "ASTRON161"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "very interesting person, enjoyable class",
        "course": "ASTRON161"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.6,
    "department": "Science",
    "firstName": "John",
    "id": "VGVhY2hlci00Mzk5Mw==",
    "lastName": "Wenzel",
    "legacyId": 43993,
    "numRatings": 87,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's funny and intelligent",
        "course": "BIO101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "He makes lecture interesting to attend and is funny.",
        "course": "BIO101"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Made the information in lecture interesting. Was told that if you go to lecture and take notes you'd excel on the tests. Did the above, studied, understood concepts, but found test material was worded differently than presented in class--even contradicting. Didn't expect questions exactly from the notes, but presentation on tests was confusing",
        "course": "BIO101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "WARNING!!! This professor is awesome!  If you don't like one sentence questions on exams that are extremely straight forward DO NOT TAKE HIM! Also, if you prefer a boring class that you dread going to DO NOT TAKE WENZEL! Every class is enjoyable and he makes learning the material fun.  If you go to lecture and never study you will get at least a B.",
        "course": "BIO101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Wenzel is funny, knowledgeable, and a quality professor. I took the class thinking, &quot;eww bugs&quot; but he presents the material in an amusing and very intriguing way. Highly recommended!!",
        "course": "ENTH444"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Like everyone said, amazing professor! VERY FUNNY and makes class interesting. Also, the book is not required (wouldn't even buy it) which is good. I would definitely recommend his class, especially if you aren't that interested in biology because he makes it fun to learn. Also, has a lot of personal experience with things and tells funny stories.",
        "course": "BIO101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Wenzel is the most fun Professor I have ever had.  His lectures are interesting, fun, informative and make me want to do more biology.  His lectures are very important though, so go!",
        "course": "BIO101"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Wenzel is an excelent lecturer!  He makes biology interesting and I think he's really funny.  The labs were kind of dumb, but that's not his fault.  He understands that we are not science majors, so he tries to make biology relevant to our lives and interesting.",
        "course": "BIO101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wenzel is a very intelligent, fun guy. He is extremely interested in helping students who want to help themselves. He adds humor to his class and he is an all around awesome dude!! I hope to take another class of his someday! You won't regret taking his class...that's a promise!! He's the first to make Biology fun for me!! Take his classes!!",
        "course": "BIO101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Makes lecture really intersting",
        "course": "BIO101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "dude was great",
        "course": "BIO101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "No reason to buy the book with this good of lecturer. The tests come from lecture anyway. Lectures are pretty good considering that I don't really care about biology and he keeps me interested/awake. I would defiantly recommend him.",
        "course": "BIO101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "An incredible teacher. Very witty and humourous. There wasn't a single lecture I didn't laugh in. I had to miss labs due to a family member's funeral and he PERSONALLY made sure I was able to make them up without having to do something extreme like showing a death certificate. I'm going to take his Entomology 333 class. Best prof. I had so far.",
        "course": "BIOL101"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Awesome teacher.  Very good at talking to a group of 500 college kids.  Lights fritos on fire on the occasion. =)",
        "course": "BIO101"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Wenzel is hilarious! His lectures are very interesting. Attendance isn't mandatory but midterms and finals are 90% from the lectures. The book is hardly ever used, I wouldn't buy it. I definitely laugh outloud everyday. He makes his class enjoyable to go to and can relate easily to college students! :)",
        "course": "BIO101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing teacher. Lecture was very fun and interesting. He makes things funny and relates to college students. I laughed everyday in lecture.",
        "course": "BIO101"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "Makes Bio very interesting and fun. very witty guy. lecture attendance isn't mandatory but I HIGHLY recommend it. exams rely heavily on lectures, not really on books (I wouldn't get it unless you need a lot of visual help understanding things). Definately take Wenzel if he is teaching Bio.",
        "course": "BIO101"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Quality professor",
        "course": "ENTOH444"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class years ago after having Wenzel's Bio 101.  Love this professor.  Very passionate and knowledgeable, made every lesson phenomenal.  He wrote a letter of rec. for me even though bio was not my major.  Now, as an English grad student, I look back on his classes as my definite favorite.  This is a good man and a great teacher.",
        "course": "ENTM444"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "I liked Wenzel a lot....he's a funny guy and I was interested in Biology, which he taught well.  The labs weren't all that great, but he didn't teach those.  I would suggest taking this course from him because he deals with the large crowd very well.  He's very intelligent...a little biased about bugs but thats beside the point;)  I enjoyed him.",
        "course": "BIO101"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Most interesting class I've ever had! He's beyond great, one of the few professors that actually care about students. He listens to your needs and is very flexible about things. Going to class is actually very enjoyable. Quizzes are easy, midterm and finals are a bit harder, but if you study, it'd be real hard not to do well.",
        "course": "ENTH444"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had Dr. Wenzel for Bio 101 and I liked him so much I decided to take his Entemology class to complete my Bio reqs, even though I'm a psych major and I HATE bugs. And, even though I hate bugs, I like going to his class because he makes it so interesting and fun and easy! And, his tests are very fair.",
        "course": "ENTEMOLOGYH444"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "so much fun, wants you to learn, very good professor.",
        "course": "BIO101"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good GEC class.",
        "course": "BIO101"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is amazing! You learn so much more then most GEC's and his lecture's are not boring! The only thing you must keep in mind in taking this class with him is his midterms and final. The lectures are easy but the tests are hard if you don't study.",
        "course": "BIO101"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "well organized and mostly interesting lectures.  took questions before exams, which was very helpful (although he always seemed stressed/pissed on exam days, which i found curious).  wears what i think were cowboy boots sometimes which is lame but other than that a great prof.",
        "course": "BIO101"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was a breath of fresh air after my chem classes. Dr Wenzel knows his stuff and is more than willing to help out his students. Lectures are entertaining and he brings in new research and his own experience as well as textbook material (so you don't need the book). An easy class, easy lab, hopefully easy A. :)",
        "course": "BIO101"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very enjoyable class. Really makes you forget you're taking an entry level Bio class. Makes lecture interesting with personal stories from around the world. This man should still be doing research!",
        "course": "BIO101"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was really fun and I learned a lot too. His lectures were so interesting and all the test questions came from material covered in lecture.",
        "course": "BIO101"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "DUDE..i am IN LOVE with this man.  he is an awesome teacher and his way of teaching makes me want to go to lecture everyday!  he is absolutly hilarious and he has the best stories that make learning bio soo much better.  His tests have a lot to do with lecture..so go!! it is a very interesting class with him and i really enjoyed it.  best teach eve",
        "course": "BIO101"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cool guy. Funny and class was enoyable.",
        "course": "BIO101"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 2,
        "comment": "GREAT TEACHER!",
        "course": "BIO101"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best!!!!!!!!! Many people have said he's easy, he's not, he's just an excellent teacher, hence it seams easy.",
        "course": "H444"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cool dude, always enjoyed going to his class.",
        "course": "BIO101"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "I thought the class was very easy, professor is very humorous, a good guy, tells a lot of good stories, we got cool guest speakers in class, overall one of the best classes I've taken at OSU so far.",
        "course": "ENTH444"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "awesome teacher and awesome class!",
        "course": "BIO101"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher.  Very funny.  Very laid back.  Pretty easy class too.  He is sensitive to needs of students and he always takes time to explain things (even if it's right before a test).  Takes his class outside on the nice days to catch bugs!!  Highly Recommended.",
        "course": "ENTOMOLOGYH444"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "Actually made going to class fun.",
        "course": "BIO101"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent teacher. Always worked at keeping you interested. Straight forward in what you need to study for exams. Highly recommend",
        "course": "BIO101"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is HOT!!!!",
        "course": "BIOLOGY101"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "He makes learning fun!  He is always trying to keep the students interested by cracking jokes.",
        "course": "BIO101"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's a great teacher and actually makes biology fun. Very entertaining. Don't be fooled, this class is not SUPER easy, midterm avgs were in the 70s so be prepared to work a little!",
        "course": "BIO101"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Prof, definately the best i have had at OSU so far, very funny, easy midterms. his lectures are great, never dull or boring!!!!!",
        "course": "BIO101"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 1,
        "comment": "Hilarious, he'll keep you entertained while learning a not too thrilling topic",
        "course": "BIO101"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 3,
        "comment": "Terrific lecturer, funny, smart, etc. I actually thought that his exams were hard as all get out, he even says that half of the questions he doesn't expect people to know because they weren't discussed. That's total crap, in my opinion, but other than that he rules the school.",
        "course": "BIO101"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 2,
        "comment": "awesome prof, funny guy who will keep your attention, makes learning interesting, very easy midterms",
        "course": "101"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great Professor, he helps make Bio not so terribly boring and he's a goofy guy who keeps your attention for the entire class. I would recommend to all.",
        "course": "BIO101"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wenzel was pretty awesome. Kept it simple.",
        "course": "BIO101"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hilarious",
        "course": "BIOLOGY101"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 3,
        "comment": "Definitely one of the best professors I've had here, would reccomend him to anyone. He literally GIVES answers away before the tests, because he doesnt care what grade you get (&quot;If it were up to me there would only be 2 grades: groovy and bummer&quot;)",
        "course": "BIO101"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 3,
        "comment": "Keeps a persons atention because he is very funny.",
        "course": "BIOLOGY"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 1,
        "comment": "Definitely the best teacher I've ever had at OSU he really made Bio 101 fun, and that's not easy to do. The man was meant to teach. Our lecture hall housed about 400 students, and was filled almost everytime.  I don't like bugs, but I was considering taking an entemology class to have him as a prof.",
        "course": "BIOLOGY101"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 2,
        "comment": "By far the greatest teacher I've ever had.  He always made class incredibly fun and interesting, you regret missing his lectures.  Moreover, his exciting and interesting examples are great stories that are hard to forget.",
        "course": "EEOB410ENT444"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 3,
        "comment": "The best teacher I have ever had.",
        "course": "EEOB400"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fabulous personality, will always make you laugh.  Loves what he does and it shows.",
        "course": "ENTH444"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good, animated, energetic, and interesting. I've taken several of his courses because I enjoy his lecures.",
        "course": "EEOB400"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher, don't take intro to Bio unless you have him.",
        "course": "BIO101"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wenzel was my favorite professor at Ohio State this far, he was hilarious and a good teacher.",
        "course": "BIO101"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 3,
        "comment": "great guy",
        "course": "ENT444"
      },
      {
        "index": 60,
        "rating": 3,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 61,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's the best professor I've had at OSU, in a large class. Always entertaining, I regretted missing any of his classes.",
        "course": "BI0101"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very humorous...made class fun.  Excellent teacher!",
        "course": "BIOLOGY10"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wenzel is super cool, and extremely intelligent. I wish I had him every quarter.",
        "course": "BIO101"
      },
      {
        "index": 64,
        "rating": 4,
        "difficulty": 4,
        "comment": "Funny but fair.  Definately go to lecture or else you won't do well in class.  Lecture notes are on WebCT which is a plus!",
        "course": "BIO101"
      },
      {
        "index": 65,
        "rating": 5,
        "difficulty": 3,
        "comment": "BEST TEACHER EVER!!!! Not only is he hilarious person but he teaches in a way that is fun. He made me interested in science again. Wenzel RULES",
        "course": "BIOEEOB"
      },
      {
        "index": 66,
        "rating": 4,
        "difficulty": 2,
        "comment": "He was really funny and a good teacher. He made the class interesting.",
        "course": "BIO101"
      },
      {
        "index": 67,
        "rating": 5,
        "difficulty": 4,
        "comment": "You have to attend lecture to do well, but he's an excellent teacher. Very cool, not uptight, funny, but serious about what matters; learning.",
        "course": "EEOB400"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Wenzel is the best!  Now i remeber why i decided to major in Biology.  He is funny, helpul and really nice.  Always gets you laughing, but teaches the material very well.  He has the whole teaching is fun thing down to a T",
        "course": "EEOB400"
      },
      {
        "index": 69,
        "rating": 5,
        "difficulty": 1,
        "comment": "A fun teacher.  Very knowledgeable.  Good class.",
        "course": "BIO101"
      },
      {
        "index": 70,
        "rating": 3,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very entertaining/interesting.  Always has a good story, I guarentee you will end of laughing, lecture on sexual selection is the best.  get wenzel if you can, he rocks!  Tests are tough but fair, multiple choice answers often have a joke answer",
        "course": "BIO101"
      },
      {
        "index": 72,
        "rating": 5,
        "difficulty": 2,
        "comment": "Plays music before class and is very entertaining...you will enjoy this class!!!",
        "course": "BIO101"
      },
      {
        "index": 73,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 74,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 75,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lots of goofy stories to tell.  Multiple choice tests always have one joke answer.  He really seems to like what he does.",
        "course": "BIO101"
      },
      {
        "index": 76,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 77,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Teacher, very lively and energetic. He will keep you interested",
        "course": "BIO101"
      },
      {
        "index": 78,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wenzel is great and he is soooo funny.",
        "course": "BIO101"
      },
      {
        "index": 79,
        "rating": 5,
        "difficulty": 3,
        "comment": "very interesting and funny, tests are tough but fair",
        "course": "101"
      },
      {
        "index": 80,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 81,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wenzel rules the school.",
        "course": "BIO101"
      },
      {
        "index": 82,
        "rating": 5,
        "difficulty": 2,
        "comment": "keeps you interested",
        "course": "BIO101"
      },
      {
        "index": 83,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher.. Hate Bio, but he made it interesting. Fun teacher",
        "course": "BIO101"
      },
      {
        "index": 84,
        "rating": 2,
        "difficulty": 3,
        "comment": "Goofy",
        "course": "BIO101"
      },
      {
        "index": 85,
        "rating": 4,
        "difficulty": 4,
        "comment": "is not boring",
        "course": "BIO101"
      },
      {
        "index": 86,
        "rating": 5,
        "difficulty": 3,
        "comment": "Made lectures interesting",
        "course": "BIO101"
      },
      {
        "index": 87,
        "rating": 1,
        "difficulty": 4,
        "comment": "Do all you can to avoid this professor.",
        "course": "BIO101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 2.6,
    "department": "Science",
    "firstName": "Garry",
    "id": "VGVhY2hlci03MjE3Nw==",
    "lastName": "McKenzie",
    "legacyId": 72177,
    "numRatings": 21,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "The WORST professor I have ever had.  I can not believe I paid for this joke of a class.",
        "course": "GEO105"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "this teacher is absolutely ridiculous...none of his lectures have any structure and he makes no sense whatsoever.  The people below me have it right, if you want to do well, don't buy the book, just use Google and Wikipedia.  He expects everyone in the class to have taken a Geology class prior to his and doesn't understand when people don't get it",
        "course": "GEO105"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "The other GEO105 posting are dead-on..Its a complete waste of a class. His lectures contain no substance and then he tests on the lectures..STAY AWAY unless you know a lot about geology or prepared to work EXTREMELY hard to know what he is talking about...should have dropped while I could have.",
        "course": "GEO105"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Garry, I believe has a good heart. But the class is a complete joke. Absolutely no structure for topics. It is impossible to articulate the uselessness his lectures are. Better off simply reading the book. The T.A. stopped coming to lecture stating,&quot;I don't know what's going on in here, so I don't come.&quot;",
        "course": "EARTH105"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Absolutely the worst prof i have ever had. He is unclear and random in lectures. You will learn nothing in class and will have to google everything for tests. Don't go if you want a good grade.",
        "course": "GEO105"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful. Literally the worst professor I have ever had.  Completely and utterly ridiculous.  IF YOU HAVE A CHOICE STAY AWAY FROM THIS MAN.  He expects you to already know everything about geology.  He talks to you as if you were one of his colleagues.  Quizzes feel like midterms and the midterms are way to hard for a GEC class.  AWFUL.",
        "course": "GEO105"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "Garry isn't that great. Hard to follow in lecture, and his exams are ridiculously hard and specific.  For a 200 level GEC he doesn't make it the easy A it should be. He just mails in every lecture, and I'd encourage you to mail in this class as well-I did and somehow wound up w/ a B b/c i think he generously curves the class at the end.",
        "course": "ES203"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "McKenzie is allright, but the class is a joke. Almost seemed like everyone, including him, was just going through the motions.  The class requires almost no effort.",
        "course": "GEO203"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Typical geology professor, but more interesting to listen to than usual.  Focuses alot on actual events (in class and on tests) which make the information at least seem relevant.  Nice guy.",
        "course": "GEOL203"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 2,
        "comment": "I had Dr. McKenzie for a freshman seminar class and really enjoyed it. He really tries to help you learn.",
        "course": "PEAKOIL"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 2,
        "comment": "He's a good guy. His lectures aren't thrilling, but the subject matter is definitely interesting and worthwhile.  Tests aren't too bad, just study previous quizzes and midterms before the final.  I got an A without too much work.",
        "course": "GEOL203"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good teacher. To my surprise, I actually found some of the course really interesting. Could be really boring at times though. The exams were pretty easy, got an A without much effort- only crammed the night before and the morning of for exams.",
        "course": "GEO203"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class can be very boring at times. But McKenzie is very passionate about the subject matter. My only real complaint other than being bored at times is that he is quite disorganized. But I would say all in all he isn't bad.",
        "course": "GEOSCI100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Garry is an extremely nice guy.  He gave us cookies during our final.  The subject matter and the lecs were very interesting.  Yes, he was a little dissorganized, but that didn't really matter since he made it clear what topics were important to focus on for tests and such.  Thumbs up for this cool Canadian!",
        "course": "GEOSCI550"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 1,
        "comment": "Not a real hard class.  His final was directly from previous midterm questions.  Got B+ but not sure how. Thought that I should have done better but would not email me back after I emailed him twice. frustrating",
        "course": "GEO100"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Classes were kind of boring but they were tolerable. Most of the material somewhat interesting. Pretty straight foward with what he wants. Go to most classes, read the chapters, and go to labs and you will do good in the class. Seems like a pretty cool guy.",
        "course": "GEOLSCI100"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 3,
        "comment": "Good teacher, disorganized notes...made the subject material interesting and changed the mind of a conservative on enviornmentalist issues",
        "course": "GLG203"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 3,
        "comment": "i liked him, i became interested as class went on.",
        "course": "GEOLOGY100"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "GEOLSCI2"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 3,
        "comment": "Bring a pillow and hope he doesn't test you on who led his 15 expedition into the artic....",
        "course": "GEOSCI"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "Difficult to follow lectures, unsure if extra info or actual facts for tests.",
        "course": "GEOSCI"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.1,
    "department": "Science",
    "firstName": "Ralph",
    "id": "VGVhY2hlci02NTczOQ==",
    "lastName": "Boerner",
    "legacyId": 65739,
    "numRatings": 44,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Great, hilarious guy. GO TO LECTURES. You must not even miss one. He goes over everything on the test in his lectures. Study them word for word and you will do fine on tests. His class is extremely interesting and he makes it enjoyable. Very helpful and knowledgeable. Recommend him to anyone! No need to even purchase the book. take good notes!",
        "course": "EEOB503"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "awesome prof. go to class, take notes, do review questions and memorize those questions. questions are what make up the test. guaranteed A-. let's you argue unfair grading. doesnt make it difficult. seminars are annoying for scheduling, but easy way to cushion your grade. i had a 96. interesting too. take this class!",
        "course": "EEOB503"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's a professor who knows his stuff. His slides are what are important. Go to class because that's what you'll be tested on.  He uses a lot of graphs, so I'd advise getting the book, b/c some graphs are in their.  Good guy, wants his students to succeed.",
        "course": "EEOB413"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Interesting guy, quality professor. It's important to go to lecture if you want to do well on the tests. The book wasn't very helpful (except citing examples of what we were discussing), but his review questions were. Studying in groups for exams is VERY helpful because of the focus on lecture materials on the test.",
        "course": "EEOB413"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "In the class I had, he gave quizes every week. The quizes were tricky but reasonable (study in advance and you'll do fine/don't procrastinate bc he could give the quiz at the beginning of class). The labs are easy for the most part but the TA may take off some points. He gives extra credit = life saver if you get them all right.",
        "course": "BIO101"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Exams are difficult, show up to every class helps alot because notes are tough to understand if you don't go.  Does preach is liberal views alot when he says he's talking from both point of views.",
        "course": "BIO101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "SUCH a good teacher.  I hate bio, and he really made lectures interesting!  His exams are kind of difficult, but it really isn't that hard to get an A in the class.  Would recommend him to anyone!!!",
        "course": "BIO101"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "not too difficult of a class, but the tests are full of trick questions so be sure to know the material.  DO NOT need the book, nor do you need a paid subscription to the Times (articles online).  at one point preached his political views which i was not happy with, but other than that not a bad guy",
        "course": "BIO101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Test were ridiculous because of the purposefully tricky wording, but the class itself is not difficult. Go to lecture (and lab of course) and you'll get a decent grade. I cannot stress enough - DO NOT BUY THE BOOK. You might as well flush your cash down the toliet.",
        "course": "BIO101"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Easy labs, clear lectures, no required attendance.  The problem is that his test are extremely difficult.  He has tons of questions that are worded for the purpose of tricking people and as a result one of the exam averages was 62%.  He also tends to get a bit preachy at times and only likes to discuss his way of thinking.",
        "course": "BIO101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "His tests are really hard and he complains a lot about stuents not being at lecture but doesn't do anything about it. He is good at explaining things but it is difficult to judge what he might use on a test, so as a result the tests have pretty low averages. He makes up for it by having easy labs (even if they are elementary.",
        "course": "BIO101"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Interesting and funny teacher. Bio 101 may suck but if you have to take it this guy is not bad. His lectures are actually pretty interesting at times. Exams are difficult; make sure you read the NYT articles. Lab grades will help you out a lot. Do NOT buy the book!",
        "course": "BIO101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved going to lectures because he makes them really interesting. He makes jokes and does animal impressions which is always worth seeing.  Definately take him and do not buy the book. Go to the lectures and you won't have to spend much time studying for exams.",
        "course": "BIO101"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "teaches definitions, tests on application...very difficult quizzes, hope for a good TA to keep your points up",
        "course": "BIO101"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "He has a weird sense of humor and tries to keep the lecture interesting. A lot of the tests are conceptually based but if you attend lecture you should be able to handle it. He gives take home essays for each exam which really helps to boost your grade if you need it.",
        "course": "H116"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "If you have to take Bio 101...take it with Ralph Boerner!! He is very easy. I literally never studied for a quiz until I got to his class during lectures...and his quizzes covered the materials only covered in class and the New York Times Articles. You don't need a book for the class because you will NEVER use it.",
        "course": "BIO101"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very fun and entertaining lectures.  Multiple choice exam portion is theoretical and confusing.  Come to lecture.  Majority if not all of the material is from lecture.  Very funny guy.  Take this class if you have to do fulfill your biology requirement.  He'll assure you do well in his course.",
        "course": "BIOH116"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 4,
        "comment": "He seems to care a lot about teaching; class interesting and challenging, learned a lot.  He knows his material, for sure. A bit partial to some students he obviously likes, which is offputting to the rest of us.  High quality teacher.",
        "course": "COMMECO510"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ok some of his jokes aren't nearly as funny as he thinks they are, but his constant sarcasm and goofiness make the lectures way more interesting. Also, this is hands down the easiest class I've had since probably middle school. I only went the once a week there was a quiz, and to study I just printed the notes off and studied in class right before ",
        "course": "BIO101"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "He's a bit of a jerk and thinks he's really funny. Got mad that people didn't show up so he started making the class harder.",
        "course": "BIO101"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Everyone in my class thought that the exams were harder than they should have been for a 101 course.  Lectures sometimes were very boring and he tends to take up all of the class period.",
        "course": "BIO101"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "This man is amazing.  Somehow he makes an 600 person lecture hall feel like an intimate small biology seminar.  He is enthusiastic, relevant, and exciting.  This was the only class I took this quarter where attendance was not compulsory, and yet I attended every class.  Ohio State should be proud of Ralph Boerner.",
        "course": "BIO101"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "Yes, his jokes are corny and he's a little off the wall, but he makes biology extremely interesting. He finds a way to tie in introductory biology material into real world events that affect the way we live. Also, the class is extremely easy and he offers plenty of bonus. The whole not-taking-a-midterm-or-exam thing is pretty nice too.",
        "course": "BIO101"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "He is very annoying and thinks he is funny, but really isnt at all.  Everyone in my class thought that the quizzes were harder than they should have been for bio 101.  He was interesting at some points, but was more annoying and should retire.",
        "course": "BIO101"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved this class! You really have to come to lectures and study to do well, but it's interesting and Dr. Boerner is a great teacher. The only annoying thing is having to attend seminars and turn in summaries, but it's still not too bad. Highly recommend this class and this prof!",
        "course": "EEOB413"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "VERY easy class, a joke in fact. But attend lectures and skim the readings and there is NO reason not to get an A. Labs are long, but if you explain your logic, they never took off.",
        "course": "BIO101"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class.  He's a lil out there, but I'd take another class with him in a second.",
        "course": "BIO101"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "It's a fairly simple class.  He's a good teacher.  You have to go to all of the lectures if you want to get an A.  Even tho he has the notes online, it doesn't help to skip lectures and read them.  Take my advice, I did this and got a C+ in the class.",
        "course": "BIO101"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "A fun class.  If you read the book and go to class, the quizzes aren't bad at all.",
        "course": "BIO101"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class and he's interesting to listen to. He really knows what he's talking about, but he explains things well. Take his class. He's much better than the other bio teachers.",
        "course": "BIO101"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "great professor; it's nice to have no midterms, but quizes are difficult.  He makes lecture interesting because he jokes about almost everything without making the class a joke.  Class is very easy and very interesting.  Great Prof!  TAKE HIS CLASS!",
        "course": "BIO101"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class ever, boring but somewhat entertaining for an A.",
        "course": "BIO101"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "fun to listen to, if you read the book and go to lecture the quizes are very fair",
        "course": "BIO101"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 2,
        "comment": "He makes lecutres fun. I  loved the idea of no major studying for a midterm or final!! But still makes you use your brain on quizes, so no getting off the hook really ;-)",
        "course": "BIO101"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "made the class entertaining and enjoyable",
        "course": "BIO101"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 2,
        "comment": "quizes are all lecture based.  Very fair with material on the quizes.",
        "course": "BIO101"
      },
      {
        "index": 37,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 3,
        "comment": "Only quiz's. no exams but it isnt a walk in the park and no curve at the end!",
        "course": "BIO101"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 3,
        "comment": "Nice guy...seemed like no exams would be nice but the quizes aren't that easy",
        "course": "BIO101"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 2,
        "comment": "Laid back lecturer.  Very knowledgable.  Interesting to listen to.  Learned much",
        "course": "EEOB4130"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "BIO101"
      },
      {
        "index": 42,
        "rating": 3,
        "difficulty": 5,
        "comment": "His quizzes are super hard, meaning his relaxed lectures aren't what they seem..",
        "course": "BIO101"
      },
      {
        "index": 43,
        "rating": 1,
        "difficulty": 3,
        "comment": "Yes he's easy-going but you never know what's important & what's just rambling!",
        "course": "BIO101"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 3,
        "comment": "Really easy going. It's not bad going to the big lectures.",
        "course": "BIO101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.9,
    "department": "Science",
    "firstName": "Rodney",
    "id": "VGVhY2hlci01MTE3OA==",
    "lastName": "Tettenhorst",
    "legacyId": 51178,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was one of Dr Tettenhorst's very first graduate students, and he was a wonderful advisor and mentor. I received my MS degree from the OSU Mineralogy department in 1968. His teachings and his manner of teaching benefitted me throughout my lifetime in engineering and teaching.",
        "course": "MINERALOGY850"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "I had him over 20 years ago and went to see if he was on here..and he is...he was lousy in the 80's and the students either got A's or D's, because he was lazy and used the same tests over and over. A fewfemale students go copies of old tests from other guys in his prior classes of his and - automatically got A's somehow. Nobody understood him tho",
        "course": "GEO221"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 5,
        "comment": "Someone else already mentioned that he acted like he was the guardian of the gates of geology. That was my same experience. He had his favorites although I'm not sure what made them his favorites. I personally found him to be arrogant, judgmental and cliquish. I got the impression that he thought I was an idiot.",
        "course": "GEOL221"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "An old fashioned professor; too few like him are left.  If you are lazy, you are in really deep trouble.  If you love geology, this class is utterly foundational and it would hard to find a better professor of mineralogy.  If you hate geology, he'll help you discover that fast.",
        "course": "GEO221"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "He felt it was his responsibility to decide who would be geologists, and if he didn't like you...  you were in deep trouble.  His exams bordered on comical.  Mineralogy through intimidation and thinly veiled threats.",
        "course": "221"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "His methods and subject matter is outdated and unclear, he is belligerent.",
        "course": "GEO221"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. T is a cool dude.  Strict and serious, but fair and friendly.",
        "course": "GS121"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terible class, poorly explained, read from the text book",
        "course": "GEOL121"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Tettenhorst is clearly nuts about geology-cares about teaching it.",
        "course": "GEOLSCI121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.2,
    "department": "Science",
    "firstName": "Dana",
    "id": "VGVhY2hlci0xNTg2Nzk=",
    "lastName": "Wrensch",
    "legacyId": 158679,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Interesting lectures, but frequently strayed from topic.  Did not really seemto care ifwe learned course material or not.  More entertaining than instructive.",
        "course": "BIO"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is simply one of the best professors here at Ohio State. She is fun to talk to and her class will be one of the most interesting in your time at Ohio State. Take this class if you need a Bio GEC requirement. She is more than willing to help you at anytime.",
        "course": "BIO1102"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Simply the most fun professor ever. She's extremely easy on the grades and due dates, doesn't care much about when you turn in the work, open-book exams. I learned a lot from her, because she gives latest info on everything. Best prof ever.",
        "course": "BIO597"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "So Wonderful. No other words to describe. Her T.A. Aiqing is equally as awesome.",
        "course": "BIO597"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "This prof is the best! After years at OSU she's the only one who ever bothered to learn my name. You have to take very good notes, otherwise you'll get to a question on the exam and not have a clue how to answer it. Learn how to take short hand notes that you can understand, use keywords, and write down examples she gives you during discussion.  Sh",
        "course": "BIO597"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class about human diversity.  Really the class teaches you how to think critically about current events.  Can use your notes for the exam, but you have to take great notes and not miss class.  HIGHly recommend!",
        "course": "BIO597"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very nice.  Class was interesting, and easy  She tends to wander off topic a lot, but she's very well informed and fun.",
        "course": "ENT101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Interesting class, great teacher! She is very helpful and makes it pretty fun and easy. Take entomolgy with her.",
        "course": "ENTOM101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "i waited for almost 3 years to take dana's class, and it was totally worth the wait. she doesn't always stay on task but she is SO interesting and helpful it doesn't matter. i'm in ento 102 now and was plenty prepared for it. take ANYTHING she teaches she is really helpful and as long as you put in some effort she'll give you an A.",
        "course": "ENTO101"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 2,
        "comment": "Hard to understand (talks very fast), rambles all over the place, doesn't teach the course description but rather rambles about all sorts of biology/current events. Pretty fun and relaxed atmosphere, however I don't really feel like I learned too much, as a result.",
        "course": "ENT500"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dana is an amazing instructor and will make you reconsider almost everything you thought you knew about biology!  She really gets you to think about biology and bugs rather than just assimilate information.  Her teaching style is such that you don't need t",
        "course": "ENTOMOLOGY500"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "helpful, awesome teacher. TAKE HER CLASS",
        "course": "ENTO101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "A friend of mine had Dana for 597, and I was so intrigued by his stories, I emailed Dana, and we have kept up a friendship, even though I've never had her as a teacher.  She is AWESOME and I have learned so much from her, just about life in general.  If you have the chance, take ANYTHING with her.",
        "course": "LIFE"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really enjoyed her class.  She knows so much and she is the best teacher I have had here at OSU..",
        "course": "ENTO101"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "She lets you turn in work as late as you want.  She is always willing to help.  Note taking is hard but if you do everything and be nice to her you'll probably get an A.",
        "course": "ENT101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is an awesome teacher! I highly reccomend this class and teacher to anyone who loves science, or loves the study of bugs or who needs a science credit but finds science to be hard. Dana Wrensch makes science very fun and interesting. I would take any class with her in a heartbeat!!!",
        "course": "ENT101"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dana is my favorite teacher at OSU, her class is easy but interesting, and there is a big curve even though most people don't need it.",
        "course": "ENTOMOLOGY101"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 1,
        "comment": "Great personality hilarious lady.  She is very smart but EASILY sidetracted in class.  You will get a lot of info but note taking can be difficult.  She will help you with tests in class.  She has a lot of info to share, cool professor. highly reccomend.",
        "course": "597"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is by far the best teacher at OSU, her tests are essay style so if your not an idiot you can BS through.  I took both classes she teaches and got a's in both.  Great personality and the fact she gets so off subject makes her hilarious.",
        "course": "ENT101"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 4,
        "comment": "Do not take this class. She rambles in lectures about things irrelevant to class. Her tests have nothing to do with anything that was covered. Notes are impossible to take in her class.",
        "course": "BIO597"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is my favorite professor at Ohio State.  By far, the coolest lady you'll meet.  Very personable--almost impossible to fail her class.  Do yourself a favor and take her class.  I PROMISE you'll love her.",
        "course": "BIO597"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good teacher.  Helps out a LOT. Like, she will help you with projects in EVERY aspect of it if you just ask her.  Rambles a little bit.  Tests are in the middle of an easy/hard continium.  Little hw.  Big projects at the end of quarter.  must go to lectur",
        "course": "ENTOM101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.5,
    "department": "Science",
    "firstName": "Andrea",
    "id": "VGVhY2hlci0zMTY2MDg=",
    "lastName": "Doseff",
    "legacyId": 316608,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Doseff scared me a lot because of her bluntness with students in class, but really is a lovely person who cares a lot. Class isn't mandatory but there are activities often for credit. Her lectures are fantastic- I never found myself dazing off- she gives great personal examples & clearly loves her work. Very high expectations. Tough exams.",
        "course": "BIO114"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "She can be intense but I thought she was super kind and sweet. Loved her. Class participation during lectures, I thought it was engaging + helpful. Lecture is from slides but she does a lot of talking that's not on the slides. I had already taken AP Bio before so I just studied the slides and easy A. She really cares about students' understanding.",
        "course": "BIO1113H"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Doseff is very intelligent and engaged in her subject matter. I found her lectures somewhat difficult due to the fact that English isn't her first language, but she's more than willing to give clarification in office hours. Her lectures work very well along with the textbook.",
        "course": "BIO1113"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "Easy tests.  Only counted 2 of 3 midterms but bad teacher.  I had to learn everything from the book.",
        "course": "MGEN500"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Doseff is a very engaging and knowledgeable lecturer. She really knows what she's talking about. Go to lecture and take additional notes. She sometimes walks through problems you need to know. Do the extra exercises she posts.",
        "course": "MG500"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Her exams are pretty easy as long as you have done the problems that she assigns. In fact, on some of the midterms they were the exact same. She is clear in the lectures and emphasizes key concepts she wants you to grasp. Bring the posted lectures notes to class to take additional notes.",
        "course": "MOLGE500"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "knowledgeable but impatient with students. seems to have no compassion for students actually trying to work hard and succeed. lectures are incredibly boring and long-winded",
        "course": "MOLGE500"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "She wasn't bad. As long as you did the reading and looked over her slides and the practice exams you are gonna do well.  I never actually spoke to her though. She plans on teaching more than she can actually fit into the course it seems.",
        "course": "MOLGE500"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "I don't know where to start.  Once again, another upper level professor who just doesn't teach anything of relevance to the exams.  If she is paired in the MOL GEN sequence, wait a quarter for the other prof.",
        "course": "MOLGE500"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "Went through things very quickly in class, very picky grading on the tests, it is very necessary to go to a TA to figure out the practice problems and do well on the tests",
        "course": "MOLGE500"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "She really sucks, i got a 3.8 gpa in my third year as a science major, and she isn't the worst teacher, but she is terrible at explaining anything.  If it makes it any better tho, her exams arent THAT hard if you just study sample problems.",
        "course": "MOLGE500"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "She's atrocious, for God's sake. She ruins a class that should be really interesting. Buy the book because you won't learn anything from her.",
        "course": "MG500"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 3,
        "comment": "she is not very good",
        "course": "SCS"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "She's not so bad. Boring, but not so bad.",
        "course": "MOLGEN500"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.9,
    "department": "Science",
    "firstName": "Ralph",
    "id": "VGVhY2hlci0xMzM3MTg=",
    "lastName": "VonFrese",
    "legacyId": 133718,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "HORRIBLE professor. He doesn't teach anything in lectures, but somehow happens to talk the entire time. His exams do not at all reflect what his slides say. A lot of the statistics used on the exams are outdated, so if you google an answer or try to learn on your own, your new stats are considered wrong on the test. He ruined my 4.0 GPA as a senior",
        "course": "EARTHSCI2203"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "You have to do research with Ralph in order to understand how smart this man is.  His knowledge and understanding of the Universe is admirable.  I have the deepest respect for him.  He is a very cool guy.  You have to be good in math and physics to understand his graduate level course material.  :)",
        "course": "GS781"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "He is an expert in his field, and clearly has been for some time.  However, he is not a very effective lecturer; minutes felt like hours in this boring class.  And worst of all, the boring, repeitive tropes of his in-class lectures (and even reviews) had little to do with what was on the test.",
        "course": "ESCI203"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "He's the typification of someone who's an expert in his field, but not really a teacher. Your performance is determined by how much work you're willing to put into understanding the material on your own. If you're like me, taking your last GEC with a litany of other commitments, his class probably isn't your best choice.",
        "course": "ESCI203"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "He is a very wise man who may not be the most explicit teacher, but you can definitely learn a lot from him. He discovered the Wilkes Land crater which caused the Permian Triassic Extinction, and he talks about it in class, but he is so humble that he doesn't even mention who discovered it or how it was discovered!",
        "course": "EARTH100"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Amazingly Smart Man! He has a very monotone voice and can be tough to follow sometimes but he is really fair. Our first test this quarter was out of 50, he then dropped 2 questions because nobody got them right and then curved it so an A was 33/48. Labs are unstructured but easy. If you go to class there is no reason not to get atleast a B+",
        "course": "EARTH100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "this guy is horrible. pointless to study for any tests since no material youre given is contained within the exams",
        "course": "GEO100"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Stupid guy, easy class.",
        "course": "GEOLOGY100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "good stuff",
        "course": "GEO100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "GEO100"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "The questions on tests don't change each year, only the answers Very unclear",
        "course": "GEOL"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.7,
    "department": "Science",
    "firstName": "George",
    "id": "VGVhY2hlci0zMDY1MjM=",
    "lastName": "Marzluf",
    "legacyId": 306523,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "How to succeed in his class: memorize everything he writes on the board and study the old exams. Keep up with the material, especially metabolism, because memorizing everything detail can be hard. Also be prepared to hear a lot about Sir Hans Krebs.",
        "course": "BCHEM511"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Go to class everyday, copy down and memorize EVERYTHING from the class notes, study the old exams he provides on carmen and you'll be fine. Sometimes he does kinda act like it's a chore for him to answer questions. But, overall, good.",
        "course": "BIOCH511"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class taught me how to study. Before each midterm, I made flashcards of EVERYTHING he wrote on the board and memorized them over the week leading up to the test. Gives you old midterms which are often identical. A ton of memorization, but I ended up with an A. Class averages were around 80 (84 for the final) so no real curve. Recommended.",
        "course": "BIOCH511"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "An easy class that is 100% memorization. I Spent about 5 hours over the course of the entire quarter studying and still got an A. Marzluf is a nice guy and knows what he's talking about, and the class is easy for anybody who copies down everything he writes and looks at old exams.",
        "course": "BIOCH511"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy A. Just memorize and study an entire week for the exam and you can do it. I didn't learn anything in this class but still did well.",
        "course": "BCHEM511"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Go to every lecture, take detailed notes, and basically memorize past tests that he gives you. The class is not particularly engaging or challenging, as it is simply mindless cramming. I took 23 credit hours this quarter and with about 30 minutes to 90 minutes a day regularly and more for midterm weeks, I had no problem acing the class.",
        "course": "BIOCH511"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 5,
        "comment": "Biochem is going to be difficult regardless. I am not good at memorization, so this class was very hard for me because it's memorizing soooo many structures/enzymes/cycles for the exams. The only godsend is that the midterms/final isn't cumulative. Also, study the old exams religiously, the questions are often identical.",
        "course": "BIOCH511"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Prof knew material very well and applied everyday medical conditions to material. Kind of boring class, and have to attend b/c everything is put up on board. Study past exams put up online extensively and should do okay.",
        "course": "BIOCH511"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took Biochem over the summer with Behrman before dropping because he was a monster. I've got to say with my experience, Marzluf is probably as good as it gets for Biochem. His exams are difficult, but only because you have to memorize every part of his notes. However, he is extremely fair and will not put anything on that he hasn't covered",
        "course": "BIOCH511"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's pretty clear for the most part, you have to go to class since he doesn't use the textbook. Not really tricky on exams,just know all structures and cycles backwards (literally) and forwards, I aced all 3 so not that hard, I'd also recommend his classroom style office hours. I found they really helped. Overall, i'd say take him for biochem",
        "course": "BIOCH511"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Old prof who makes it a passable class but hard to do well. Pay attention take meticulous notes and study every little thing. Other than that good luck because his exams are rough. I had a 90% on quizzes and 68% on tests they are poorly written",
        "course": "BIOCM511"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Marzluf's chalkboard notes are very straightforward and require little to no textbook supplementation.  Quizes and exams are directly out of notes.  This class requires no prior understanding of chemistry - only good memorization skills.  Just stay on top of the material - otherwise it can accumulate quickly.  Dr. Marzluf is a great, funny guy.",
        "course": "BCHEM511"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "He does all of his work on the chalkboard, in small, illegible writing. Gets an attitude when asked to write bigger. Doesn't explain how the ideas connect so it all seems random. Doesn't answer the question asked&sometimes treats you like an idiot for asking. I get good grades in the class but it doesn't take away from him being a terrible teacher.",
        "course": "BCHEM511"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "He is undoubtedly the best of the Biochem teachers (Took and dropped one and had a close friend in the other).  Marzulf will cover the things that are important.  He also makes his previous midterms available at the BioSci Library (Take advantage of this!!!)  Go to class, don't sleep/skip, and you will do fine.  High emphasis on class material.",
        "course": "BCHEM511"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "I bet the last poster didn't come to class very often or did not take advantage of his office hrs.  Well, that is his/her fault for not keeping up and not taking the effort to understand biochem.  If the class avg on a biochem exam is over a 80% then how is it hard&#63; Dr. Marzluf is simply amazing.  He will make sure that you understand the material.",
        "course": "BC511"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not a big fan of this guy. His notes are confusing, he doesn't label anything, and usually he makes no sense.  He does not do thing sequentially and his train of thought is a bit hard to follow, even if you do read before class. He's a really nice guy, but as far as his teaching goes, I'm not impressed.",
        "course": "BCHEM511"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "great professor. i thought i would hate this class but i now think it is pretty interesting. class is pretty hard though and requires quite a bit of studying, but the tests are fair. he is also funny whether intentionally or not",
        "course": "BIOCH511"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is the best teacher ever! Although there is a lot of material to cover, he never rushes through anything and his tests are VERY clear. This is probably my favorite class! He is a very nice man and he genuinely wants his students to get good grades. Take him for this class!!",
        "course": "BIOCHEM511"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "this class is seriously rough, but i don't think it is the prof's fault. a LOT of information gets covered, but he thinks it should be a 2 or 3 quarter class, so at least he knows the problems with the class. his notes are generally clear, and there aren't too many surprises on the tests.",
        "course": "BIOCHEM511"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "He's a terrific prof. The BEST one to have for Biochem because he never rushes over any material. The book is not necessary for a good grade, as long as you go to class every day. If you go to office hours with questions, he's helpful and understanding. I went into the class expecting difficult, boring material and though it was hard, I enjoyed it.",
        "course": "BIOCHEM511"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing teacher",
        "course": "BIOCHEM511"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "its a hard class, but if u understand the lectures and take good notes you will do very well in the exams ! he is very nice and helpful",
        "course": "BIOCHEM511"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very knowledgable, but the lectures are sometimes boring. He teaches away from the book sometimes and the tests are difficult because they are all short answer questions.",
        "course": "BIOH115"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "He is a really nice guy, and his lectures are pretty clear.  But it's true that he teaches away from the book. He doesn't spend time on the basics.  He is very details oriented.  The tests are tough, all short answer.  You really have to know your stuff.  Listen and take excellent notes.",
        "course": "BIOH115"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 3,
        "comment": "His graduate classes make it easy for unthinking  crammers. In that sense they defeat the purpose of attending graduate school. However, the course material is carefully selected and relevant.",
        "course": "BIOCHEM7SOMET"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Is boring, talks very quietly and slowly. Lectures would be interesting if I could stay awake. Tests are hard due to the fact that they are completely lecture-based, which is a problem if you can't stay awake. Good guy, very knowlegable though.",
        "course": "H115"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 5,
        "comment": "His tests are very hard and focus details. He doesn't use the book much or list any suggested readings that perhaps my go along with the lecture,you spend $$ on a book and is nothing like the lecture. He also has a problem with the microphone.",
        "course": "BIOCHM511"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "Had 17 years ago in grad school.  Real good prof.  Challenging, but fair - same for exams.  Up to date on current research.  You could tell he puts a lot into it.  A star for the Buckeyes for sure.  Nice guy too.",
        "course": "GEN611"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 4,
        "comment": "His exams are hard, very details oriented, he focuses on application rather than principle but if you acutally listen to him you should be okay.",
        "course": "BIOH115"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 4,
        "comment": "His exams are difficult; all short answer and focus on details, but his lectures are pretty understandable.",
        "course": "BIOH115"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3.9,
    "department": "Science",
    "firstName": "Russ",
    "id": "VGVhY2hlci04NTAxODQ=",
    "lastName": "Hille",
    "legacyId": 850184,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Avoid him and anything he does. Don't trust him. Dont rely on him. Don't take his courses, and DONT ask him to be on your committee. Now you know.",
        "course": "ENZYM762"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "One of the best and brightests professors I have ever met.  Its like poetry how he explains enzyme kinetics.  His overheads are straightforward and you can tell he puts so much time and consideration into them.",
        "course": "BIO742"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 5,
        "comment": "Russ is one of the most influencial professors of my graduate experience.  He is a true scholar, beyond the years...",
        "course": "762"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "762"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "762"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.3,
    "department": "Science",
    "firstName": "David",
    "id": "VGVhY2hlci0xMjg1NjU=",
    "lastName": "Ennis",
    "legacyId": 128565,
    "numRatings": 72,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Doc Ennis is the man. Really interesting class and he does a tremendous job of explaining the material in a simple manner. I don't think there is any question he cannot answer. Getting an A will require going to (almost) every lecture, and taking notes on the slides as he goes through them. Overall an awesome class.",
        "course": "ASTRON1144"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "This guy is the king of all that is holy in this world. Really funny teacher and very helpful.",
        "course": "ASTRON1162"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr Ennis is a really nice person. You can feel his passion in astronomy and genuine interest in teaching the class. Caltech and NASA guy, so he knows a lot of stuff. The tests are all MCQ. Oh ya, he tells a lot of jokes and stories :)",
        "course": "ASTRO1161"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "really,really interesting class and i would even go to his \"evening\"class before holidays but he usually cancels his class because of the holidays......He is adorable with his weird jokes.",
        "course": "ASTRO1161"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Loved this class. This prof is so nice and genuine. Really glad i took his class and plan to take 1162",
        "course": "ASTRO1161"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Ennis is a very smart, friendly, and funny teacher. I enjoyed the class and thought he did a good job explaining things. Just remember to take notes quickly, because the guy talks fast.",
        "course": "ASTRO141"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Ennis genuinely enjoys teaching and he likes students. He does not require attendance but the way to learn and get an A in the class is to attend every lecture, make notes when he says something is important, and study the powerpoints. The textbook is good. He's interesting, knowledgable, helpful and entertaining. And he likes cats!",
        "course": "ASTRO141"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "if you're interested in astronomy at all take it, it's pretty straight-forward. not quite as exciting as i expected but still good class, and he's a really good guy.",
        "course": "ASTRO141"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Ennis is now my Favorite instructor.  He has has enough real life experience to make the subject interesting and enjoyable.  I was apprehensive about taking Astronomy as a GEC requirement.  But after sitting in his 161, I knew I would take his 162.  Simply the best teacher I've had so far (and I'm a junior)!",
        "course": "ASTRO161"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 4,
        "comment": "Interesting professor-likes to make nerdy (but funny!) jokes. Sometimes it is a little difficult to sit through class if it's two hours long, but the material is very interesting. Professor is very helpful, but you have to study hard. The only assignments: 4 quizzes and a Final. He posts powerpoints, so you don't have to go to class.",
        "course": "ASTRO161"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "I definitely recommend him if you have to take AST 162. I tried taking it with another professor and had to drop it. He makes the class pretty interesting, and he's good at explaining difficult subjects. He clearly enjoys teaching. As long as you go to class and spend time studying the notes you shouldn't need the textbook.",
        "course": "AST162"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "A really nice professor who extremely enjoys what he is talking about.  His jokes and stories keep the subject entertaining throughout the classes.  Definitely would reccommend this class.",
        "course": "ASTRO161"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Definitely harder than I expected.  If you know the slides you will do well.  Average was about a 75.  Final was a lot easier than the quizzes.  Got an A but definitely had to work for it",
        "course": "ASTRO141"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good teacher, really seems to enjoy teaching the subject and has a lot of past research experience to back up his knowledge.  Tests can be pretty hard at times however, you have to really know the slides that are given out to you.",
        "course": "ASTRO162"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Currently taking him for 162, he is definitely one of the trickiest professors especially for his quizzes which are hard with questions such as which of the following is not a property of a neutron star, etc. He says they are straight-forward but trust me they are not! I would not recommend him!",
        "course": "ASTR162"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "def a great professor, interested and lvoes the material he teaches, will do anything to help students understands, takes questions and gives in depth answers freely, great class and pictures! def get him!",
        "course": "ASTR161"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "This guy has the trickiest tests, he says there stright forward... there not. He likes to hear himself talk too, he is a nice guy and interested in helping, but he is out to trick his students...beware.",
        "course": "AST141"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 1,
        "comment": "He's really easy-going and nice, although sometimes a little confusing. I only studied for like 3 hours before each quiz and exam and still got an A. Funny in a goofy way.",
        "course": "ASTRO162"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy, interesting, and fun class.  If you have to take a science GEC, take 161 and 162.  He is an outstanding teacher.  He's hilarious and a real sweet guy.",
        "course": "ASTRO162"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "Possibly the least tricky exams ever.",
        "course": "ASTRO161"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "PROs: Don't need to buy the book. 80% of test material on power points which are online. Exams are multiple choice. No mandatory attendance. CONs: Very boring, but it was a night class after a long day. It was very hard to want to go to class if you felt you didn't need to. Felt like torture having to sit through it. I never stayed to the end.",
        "course": "AST161"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 4,
        "comment": "I would have to agree with the rest of the recent ratings.  His class bored me out of my mind.  He was interested in what he did, but he was not very straight forward on what was going to be on the exams.  It is too much material to look over without a study guide of what you need to know.  I would not recommend him.",
        "course": "ASTRO161"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "fact one: his lectures are okay. fact two: his exams are insanely tricky. they are NOT easy like what others said. plus, his exams cover too much material. it's like almost impossible to study that much material for the exams. his undergraduate assitant grades assignmets hard too. i won't buy others' comments on this website again.",
        "course": "ASTR161"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 5,
        "comment": "ennis is a great guy and his class sure is interesting, but his tests suck. they are so tricky. i don't know why all these people say his tests are &quot;easy&quot;. i'm not goning to trust comments on rmf any more.",
        "course": "ASTR161"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 1,
        "comment": "If you have to take a science GEC - TAKE 161 with Ennis. Easy on his students if you go to class. Book is little relevance if you pay close attention. Mr. Ennis is a great prof!",
        "course": "ASTRO161"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 1,
        "comment": "Mmmkay. Mr. Ennis is a great prof. His class was fun and we hardly ever used the textbook. Don't bother buying it, mmmkay. There was almost no math and his lectures were very funny and interesting, mmmkay. The only drawback is that he says &quot;mmmkay&quot; a lot, mmmkay.",
        "course": "ASTRO161"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "excellent professor who truly loves what he does.  Exams are easy and straight forward.  No reading and very little homework.  Class can be interesting but is mostly boring.  You probably do not need to go to class (especially for 161) but I always did anyway for the entire 2 hours 18 minutes, which is probably why I thought it was boring.",
        "course": "ASTRO162"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "I can count on 1 hand how many times I went to class & I still got an A-. Lectures are online, READ THEM. Remember little things like how hot it has to be for nuclear fusion to begin. Homework replaces lowest midterm grade, so do perfect on it! Ennis is a very funny guy and the class is simple as long as u study. If only all classes were like this",
        "course": "ASTR162"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 1,
        "comment": "Absolutely awesome professor.  He was by far the funniest professor I've had.  He loves to poke fun at himself which is hilarious.  As for the course, exams are all off of lecture and he always tells students that he never tries to trick you, and he holds true to it.  Overall, highly recommended!",
        "course": "ASTRO162"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "ASTRN162"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "David Ennis is great. Not only does he make Astronomy accessable to all of us who are just taking it for the GEC, he also keeps the two+ hour lecture lively with bad jokes and colorful powerpoints. I highly recommend him. He's a sweetheart.",
        "course": "ASTRASTR"
      },
      {
        "index": 32,
        "rating": 4,
        "difficulty": 2,
        "comment": "One of the easiest, if not the easiest, class i've had in college. Funny Guy. Really enjoyed the class.",
        "course": "ASTRO161"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's GREAT GREAT GREAT GREAT!!!  Best professor I've ever had.  He really know the material and and is very passionate.  Also very helpful.  Tests are easy if you study the slides and attend class!",
        "course": "ASTRO161"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 1,
        "comment": "This professor is awesome. If your taking Astro, Ennis is the guy. Go to lecture and you'll do fine. His jokes are quite hilarious, not going to lie.",
        "course": "ASTRO161"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great professor.  Class is very interesting and the quizzes easy if you pay attention in lecture.",
        "course": "ASTRO161"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "I LOVE THIS PROFESSOR! He is a great teacher, he gets so excited about astronomy. His jokes are bad, but he's so funny you still laugh. His class is not that hard if you just attend lecture.",
        "course": "ASTRO161"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very passionate about astronomy and a good instructor. The quizzes and homeworks are very easy and they come directly from his lectures not the book. The final is also mostly from the same quizzes. Recommend this course to fulfill your GEC.",
        "course": "ASTRO161"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 4,
        "comment": "Was an interesting professor. GO TO CLASS, all the tests are off of the lecture material and slides, you don't need to buy the book at all. Homework was simple and easy especially if you use Wikipedia to look things up.",
        "course": "ASTRO161"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ennis is awesome.  I didn't use the text at all.  If you go to class, pay attention, and take notes you'll be fine.  He makes the funniest comments all the time.  I loved his class, and I've never even been interested in Astronomy.  He loves it, and wants you to like it too.  Seriously, his weird little comments made it worth going.",
        "course": "ASTRO161"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was worried this would be harder than 161, but it was actually a lot easier and a lot more interesting.  Class is not necessary, but it's very interesting! Great guy, very easy, I wish I still had him for class!",
        "course": "ASTR162"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Dr. Ennis for both 161 and 162. I was not interested in astronomy at all but he made it interesting. He has to be my favorite professor at OSU by far. His tests are kind of hard but if you take good notes you should get a good grade. Almost all of his test questions come from class.",
        "course": "ASTRO161"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is pretty easy.  I didn't try this out, but Professor Ennis certainly offers help with anything you may need.  Attendance is not mandatory, but material becomes a lot more clear the more you attend class.  His jokes can be lame at times, but they'll still make you laugh and keep your interest for 48 minutes.  I didn't even buy the text.",
        "course": "ASTRO162"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 1,
        "comment": "the easiest GEC i've had. Dr ennis is one of the funniest professors i've ever had, and probably the absolute most enthusiastic astronomer there is. i learned so much in this class and put no effort into it other than going to class a little more than half the time. book is not necessary at all",
        "course": "ASTRO162"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best professor I've ever had. He manages to make huge concepts understandable. He is awesome.",
        "course": "ASTRO162"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is an amazing teacher that makes you interested in the material. If you make side notes on his slides then you dont have to study a lot for the test. Go to class and you'll get an A. He is a splendid teacher",
        "course": "ASTRO161"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "WONDERFUL professor!  He made us laugh a lot with his corny jokes.  He loves teaching and does great at it.  I would highly recommend his class,  I heard other ASTR 161 professors were dificult.  It is not hard to do well in this class and you do not need to do any reading.",
        "course": "ASTR161"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 1,
        "comment": "this is the prof. to have if you need astronomy GEC. he is so sweet. he loves what he is teaching. it is sooo boring (personally) but it is very direct and easy. homework is directly from the notes. quiz questions are very straightforward. powerpoint notes online.",
        "course": "ASTRO162"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ennis is a good guy uses all powerpoint the class is easy, 60% of the class is based on 4 quizzies the were all mutiple choice and preety easy, you get to drop the lowest quiz grade and replace it with HW of which there were only 4 and took about 5 mintues each ... the other 40% is the final of which the questions came directly from the quizzes",
        "course": "ASTR161"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 3,
        "comment": "Knows what he's talking about, loves teaching and explains everything clearly, don't need book if you attend class. If you have any questions just ask and he'll spend a whole class trying to answer, if need be.  I took this sequence because I enjoyed his person, teaching style, and he just made the material that interesting.",
        "course": "ASTRN162"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 3,
        "comment": "Knows what he's talking about, loves teaching and explains everything clearly, don't need book if you attend class.  If you have any questions just ask and he'll spend a whole class trying to answer, if need be.  He's really personable, I literally spent hours after class talking with him about astronomy and whatever other topic that came up.",
        "course": "ASTRN161"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is pretty easy. He doesn't use the book-all you have to do is study the slides for tests. Any questions just ask him he's a nice guy and knows the subject in and out. He says &quot;mmmkay&quot; a LOT, but it becomes funny after the first couple of classes.",
        "course": "ASTR161"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "AST161"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class! Very interesting teacher, great way to learn about astronomy, no math, no formulas just facts and interesting stories~~!!!Yay Ennis! easy too...",
        "course": "AST161"
      },
      {
        "index": 54,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was a breeze. I thought 161 was a lot harder and that professor sucked. Ennis is fine. I maybe went to 2 classes where we didnt have either homework due or a quiz. Just study the slides and you will do fine. He was actually sick for the 1st 2 classes, which made things interesting but it was easy.",
        "course": "ASTR162"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good class, easy grade. Some suprises on the exams, but if you go to class and pay attention, it isn't a problem at all. &quot;Mkay&quot; kind of distracting, but after you spend the first lecture counting how many times he says it, you're already used to it. If you take this class, take it with Dr. Ennis.",
        "course": "ASTRON161"
      },
      {
        "index": 56,
        "rating": 2,
        "difficulty": 4,
        "comment": "I was disappointed in this class. He does not follow the book and does not give study guides. You have no idea what will be on the Tests. Talking to people in the morning AST class their teacher was a lot more organized. I was very disappointed.",
        "course": "AST161"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy A!! I would tell anyone to take the class.  The quizzes are so easy! I took it as a night class from 5:30-7:40 and I always wanted to fall asleep, but it is for sure an A! :-)",
        "course": "ATRON161"
      },
      {
        "index": 58,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is pretty easy, m'kay. Kinda boring but the stuff is pretty interesting, m'kay. Really easy and i recommend to all, m'kay. And by the way, he a hefty Mr. Mackey, m'kay.",
        "course": "AST161"
      },
      {
        "index": 59,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this class. Prof. Ennis is nice but extremely boring his test are very hard if you are not a math/science minded person. I think he thought he was teaching an upperlevel course. I would not recommend this class to anyone who is just trying to fill a gec.",
        "course": "ASTRO161"
      },
      {
        "index": 60,
        "rating": 5,
        "difficulty": 1,
        "comment": "The most interesting and funny science teacher at Ohio State. He prepares you well for the test.",
        "course": "ASTR161"
      },
      {
        "index": 61,
        "rating": 2,
        "difficulty": 1,
        "comment": "Dr.Ennis class was perhaps one of the most mind numbing experiences I have ever had. His stories ranged from sliver noses to his Toyota Prius to his jealous at another astronomer. I learned everything in this class in one week as a freshmen in high school in Earth Science. Easy Grade",
        "course": "AST161"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 1,
        "comment": "very understandable, made astronomy as interesting as it can be. funny guy",
        "course": "ASTRONOMY161"
      },
      {
        "index": 63,
        "rating": 5,
        "difficulty": 3,
        "comment": "This teacher is excellent.  He makes the class intereting and relevant, while not making the class difficult.  MAke sure you study your powerpoint notes, go to class and write everything he says, listen, and if you miss a class (don't!) read the book.  I learned so much.  I truly appreciate it.",
        "course": "ASTR161"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "ASTRONOMY161"
      },
      {
        "index": 65,
        "rating": 5,
        "difficulty": 1,
        "comment": "He made the class easy to understand and fun.",
        "course": "ASTRONOMY161"
      },
      {
        "index": 66,
        "rating": 5,
        "difficulty": 2,
        "comment": "I thought the information for this class was more boring than 161, but Ennis is a nice guy that is very clear and easy to understand, if you don't understand something just ask.  If you study the notes well you don't need to buy the book, but the book is helpful for homework that replaces a quiz sco",
        "course": "ASTRONOMY162"
      },
      {
        "index": 67,
        "rating": 3,
        "difficulty": 3,
        "comment": "I don't find his sense of humor all that amusing. And he is the most boring man alive. But, if you go to class the quizzes are fairly easy. He puts up the notes online but I wouldn't use just that because he has a way of going off on tangents and asking questions about his stories on quizzes.",
        "course": "ASTRON161"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very funny guy and easy quizzes because the questions just come right off the notes.",
        "course": "ATRON161"
      },
      {
        "index": 69,
        "rating": 3,
        "difficulty": 5,
        "comment": "Hes really funny, but his class is extremely boring!. And his tests are tough.",
        "course": "161"
      },
      {
        "index": 70,
        "rating": 4,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "AST171"
      },
      {
        "index": 71,
        "rating": 3,
        "difficulty": 3,
        "comment": "Really, the nicest man.  But, he gave material in lecture and said it would not be on the test, and the next test was based entirely on that material.  With the exception of that test, material was clear and well organized, and grading made sense.",
        "course": "ASTRO161"
      },
      {
        "index": 72,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "AST1611"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 1.8,
    "department": "Science",
    "firstName": "Sheldon",
    "id": "VGVhY2hlci0xNDEwNTE=",
    "lastName": "Shore",
    "legacyId": 141051,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "He shouldn't be allowed to teach anymore. The man is at least 85 years old, and can't work the microphone. Honestly, drop the class and get a new section.",
        "course": "CHEM121"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "He really does seem like a nice guy, But he should have stopped teaching 20 years ago. Can't seem to make the mic work and that's obviously very important in a large class. The exams are ridiculous. Way harder than they need to be. I'm having trouble and I took an equivalent class already. Get out now.",
        "course": "CHEM121"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Sucked! Can't read or write. Hard class to begin with, and he made it worse. DO NOT RECOMMEND",
        "course": "CHEM121"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "This is my second time around taking Chem, and I got stuck with the hardest teacher possible the first time. Shore was like a god sent, his tests are ridiculously easy. However if you dont want to learn about Vietnam, Uboats, and life in the 20s, you shouldn't go to lecture.A good TA is necessary, because I'm 89% Posative Shore invented the wheel.",
        "course": "CHEM121"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "I tried to get through it, but withdrew 4 weeks in. Shore has LOTS of trouble with the technology of the classroom, which is paramount when teaching 350+ at once. He often mixes himself up is his own notes and has to backtrack to correct himself. If you depend on a clear lecturer to understand course material, trust me, do not schedule Dr. Shore.",
        "course": "CHEM151"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "I feel bad saying this about Sheldon, because he is a nice old man, but to put it simply, he is the main reason why I am no longer a Pre-med student, his poor teaching in this introductory course put me way behind all of the other chemistry classes which subsequently led to me failing further chemistry courses. Awful teacher, nice man.",
        "course": "CHEM121"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "CHEMISTRY121"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 2,
        "comment": "Lecture is a waste of time, just read the book at home. Hopefully you'll get a good TA who can explain things, because concepts just seem more confusing in lecture.",
        "course": "CHEM121"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 4,
        "comment": "Poor Dr. Shore. Really, I'm sure he was good at Chemistry back in the '80s or something, but now...he's just too old to be teaching. He constantly spells words wrong (leaves out letters, etc.). It took him three or four tries to spell &quot;oxygen.&quot; His midterms and exams are nearly impossible. Try another professor if you'd like to actually learn Chem.",
        "course": "CHEM121"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 5,
        "comment": "I recommend this class to anyone who has taken AP Chem in HS or can teach themselves.  If not, get out of the class NOW.  Funny guy at times, but really a bitter old man at heart.  Be prepared that if he tells you something is or isn't on the test the truth is probably the opposite.  No curve unless you practically fail the class.",
        "course": "CHEM121"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "Not interested in teaching the class. Find a different professor before it's too late. Has some funny moments but if you're looking to learn the materail lecture is a waste of time. (you might as well just read the book because that's what his lecture is.)",
        "course": "122"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 5,
        "comment": "totally not organized. hard as ****. advice: drop the class now...",
        "course": "121"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 4,
        "comment": "Reads almost word for word from the book. Pretty amusing guy. Hard exams.",
        "course": "CHEM121"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "He can tell good stories every once in awhile (why he carries a Bible in his coat pocket is a good one...), but for the teaching aspect&#63;  He can get a point across if he can get the microphone to work (poor guy is technologically impaired) and if he writes and spells correctly.  Just be sure to read the book.",
        "course": "CHEM121"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 3,
        "comment": "The worst.  Cancels classes because he is not prepared.  Disorganized.  This class is a waste.",
        "course": "CHEM753"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very amusing. I would definitely recommend him. Tests are not that hard.",
        "course": "CHEM121"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "Knowledgable but can't teach. Reads out of the book for lectures. Hard tests.",
        "course": "CHEM121"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.6,
    "avgRating": 2.4,
    "department": "Science",
    "firstName": "E J",
    "id": "VGVhY2hlci0xMjM0Mzk=",
    "lastName": "Behrman",
    "legacyId": 123439,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "worst prof I've ever had. I put more time into this class than all of my other classes combined. I literally taught myself everything I learned in this class...horrible notes, puts random problems on tests...very smart but a terrible teacher.",
        "course": "BIOCH211"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "SO OLD. he teachers like they did in the 50s. his quizzes are tests are over the most random points in his lecture. his notes were HORRIBLE. written everywhere, on top of each other, in between, anywhere. they didn't make much sense either. talks down to students. all i could think about during class was how he was still alive. SO OLD",
        "course": "BIOCH613"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you want a terrible teacher who talks down to you, who gives unorganized notes, and tests on irrelevant details in order to make the average on every test, and the overall average an F, then Dr. Behrman is for you. He is tied for number 1 on my &quot;worst OSU professors&quot; list. He cares more about flaunting his intelligence than teaching.",
        "course": "BIOCH511"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 5,
        "comment": "This man obviously knows his stuff but that doesn't help the students one bit! He prefers to flaunt his intelligence to intimidate the class. I went into his office hours for some advice and assitance and all he did was talk down to me and tell me to memorize my notes. His exams cover the tiny details of his notes resulting in an F average! Awful!",
        "course": "BIOCH511"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "As far as teaching goes, he's bad but not terrible.  His testing methods, however, are horrible.  He picks out the most irrelevant and insignificant details from his notes and comprises his tests entirely from them which makes it near impossible to do well no matter how well you know the material. DO NOT TAKE HIS CLASS!",
        "course": "BIOCH511"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "What everyone said about him below is about right. He is not very &quot;step-by-step&quot; if that is how you learn, you should avoid him. He is also not concise with what you should study, no reviews or study guides for exams. 2 midterms and a final with no quizzes. Nice guy but bad teacher.",
        "course": "BIOCH511"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Stay away from this professor. You are on your own in this class - no office hours, no reviews and certainly vague, &quot;find the answer yourself&quot; e-mails. Come prepared to write notes, as his exams consist of only this - don't even bother buying the text book. He constantly enjoys flaunting his intelligence and asking questions his TAs fail to answer.",
        "course": "BIOCH511"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "The material is quite superficial compare to other biochem classes. Exams are quite simple but require a lot of thinking. Stay away if this will be your first biochem class, but highly recommended if you want to take this class to fulfill an elective credit. Overall, he's a good professor.",
        "course": "BIOCH511"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 5,
        "comment": "Awful prof. does nto test on relevant info, just what he finds important. skips many if not most major topics in  book! no notes given online, no guided notes, no helpful hints, might talk for 45 minutes and only fill up 1 black board. AVOID AT ALL COSTS",
        "course": "BIOCH511"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 5,
        "comment": "If you ever have the chance to take BIOCHEM at OSU, skip the quarter this man is teaching. Don't even buy the textbook, as he lectures straight from his notes. The class average is a big fat F at the moment. PLEASE, stay away from this man! He would rather intellectually stroke himself than teach something efficiently to his students. NO MERCY.",
        "course": "BIOCH511"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "yikes. i have him as a prof this summer because he dedided to come out of retirement for one quarter and teach biochem 511. he is OBVIOUSLY extrememly smart but he doesn't know how to teach! our exam averages so far have been 56% and 47%. he keeps telling us we're in a graduate level class and should understand more but most of us are undergrads!",
        "course": "BCHEM511"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Thank goodness he's gone. I had the misfortune of having him as my professor (groan)- he is smart, no doubt, but he doesnt know how to teach. He likes mumbling only to the front rows and u wonder why those kids fare better! (I had a previous class and could make it any earlier to class) Uses his intelligence to his advantage to intimidate students.",
        "course": "BIOCH613"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "A really good professor but he is not easy",
        "course": "BIOCHEM613"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 5,
        "comment": "Best professor I had at State.  He and Paquette were (ARE) leaders in their fields. I did some research for Behrman during a summer and worked in his lab for the rest of my time at state.  Super funny man once you get to know him.  Extremely helpful, and is he f-ing smart or what.  Electron pushing will never be the same!  I could sit and listen to him lecture for hours.",
        "course": "BIOCHEM613"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy rules, everyone else is just mad because he's smarter than them!",
        "course": "BIOCHEM613"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "BIOCHEM613614"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "BIOCHEM613"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "He's so old that he forgets what he lectured on when it comes time to write the exams.",
        "course": "BIOCH613"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "BIOCHEM"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "BIOCHEM61"
      }
    ],
    "SEI": []
  }
]