[
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.2,
    "department": "Social Science",
    "firstName": "Michael",
    "id": "VGVhY2hlci03OTE3NDc=",
    "lastName": "Swartz",
    "legacyId": 791747,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "His initial introduction was off-putting (anti-technology in the classroom) but I definitely warmed up to him during the semester. Material was interesting and he broke up lectures with informative videos and snippets of media. Quizzes and exams were not difficult if you did the readings and listened in class, mostly just identification questions.",
        "course": "COMPSTD2370H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "class was graded by two 5pg papers a midterm and final and attendance, overall it pretty easy but I didnt find the material too interesting since I was just taking it as a GE",
        "course": "COMPSTD210202"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had a great time in Mike's class, readings are sometimes a bit much but everything's really clear and easy when it comes to the hw and exams. he offers tons of extra credit so its hard not to get an A",
        "course": "HEBREW2210"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Swartz is really not bad at all. As long as you keep up with the readings it's a pretty easy A and he can be really funny in a sort of dry humor way. He really knows his stuff and you'll leave the class feeling a lot more insightful if you show up and listen to him. Just make sure you're not on your phone during lecture",
        "course": "COMPSTD2370H"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "The worst professor I have had. There is absolutely nothing given to guide you in study, the powerpoints are mostly pictures and excerpts from texts you read. All the texts you read for class are EXTREMELY dry and most don't make sense since they're from centuries ago. The lectures are also very boring and there's a lot of unnecessary information",
        "course": "MEDREN2666"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Im a junior at OSU, and in my three years this has been the most unhelpful teacher Ive encountered. The class is composed of 4 quizzes and an exam, all of which he gives you nothing to guide you! No study guide, no review, the only time he speaks about them is when they are coming up and says nothing more and there is ALOT of info so its hard.",
        "course": "MEDREN2666"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Swartz seems like a nice guy and is super passionate about his subject, but his lectures are extreeeemely boring. I'm super interested in the course material and I almost fall asleep during every lecture. The course isn't difficult if you pay attention in class. He says no electronics, but in a big lecture hall he won't call you out.",
        "course": "MEDREN2666"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "No electronics, doesn't post grades online, very boring, brilliant professor, unclear about what you need to know, and overall just an extremely dry class. You don't know your grades until it's over... Not a recommended class",
        "course": "HEBREW2210"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 3,
        "comment": "Absolutely no electronic devices allowed in the classroom. Very smart but not very articulate some times. Rambles on about irrelevant things, he tried to tell a joke once and it took him about five minutes to get it out. Also, uses pluses, checks and minuses as his grading scale...so good luck figuring out your grade before it's made official.",
        "course": "COMPSTD210202"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very nice guy. Information is tough to learn and if you study hard you should be fine.  The information is not easy and he is pretty helpful if you see him in office hours.  Rewarding class.  Not an easy A.  A lot of reading but if you show improvement he is fair with you",
        "course": "HEBREW2210"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 5,
        "comment": "Oh man..where to begin. I was super excited about the subject before the quarter started....now I'm just burnt out and never want to hear about the subject again. He's tough, and rambles--it's hard to keep up with what you're supposed to know. Although, if you're going to learn from someone, this is the man to do it from. He knows everything.",
        "course": "CS376"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 4,
        "comment": "The material was interesting, but the class was so confusing. Grades were completely subjective, I had NO IDEA what my grade was all quarter. He never emails back, and doesn't post anything at all on Carmen. Not what I want/expect from a GEC class.",
        "course": "COMPS202"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "Professor Swartz is a fountain of knowledge. That being said he is very bad with using technology and getting back to students via email. he tends to ramble in class, and run with random thoughts during speaking. Sometimes hard to know what is relevant, and what is completely irrelevant. Did i mention he is bad with technology&#63;!&#63;!&#63;!",
        "course": "HEB376"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "Doesn't use carmen or powerpoints, he's pretty bad with technology.  Class is pretty boring, learned some interesting things about religion but I think he pulls grades out of his ass.",
        "course": "COMST202"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good class. very informative. Prof is too cool and helpful. Exam and quizs are easy.",
        "course": "COMPSTD20202"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 3.3,
    "department": "Social Science",
    "firstName": "Basil",
    "id": "VGVhY2hlci01MTUxNw==",
    "lastName": "Kardaras",
    "legacyId": 51517,
    "numRatings": 45,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best professor. He's very intelligent, knowledgable and active during class. He helps everyone a lot and makes people really think about the international arena and theories. He doesn't use electronical devices, which makes it easy to focus and have dicussions during class, which were always interesting discussions. I was gutted when class ended.",
        "course": "INTSTD5800"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Do not take this class if you respect your personal time or energy, whatsoever. Kardaras is a nice guy, but offers little to no deadlines or guidelines for the work he expects you to do. Actually the most bizarre class I have ever had. Do not take under any circumstances.",
        "course": "INTSTDS5800"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "He doesn't set clear deadlines for things so it can get kinda confusing. The class was pretty easy though. He doesn't let you use electronics but expects you to take notes type them and turn them in for points.",
        "course": "INTSTD5800"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "My favorite class I've ever taken, solely because of the teacher. He's extremely smart, helpful, and loves extending deadlines and making the student feel like they've got wiggle room. I legitimately didn't ever want to miss a class and they were at 8 am so that's saying something. I hugged him goodbye at the end of the semester and almost cried. ",
        "course": "INTSTD5800"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Dr. Kardaras is a brilliant guy and this class was very interesting.  He does take attendance, but stopped midway through the semester.  He teaches a truly organic class, does not use the syllabus or Carmen.  He is really an interesting guy and finds himself hilarious and is always cracking jokes.  I enjoyed him, but it is a different type of class",
        "course": "INTSTD5800"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 2,
        "comment": "He is clearly a brilliant guy, but getting knowledge from him can be somewhat difficult. The syllabus isn't a thing, don't pay attention to a single date on there. Attendance is mandatory, but he stopped taking attendance about halfway through the semester. Nice guy, just not the most effective teacher. (and totally a name dropper.)",
        "course": "IS5800"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Kardaras is the nicest, smartest, funniest professor I have ever had at Ohio State. The class is slightly confusing and unclear. He does not use Carmen and does not follow the syllabus. BUT if you are go with the flow and are not just concerned about getting a grade and actually want to learn and have a good time doing so, Kardaras is amazing.",
        "course": "INT5500"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 2,
        "comment": "Do NOT take Prof. Kardaras if you are just looking for an basic GEC or easy A. He doesn't do powerpoints or normal lectures. It was an organic class where we discussed questions brought up. It was interesting, but I would hate if *every* class was like this. Kardaras has LOADS of good information, so if you are interested in the subject take him!!",
        "course": "INTSTDS2800H"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 5,
        "comment": "I would not take him again(SPRNG '12). Dr.K was unclear and ambiguous it was difficult to do papers. He didn't use Carmen. For all the interesting current event in world studies, we didn't discuss any of it. His lectures were super disorganized so I had no idea which parts were important. Frustrating, uncomfortable environment and little learning.",
        "course": "INST201H"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 3,
        "comment": "I really enjoyed being in his class. He has a sense of humor, is brilliant, and tries to get to know his students at least on some level. The 8:30 am class& 7:30 am final were worth it, for all I learned. It's a great introductory course into int'l studies, as, though the subject is \"peace studies\", his lectures cover so much.",
        "course": "INTST201H"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 2,
        "comment": "Spent most of the class wondering what was going on,  but left knowing more than when I came in. No denying Kardaras is brilliant and made class memorable. 2 papers (one optional) not bad if you put the work in, and he gives you the final essays beforehand.",
        "course": "IS201H"
      },
      {
        "index": 12,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very disorganized and was never really sure what I should and should not take notes on, but really nice and funny guy and I do feel like I learned a couple things, mostly along the lines of \"war sucks\". 1-2 papers and a final are the only real work you have.",
        "course": "IS201H"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "RUN from this class! Dr. Kardaras was completely disorganized and even offensive. Two papers and final were absolutely ridiculous-- not even hard, just weird and a waste of time. I really wish I would have dropped this class.",
        "course": "INTST201H"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "Positives: Very knowledgeable, has many thought provoking, unconventional ideas. A nice guy, laid back when it comes to due dates, missed classes, etc. Negatives: Can be vague and unclear, his tangents can get tiresome, and the material can be rather dry. Overall, an A is doable with a solid effort.",
        "course": "IS650"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 5,
        "comment": "Unlike lower level classes, A's are rather difficult, not impossible though.  Heavy focus on the textbooks but they are there to present ideas, often Dr. Kardaras' thoughts contradict textbook statements.",
        "course": "INTST650"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 4,
        "comment": "I feel like I wasted my time. It was so so so hard waking up early to go and sit through meaningless words. Did I learn anything&#63; Maybe. I am still not sure. I wish I had those hours back.",
        "course": "INTST201"
      },
      {
        "index": 17,
        "rating": 3,
        "difficulty": 2,
        "comment": "As people have said, he's an amazing intellect. Has an incredible breadth of knowledge. Does go off on many tangents and the class seems to be loosely organized. However, this is just his teaching style and frankly I think it works. A very thought provoking class. He's a really nice guy and an A is very achievable with a decent effort.",
        "course": "INTST201"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "He is obviously a genius, but his syllabus is the most confusing I've ever seen. His lectures are very random and abstract and it's really hard to figure out how it all fits together. Especially with all of his side stories. I would not recommend him.",
        "course": "ISH201"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "Went off on ridiculous tangents all the time. The subject matter wasn't complicated, he would give us no direction on the assignments, and doge questions when asked. We spent 3 days on intros too. His tangents weren't interesting/funny- just annoying. Google his name and read &quot;Another Churhill Clone&quot;-Evidence of his socialist/marxist backround",
        "course": "ISH201"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "Most confusing class I have ever taken!! Dr. Kardaras is a very interesting professor and a joy to listen to. But I don't remember anything relivent discussed in class. He goes onto many tangents and some classes went on for days. We barely finished our group projects for the quarter. He jumps from subject to subject with no connnection.",
        "course": "INTST201"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Kardaras is such an intelligent professor--he knows about everything. He does go off on tangents, but it's just his teaching style, and everything he talks about comes together in the end. He really stresses intelligent thought and discussion, so be prepared for hard grading. I really enjoyed this class and thought Dr. Kardaras was a great prof",
        "course": "INTSTH201"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 2,
        "comment": "He was very knowledgeable, though he ran with a lot of tangents and discussions lasted for days... we barely had time to finish group projects. i really enjoyed this class even though i was pretty neutral going into it.",
        "course": "INTST201"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 3,
        "comment": "I don't doubt that this man is smart, but his thought process was so difficult to decipher. We spent THREE classes doing &quot;beginning of the quarter&quot; introductions. It was so ridiculous. I really can't remember any concrete information that was discussed in that class.",
        "course": "INTS201"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "one of the most interesting person i've ever meet. get him talking and he won't stop, seriously. he's very mysterious too, try and learn about his past life and he always lies and ignores you. AWESOME teacher and easy A. i looked forward to listening to him talk every time. he'd be a great millionaire life-line",
        "course": "INST201"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very Unique, intersting prof. U dont need to watch any of those confusing news channels , just go to lecture he will keep u updated. I loved every min. of class",
        "course": "INTS201"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 2,
        "comment": "one of my favorite teachers ever. he DEFINITELY was all over the place, but i learned so much in the class and decided to pick up an international studies minor because of it! if you need every little detail to do well in a class, 1. you suck and 2. don't take this class. very fun and very interesting!",
        "course": "INTST201"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "he was awesome. one of my favorites. i actually wanted to go to class and it was 8am. he is a little all over the place and i most of what i wrote down in my notes was the funny stuff he was saying but i did learn a lot in his class and the readings were great.",
        "course": "IS201"
      },
      {
        "index": 28,
        "rating": 2,
        "difficulty": 4,
        "comment": "Worst professor. Very unorganized and all over the place. Appears to fly by the seat of his pants, as thugh he prepaired lectures and activities while driving to campus each day. Very frustrating.",
        "course": "IS201"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "H201"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "I can't believe so many people liked him and this class. The actual class time could be very interesting when he wasn't name dropping and talking about random stuff and I don't doubt he is incredibly intelligent and interesting but the structure and grading of this class was so unorganized that it made me crazy!",
        "course": "H201"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class was interesting, but I feel like the professor was all over the place.  We talked about random things every day and half the class would fall asleep.  The class wasn't too difficult and the professor was a fairly easy grader.",
        "course": "IS201"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "An incredible professor and a great person.",
        "course": "PEACESTUDIES"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "1"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 1,
        "comment": "the best professor ever,he is the man who knows how to teach.",
        "course": "201"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class and teacher were awesome.  I was so blown away everyday in his class.  I thought I had a handle on world politics and the causes of war and peace - boy was I wrong!  Definitely a class to take, but only truly great with Dr. Karderas.",
        "course": "INTSTDS201"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 3,
        "comment": "My favorite professor of all time.  Difficult to figure out, but if you want a class that will make you think, take peace studies. I loved this guy!",
        "course": "INTSTDH201"
      },
      {
        "index": 37,
        "rating": 4,
        "difficulty": 2,
        "comment": "wow! he has endless knowledge! although he picked on me everyday, i loved him and the class. laid back, and helpful. I want to be like him someday! you won't regret it!",
        "course": "INTST201"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 2,
        "comment": "awesome guy, totally genius.",
        "course": "PEACE"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 4,
        "comment": "He has a wacky teaching style, however it seems to work.  I learned a lot, and the class really made me think.  If your interested in taking a class that challenges your beliefs, def take peace studies.  He is a good teacher.",
        "course": "PS100"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 2,
        "comment": "Basil.  Wow.  What can you say.  I went the whole quarter not entirely knowing what to make of him, but I know I liked him.  The class itself is interesting but for me the best part was trying to figure out what goes on in his head.  A unique individual.",
        "course": "488"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 2,
        "comment": "he's cool, a little weird, but in a good way",
        "course": "INTSTDS2"
      },
      {
        "index": 42,
        "rating": 3,
        "difficulty": 3,
        "comment": "This is a strange, strange man.  His class is easy though, and most entertaining",
        "course": "INTSTDS2"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 3,
        "comment": "this man is great",
        "course": "INTSTD20"
      },
      {
        "index": 44,
        "rating": 1,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "SOC488"
      },
      {
        "index": 45,
        "rating": 1,
        "difficulty": 3,
        "comment": "Strange but if you go to class youll get an A",
        "course": "SOC488"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.3,
    "department": "Social Science",
    "firstName": "Christopher W",
    "id": "VGVhY2hlci0yODQ4NTY=",
    "lastName": "Knoester",
    "legacyId": 284856,
    "numRatings": 40,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Knoester is a helpful professor and is very passionate about his subject, but lectures were often tough to sit through and not very engaging",
        "course": "SOC1101H"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Although this class was structured weird, with pretty much the entire grade depending on a midterm, final paper, and final exam, Professor Knoester is really great. Very knowledgable and passionate about what he teaches and keeps lectures engaging through funny videos and games. Genuinely cares for the wellbeing and success of his students. ",
        "course": "SOC1101H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This call was Definity a reading heavy class because a lot of the topics covered in class had excerpts to read. If you read them and take note you will do amazing. The exams are written and all the stuff can be turned in on the last day of class. So what you give is what you get. A great teacher really cares but is kinda boring at times.",
        "course": "SOC1101H"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very understanding prof during Covid as he did not have deadlines for homework/exams. However, he assigned many random assignments/papers, and the midterm is a 10-page paper. The class also has a very unclear/confusing research project (5 pages) worth 15% of grade. Lectures are also extremely boring.",
        "course": "SOC1101H"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Pretty straightforward class. Brings unbiased, thorough discussion material class. Has students think for themselves a lot. Lots of effort points. Basically everyone opts to take the essay option for exams which is 2 essays you can prepare outlines for ahead of time. Can be a bit passive-aggressive at times. Decent extra credit at the end.",
        "course": "SOCIO101H"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "This class was pretty easy if you've taken Sociology courses before. The debates and debate notes were not hard to complete just annoying busy work. The exams were fair. Discussion in class could be frustrating at times but overall the class was not bad.",
        "course": "SOC4655"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Chris was very good at keeping his teaching unbiased. Although people disagree a lot when it comes to sociology, he didn't try to convince us to adopt his views.  Class isn't hard if you attend and if you keep on top of work.",
        "course": "SOC1101H"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very boring lecture. Very vague and confusing with his lecture. Didn't really learn anything. Overall, easy grader and nice but horrible professor.",
        "course": "SOC1100H"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is one of the worst professors at OSU, the exams are impossible and when you miss class you have to write a paper when in class they took a half page of notes.",
        "course": "4655"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 5,
        "comment": "a HUGE amount of work for zero payoff. If you miss a class for any  reason you can \"make up\" a missed in-class assignment by writing a 3-5 page paper. He adds projects which are not listed on the syllabus and only allows a few days before they are due, so if you miss a class you also miss assigned papers. ",
        "course": "SOC4655"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Knoester's class wasn't difficult and he is an extremely nice person.  I just wanted to comment to warn that if you want to get excited about Sociology, this is not the professor to take.  His lectures were so hard to sit through.  Don't bother buying the textbook, but you need the reader!  Take the essay version of the exams.",
        "course": "SOC1101H"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "The class is relatively easy with only two exams (take the essay versions and you can bring in outlines on the day of the exam). There's in-class activities for a grade, so you have to show up to class. The lectures are a little boring, but overall the class is an easy A. ",
        "course": "SOC1101H"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 2,
        "comment": "Not a bad class overall but rather boring lectures for 1hr 20mins. Only two exams (midterm and final)- choose the essay exam! The rest is in-class activities (graded for completion) so show up to class plus a few things outside of class. Only buy the reader, not the other text! Sometimes lectures are fun when he plays movies and clips from colbert!",
        "course": "SOC1101H"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "OMG the class was overrated. There were 2 exams (Midterm & Final) he definitely took the fun out of the class. I think it could have been better but he made it horrible. I wouldn't recommend this class because it doesn't matter how hard you work on the debate notes. You're going to get a LAME GRADE!",
        "course": "SOC4655"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "In-class participation assignments are used as an attendance-taking tool. Other than that, there was only 1 easy midterm and three very relaxed debates. Overall, the class consists of open discussions, basic Powerpoint slides, and relevant documentaries/clips. Chris is genuinely great guy, and his love for teaching is extremely evident.",
        "course": "SOC4655"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 2,
        "comment": "Knoester is special in that he is smart and knows what he's talking about and he's good at teaching. Make sure to take notes on the reader as you go, it will make your life a lot easier around midterms and finals. He doesn't give tests, only two essay exams and a project.",
        "course": "SOC1100H"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took the Honors version of the course, easy A. He takes participation credit sometimes but you'll get it if you're there. No need for the Henslin book, you only need the reader. Sit back, survive the lecture and this class is a breeze. He's extremely knowledgeable on the subject, just not the most exciting.",
        "course": "SOC1100"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "don't take his class if you are not a native speaker.",
        "course": "SOCI101H"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class. Don't bother buying the textbook. Buy the reader and take notes from it because you need to site it in the midterm and final exam essays. Nice professor, but boring class.",
        "course": "SOC1101"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Class is almost interesting, completely lecture.  He assigns two books, but only uses the reader.  He is a smart guy and understand the subject well.  Take the full essay format exams- way easier",
        "course": "SOCIO1101"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took the honors version. Great class and super easy. Only need the reader, don't waste time purchasing textbook. Midterm and final are essays that you get to make outlines for and use on the test. Kinda boring but easy GEC.",
        "course": "SOC1101"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not a hard class at all, but not particularly fun either. Go to class and skim the readings, you should get an A. DO NOT BUY THE HENSLIN TEXT. You will need the reader but don't waste your money on the textbook. All in all, not bad. Knoester is biased in a lot of areas, which bothered me, but do what he asks and you'll be fine.",
        "course": "SOCIO101H"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good professor, class is fun early on in the quarter but started to become boring. doesnt use textbook just the reader to cite sources for essay exam. Take the essay exam and dont get behind on the reading and you should get an A",
        "course": "SOC101H"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 3,
        "comment": "You don't need the textbook at all, all you need is the reader if you take the essay exams because you have to site the readings in your essays.  I thought this class was incredibly boring, but overall not difficult.  In retrospect I wish I didn't take it- boring and not that informative.",
        "course": "SOC101H"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "I had Knoester for Sociology of Sports. I think that he did a very good job of teaching the course. For it to be a 600 level, it was very easy. No papers, just debates in which you have to read all the assigned articles. Overall, I think it was a good class with a good teacher.",
        "course": "SOC655"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Loved this class & teacher! Learned a lot of interesting things about society and sociology. Sometimes the readings were boring but class was hardly ever lecture-based and instead, almost all discussion. Highly recommend.",
        "course": "SOC101H"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 2,
        "comment": "You only need the reader, because he doesn't teach, you just read a million god awful articles and uneducate each other about them. As a teacher he's absolutely useless, and his exam set up is beyond pointless. Not hard, but excessively time wasting.",
        "course": "SOC101H"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 3,
        "comment": "Boring. Beats around the bush with information that he expects you to know.",
        "course": "SOC655"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 2,
        "comment": "only need to buy the sociology reader, the actual textbook isn't really needed. take the essay exams. difficult to tell how you're doing in class because grades aren't posted anywhere. i hated the class and am glad it was over but it wasn't that bad...",
        "course": "SOCIOH101"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great class and great teacher. Definately take his essay exams. that is all.",
        "course": "SOCIOLOGYH101"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 4,
        "comment": "Please note the prof. is very nice and he really does try to make the class fun. He just fails at the last part. The Sociology of Sports should have been fun, be he beat it like a dead horse. He also makes you do 6 debates which entails 6 (long) papers. It is a crazy amount of work and NO FUN! Whatever you do-don't take Sociology 655!",
        "course": "SOC655"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 3,
        "comment": "good",
        "course": "SOCIOLOGYH101"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class as long as you study for the exams and participate in class. Do the essay exams. Really nice guy and willing to talk things over.",
        "course": "SOCIOLOGYH101"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 2,
        "comment": "Good class, not so interesting but pretty easy A. As others said, do the essay question for the exams. Knoester is fair and nice guy.",
        "course": "SOCIOLOGYH101"
      },
      {
        "index": 35,
        "rating": 4,
        "difficulty": 1,
        "comment": "He let the class discuss.  Including the readings in essays got annoying, but they were easy.  He did use the old version of the book, however, so some had to copy it from the libby.  Overall, the class was like a gorilla stuck on a tree: Its easy to deal with as long as you keep an eye on it.",
        "course": "H101"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "SOCH101"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 3,
        "comment": "taking an all essay test is the way to go, because he's fairly lienient.  however, if you're not that interested in sociology then get ready for the &quot;most exciting&quot; class of the quarter",
        "course": "SOCH101"
      },
      {
        "index": 38,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very boring. I had to drink a red bull before every class. Loves for the students to talk, and will wait for hours until someone does. But a fairly easy class, although you dont learn from him, you learn from the book...",
        "course": "H101"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very decent professor, tests aren't too bad anymore, used to be all essay, now just one essay, tells you what to study before the test, essay topic given a week before, not bad at all for an honors class, VERY discussion oriented",
        "course": "SOCH101"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 5,
        "comment": "Would not allow students to take empty seats in class 2 weeks into quarter.  Loves to hear himself talk but talks in circles.  All grades based on essays he gives NO feedback on. Uses worst text books possible (I only realized this when I got a new book)",
        "course": "SOCH101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.1,
    "avgRating": 4.7,
    "department": "Social Science",
    "firstName": "Dawn",
    "id": "VGVhY2hlci0yNjA0NzU=",
    "lastName": "Anderson-Butcher",
    "legacyId": 260475,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "great class. structure is very interactive. we spent a lot of time playing games in the gym. not a ton of assignments. would 100% take again!",
        "course": "SOCWORK2110"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Dawn was an outstanding instructor. She made sure no student fell behind and that everyone understood what was happening. I enjoyed this class thoroughly and had lots of fun. I recommend it to anyone of any major.                                                                                                                               ",
        "course": "SOCWORK2110"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Dawn is INCREDIBLE. I loved taking her class, and she has been a great mentor to me ever since. She is kind, compassionate, and truly wants her students to succeed. She doesn't let anyone slip through the cracks, learns everyone's names, and truly gets to know you throughout her courses. She is a wonderful educator and teaches with grace.",
        "course": "SOCWORK2110"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dawn is one of the best professors that The Ohio State University has. She's extremely passionate about the integration of sport and social work and her enthusiasm is contagious. I would recommend this class to everyone!",
        "course": "SW310"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dawn is a terrific teacher!  She is so fun, and has so much passion about what she is teaching.  The class was very applicable to the profession, and I wish I could take it twice!  I would reccomend this to any social work student because it is easy, and I never wanted to miss a class.  Also, she is very very nice!",
        "course": "SWK310"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 5,
        "comment": "The content was based on administrative content way more than clinical.  If you are interested in macro practice take this class.",
        "course": "SWKSCHL"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was very helpful and always willing to answer questions.  She challenges students to think about macro practice.  One of the best professors I've had at OSU! She really cares that you learn but does not let people slide through either!",
        "course": "SCHOOLSWK"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3,
    "department": "Social Science",
    "firstName": "Chris",
    "id": "VGVhY2hlci01MzExNw==",
    "lastName": "Papaleonardos",
    "legacyId": 53117,
    "numRatings": 116,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Prepare to spend hours on readings and lectures for this class - the exams are no joke and cover even the smallest details. While the assignments are manageable, the rigid grading and lack of flexibility make it a tough course. Unstuck study was a lifesaver for preparing.",
        "course": "SOC3302"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "The system for the class messed up, I showed proof and contacted him , then he said to contact the system we use for our class , I did that same night and told him it got fixed , and then he would not let me go back and complete the assignments even under the circumstances that was not my fault , then just stopped answering my email about it, 0/10",
        "course": "SOC1101"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "The essay that was due over two months ago was finally graded on the day that final grades are due to the registrar. No response to emails, and exams are difficult and a major part of the grade. Still, I never felt too overwhelmed with the amount of work I had to do for this course.",
        "course": "SOC3302"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class was kind of boring. His lectures were just him talking. His grading his okay, he does drop multiple assignments. You don't get any feedback on the exams.",
        "course": "SOC3302"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Good lecturer, even if it was a recording. Not very engaging but that can be the nature of online classes. Can be a bit of a disconnect. One of the worst grades I've received in a class. ",
        "course": "SOC3302"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Probably the worst professor I have ever had. Midterm/final are majority of your grade, but they have almost nothing to do with lecture material. He gives you great study guides that are useless. Takes weeks to grade assignments and his lecture videos are just talking about random things that do not pertain to the class. Do not recommend. ",
        "course": "SOC3302"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "i'm about to crash out from this man and this class. AVOID. AVOID AT ALL COSTS. chris does not respond to emails, he does not give clear criteria for grading, will not budge on his grades. his online and asynchronous midterm grade AVERAGEEEEE was a D. ",
        "course": "SOC3302"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "I am begging you, please choose a different professor. His exams are IMPOSSIBLE. The average grade is always trash but of course he doesn't care. He enjoys adding the most niche questions that nobody would know onto the exam. He lovessss when people get them wrong and doesn't offer extra credit. Extremely odd way of teaching a class....",
        "course": "SOC59701"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly, the worst professor that I have ever had. There is an insane amount of work for a class, an elective at that. There are rules that he does not put in the syllabus but hides in announcements that you have to dig to find. If you can avoid this professor, I fully advise that you avoid him at all cost.",
        "course": "SOC3597"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 3,
        "comment": "So much to read each week that it was hard to keep track of it all. You usually had options of what to read but you may have to come back and read them all for the exams. Tough grader on the essay and super heavy on the exam with oddly specific questions on outside articles. Filled out every review guide thoroughly and still never did super well. ",
        "course": "SOC3302"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE THIS CLASS!!! Exam questions were just based on what he rambled about in the lectures, don't bother going through the exam review slides. The time spent every week was around 6 to 8 hours with reading, discussion posts, assignments, podcasts, and lectures.",
        "course": "SOC3302"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 5,
        "comment": "I did enjoy the class as a whole, but as a senior it was way more work than I wanted or anticipated. Throughout the semester there are quizzes and discussion boards, which aren't bad, but the final project is intense (especially if you get a country where information is hard to find). If you are looking for something easy, take something else.",
        "course": "SOC3597"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "One of the worst professors in the university. Please choose another professor if possible.",
        "course": "SOC3302"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 4,
        "comment": "Prof Papaleonardos' discussion boards and assignments were fine.100% on those. The rest is terrible. Midterm and final were heavily based on the tiniest of details in his lectures, and even if you wrote pages of notes, you would still probably get a low grade. No curve, no extra credit. Also HOURS of reading that will show up on exams! ",
        "course": "SOC3302"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Every week I'd spend (on average) nine hours with all the lectures, reading, podcasts, assignments for this course. There was an insurmountable amount of work each week, and the prof was hardly accessible by email. Incredibly rigid rules, strict grading, no extra credit. Lectures are mostly personal opinions or weird historical stories. Very hard. ",
        "course": "SOC3302"
      },
      {
        "index": 16,
        "rating": 1,
        "difficulty": 2,
        "comment": "All of his material has an underlying liberal agenda and anti right wing. 12 assignments due every week. Hours of reading the textbook and answering interactive quiz questions followed by hours of boring pre recorded lectures then a couple mini assignments. I learned nothing from this class. Professor is not friendly and tries to trick students.",
        "course": "SOC1101"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "Homework assignments and discussion posts are easy. Exams are god awful. Questions are about the littlest random facts that may have been mentioned once in one of his three hour lectures per week. Average exam on the midterm was 55, and he did not say anything about it. Thinks his class is the only thing going on in your life. ",
        "course": "SOC302"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 5,
        "comment": "I took this class thinking it would be a normal asynchronous gen ed class, but Dr. P made the exams INCREDIBLY difficult, referencing exact quotes he made in 3 1/2+ hour lectures and readings and making the exams closed note. The average grades on midterm/final were below 65%, yet he refused to change anything when I addressed this issue. DONT TAKE",
        "course": "SOC3302"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 3,
        "comment": "This course is online and the overall workload is very easy. The midterms however are horrible and the timing is simply not fair. The study guides before the test are truly a waste of time and I would recommend the other online sociology teachers. I did not learn one thing. ",
        "course": "SOC1101"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Papaleonardos' lectures were interesting, but sometimes dry or redundant. There was a lot of work to do, but it wasn't too difficult. I rented a textbook for this course which was helpful, but not entirely necessary (though there were a few quiz questions that asked for definitions from the textbook). ",
        "course": "SOC1101"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "The study guides he gives are useless. Read the chapters and the papers he assigns. Also, the end of semester project is important so put all your energy into that, he is looking for ridiculous info especially in the paper.\nDon't bother emailing him, he will take a pic of your email and post it to the discussion board and answer it that way.",
        "course": "SOC3597"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 3,
        "comment": "This course had a TON of reading involved. (I read NONE of it and still did alright because of quizlet). The exams were very hard and you have to move fast. ",
        "course": "SOC1101"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 2,
        "comment": "One of the slowest graders I have ever had at any level of schooling. I'll probably get an A in the class, but it's hard to say for sure, since over a quarter of our points are not in yet. He says that we are scored on participation, but did not know our names or take attendance until the last day. Incredibly easy grader, but a dry lecturer.",
        "course": "SOC236701H"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was dry but educational. The lectures were most interesting when he drew from personal experience, but overall were pretty generic. The books were well worth my time and I enjoyed reading/discussing them. He isn't a difficult grader so if you read the books and put some effort in you'll be fine. Make sure to take good notes in class.",
        "course": "236701H"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 4,
        "comment": "The lectures are uncomfortable, Im a social work major and found myself being offended by some of his material. Referred to womens bodies in an uncomfortable manor. The course is easy overall, you dont need to attend class to do okay on web assignments and mid term.",
        "course": "SOC1101"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Assigns lots of reading and papers, which is to be expected from a second writing course. Lectures were usually dry but when he drew from his personal experience they improved. Very knowledgeable about politics and current events. Gives little feedback but did not grade too harshly. Most readings were engaging and applicable to modern times.",
        "course": "SOC236701H"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 4,
        "comment": "Instructor hardly teaches anything, assigns random readings each week, no lectures. Clearly professor has no interest in the course, only posted 5-10 minute videos on topics each week, everything else is self taught. Exams are nearly impossible, none of the questions are taken from the textbook, or topics covered. Prof doesn't responds to emails.",
        "course": "SOCIOL395701"
      },
      {
        "index": 28,
        "rating": 3,
        "difficulty": 1,
        "comment": "I never watched lectures and assignments were easy. Tests use a lockdown browser so you do have to do your reading. Tests are honestly harder than you would think and his grading is so weird. My friends and I would get different scores even with similar answers (discussed after the fact). He did round my grade without me asking. Feedback was bad.",
        "course": "SOC3302"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 4,
        "comment": "The exams are unreasonable for the content he offers. As a junior in engineering, this is the worst grade I have received in any class.",
        "course": "SOC3302"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 4,
        "comment": "Just took his final: if you think you know the content-you don't. Studied and did majority of readings/lectures, still bombed it. Asynchronous is a horrible decision for the amount of readings and extra crap he has. Exams are super hard, study guides are minimal help. Only positive is discussion boards and assignments aren't too difficult.",
        "course": "SOC3302"
      },
      {
        "index": 31,
        "rating": 1,
        "difficulty": 5,
        "comment": "This online class had very little actual teaching. I suspect he still tested on what he has previously taught in class. Study guides are useless, exams are ridiculously hard with 45 minutes for 50 complex questions. There is no time for those who have trouble reading/processing quickly in a testing environment &amp; goal seems to be to reduce grades.",
        "course": "SOCIOL395701"
      },
      {
        "index": 32,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you want an easy A, this is not the class for it. Just took one of his midterms and completely bombed. The study guide that he gave us was extremely useless. 50 questions midterm that you had to complete in under 45 minutes. Each question was long, confusing, and had throwball in it. All the content that I studied was not on the midterm.",
        "course": "SOCIOL395701"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 3,
        "comment": "There is so much reading in this class. Read everything for the exam. Other than the reading, the class is not bad at all. Just DO THE READING. I did not interact with Papaleonardos, but from what I saw he was helpful. His lectures were very average and long.",
        "course": "SOCIOL3302"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 2,
        "comment": "Chris's class is perfect if you are a politically active and love reading. He's genuinely a really great guy, but his lectures tend to be dry and hard to stick with for 80 minutes straight. Go to class because he doesn't post lectures and on the final he looks for answers that he specifically talked about. Overall, pretty easy course.",
        "course": "236701H"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 1,
        "comment": "His averages for his exams were C- and D, yet he didn't curve. The high's for these exams were 90 and 94 as well, so getting an A is near impossible. That being said the class has no work for you to do at all, every other &quot;assignment&quot; is cake so if you don't care about getting an A/A- its an easy class to pass.",
        "course": "SOC3302"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take this class! The professor is so chill. Attendance is optional. There are books that you don't have to read to write the papers on. I learned a lot about current politics in this class, and actually looked forward to his lectures. Easy A. Also, he canceled class a handful of times which was super great. Final exam ended up being online.",
        "course": "SOC236701H"
      },
      {
        "index": 37,
        "rating": 3,
        "difficulty": 1,
        "comment": "Easy class. He cares about students and has interesting class discussions. Would recommend his class.",
        "course": "SOC236701H"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 1,
        "comment": "Lectures are very interesting. He always had a positive attitude in class and would stay afterward to help students with any questions they had on assignments, quizzes, or the lecture. Definitely made the class very fun and one of my favorites I have taken so far.",
        "course": "SOC1101"
      },
      {
        "index": 39,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took Chris for my honors writing class and it was one of my favorite classes at OSU. He makes class so interesting and uses real life examples along with current news. He is such a nice guy and made learning so fun. There is a lot of reading, but the class makes up for it in lack of other assignments.",
        "course": "236701H"
      },
      {
        "index": 40,
        "rating": 1,
        "difficulty": 4,
        "comment": "Lecture heavy and very boring. Please dont skip class or good luck . Study guide pointless and reading a lot of article is his main criteria. Can go off topic but knows his stuff. Didnt enjoy this class at all.",
        "course": "SOC3302"
      },
      {
        "index": 41,
        "rating": 4,
        "difficulty": 2,
        "comment": "Go to class and stay awake. I had 8 am and no one showed up or did the readings. Then the final had a bunch of questions that you really needed to be in class to know. There's one in class assignment and a paper, but it's not hard. Chris is pretty cool, he talked a lot about his personal experiences, but still said what needed to be said.",
        "course": "SOC3302"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "Only problem I had with this professor is the lack of a textbook so couldn't just skip classes even if needed. Other than that, he's a great professor. Lectures are fun, could get an A easily if you get the work done. Lots of reading though so you gotta make sure to keep up or you'll end up under a pile of unread articles on the final like me.",
        "course": "SOC3302"
      },
      {
        "index": 43,
        "rating": 2,
        "difficulty": 3,
        "comment": "His classes are boring as he spends half the time discussing current politics. Does not have a clear grading criteria for his essays. Even if you specifically address all his questions, he would still grade you C -. I have spent two years at OSU, and his course is the lowest I have ever received. Avoid this professor and the subject AT ALL COSTS.",
        "course": "SOCIOL2367"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 3,
        "comment": "His class is not for the faint hearted. It is lecture heavy but the test are fair. I would recommend students that easily get offended by language or comments of a sexual nature to not take him. To provide fair warning, he has described explicit scenes as part of his lectures. Lectures are very discussion based too.",
        "course": "SOC3302"
      },
      {
        "index": 45,
        "rating": 2,
        "difficulty": 4,
        "comment": "Took this for a writing GE, and we definitely wrote. The books were fairly interesting but his grading criteria of them was unclear though not too harsh. Showed too many movies in class, which was also super disorganized and based around whatever current events he felt like. Would not take a class with him - made little effort in an honors class.",
        "course": "SOCIOL2367H"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 2,
        "comment": "Funny and interesting lectures. Keeps my attention (even at 8am!). Easy A, as long as you show up and participate in lectures. Very clear schedule.",
        "course": "SOC3302"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you are reading this and you are looking at Soc3302 for your engineering GEs, I really recommend Dr. P's class for you. He has a lot real world insight that adds to class discussion. His lectures are always enjoyable which made me look forward to classes. Exams are easy if you take notes in class.",
        "course": "SOC3302"
      },
      {
        "index": 48,
        "rating": 4,
        "difficulty": 4,
        "comment": "He seems to know what he is talking about.  His class is discussion based and there is a heavy amount of reading. The grading is usually done by his grader for essays and online homework.  His midterms are multiple choice and short answer based.  The multiple choice was very tricky when I took his class.  The averages were around 69%.",
        "course": "SOC3302"
      },
      {
        "index": 49,
        "rating": 3,
        "difficulty": 5,
        "comment": "No comprehensive exam, rather 3 exams. Weekly quizzes, papers, and discussion boards. Homework/exams/everything all at same time. NO breaks!!!",
        "course": "SOC3597"
      },
      {
        "index": 50,
        "rating": 2,
        "difficulty": 3,
        "comment": "His course is extremely lecture heavy, and he seems to struggle in making a consistent,  concrete curriculum. There are a ton of reading-based essays so get ready to read and write. He doesn't allow extensions; I was in the hospital for days with a terrible sickness and he wouldn't allow me an extension on a paper.",
        "course": "236701H"
      },
      {
        "index": 51,
        "rating": 3,
        "difficulty": 3,
        "comment": "His Study guides are nothing like the test.  Very long lectures so if ur a more hands on learner avoid taking.  Not to many assignments which can hurt ur grade if u don't do well on the Midterms.",
        "course": "SOC101"
      },
      {
        "index": 52,
        "rating": 1,
        "difficulty": 4,
        "comment": "Very disappointment about this teacher. Class is so boring. He gave us the notes to prepare the exam, but these notes did not help at all!!  He made the exam intentional hard. This class no organization at all. Please keep away from this teacher.  Extremely regret to select this class!",
        "course": "SOC3302"
      },
      {
        "index": 53,
        "rating": 2,
        "difficulty": 3,
        "comment": "Very unorganized. You spend all 55 minutes of class listening to him talk. Gives some notes online, but the notes are not helpful at all. Grades very easily on most assignments. However, tests require you to remember the most insignificant details of certain class days and the study guides are no help. There are easier professors out there",
        "course": "SOC3302"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 2,
        "comment": "There's a bookpaper every couple of weeks, but it's really not bad. The material is interesting, and reading the bookwriting the paper the day before it's due still got me an A or A- on each paper. Classes were interesting and engaging. This class probably wasn't the easiest, but it wasn't a source of stress either, and very thought-provoking.",
        "course": "236701H"
      },
      {
        "index": 55,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was borderline pointless. The weekly quizzes are ridiculous. There are 12 and not once did I get a 1010 when the book and all information was right in front of me. The questions are worded confusingly. Exams aren't much better. Overall, I do not recommend. ",
        "course": "SOCIOL395701"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 1,
        "comment": "Good professor, passionate about the subject.  Despite the high number of books for the class, I strongly suggest the class because you dont have to read the whole book to do well, and he grades pretty easy.",
        "course": "SOC236701H"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent professor. Makes the subject very interesting and obviously enjoys it himself. The class is discussion based, but he does a lot of lecturing too and seems to know the subject matter very well. He never misses a beat, and can hold students attention. Provides lots of readings online that are discussed in class. Easy grading, too.",
        "course": "SOC3302"
      },
      {
        "index": 58,
        "rating": 4,
        "difficulty": 2,
        "comment": "A good class overall. A little boring at times, but most of the time was interesting. He definitely knows his stuff and is very knowledgable, but does take his time on grading assignments/exams. Show up to class, take some notes and you'll be fine.",
        "course": "SOC302"
      },
      {
        "index": 59,
        "rating": 2,
        "difficulty": 2,
        "comment": "I took the second year writing class about Political Movements in the U.S. The class was fairly interesting, with a liberal bias, but completely unstructured. There are 4 essays corresponding to 5 books, and a written final exam. He grades on a 4.0 grading scale, which does not correspond to Carmen.",
        "course": "SOC236701"
      },
      {
        "index": 60,
        "rating": 2,
        "difficulty": 2,
        "comment": "Professor Papaleonardos might be a nice guy, but this second writing course was horrible. There is absolutely no curriculum for the lectures, we discussed current events every single day. The book selections are good, but you read them on your own, write a paper, turn it in and that's it. You won't learn anything, but you'll probably get an A",
        "course": "SOC236701H"
      },
      {
        "index": 61,
        "rating": 4,
        "difficulty": 1,
        "comment": "He is not by any stretch of the imagination a tough grader. I did not read any of the books all the way through and did just fine on my papers. Final was simple and based completely on the final review sheet he gave us. If you want an easy 2nd writing, this is your best bet.",
        "course": "SOC367H"
      },
      {
        "index": 62,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took his class on Social Movements, and maaaaan does he know his stuff. Sometimes the reading got a little dry but he tries hard to work in real-world, modern examples of things and not just hit you over the head with theory. It is a pretty writing-intensive course but the only real obstacle for me was not having a background in research meth",
        "course": "SOC606"
      },
      {
        "index": 63,
        "rating": 3,
        "difficulty": 2,
        "comment": "I took this class online.  He requires several readings/activities a very short quiz and blog posts each week as well as 2 midterms and a final.  The midterms and final are easy if you do the readings and study a little.  Some of the blog posts I felt were graded based on how he agrees with your opinion and not on length as he says.",
        "course": "SOC101"
      },
      {
        "index": 64,
        "rating": 4,
        "difficulty": 2,
        "comment": "took the class online.  it's really not that hard, but there's a lot of assigned readings and such each week that you need to do.  exams are all multiple choice and were right from the readings.  he made this class pretty interesting for a general sociology course, and i feel like i really learned a lot from this class.  good choice - pick him!",
        "course": "SOC101"
      },
      {
        "index": 65,
        "rating": 2,
        "difficulty": 2,
        "comment": "This class is a lot of outside work/reading for a GEC, but the grading is very fair. Class is very boring, but it's only twice a week, so it's not too difficult to suffer through the lectures. Very liberally-biased class, every piece you read will rag on Bush and the conservative party, so be ready for that.",
        "course": "SOCH367"
      },
      {
        "index": 66,
        "rating": 4,
        "difficulty": 4,
        "comment": "Not the most interesting lecture style, but the books were pretty good...at least what I read of them. Didn't finish a single book and got generally A's on the paper. Very cynical class.",
        "course": "SOCIO367H"
      },
      {
        "index": 67,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very easy class.  I did not read a single thing for class, but I attended every class and took notes.  I received 100% on both the writing assignments by using common sense, not so hot on the midterm because I did not read, the final was all class notes.  Be active in class, pay attention and you can get an A- with minimal work.",
        "course": "SOC302"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved Dr. Chris. He didn't let any personal beliefs get in the way of his grading or the class discussion. Easy class, and the discussion was usually interesting. Dr. Chris was chill as ****.",
        "course": "SOC367H"
      },
      {
        "index": 69,
        "rating": 4,
        "difficulty": 3,
        "comment": "I very much quite enjoyed this guy.  Isn't afraid to swear in class and basically makes the whole thing a giant discussion period.  Which if you like that thing is awesome.",
        "course": "SOC367"
      },
      {
        "index": 70,
        "rating": 4,
        "difficulty": 1,
        "comment": "I found this course incredibly easy, but I can see how someone who isn't interested could struggle. I found it to be fairly straightforward. His lectures are boring, but he posts a PDF of his outlines which makes studying easy. If you aren't a good test taker (such as me) he also has Carmen assignments and two (easy) papers to boost your grade. B+",
        "course": "SOC302"
      },
      {
        "index": 71,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not always the clearest in class, but much more so if you bother to e-mail him.  Very nice and helpful, does want his students to succeed.  Just do the work and reading and there is no reason why you shouldn't get an A in the class.  Tests are from the notes and readings.",
        "course": "SOC302"
      },
      {
        "index": 72,
        "rating": 3,
        "difficulty": 2,
        "comment": "4 books/4 papers, 2 assignments, 1 final.  The books are valuable and the papers are only 3-4 pgs long.  The majority of class is discussion which is good sometimes, but half of the entire class is spent on song lyrics (no exaggeration).  Easy A, but I didn't learn very much from him.",
        "course": "SOCH367"
      },
      {
        "index": 73,
        "rating": 4,
        "difficulty": 4,
        "comment": "Recommended for 606. Must attend class and take meticulous notes. No powerpoints or notes posted- he is oldschool and lectures with occasional chalkboard use. He is enthusiastic about the subject matter. Lots of reading but you will learn so much from his class. He gets a bad rep for being old school but he is truly a good prof.",
        "course": "SOC606"
      },
      {
        "index": 74,
        "rating": 4,
        "difficulty": 4,
        "comment": "Must attend class and take meticulous notes to pass tests! (although he posted some of his notes online, too) 4 grades: 2 papers, 2 tests. Tests are m.choice, short answer and short essay. If you go to class and take notes you should be able to get an A. He is willing to help. Don't let his rough look put you off, he is an awesome professor.",
        "course": "SOC302"
      },
      {
        "index": 75,
        "rating": 5,
        "difficulty": 4,
        "comment": "Interesting professor with alot to say. He knew the material and was glad to offer assistance when needed. The lectures were sometimes a little slow, but they were never boring. Take notes, show up to class and you will get an A.",
        "course": "SOC302"
      },
      {
        "index": 76,
        "rating": 4,
        "difficulty": 3,
        "comment": "Papaleonardos was an interesting character. At first glance you would not expect him to be a university professor. However, he is a very laid back guy with a rather dull teaching style. I learned alot more law than sociology in this class which can be good or bad depending on your interests. Papers were easy, tests were mediocre.",
        "course": "SOC309"
      },
      {
        "index": 77,
        "rating": 4,
        "difficulty": 3,
        "comment": "He grades papers as an A or A-, based on &quot;flow.&quot;  The class is kind of abrasive, so don't take H367.01 unless you want to debate, because participation is 10% of your grade.  The exam is based off the notes that you will take sporadically through the quarter, so don't blow them off if they seem kind of random.",
        "course": "SOCIOH367"
      },
      {
        "index": 78,
        "rating": 5,
        "difficulty": 2,
        "comment": "class got a little boring at times but his stories made it interesting",
        "course": "SOC507"
      },
      {
        "index": 79,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great intro class. Exams followed lectures to a T. Averages for exams were near 100%. Lectures usually interesting, with Chris' own real life examples peppered in to reinforce ideas. Would take him again in a higher level soc course, no question.",
        "course": "SOCH101"
      },
      {
        "index": 80,
        "rating": 3,
        "difficulty": 3,
        "comment": "Go to class. Tests come straight from Lecture notes.  Nice professor, I would advise bringing a laptop or going over notes directly after class to organize.  Can be boring at times, but he will help with you with anything you need clarified.",
        "course": "SOC309"
      },
      {
        "index": 81,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very good professor! Come to class most of the time, study the review and youll get an A. 5 grades in class- 3 short papers, midterm, and final. If you follow his guidelines, he wants you to do well!",
        "course": "SOCIOH101"
      },
      {
        "index": 82,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class looked really easy at first, but ended up being a lot of reading. Still pretty easy if you study. Very understanding when things go wrong. He sometimes skips around within his topic which can make for some difficult note-taking. Overall, though, very informative.",
        "course": "SOC309"
      },
      {
        "index": 83,
        "rating": 3,
        "difficulty": 2,
        "comment": "A friend and I who took this class together still laugh about how ridiculously the course was put together.  The lectures were often nonsequential and the contrived nature of this course was always apparent.  He seems like a nice guy, but this class was a joke.",
        "course": "SOC309"
      },
      {
        "index": 84,
        "rating": 3,
        "difficulty": 2,
        "comment": "I went into this class very excited about the topic and came out of it a little apathetic towards &quot;Law in Society&quot;.  He is never enthusiastic and his notes do not really tie themselves together very well.  Plus, he sweats a lot.",
        "course": "SOC309"
      },
      {
        "index": 85,
        "rating": 4,
        "difficulty": 2,
        "comment": "easlily one of my favorite classes ive taken, though im not sure if it is still being offered.  he is a very smart man with lots of information to share.  lectures can be long with multiple pages of notes.  the tests werent too bad. reasonable amount of work in total.",
        "course": "SOC302"
      },
      {
        "index": 86,
        "rating": 1,
        "difficulty": 5,
        "comment": "THIS GUY SPEAKS IN DEFINITIONS,AND HIS LECTURES ARE BORING, WE HAD A 3-4 PAGE PAPER DUE THE SAME DAY AS AN EXAM!! HE TOLD US THE AVERAGE GRADE IN HIS CLASS WAS A 69% AND HE'S BEEN TEACHING THE CLASS FOR YEARS. I THINK THAT MEANS HE NEEDS TO MAKE SOME CHANGES. DO YOURSELF A FAVOR, DON'T TAKE A CLASS WITH THIS GUY.",
        "course": "SOC487"
      },
      {
        "index": 87,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nice guy, easy class. if you can write 3 short book reviews, you're good to go. he's a little biased, but that doesn't usually effect what goes on during class, so that's no big deal. good 597 class to take if you need it",
        "course": "SOCIOLOGY597"
      },
      {
        "index": 88,
        "rating": 5,
        "difficulty": 1,
        "comment": "WOW so you want the A in a 597.XX class&#63;  TAKE CHRIS.  Quizzes are mainly over recent events in the world, which you talk about everyday in class.  One exam/quiz 22 ppl got A's.  He is def a smart man and you will learn a lot.",
        "course": "SOC59701"
      },
      {
        "index": 89,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "SOCIOLOGY202"
      },
      {
        "index": 90,
        "rating": 3,
        "difficulty": 4,
        "comment": "He's a nice guy, but was all over the place in his lectures. The readings weren't all that interesting. I could not get into this class. If you really love the topic and have a background with it, then you might like this class. I liked the topic, but for some reason, could not get into the way it was taught in this class.",
        "course": "SOCIOLOGY606"
      },
      {
        "index": 91,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really enjoyed this class. My favorite of the quarter. While class was long, if you paid attention to the lectures, you only had to read some of the readings. Tests were easy and papers were relevant. He doesn't make you do busy work. I really enjoyed the class. Highly recommend the professor.",
        "course": "SOCH101"
      },
      {
        "index": 92,
        "rating": 3,
        "difficulty": 2,
        "comment": "Knowledgeable teacher..but neeeds to make lecture more interesting ...Music assignments were REALLY fun!! Overall he is a good teacher and a good guy... Tough grader on Papers at first, but hey it is a second year writing course..Final was very easy and lays everything out on the review sheet!",
        "course": "SOCH36701"
      },
      {
        "index": 93,
        "rating": 5,
        "difficulty": 4,
        "comment": "as long as you keep up with the reading, you will be fine, his lectures follow what is in the book. having to come up with your own research topic and your own surveys may seem difficult but it really helps you understand the concepts taught in class.",
        "course": "SOC487"
      },
      {
        "index": 94,
        "rating": 5,
        "difficulty": 1,
        "comment": "Extremely good professor! Take his class if possible. Pay attention and take notes and exams are very easy. My favorite professor yet.",
        "course": "H101"
      },
      {
        "index": 95,
        "rating": 1,
        "difficulty": 4,
        "comment": "Chris knows his material, however, I found his method of teaching very difficult to understand.  In order to pass, I relied more on the tutors and the writing center to pass.  I would not recommend this instructor.",
        "course": "SOC487"
      },
      {
        "index": 96,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chris is an extremely intelligent professor with a great deal of knowledge regarding sociological issues in general, but especially current events and politics. It was refreshing to take a class that taught me so much about topics that are truly important. Good class, great teacher. A+",
        "course": "59701"
      },
      {
        "index": 97,
        "rating": 5,
        "difficulty": 3,
        "comment": "Made the class interesting",
        "course": "SOCH101"
      },
      {
        "index": 98,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Go to lectures and keep up with current events. Yes, sometimes I fell asleep but it was an easy A",
        "course": "SOC59701"
      },
      {
        "index": 99,
        "rating": 3,
        "difficulty": 3,
        "comment": "wow, I hated this class. I was bored out of my mind in lecture,he doesn't know how to keep the class' attention and make it interesting, besides throwing in a curse word every now and then, but that tactic gets old after a while. The tests are kind of difficult especially the final, rec. isn't bad.",
        "course": "SOC101"
      },
      {
        "index": 100,
        "rating": 3,
        "difficulty": 2,
        "comment": "Fairly easy class.  I skipped lectures every now and then and got a B+.  His lectures are extemely boring though, and he talks about himself being Greek a lot, which is pointless.  Fairly easy subject matter.",
        "course": "SOC101"
      },
      {
        "index": 101,
        "rating": 3,
        "difficulty": 4,
        "comment": "BBBOOOORRRRIIIINNGGG!!!! He tests more on current events than the class/book.  Listen to what everyone else is saying about him.  Not the greatest prof. ever!!!!",
        "course": "59701"
      },
      {
        "index": 102,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst Prof EVER",
        "course": "SOC101"
      },
      {
        "index": 103,
        "rating": 3,
        "difficulty": 3,
        "comment": "I hated going to his class.  Everyday I thought of a reason to skip, but I forced myself to go and sit through his BORING lectures.  All he talks about is Greece and his old jobs...he made things relatively easy, but his tests were hard to study for.",
        "course": "SOC101"
      },
      {
        "index": 104,
        "rating": 1,
        "difficulty": 5,
        "comment": "The man tells stories the whole time during lectures and refers to the examples maybe once or twice on exams. I too learned more about Greece and the Columbus Auto Parts or wherever he used to work more than I learned actually sociology.",
        "course": "SOC101"
      },
      {
        "index": 105,
        "rating": 5,
        "difficulty": 2,
        "comment": "Make sure you go to class or atleast get the notes from someone because in class notes are about 30% of each midterm and final.  other than that, the class is really easy.",
        "course": "SOC101"
      },
      {
        "index": 106,
        "rating": 4,
        "difficulty": 2,
        "comment": "Most boring man alive, I think he just likes the sound of his own vioce. His lecture was total torture. I think I learned more about Greece than I did about sociology!",
        "course": "SOC101"
      },
      {
        "index": 107,
        "rating": 3,
        "difficulty": 3,
        "comment": "He's not as hard as people want to make him. The tests are common sense and you don't need to read the book to do well. People have a hard time because he doesn't do power point, I personally would rather have a teacher teach me than a computer.",
        "course": "SOC101"
      },
      {
        "index": 108,
        "rating": 1,
        "difficulty": 5,
        "comment": "I hated this man. He heard that last quarter his tests were too easy so this quarter he decided to make them impossible and when everyone failed, he refused to curve them. He's a bias ****. Everyone in my lecture hates this man.",
        "course": "SOC101"
      },
      {
        "index": 109,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had him for two sociology classes and learned a lot from him.  He keeps things interesting.  I would take him again",
        "course": "SOC59701"
      },
      {
        "index": 110,
        "rating": 5,
        "difficulty": 2,
        "comment": "Uses good examples to get the point across",
        "course": "SOC101"
      },
      {
        "index": 111,
        "rating": 5,
        "difficulty": 3,
        "comment": "This course is dry and boring...all stats!  However, he does a TON of example problems in class which makes it very easy to follow along and get the hang of things, especially when it comes to the harder stuff.  I'd take a class from him again.",
        "course": "SOC549"
      },
      {
        "index": 112,
        "rating": 3,
        "difficulty": 1,
        "comment": "Good teacher, but the course material sucked. Easy A for very little work.",
        "course": "SOCH100"
      },
      {
        "index": 113,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "SOC209"
      },
      {
        "index": 114,
        "rating": 2,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "SOC487"
      },
      {
        "index": 115,
        "rating": 5,
        "difficulty": 2,
        "comment": "he's great, you'll learn a lot",
        "course": "597"
      },
      {
        "index": 116,
        "rating": 5,
        "difficulty": 3,
        "comment": "good lecturer but better at pol. sci than soc",
        "course": "SOC597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.4,
    "department": "Social Science",
    "firstName": "Sharon",
    "id": "VGVhY2hlci01MTMyMw==",
    "lastName": "Houseknecht",
    "legacyId": 51323,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is tremendously kind-- you won't believe the nice feedback she'll carefully write on all of your papers. She isn't very interesting while lecturing, but that's my only complaint. She was very helpful and picked really engaging documentaries for us to watch in class. I would definitely recommend this class.",
        "course": "INTSTDS5801"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "not recommended",
        "course": "IS615"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Would not recommend this course.",
        "course": "INS615"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 1,
        "comment": "One of the most painful classes I've ever sat through. So easy it requires no thought process, professor is the dullest lecturer I've ever had and treats students like an elementary class. She's nice though, and an easy A if you can survive without dying of boredom.",
        "course": "SOCH101"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "A ditz, but knew her material well, very nice and friendly, format things the way she wants and participate in discussion and you'll be good",
        "course": "IS501"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lots of reading, with comment papers, but this was in place of a midterm so it was worth it.  She really works at getting students to understand the issues involved.  A major term paper but again, in place of a final.",
        "course": "INTSTD501"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dry, much more boring than a sociology of religion class should be. (Sadly, OSU is not much for religious soc.) She taught the theory pretty well, though, and she questioned/clarified student presenters who didn't make a lot of sense... The grading was fair and straightforward, which is a plus.",
        "course": "SOC467"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "very very boring",
        "course": "SOC487"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "SOC487"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "SOC487"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "487"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.5,
    "department": "Social Science",
    "firstName": "Theresa",
    "id": "VGVhY2hlci0yNjA0NzY=",
    "lastName": "Early",
    "legacyId": 260476,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had Dr. Early in 2009 for the same 695.08 International SW class and enjoyed the class very much. I have her this semester also and disagree w/ the last rating. She DOES care about the students and courses she teaches quite a bit and has even agreed to meet w/ me after class. The last rater was probably the one with the problem, not Theresa.",
        "course": "SW695"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "The International Social Work class was horrible, horrible, horrible- and I'm interested in International Social Work! It seems that professor Early is either fed up with her job, with life, or is a generally poor instructor. Avoid this class unless you have to take it for a study abroad trip. Had I not studied abroad, I would have dropped it asap.",
        "course": "SW695"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4,
    "department": "Social Science",
    "firstName": "Randy",
    "id": "VGVhY2hlci01MzY5Mw==",
    "lastName": "Hodson",
    "legacyId": 53693,
    "numRatings": 40,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "DO NOT TAKE him, if possible. Im used to straight A's.. The avg for our 1st test was a LOW C. He gives NO REVIEWS, tests on an insane amnt of material- most is stuff you dont learn/ he randomly has mentioned in class. He says study the key terms and read the book- the tests don't hardly cover them. I asked for a review and he straight up said \"No.\"",
        "course": "SOC3464"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "His coursepacket is disorganized, notes are not set in a linear fashion which makes it tedious to keep up in class. His anecdotes will be on exams, so pay attention because it is really easy to lose focus during his rambling lectures. Writing exercises are done in groups, which no one likes participating in.",
        "course": "SOC3464"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class was pretty boring, it was in huge lecture hall with 475 students and he just stood up on stage and went over slides. 3 exams, and a critical book review(TURN IN EARLY FOR EXTRA CREDIT!), and periodic small writings. Make sure you know someone in the class so they can write your name on the writing assignment if your not there.",
        "course": "SOCIOL1101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Lectures are boring, especially at 8 am. Attendance not required per se, but the videos he shows are on the exams and there are in-class writing assignments. Many of the exam questions are from the textbook, so be sure to have it. Dr. Hodson is a good professor, but 8 am is too early to listen to him. The class is tedious but not difficult.",
        "course": "SOC1101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Lectures can be boring but it is important to go because videos are on the test and you do in class writing exercises.  Dr. Hodson is a nice family guy and loves what he teaches but he can drag topics out. Test are 50% lecture, 50% book. The class isn't that bad if you put the work into it",
        "course": "SOC1100"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr.Hodson  is so damn boring. He literally takes too much time talking about stuff that isn't even on the exams. Such a boring class!",
        "course": "SOC1100"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Hodson is not a good professor. The exams have information that was never discussed in class. He goes on and on about nothing. You also watch pointless videos that will be on the exams.",
        "course": "SOCI1101"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "lectures can be very boring, but he frequently shows videos to spice things up. VERY IMPORTANT to attend lectures because there are numerous questions about videos on the exams. also, you have to do short writing assignments just as an attendance check. LOTS OF EXTRA CREDIT. take advantage of turning in the critical book review early!",
        "course": "SOCIOL1101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "Boring lectures, but Professor Hodson was a really nice teacher. Read the textbook to be able to answer trick questions on the exams/midterms.",
        "course": "SOC1101"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures are very boring but most of his exam questions come from lecture. The exam questions are pretty specific and a lot of the questions were from video clips he showed in class. Buy the lecture slides at SBX, very helpful and saves time taking the notes in class.",
        "course": "SOCIO1101"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "Nice man, lectures are boring, but attendance isn't mandatory. Requires you to have a notebook with the powerpoint slides. Watch lots of video clips in class that are on the test. Required to read chapters from the book for the test but don't actually have to. Studying for finals can be difficult because there is so much reading and information.",
        "course": "SOC1101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "The class is really boring, but taking notes is easy because he has them all in a UniPrint book so you just fill in blanks.  Dr. Hodson likes what he teaches, but he can go off on tangents that get wordy and cause drowsiness.  Two observational projects and three exams (one is the final).  If you like soc I recommend him.",
        "course": "SOC101"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Class is pretty easy just boring! Recommended instructor though",
        "course": "SOC101"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good professor. Really just a nice guy, and keeps things interesting. You get to watch interesting videos in class that serve as attendance when he asks simple questions on the test. Take his class.",
        "course": "SOC101"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very good professor!! He loves teaching and makes lecture interesting and fun. Go to class because he does a better job of explaining the material in person than his online notes do. Easy course if you put in the time and interest. 3 tests and 2 papers. Not bad at all.",
        "course": "SOC101"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loves to teach! Lectures are mandatory because of in-class writings. 2 papers and two midterms. The final was NOT cumulative. I actually ended up doing better on the final (which he said was harder than the 2nd exam) without studying. Discussions in recitation depend on TA. I'm not much of a talker and it didn't cost my grade. Overall easy class.",
        "course": "SOC101"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "Started putting fill-in-the-blank slides up after the first midterm that were very helpful. Likes to talk about his kids a lot. Learned a lot from him and loved this class! Multiple choice exams and non-cumulative which was great. Totally recommend.",
        "course": "SOC101"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Cool guy, loves teaching, helpful, and flexible with assignment due dates",
        "course": "SOC101"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 4,
        "comment": "Overall, bad professor. Makes up ridiculous statements with no data or evidence to support his claims. His democratic views and opinions are tried to be presented as facts. But, the class isn't hard. Nothing wrong with Dem.  views, just not the ways in which he presents them as facts and usually don't have to do with sociology.)",
        "course": "SOC101"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a very good professor. His lectures are good, good notes. He puts questions from the text on tests. Pretty easy if you try a little.",
        "course": "SOC101"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very good professor, his notes are very clear, but he goes kinda fast.  He is very sneaky about putting questions from the text book in the midterms.  Papers are easy",
        "course": "SOC101"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved him!  He has very clear and understandable notes.  Lecture is mandatory due to note taking as well as group assignments.  I didn't study hardcore, most is just common sense things that we just don't think about.  Read the novels assigned, if any.  He always dressed professionally and was very nice looking and enjoyed what he was teaching :D",
        "course": "SOC101"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "He seemed like a very nice guy.  This class was not hard, but it required a lot of work.  The book is important, especially the key terms.",
        "course": "SOC101"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Hodson loves his job.  he knows his information and is very easy to understand.  The midterms come directly from the notes and the book, and the final is mainly from the book.  Anne McDaniel is the best TA to have in his class.  I wish i could take this class with him again.  TAKE SOCIOLOGY WITH HODSON!",
        "course": "SOCIO101"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Hodson is obviously interested in what he teaches.  Although the class is not demanding, attendance is mandatory (in-class activities in videos).  You can essentially study the night before tests and get A's, and the two projects are pretty straightforward.",
        "course": "SOC101"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class! Only a few amount of notes in class and then the movies were quite interesting. Projects were fairly simple. Attend each lecture and watch the movies cuz they are about 1/3 of the exam. Very friendly guy and I always love his stories.",
        "course": "SOC101"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome Professor! wish i could have Randy Hodson as a professor again...the course was very interesting...and surprisingly lectues were fun...movies almost every time and Mr. Hodson made the class seem so small and helped make it easy because he was so personal with everyone! GReat class and AWESOME Professor!",
        "course": "SOC101"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "Alot of work invovled but the class wasn't that bad. Ok midterms but get Derek Bryan as your TA because hes probably the best TA i've ever had at OSU. Got an A- in the class.",
        "course": "SOCIOLOGY101"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 3,
        "comment": "great guy. His lectures are not boring and the assignments are easy and fun.I got an A i this class( not an A student)simply because i read the book before tests and completed two major assignments...on projects he is an easy grader ...tests are straight from book and lectures. Take this class.",
        "course": "464"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was really easy.  The book was so easy to follow and the question on the test were straight out of it.  Easiest GEC I've taken.  Yes, lectures aren't always that exciting but any class has days like that.  Plus not all of the material is equally as exciting.  Ended up with an A :)",
        "course": "SOC101"
      },
      {
        "index": 31,
        "rating": 2,
        "difficulty": 4,
        "comment": "you do not wanna take Soc 101 with this guy if you want an easy A.. He will definitely make you work WAY more than the other profs- It is so stupid how he treats you like a little kid in lecture and then expects you to do a ridiculous amount of work outside of class!",
        "course": "SOC101"
      },
      {
        "index": 32,
        "rating": 2,
        "difficulty": 2,
        "comment": "He's a good teacher, and willing to talk to you and help out with assignments. Can not attend classes, and still do well of the exams. His notes that he gives in class, don't help a lot of the exam, better to just read the book.",
        "course": "SOC101"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great teacher, keeps me interested, love the movies we watch, very fair, i just wish he'd let us go a little early sometimes when its obvious the whole class is pretty tired. great guy overall.",
        "course": "SOC101"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 2,
        "comment": "awesome teacher!!",
        "course": "SOC101"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "awesome teacher",
        "course": "SOC101"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good at making material interesting and easy to learn.  I really appreciate the way he structures his midterms; they are very easy.  With a little studying, an &quot;A&quot; is possible in this class w/o even attending.  And he has no attendance rule. :)",
        "course": "SOC101"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy tests, and lectures weren't too bad either.  Good prof!",
        "course": "SOC101"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class.",
        "course": "SOC101"
      },
      {
        "index": 39,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "SOC100"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 3,
        "comment": "boring lectures, bad observation assignments",
        "course": "SOC101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 2.8,
    "department": "Social Science",
    "firstName": "Tim",
    "id": "VGVhY2hlci02NzExMA==",
    "lastName": "Curry",
    "legacyId": 67110,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Incredibly dull, but hard to skip as assignments are due in class. Easy A, though. Try to find a different professor if you cam, or you know what, just take a different social science GE.",
        "course": "SOC1101H"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "(1) Class attendance is mandatory, and he gets ticked off with people walking in late. (2) Exams are not too hard, and he is very open minded about the one term paper he gives (3) He is a very boring lecturer, but he has alot good information underneath the tangents / rambling. Attending his office hours are 100% more helpful than lecture",
        "course": "SOC1101H"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Extremely  boring, but lecture is mandatory as homework assignments are due every class. He wrote the book and can be very self absorbed.  Ace the tests because he will randomly take off points on any writing.  He is very unclear about what he wants.  Genuinely nice man however.",
        "course": "SOC1101H"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Undoubtedly the worst instructor I have encountered in my academic career. Very unclear about instructions and methods of grading. Parrots the lectures off of books that he wrote. Class overall incredibly boring, but attendance is mandatory.",
        "course": "SOC1101H"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "I really liked Dr. Curry!  The lectures were unbearably boring, but he is a genuinely nice guy.  He really likes what he does and is always ready to help with any questions you might have.  I encourage you to go to his office hours, it's very helpful, and kind of fun to talk with him!",
        "course": "HSOC1101"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 2,
        "comment": "He is bad at teaching but he gives out easy A's. Hated his overplaying of Johnny Cash music. Pretty boring guy.",
        "course": "SOC101H"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 3,
        "comment": "I usually give professors the benefit of the doubt but Prof Curry is one of the worst I have had. He is incredible self absorbed and class time is useless. I would urge anyone to take Soc 101H with another professor.",
        "course": "SOC101H"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 1,
        "comment": "This class is extremely boring. He talks about Johnny Cash or himself nearly the entire time. His lectures are completely boring and useless but attendance is mandatory because you have a homework assignment due in every class.",
        "course": "SOC101H"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Did not like Prof Curry. His lectures were completely off topic and useless to attend, however they were mandatory because there was an assignment due in each one. His tests were easy as long as you reviewed the book and a lot of the questions came directly from the online quizzes. But I would avoid if you didn't want to be bored out of your mind",
        "course": "SOCH101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent class/teacher. Make sure that you read the book/do the assignments-exams are the same questions as questions online or in the book. He really does love johnny cash! Although the lectures were off-topic a lot of the time, it's obvious that he really knows what he's talking about and wants you to like it as much as he does.",
        "course": "SOC101"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved prof curry! He is really a great guy and is dedicated to helping us learn. He really cares about the subject and enjoys teaching. He is a very genuine guy.",
        "course": "SOCIOH101"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 1,
        "comment": "This guy really loves Johnny Cash.  Seriously.  The class was pretty easy and since he wrote the textbook he uses for it, you don't actually need to go to class.  I didn't learn anything from him, but I did well in his class because I read over the review stuff at the end of each of the chapters and did the practice quizzes and stuff.",
        "course": "SOCIOH101"
      },
      {
        "index": 13,
        "rating": 3,
        "difficulty": 3,
        "comment": "I thought I didn't learn anything from him, and then I took another socio class and realized how much he really got through.  He makes an extra effort to make honors classes worth it (he booked a private screening at a theater for us, and provided lunch afterwards)- I liked him.",
        "course": "H101"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 1,
        "comment": "ya so going to the class was hard because it was so early and long... but he was a nice guy if you just talked to him.. and he knew his stuff.. but he did not communicate that all the time so you though different.. but was very willing to help if you wanted ... good guy :)",
        "course": "SOCH101"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 3,
        "comment": "He doesn't lecture at all, so going to his class is pointless...only to turn in the assignments and watch film on film day.  At times he appeared to talk about anything just to take up class time.  You have two exams and 9 short assignments that are all equal in points. If your a reader than take him otherwise I would think twice!",
        "course": "SOC655"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "Read the Book and Go to class. First exam was mostly composed of lectures material but then everything else was book and the book was like a bible. Don't take this if you mind reading cause thats what you'll be doing for the exams.",
        "course": "SOC655"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 2,
        "comment": "This guys defines D-Bag.....Doesn't talk about much relavent stuff to the class.  Just have to read the book and study the questions at the end of each chapter and the ones online to do well.  total D-bag and i can't stand johnny cash anymore cuz of him...because that is ALL he talked about",
        "course": "H101"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 1,
        "comment": "Nice guy. About as scientific as Jerry Springer. I had a hard time taking him seriously.",
        "course": "SOCH345"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was definately VERY boring. I don't think I learned very much, but it's an easy A. If you don't like Bob Dylan, don't take this class. He LOVES Bob Dylan and plays him constantly!",
        "course": "SOCH101"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class was boring...but an easy A&quot; or B&quot; if you make sure to read the book.",
        "course": "SOCOFSPORT"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "He wrote the book used for this class, so all you have to do to get an A is read the book! 2 exams but he hands out study guides; and a cumulative final--but he uses the same question from the previous 2. Read and do the multiple choice ques at the end if the chapter b/c he uses them in exams too!",
        "course": "H101"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "this class was pointless",
        "course": "H345"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.3,
    "department": "Social Science",
    "firstName": "Donna",
    "id": "VGVhY2hlci0xMjQ1MjY=",
    "lastName": "Crossman",
    "legacyId": 124526,
    "numRatings": 46,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "this class was super hard for a 101 class. lectures were just her rambling on about pointless things, and her test were extremely hard. you have to read the 20+ page chapters and so many article. theres no lecture notes or study guide. would not recommend if trying to take a east class.",
        "course": "SOC101"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Took as a gec. Tests only over book going to class was pointless vuz she never taught. Just rambles the whole class about random topics and opinions. Hated it. But tests weren't too bad if u read the book.",
        "course": "SOC101"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "I had the absolute worst experience with this class. We had to read 2-3 20+ page articles for each class and she would pick the smallest details for her tests (the whole class talked about forming a mutual complaint). I have taken several 400+ level soc classes and got straight As and she got me the only B my whole year.She also tended to yell.",
        "course": "SOC101"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "I loved this professor, class is tough... you MUST read.  The book is so easy to read and explains stuff so well.  This class sucks but its required so take it with her!! She is hilarious and class is not boring at all",
        "course": "SOC488"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "This is the BEST professor that I have had so far! The textbook she uses is A-Mazing. Reading is a must though but, if you miss a few classes it won't hurt your grade. Three tests, and six in class writing activities. Take this professor! You will not regret it.",
        "course": "SOC488"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lectures became less and less useful throughout the quarter, and she grades pretty tough, but the tests are all fair, and it's ok to keep up with as long as you do the work.  She's a good teacher, but not an easy one.",
        "course": "SOC345"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "Great Professor! Cares about her students! 488 was hard, and you really have to read to do well. A lot of the tests were terms though, and the book is AMAZING and EASY to read! Class discussions very real-world orientated. Great professor, you'll learn something!",
        "course": "SOC488"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome class! She is a great prof! Just make sure you do the readings that are assigned, most of classes are discussions about stuff totally off topic!",
        "course": "SOC345"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "When I first walked into class I thought, great an awful mandatory Soc theory class with a boring old lady. But I was very wrong. She is really into the issues and has an open discussion of a class. Fire and brimstone I'd say, talking about the crap of the world we endure and create. Important issues discussed in a engaging fun way. Not for lamers",
        "course": "SOC597"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Crossman babbled on and on during her class.  As a result it was very hard to pay attention in class.  The majority of the discussions in class were way off topic and I honestly did not learn anything from this class.  The textbook was very readable.",
        "course": "SOC488"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very nice woman, and helpful if you need her. Very liberal, and very opinionated. Sometimes this causes her to lose focus on the topic, making you wonder whether your ready for test. Tests are multiple choice, matching, but the class has a lot of reading. If you go to class and she doesn't get of subject you do not have to read.",
        "course": "SOC597"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "Interesting and the work is not overwhelming. She has in-class group essays throughout the quarter instead of a paper. Exams are somewhat difficult and are based heavily on the reading. Overall she is a good professor and keeps things interesting.",
        "course": "SOC345"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not bad. Expects little, especially from her honors classes. Only a few in class papers, never took off points for content. Funny at times.",
        "course": "SOCH101"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "Great prof. If you read the material assigned then you will be fine for mid terms and final. Most classes are discussion based. One of my favorites!!",
        "course": "SOC345"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 3,
        "comment": "A Crossman course is truly a treat. Here's the breakdown, she spends the whole class talking about random issues in the world that, for the most part, have nothing to do with what you need to know to pass. Study the books INSIDE AND OUT. Know every detail because that's what the midterms/final are on. She's political so be prepared to come with it!",
        "course": "SOC597"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very interested in teaching. Very fair with her grading and takes responsibility for teaching assigned material. If material isn't covered in class she doesn't expect you to learn it by yourself.",
        "course": "SOC101"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 3,
        "comment": "great prof!  uses text a lot, so buy it.  gets very deep into discussion, so contribute and be an active listener...she will remember you! attendance is not mandatory, but it is good to know any extra material that may be covered.  overall, great course.",
        "course": "SOC488"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "Her teaching style consists of just clarifying what's in the book rather than actually teach the material. Meaning if you don't keep up with the reading, you have almost no chance of passing. Just read the books and passing the tests will be (almost) a piece of cake.",
        "course": "SOC488"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 4,
        "comment": "Very opinionated, and can be overwhelming at times. However, not that bad of a prof. You get to spend a lot of class time just discussing/sharing stories.  Grades papers mostly for grammatical mistakes, I never saw her take off points for content. Do the readings, pay attention in class, and you should be okay. Also lets you argue answers on tests.",
        "course": "SOCH101"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite profs yet! class is discussion based, so interesting. make sure to read book carefully, almost all of the test questions come from text. if you pay attention and do the reading, you will do well.",
        "course": "SOCH345"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "LOVE HER!! definatly opinionated, but keeps it interesting. tells you what you need to know. read the text and you will do fine.",
        "course": "SOCH367"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "Hillarious.",
        "course": "SOCH345"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "59701"
      },
      {
        "index": 24,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "SOC59701"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 3,
        "comment": "ummm...she's VERy opinionated.....i don't much like her, but the class is pretty easy, even though her tests are all multiple choise and t/f and matching,she is a bit tricky with her wording make sure you read the book... and her opinions are CRAP!!!",
        "course": "59701"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "I LOVE Dr. Corssman.  She is very entertaining in class and she is straightforward as to what you need to know and do to get a good grade.  She has opinions and she will tell you, so if you are easily offended you might not like her.",
        "course": "SOCIO435"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 3,
        "comment": "I thought she was a great teacher.  Wasn't very hard to get an A in her class--just show up and turn in assignment, and READ THE BOOK!  She definitely does favor people, but she was inviting to the entire class for comments and conversation.  I recommend it!",
        "course": "SOCH101"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Overall good prof but opinionated. Takes off for small mistakes on papers. Shows some favoritism towards students who have had her b4.Class itself is very interesting&discussion based. Short 1page papers are pretty easy and exams are really fair. Read the book. Besides that, show up&voice your opinion but be prepared to be shut down. Got an A.",
        "course": "SOCH36703"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved her class!  Yeah, she's opinionated, but she's also really funny and straight-forward.  I found the class interesting and easy.  If you work hard and participate, you'll do great in her class.",
        "course": "SOCH36703"
      },
      {
        "index": 30,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this teacher. She's crazy, very unhelpful,demanding and doesn's make anythng clear. She expects a certain portion of her class to fail and she makes no bones about that fact. just ask her.",
        "course": "SOC488"
      },
      {
        "index": 31,
        "rating": 3,
        "difficulty": 3,
        "comment": "kind of mean. very unwilling to help students after class, would always direct them to the TA. was not willing to hear or deal with complaints about the TA either. would probably be okay in a small class. you must read in her class, many test questions from the book!",
        "course": "SOC430"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "I love Dr.Crossman,she does have strong opinions but she is open to hearing yours as well...shes hilarious and her class is never boring! Shes a great woman and she isnt nitpicky on papers if you know how to write.",
        "course": "SOC43059701"
      },
      {
        "index": 33,
        "rating": 3,
        "difficulty": 3,
        "comment": "Class is fairly easy if you read the book and take very specific notes. Her exams are very easy at parts and tricky at others. I got an A but try to select a TA because it is more work than the other sections. She is quite funny at times and the group project is easy.",
        "course": "SOC59701"
      },
      {
        "index": 34,
        "rating": 3,
        "difficulty": 3,
        "comment": "Not a big fan of Crossman. She can't teach without including her biases, and she's not very open to outside opinion. Paper grading is very nitpicky.. will take of significant points for length issues, and seems to care less about content. Teaches like she is THE authority.",
        "course": "SOC430"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class was definitely challenging. She's such a nice woman who is extrememly knowledgable...class is all discussion based.  Papers are easy to write as long as you keep up with the class topics.  Tests are challenging. She's very liberal and makes everyone aware of it.  But, still she's a great prof!",
        "course": "SOC487"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a great professor and she's hilarious.  I enjoyed her class.  It's easy if you read the material and follow directions on her papers.",
        "course": "SOC430"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "SOC430"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "my favorite teacher here at OSU. she's a tough cookie, but the format of her exams are very easy, and she's hilarious. very good teacher",
        "course": "SOC488430"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 3,
        "comment": "She challenges her students, but is not impossible. If you work hard you will get a good grade.",
        "course": "SOC488"
      },
      {
        "index": 40,
        "rating": 2,
        "difficulty": 3,
        "comment": "She's old and teaching about love and relationships. She acts as though her opinions are the only opinions. Though she is married for over 40 years, dating is a little different now compared to WWII, when she was dating... careful she's kinda mean...",
        "course": "430"
      },
      {
        "index": 41,
        "rating": 3,
        "difficulty": 2,
        "comment": "not a hard course, but I couldn't stand her--all she did was voice her political opinions while telling us to open our minds--to what&#63; her opinions&#63;!&#63;!&#63;!&#63;!",
        "course": "SOC59701"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really enjoyed this course. Read the material, and study. The final covered the previous test material. :)",
        "course": "SOC430"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 4,
        "comment": "you won't fall asleep in this class, but make sure you read all the material or you won't pass the tests",
        "course": "SOC430"
      },
      {
        "index": 44,
        "rating": 2,
        "difficulty": 4,
        "comment": "i second the notion that her exams are extremely hard but she is a very nice lady",
        "course": "SOC59701"
      },
      {
        "index": 45,
        "rating": 1,
        "difficulty": 4,
        "comment": "very hard, unclear about midterms",
        "course": "SOC430"
      },
      {
        "index": 46,
        "rating": 1,
        "difficulty": 4,
        "comment": "ridiculously hard for a GEC, uses only text for exams",
        "course": "SOC59701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 1.8,
    "department": "Social Science",
    "firstName": "Ignatius",
    "id": "VGVhY2hlci0xODI2NDE=",
    "lastName": "Ahiaveh",
    "legacyId": 182641,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Ignatius Ahiaveh is just wonderful",
        "course": "SPANISPAN"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "SOCIALSCIENCE"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "AFAM251"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "AFAM"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 3,
        "comment": "Hard to follow.  He can't seem to keep the attention of the class and doesn't get much respect from students.  Doesn't make deadlines firm, but then forgets.  Not great.",
        "course": "AAA251"
      }
    ],
    "SEI": []
  }
]