[
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Clara",
    "id": "VGVhY2hlci0yMzA0MDEx",
    "lastName": "Fachini Zanirato",
    "legacyId": 2304011,
    "numRatings": 1,
    "summary_comment": "Professor Fachini Zanirato is highly regarded for her dedication to her students and her approach to teaching Portuguese. She ensures her classes are engaging and relevant, using diverse materials to maintain student interest. Her easy grading and understanding nature make her a supportive instructor, though regular attendance is crucial for skill improvement due to her focus on conversational practice.",
    "summary_comment_short": "Professor Fachini Zanirato is highly regarded for her dedication to her students and her approach to teaching Portuguese, making the class engaging and relevant with diverse materials. Her easy-going grading policy and understanding nature contribute to a positive learning environment, though regular attendance is crucial as her teaching heavily emphasizes conversation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor who really cares about her students and teaching Portuguese. She makes the class relevant to the real world and uses all sorts of teaching materials to keep students involved. She is an easy grader and very understanding of her students and their lives. Your skills will improve if you come to class as her teaching is conversation-heavy.",
        "course": "PORTGSE1102"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Nikolas",
    "id": "VGVhY2hlci0yOTE4MDYx",
    "lastName": "King",
    "legacyId": 2918061,
    "numRatings": 5,
    "summary_comment": "Professor King is highly regarded for his exceptional teaching quality, evident in his engaging lectures, clear expectations, and genuine care for his students' well-being and education. Students consistently praise his ability to make complex content accessible and his supportive, positive classroom atmosphere. His dedication and kindness have earned him the title of \"GOAT\" (Greatest Of All Time) among his students.",
    "summary_comment_short": "Professor King is highly regarded for his exceptional teaching quality, engaging lectures, and genuine care for his students' well-being and education. Students consistently praise his ability to make complex content accessible and his positive impact on the classroom atmosphere.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "3403: Nikolas is the GOAT! He is a great lecturer and you can tell he truly cares about his students. I always look forward to his class and by far have learned the most from his teaching out of all my Spanish professors at this school. There are a few papers we had to do but they were not bad at all. If you see his name on schedule planner, DO IT!",
        "course": "3450"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've taken two classes with Nik, the second by choice, and I would take all the rest of mine with him if I could. He cares about your wellbeing AND your education. He comes to class prepared, prompts engaging discussions, and his expectations are clear. 10/10 would recommend.",
        "course": "3450"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nik is actually just the best ever! Makes content accessible and is so kind and caring towards his students. Genuinely cares about you as a person and a student. Makes the class mood so positive and enjoyable. He also never judges you and constantly makes the class laugh. Like someone above said, just the absolute GOAT. Overall amazing instructor! ",
        "course": "3450"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolute GOAT.",
        "course": "23999"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was very helpful when grading papers and didn't grade too hard - he was also very nice and would almost immediately respond to emails. I liked him a lot !",
        "course": "23999"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Tara",
    "id": "VGVhY2hlci0zMDA2NTA2",
    "lastName": "Hazel",
    "legacyId": 3006506,
    "numRatings": 2,
    "summary_comment": "Professor Hazel is highly regarded for her effective teaching methods and supportive approach. Students appreciate her understanding nature and willingness to assist, leading to fair and manageable grading. Her focus on learning over rote memorization ensures that students can achieve good grades with effort and dedication.",
    "summary_comment_short": "Professor Hazel is highly regarded for her effective teaching methods and supportive approach, ensuring that students who invest time in the class can achieve good grades with relatively easy grading. She demonstrates a strong commitment to her students' learning, providing ample opportunities for understanding and improvement through accessible help and manageable daily homework.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was really great, her grading was easy and as long as you invested time into the class and wanted to learn you got good grades! She was understanding if you didn't really grasp the concepts and always was willing to help you. I had such a great experience!",
        "course": "Spanish1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Is a great professor who really cares for her students. There is daily homework but they help you to learn some Spanish and don't take much time. The grading is pretty easy and if you try it is very easy to attain an A.",
        "course": "Spanish1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Natàlia",
    "id": "VGVhY2hlci0yODUzMzM4",
    "lastName": "Server Benetó",
    "legacyId": 2853338,
    "numRatings": 2,
    "summary_comment": "Professor Server Benetó is highly regarded for her exceptional teaching quality, effectively explaining complex concepts and providing valuable new perspectives in Spanish classes. Students find her workload balanced and enjoyable, often wishing she taught all their Spanish courses.",
    "summary_comment_short": "Professor Server Benetó is highly regarded for her exceptional teaching quality, effectively explaining complex concepts and providing valuable new perspectives that enhance students' understanding of Spanish. Her approach ensures that the workload is well-balanced with the course requirements, making her classes both informative and enjoyable.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "If I could have her for every Spanish class I would. She explains things incredibly well and also opens up a lot of important new perspectives that ANYONE taking Spanish should open their eyes to. I thought the amount of work perfectly matched the requirements for the course, and I had a lot of fun taking her class. ",
        "course": "span"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "the loml. I wish I had her for every Spanish class ever. ",
        "course": "span"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "María",
    "id": "VGVhY2hlci0yODk2MDAy",
    "lastName": "Morado Vasquez",
    "legacyId": 2896002,
    "numRatings": 1,
    "summary_comment": "Professor Morado Vasquez excels in her teaching, maintaining a high level of engagement and enthusiasm that transforms a potentially daunting course into an exciting learning experience. Her dedication to her students and subject matter is evident, making her a standout instructor in the Spanish department. Students consistently praise her ability to keep the class dynamic and relevant, setting them up for academic success.",
    "summary_comment_short": "Professor Morado Vasquez excels in her teaching, maintaining a highly engaging and enthusiastic classroom environment that transforms even required courses into exciting learning experiences. Her exceptional ability to connect with students and her commitment to their success make her a standout instructor in the Spanish department.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Despite how bad the Spanish department is, Prof. Vazquez is incredible. She is funny, teaches well, and cares about her students and what she is teaching. She keeps a class of people only there because they are required to be engaged and excited to learn. She will set you up for success in a challenging class!",
        "course": "SPAN1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Lauren",
    "id": "VGVhY2hlci0yNzMyMDEy",
    "lastName": "Miranda",
    "legacyId": 2732012,
    "numRatings": 4,
    "summary_comment": "Professor Miranda is highly regarded for her engaging and supportive teaching style, making the class both enjoyable and accessible despite its challenges. She provides clear expectations and offers valuable feedback, fostering a positive learning environment. Students consistently praise her kindness, understanding, and ability to connect with them, often recommending her class enthusiastically.",
    "summary_comment_short": "Professor Miranda is highly regarded for her caring and respectful approach, making her class both engaging and supportive. Students appreciate her clear expectations, helpful feedback, and a variety of interactive learning activities, contributing to a positive and enjoyable learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lauren is great! She's a very caring, respectful, and nice professor. The class itself was a little challenging, but if you attend class, do the practices, homework's, and reach out when you need it, you'll be fine. There were 3 exams, 4 tareas that covered materials for the exam, pruebas and little assignments every week, and then a cuml. final. ",
        "course": "SPAN3404"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Gave great feedback and expectations were very clear. Class was fairly interesting and she was very nice and helpful with assignments. Weekly quizzes were online and easy. 4 tareas (few pages of questions) and field notebooks, sometimes took a bit of time. Final was a group project, which were pretty work heavy, but not too difficult",
        "course": "SPAN3401"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a very kind and understanding professor. Understood our busy lives as college students and was very easy to relate and connect with. Would 100% recommend her class\n",
        "course": "SPAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved Professor Miranda. She is very engaging with everyone in class and has a lot of different activities in class to help you learn. I always loved going to spanish class even though it was an early class. She is one of my favorite professor at OSU. 100% would take again.",
        "course": "SPAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Paloma",
    "id": "VGVhY2hlci0yNjA1ODI4",
    "lastName": "Pinillos Chavez",
    "legacyId": 2605828,
    "numRatings": 4,
    "summary_comment": "Professor Pinillos Chavez is highly regarded for her exceptional teaching quality, making complex concepts accessible and providing thorough, organized instruction with numerous manageable assignments that help students improve their grades. Students consistently praise her responsiveness, understanding, and ability to simplify difficult material, recommending her enthusiastically.",
    "summary_comment_short": "Professor Pinillos Chavez is highly regarded for her exceptional teaching skills and organizational abilities, making complex concepts accessible and ensuring her students feel supported and engaged throughout the course. Students consistently praise her responsiveness, understanding, and ability to break down difficult material into manageable components, leading to positive learning outcomes.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "great professor, would take the class again! She is very helpful and loves to teach!",
        "course": "SPAN3404"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's an awesome instructor. There's a lot of weekly modules to do (readings, quizzes, exercises, etc.) but it's so organized and manageable. There are so many tiny assignments that it's easier to bring grades up. Assignments/exams are open book. She makes complicated concepts seem super easy. Very responsive and understanding. Highly recommend!",
        "course": "SPAN3404"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Palo is an awesome teacher!",
        "course": "SPAN3401"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great Spanish teacher :)",
        "course": "SPAN3401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.6,
    "department": "Spanish & Portuguese",
    "firstName": "Giovani",
    "id": "VGVhY2hlci0yODY1ODYy",
    "lastName": "Lopez ",
    "legacyId": 2865862,
    "numRatings": 5,
    "summary_comment": "Professor Lopez is highly regarded for his excellent teaching quality, known for being incredibly knowledgeable, understanding, and caring towards his students. Students appreciate his clear explanations and supportive feedback, which significantly enhance their learning experience. His dedication to ensuring students grasp the material effectively makes him one of the standout professors in Spanish courses.",
    "summary_comment_short": "Professor Lopez is highly regarded for his excellent teaching quality, known for being incredibly knowledgeable, understanding, and caring about his students' learning. Students consistently praise his ability to explain material clearly and his dedication to ensuring students grasp the content, making him one of the standout Spanish professors at UNC.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took SPAN 203 at UNC with Dr. Lopez. He's incredibly nice, understanding, knowledgable, and gives good feedback. Very fair grader. Definitely one of the better Spanish professors I have had. Exams are not written by him but are very straightforward for 203 at UNC. ",
        "course": "SPAN1155"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "I did not mind having Giovani. The class itself is a hard class, therefore it was hard to determine if Govani was at fault or the Ohio State Spanish Department. He wanted to make sure you knew what you were doing. Sometimes he cracked down on pronunciation and participation. I would take him again if it were a different class. ",
        "course": "SPAN1155"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Lopez was one of the best professors I will probably ever have. He really cares about his students and explains things in a way that is understanding. I learned so much in this class. There is a lot of in class speaking but I kinda enjoyed that part. Very understanding and considerate professor.",
        "course": "SPAN1155"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is great. Really cares about his students. Helped me learn more Spanish than I ever did in high school. Totally recommend",
        "course": "SPAN1155"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Lopez clearly cares about his students being able to understand the material, and goes to great lengths to make sure it happens. I think I would better understand the language if I had learned from someone like him sooner. ",
        "course": "SPAN1103"
      }
    ],
    "SEI": [
      {
        "Subject": "CLLC",
        "Catalog": "5100",
        "Class Name": "Introduction to Community Interpreting",
        "Class Number": "35907",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.17"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "21423",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.87"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "25803",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.85"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "26434",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.88"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "35206",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.69"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "21250",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.87"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "21257",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.85"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "21328",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.77"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "21331",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.75"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "25673",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.88"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1155",
        "Class Name": "Intensive Spanish for Review",
        "Class Number": "29336",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1155",
        "Class Name": "Intensive Spanish for Review",
        "Class Number": "30576",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "4.86"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1155",
        "Class Name": "Intensive Spanish for Review",
        "Class Number": "35602",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.6"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1155",
        "Class Name": "Intensive Spanish for Review",
        "Class Number": "28109",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "16",
        "Rating": "4.69"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1155",
        "Class Name": "Intensive Spanish for Review",
        "Class Number": "30149",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "4.87"
      }
    ]
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.8,
    "department": "Spanish & Portuguese",
    "firstName": "Julian",
    "id": "VGVhY2hlci0yNjgwNTcz",
    "lastName": "Baldemira",
    "legacyId": 2680573,
    "numRatings": 5,
    "summary_comment": "Professor Baldemira, or Julian, is highly regarded for his engaging and cheerful teaching style, which makes learning Spanish enjoyable through humor and interactive sessions. Students appreciate his dedication and willingness to help, making him an effective instructor both in-person and online. His approach fosters a supportive learning environment that encourages active participation and question-asking.",
    "summary_comment_short": "Professor Baldemira, or Julian, is highly regarded for his engaging and cheerful teaching style, which includes humor and a supportive classroom environment. Students appreciate his dedication to ensuring their understanding and improvement, making his courses both enjoyable and effective.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took this professors Spanish 122 class at Greenriver College. He was very cheerful and brought the learning to the students through jokes and poking fun with the students. The course setup was high quality and made learning the language easy as long as you did the work.",
        "course": "SPAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Unfortunately I took this class online. I do not think many other instructors could make the course as enjoyable as Julian did. The course quickly became one of my favorites in my weekly schedule and I looked forward to Spanish. He is an instructor who truly cares and will set aside time to make sure his students are learning and improving. 10/10",
        "course": "SPAN3450"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Julian for multiple semesters of Spanish and I couldn't be more grateful! He was an awesome teacher who knew what he was doing. Julian made the classroom feel like a safe learning space where students could engage and would not be afraid to ask questions. I also experienced online classes with him and he continued to deliver great lectures.",
        "course": "SPAN1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Julien was a great TA. He really took the time to make sure the information he was trying to pass on made sense, and he worked to meet his students where they were at. Truly a gem in all honesty, but to get the most of this class and his teaching you need to be willing to engage and participate! Stay on top of homework and you will be just fine.",
        "course": "SPAN1101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Awesome guy, even though he was just a TA. Cares a lot about his students.",
        "course": "SPAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.5,
    "department": "Spanish & Portuguese",
    "firstName": "Brooklee",
    "id": "VGVhY2hlci0zMDQ5NTU5",
    "lastName": "Boots",
    "legacyId": 3049559,
    "numRatings": 2,
    "summary_comment": "Professor Boots is rated as average, with her classes described as boring despite her being considered nice. The teaching style is straightforward and minimalistic, with clear criteria but also some lack of structure, such as infrequent attendance checks and unclear assignment deadlines.",
    "summary_comment_short": "Professor Boots is rated as average, with her classes described as boring and lacking engagement despite her approachable demeanor. The course structure is clear but the material and assignments are perceived as easy, with minimal interaction such as attendance checks.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "She's nice, but the class I took was so boring, this rating isn't because she's bad, its because she's average and couldn't elevate a boring class",
        "course": "ARTSSCI110006"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Brooklee taught my ASC College Survey. She is originally an advisor from the Spanish & Portuguese department. The criteria for the class were pretty clear, and she minimally took attendance (maybe once or twice the whole semester). The lectures were easy and the assignments even easier. Be aware: the assignments do not have clear due dates.",
        "course": "ARTSSCI110006"
      }
    ],
    "SEI": [
      {
        "Subject": "ARTSSCI",
        "Catalog": "1100.06",
        "Class Name": "Arts and Sciences Survey: Arts and Humanities",
        "Class Number": "15189",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "30",
        "Rating": "4.48"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Henrique",
    "id": "VGVhY2hlci0yNTkxNjUw",
    "lastName": "Yagui Takahashi",
    "legacyId": 2591650,
    "numRatings": 1,
    "summary_comment": "Professor Yagui Takahashi is highly regarded for his comprehensive teaching approach, where office hours are particularly beneficial, offering in-depth explanations of key concepts and preparing students effectively for quizzes and exams.",
    "summary_comment_short": "Professor Yagui Takahashi is known for his comprehensive teaching approach, where office hours are highly beneficial, offering in-depth explanations and clear guidance on what is crucial for quizzes and exams. His preparation methods ensure students are well-equipped for assessments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Office hours help a lot, he explains everything in depth and what's important and what not, really prepares you for quizzes and exams ",
        "course": "2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Fernando",
    "id": "VGVhY2hlci0yNzQ0Njgw",
    "lastName": "Sanchez Lopez",
    "legacyId": 2744680,
    "numRatings": 1,
    "summary_comment": "Professor Sanchez Lopez is highly regarded for his exceptional teaching quality, effectively ensuring students are well-prepared for exams and quizzes through thorough explanations and support. He creates an engaging and interactive classroom environment that encourages active participation.",
    "summary_comment_short": "Professor Sanchez Lopez is an excellent instructor who ensures students are well-prepared for exams and quizzes, and effectively engages them in class discussions. His teaching quality is highly regarded, making complex topics accessible and interactive.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really great professor, took the time to make sure everyone was prepared for exams and quizzes. Made it easy to engage in class. ",
        "course": "SPAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Spanish & Portuguese",
    "firstName": "Justin",
    "id": "VGVhY2hlci0yNjk3ODg4",
    "lastName": "Pinta",
    "legacyId": 2697888,
    "numRatings": 1,
    "summary_comment": "Professor Pinta's course was largely self-directed, with students reading the textbook and watching videos from other instructors. The course emphasized completion-based grading for most assignments but included more rigorous evaluations like tareas and exams. Student feedback indicates that while the course structure allowed for flexible learning, it required significant self-motivation and that Professor Pinta's responsiveness to emails was slow.",
    "summary_comment_short": "Professor Pinta's teaching approach focused heavily on self-study, with students reading the textbook and watching videos from other instructors. The course was largely self-taught, with minimal interaction or response from the professor beyond grading assignments and exams.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "He didn't teach -- he had us read the textbook and go through modules with videos of other instructors. Just tab the important pages in the textbook to flip to during assignments and you'll do fine since they're graded for completion, except tareas and exams. He took several days to respond to emails so it was pretty much a self-taught course.",
        "course": "SPANISH3404"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNTQzNjE2",
    "lastName": "Kolat",
    "legacyId": 2543616,
    "numRatings": 6,
    "summary_comment": "Professor Kolat is highly regarded for his thorough preparation and dedication to student success, making even challenging topics accessible. His engaging and humorous teaching style, combined with a strong emphasis on equal treatment and deep understanding, fosters a positive learning environment. Students appreciate his meticulous planning, extra study sessions, and genuine care for their progress.",
    "summary_comment_short": "Professor Kolat is known for his meticulous preparation and high expectations, which significantly enhance students' language skills. His approachable nature and dedication to ensuring students understand challenging concepts make him a highly respected and influential professor.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "While the class was definitely difficult for someone not great at Spanish, Mark was easily accessible and spent time focusing on the hardest concepts in virtual class. He also made clear the schedule and grading of the class which was appreciated by someone who wanted to know how to plan and how to do well in the class.",
        "course": "SPAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mark is a very caring and good professor. He always made little jokes during lectures that made us laugh and kept the class interactive. Not hard at all to get an A.",
        "course": "SPANISH1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark is a caring prof and a super nice grader. He wants you to succeed and always answers questions in depth. Found out I took this class and didnt need to but I appreciate the extra A in a 4 credit class. Even if you have never taken Spanish before such as myself you will learn something and catch on if you do your hw, ask ?s, read the textbook.",
        "course": "SPAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark completely changed my outlook on the Spanish and Portuguese Department at OSU. He is one of the most influential and caring professors I have ever encountered in the classroom. He was very kind and wanted to see that every student was treated equally and learned the material. I hope to see him teaching more classes next semester!",
        "course": "SP4301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark was the best language teacher I've ever encountered. He prepares meticulously and expects students to pay effort in and outside of the classroom, which is critical for language study. He designs classroom activities that help students to initiate and engage in natural conversations. A hilarious guy who truly cares about his students.",
        "course": "SPANISH1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark was by far one of the best Professors I have ever had at OSU! With a very laid back classroom participation was highly encouraged and I almost always had a great time attending class. Despite the quick coverage of Spanish 100 and 102 in one semester Mark went out of his way to hold three extra study sessions for 2 hours to go in deeper content",
        "course": "SPAN1155"
      }
    ],
    "SEI": [
      {
        "Subject": "SPANISH",
        "Catalog": "3401",
        "Class Name": "Advanced Grammar",
        "Class Number": "19611",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "49",
        "Rating": "4.86"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "3401",
        "Class Name": "Advanced Grammar",
        "Class Number": "19612",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.88"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "3401",
        "Class Name": "Advanced Grammar",
        "Class Number": "19613",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.92"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "3401",
        "Class Name": "Advanced Grammar",
        "Class Number": "22784",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "5"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1101",
        "Class Name": "Spanish I",
        "Class Number": "36421",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.88"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103.01",
        "Class Name": "Spanish III",
        "Class Number": "21020",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "5"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103.01",
        "Class Name": "Spanish III",
        "Class Number": "21067",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.7"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103.01",
        "Class Name": "Spanish III",
        "Class Number": "21068",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.82"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103.01",
        "Class Name": "Spanish III",
        "Class Number": "36219",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.76"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "17622",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.85"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "17623",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.72"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1102",
        "Class Name": "Spanish II",
        "Class Number": "23317",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "SPANISH",
        "Catalog": "1103",
        "Class Name": "Spanish III",
        "Class Number": "29322",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Spanish & Portuguese",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Marcia",
    "id": "VGVhY2hlci0yNzUwNTMz",
    "lastName": "Macedo",
    "legacyId": 2750533,
    "numRatings": 1,
    "summary_comment": "Professor Macedo is highly regarded for his effective teaching methods, making complex concepts accessible to beginners with clarity and precision. His ability to break down difficult topics into manageable parts enhances understanding and retention.",
    "summary_comment_short": "Professor Macedo is highly regarded for his excellent teaching quality, particularly noted for being very effective with beginners. His approach makes complex concepts accessible and engaging for students just starting their journey.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good for beginners",
        "course": "SPANISH1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Ashlee Lyn",
    "id": "VGVhY2hlci0yMTY1MzQ1",
    "lastName": "Dauphinais",
    "legacyId": 2165345,
    "numRatings": 6,
    "summary_comment": "Professor Dauphinais, or Ashlee, is highly regarded for her exceptional teaching and care towards her students. She is known for her clear explanations, availability during office hours, and willingness to help, making complex concepts accessible. Students appreciate her approachable nature and dedication to their learning, noting her responsiveness to feedback and her ability to balance challenging coursework with supportive guidance.",
    "summary_comment_short": "Professor Dauphinais, or Ashlee, is highly regarded for her caring and supportive approach, consistently helping students who struggle and offering flexible deadlines when necessary. She excels in clear explanations and encourages student engagement through office hours and challenging yet fair assessments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is such a kind and caring teacher. She truly cares about her students and if you are struggling in this class, you can easily go up to her and ask for help. I completely forgot to turn my final project in on time because I had so many other exams and she was really understanding and let me turn it in late. Definitely recommend",
        "course": "SPAN3404"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "I think she did a great job at explaining and making sure every concept is understood. She made time for her students to come to office hours and be able to understand each terms. I would recommend her to every one because she helped me understand despite signing up for the course last minute.",
        "course": "SPAN3404"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ashlee was one of the best grad student teachers I've ever had. Super sweet, oral exams were not scary as she is very friendly. Exams are just like practice exams so make to do those. Also, there is weekly homeworks which force you to read the text book, and that's actually a grade booster if you try on those.",
        "course": "SPANISH3404"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ashlee was a great instructor. I know that my Spanish speaking and pronunciation skills have DRASTICALLY improved from this class. From all of the Spanish classes I have taken so far, I have learned the most from this one thanks to Ashlee. She was always willing to help and it is beyond obvious how dedicated and motivated she is to teaching .",
        "course": "SPAN3404"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ashlee is an amazing teacher. We gave her feedback and she responded to it clearly and understood the needs of the class. It is not an easy class as you analyze more advanced Spanish, but she is awesome, and also super helpful during office hours. She's a student too, so she understands what's going on.",
        "course": "SP3401"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Ashlee is a GTA but she has great credibility. She likes to remind the class that she was once/still is a student and she doesn't want to make things too difficult for us in class, but she will challenge you and you will get out of the class what you put in. She is very willing to work with you, but you need to express your want for help!",
        "course": "SPAN3401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Spanish & Portuguese",
    "firstName": "Angela",
    "id": "VGVhY2hlci0yNTg5NzQ4",
    "lastName": "Acosta",
    "legacyId": 2589748,
    "numRatings": 1,
    "summary_comment": "Professor Acosta offers a rigorous course with four exams and four papers, allowing students to drop their lowest exam score. She provides extensive homework support in class and frequently engages students through random calls and group discussions to ensure active participation.",
    "summary_comment_short": "Professor Acosta maintains a high standard of teaching with a rigorous curriculum including four exams and four papers, allowing students to drop their lowest exam score. She ensures active participation through regular call-outs and in-class homework review sessions.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Angela's a great instructor. There were 4 exams &amp; 4 papers, but you get to drop your lowest exam. There was a lot of homework that she always goes over in class. She occasionally calls on people randomly but this is usually only is when people don't talk in class. She often goes around the room and makes everyone talk but that is to be expected.",
        "course": "SPANISH3403"
      }
    ],
    "SEI": []
  }
]