[
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Nikolas",
    "id": "VGVhY2hlci0yOTE4MDYx",
    "lastName": "King",
    "legacyId": 2918061,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "3403: Nikolas is the GOAT! He is a great lecturer and you can tell he truly cares about his students. I always look forward to his class and by far have learned the most from his teaching out of all my Spanish professors at this school. There are a few papers we had to do but they were not bad at all. If you see his name on schedule planner, DO IT!",
        "course": "3450"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've taken two classes with Nik, the second by choice, and I would take all the rest of mine with him if I could. He cares about your wellbeing AND your education. He comes to class prepared, prompts engaging discussions, and his expectations are clear. 10/10 would recommend.",
        "course": "3450"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nik is actually just the best ever! Makes content accessible and is so kind and caring towards his students. Genuinely cares about you as a person and a student. Makes the class mood so positive and enjoyable. He also never judges you and constantly makes the class laugh. Like someone above said, just the absolute GOAT. Overall amazing instructor! ",
        "course": "3450"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolute GOAT.",
        "course": "23999"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was very helpful when grading papers and didn't grade too hard - he was also very nice and would almost immediately respond to emails. I liked him a lot !",
        "course": "23999"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.6,
    "department": "Spanish & Portuguese",
    "firstName": "Giovani",
    "id": "VGVhY2hlci0yODY1ODYy",
    "lastName": "Lopez ",
    "legacyId": 2865862,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took SPAN 203 at UNC with Dr. Lopez. He's incredibly nice, understanding, knowledgable, and gives good feedback. Very fair grader. Definitely one of the better Spanish professors I have had. Exams are not written by him but are very straightforward for 203 at UNC. ",
        "course": "SPAN1155"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "I did not mind having Giovani. The class itself is a hard class, therefore it was hard to determine if Govani was at fault or the Ohio State Spanish Department. He wanted to make sure you knew what you were doing. Sometimes he cracked down on pronunciation and participation. I would take him again if it were a different class. ",
        "course": "SPAN1155"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Lopez was one of the best professors I will probably ever have. He really cares about his students and explains things in a way that is understanding. I learned so much in this class. There is a lot of in class speaking but I kinda enjoyed that part. Very understanding and considerate professor.",
        "course": "SPAN1155"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is great. Really cares about his students. Helped me learn more Spanish than I ever did in high school. Totally recommend",
        "course": "SPAN1155"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Lopez clearly cares about his students being able to understand the material, and goes to great lengths to make sure it happens. I think I would better understand the language if I had learned from someone like him sooner. ",
        "course": "SPAN1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 4.8,
    "department": "Spanish & Portuguese",
    "firstName": "Julian",
    "id": "VGVhY2hlci0yNjgwNTcz",
    "lastName": "Baldemira",
    "legacyId": 2680573,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took this professors Spanish 122 class at Greenriver College. He was very cheerful and brought the learning to the students through jokes and poking fun with the students. The course setup was high quality and made learning the language easy as long as you did the work.",
        "course": "SPAN1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Unfortunately I took this class online. I do not think many other instructors could make the course as enjoyable as Julian did. The course quickly became one of my favorites in my weekly schedule and I looked forward to Spanish. He is an instructor who truly cares and will set aside time to make sure his students are learning and improving. 10/10",
        "course": "SPAN3450"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I had Julian for multiple semesters of Spanish and I couldn't be more grateful! He was an awesome teacher who knew what he was doing. Julian made the classroom feel like a safe learning space where students could engage and would not be afraid to ask questions. I also experienced online classes with him and he continued to deliver great lectures.",
        "course": "SPAN1103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Julien was a great TA. He really took the time to make sure the information he was trying to pass on made sense, and he worked to meet his students where they were at. Truly a gem in all honesty, but to get the most of this class and his teaching you need to be willing to engage and participate! Stay on top of homework and you will be just fine.",
        "course": "SPAN1101"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "Awesome guy, even though he was just a TA. Cares a lot about his students.",
        "course": "SPAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.5,
    "department": "Spanish & Portuguese",
    "firstName": "Brooklee",
    "id": "VGVhY2hlci0zMDQ5NTU5",
    "lastName": "Boots",
    "legacyId": 3049559,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "She's nice, but the class I took was so boring, this rating isn't because she's bad, its because she's average and couldn't elevate a boring class",
        "course": "ARTSSCI110006"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Brooklee taught my ASC College Survey. She is originally an advisor from the Spanish & Portuguese department. The criteria for the class were pretty clear, and she minimally took attendance (maybe once or twice the whole semester). The lectures were easy and the assignments even easier. Be aware: the assignments do not have clear due dates.",
        "course": "ARTSSCI110006"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Tara",
    "id": "VGVhY2hlci0zMDA2NTA2",
    "lastName": "Hazel",
    "legacyId": 3006506,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was really great, her grading was easy and as long as you invested time into the class and wanted to learn you got good grades! She was understanding if you didn't really grasp the concepts and always was willing to help you. I had such a great experience!",
        "course": "Spanish1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Is a great professor who really cares for her students. There is daily homework but they help you to learn some Spanish and don't take much time. The grading is pretty easy and if you try it is very easy to attain an A.",
        "course": "Spanish1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Natàlia",
    "id": "VGVhY2hlci0yODUzMzM4",
    "lastName": "Server Benetó",
    "legacyId": 2853338,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "If I could have her for every Spanish class I would. She explains things incredibly well and also opens up a lot of important new perspectives that ANYONE taking Spanish should open their eyes to. I thought the amount of work perfectly matched the requirements for the course, and I had a lot of fun taking her class. ",
        "course": "span"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "the loml. I wish I had her for every Spanish class ever. ",
        "course": "span"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "María",
    "id": "VGVhY2hlci0yODk2MDAy",
    "lastName": "Morado Vasquez",
    "legacyId": 2896002,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Despite how bad the Spanish department is, Prof. Vazquez is incredible. She is funny, teaches well, and cares about her students and what she is teaching. She keeps a class of people only there because they are required to be engaged and excited to learn. She will set you up for success in a challenging class!",
        "course": "SPAN1103"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Lauren",
    "id": "VGVhY2hlci0yNzMyMDEy",
    "lastName": "Miranda",
    "legacyId": 2732012,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lauren is great! She's a very caring, respectful, and nice professor. The class itself was a little challenging, but if you attend class, do the practices, homework's, and reach out when you need it, you'll be fine. There were 3 exams, 4 tareas that covered materials for the exam, pruebas and little assignments every week, and then a cuml. final. ",
        "course": "SPAN3404"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Gave great feedback and expectations were very clear. Class was fairly interesting and she was very nice and helpful with assignments. Weekly quizzes were online and easy. 4 tareas (few pages of questions) and field notebooks, sometimes took a bit of time. Final was a group project, which were pretty work heavy, but not too difficult",
        "course": "SPAN3401"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a very kind and understanding professor. Understood our busy lives as college students and was very easy to relate and connect with. Would 100% recommend her class\n",
        "course": "SPAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved Professor Miranda. She is very engaging with everyone in class and has a lot of different activities in class to help you learn. I always loved going to spanish class even though it was an early class. She is one of my favorite professor at OSU. 100% would take again.",
        "course": "SPAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Paloma",
    "id": "VGVhY2hlci0yNjA1ODI4",
    "lastName": "Pinillos Chavez",
    "legacyId": 2605828,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "great professor, would take the class again! She is very helpful and loves to teach!",
        "course": "SPAN3404"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's an awesome instructor. There's a lot of weekly modules to do (readings, quizzes, exercises, etc.) but it's so organized and manageable. There are so many tiny assignments that it's easier to bring grades up. Assignments/exams are open book. She makes complicated concepts seem super easy. Very responsive and understanding. Highly recommend!",
        "course": "SPAN3404"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Palo is an awesome teacher!",
        "course": "SPAN3401"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great Spanish teacher :)",
        "course": "SPAN3401"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Henrique",
    "id": "VGVhY2hlci0yNTkxNjUw",
    "lastName": "Yagui Takahashi",
    "legacyId": 2591650,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Office hours help a lot, he explains everything in depth and what's important and what not, really prepares you for quizzes and exams ",
        "course": "2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Fernando",
    "id": "VGVhY2hlci0yNzQ0Njgw",
    "lastName": "Sanchez Lopez",
    "legacyId": 2744680,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really great professor, took the time to make sure everyone was prepared for exams and quizzes. Made it easy to engage in class. ",
        "course": "SPAN1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Mark",
    "id": "VGVhY2hlci0yNTQzNjE2",
    "lastName": "Kolat",
    "legacyId": 2543616,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "While the class was definitely difficult for someone not great at Spanish, Mark was easily accessible and spent time focusing on the hardest concepts in virtual class. He also made clear the schedule and grading of the class which was appreciated by someone who wanted to know how to plan and how to do well in the class.",
        "course": "SPAN1103"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mark is a very caring and good professor. He always made little jokes during lectures that made us laugh and kept the class interactive. Not hard at all to get an A.",
        "course": "SPANISH1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark is a caring prof and a super nice grader. He wants you to succeed and always answers questions in depth. Found out I took this class and didnt need to but I appreciate the extra A in a 4 credit class. Even if you have never taken Spanish before such as myself you will learn something and catch on if you do your hw, ask ?s, read the textbook.",
        "course": "SPAN1101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark completely changed my outlook on the Spanish and Portuguese Department at OSU. He is one of the most influential and caring professors I have ever encountered in the classroom. He was very kind and wanted to see that every student was treated equally and learned the material. I hope to see him teaching more classes next semester!",
        "course": "SP4301"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark was the best language teacher I've ever encountered. He prepares meticulously and expects students to pay effort in and outside of the classroom, which is critical for language study. He designs classroom activities that help students to initiate and engage in natural conversations. A hilarious guy who truly cares about his students.",
        "course": "SPANISH1101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Mark was by far one of the best Professors I have ever had at OSU! With a very laid back classroom participation was highly encouraged and I almost always had a great time attending class. Despite the quick coverage of Spanish 100 and 102 in one semester Mark went out of his way to hold three extra study sessions for 2 hours to go in deeper content",
        "course": "SPAN1155"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Spanish & Portuguese",
    "firstName": "Marcia",
    "id": "VGVhY2hlci0yNzUwNTMz",
    "lastName": "Macedo",
    "legacyId": 2750533,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very good for beginners",
        "course": "SPANISH1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2,
    "department": "Spanish & Portuguese",
    "firstName": "Justin",
    "id": "VGVhY2hlci0yNjk3ODg4",
    "lastName": "Pinta",
    "legacyId": 2697888,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "He didn't teach -- he had us read the textbook and go through modules with videos of other instructors. Just tab the important pages in the textbook to flip to during assignments and you'll do fine since they're graded for completion, except tareas and exams. He took several days to respond to emails so it was pretty much a self-taught course.",
        "course": "SPANISH3404"
      }
    ],
    "SEI": []
  }
]