[
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.7,
    "department": "Speech & Hearing Sciences",
    "firstName": "Sarah",
    "lastName": "Leopold",
    "legacyId": 2861944,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "Dr Leopold is a great person, she is so nice and obviously cares about her students. That being said, I don't think I learned a single thing in this class that I will remember. I did not retain anything or follow the lectures at all. Graded only by a few quizzes, two group projects, and one final exam that was all short answer."
      },
      {
        "index": 1,
        "rating": "4.0",
        "comment": "Sarah is a nice person. Her class is relatively difficult by nature, but she is willing to repeat any difficult concepts during class. Graded by only two projects, 6 quizzes, & an exam. Attendance not required. Her final project expectations were unclear. She does not reply to emails. Exam all written response. Overall, I would recommend her!"
      },
      {
        "index": 2,
        "rating": "4.0",
        "comment": "The structure of this course was a bit confusing, since reading the textbook outside of class was more relevant to getting a good grade than attending the lectures. Other than that, Sarah was helpful when asking questions about the group projects and she's not a super difficult grader."
      }
    ]
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.7,
    "department": "Speech & Hearing Sciences",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yODYxOTQ0",
    "lastName": "Leopold",
    "legacyId": 2861944,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr Leopold is a great person, she is so nice and obviously cares about her students. That being said, I don't think I learned a single thing in this class that I will remember. I did not retain anything or follow the lectures at all. Graded only by a few quizzes, two group projects, and one final exam that was all short answer. ",
        "course": "3340"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Sarah is a nice person. Her class is relatively difficult by nature, but she is willing to repeat any difficult concepts during class. Graded by only two projects, 6 quizzes, & an exam. Attendance not required. Her final project expectations were unclear. She does not reply to emails. Exam all written response. Overall, I would recommend her!",
        "course": "3340"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "The structure of this course was a bit confusing, since reading the textbook outside of class was more relevant to getting a good grade than attending the lectures. Other than that, Sarah was helpful when asking questions about the group projects and she's not a super difficult grader.",
        "course": "3340"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0yODYyNjI5",
    "lastName": "Blank",
    "legacyId": 2862629,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Andrew was awesome. I took him for the senior gened seminar, not speech and hearing, but he was very accessible and truly cared about our success. He gave great feedback, graded quickly, and was super responsive. Great guy. ",
        "course": "GENED4001"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "TAKE HIM!!!!!! I love this man with all of my heart. He is kind, funny, understanding, and does a great job of explaining the material. Much of the grade is taken from turning in his guided notes, which you can fill out by either going to the in-person lectures or watching his online versions. He gives a lot of free points. Every test is open-note!",
        "course": "SPHHRNG4440"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Eric",
    "id": "VGVhY2hlci0yODY2MzEy",
    "lastName": "Bielefeld",
    "legacyId": 2866312,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class as a Neuro major. Most of the content wasn't knew to me, but it probably was to the others who were mostly SHS. Lots of kids were going to grad school for audiology or related fields, and Dr. Bielefeld was a big help to them. The three exams are fair, the weekly quizzes are easy points, and he curves at the end. Great professor.",
        "course": "SPHHRNG5760"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Bielefeld wants everyone to pass his class. I think he just wants to share the knowledge of hos field and help people who want are interested. There was 3 exams and a few quizzes. Each 25% of the the grade. He has a very generous grade scheme. The exams are easy if you pay attention but there is quite a lot of content. He recorded each lecture.",
        "course": "SPHHRNG5760"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Devan",
    "id": "VGVhY2hlci0yODIzNjcw",
    "lastName": "Lander",
    "legacyId": 2823670,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Devan is a good instructor who cares about her students. You do need the textbook for weekly quizzes but the class material is very interesting. There are 3 exams including the final that you do need to study quite a bit for. I would recommend her to anyone taking Introduction to Communication Disorders! ",
        "course": "SPHHRNG2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Devan was an amazing professor who really cared about her students. There are weekly quizzes taken outside of class and a final group project I found enjoyable. There are a lot of notes and a lot of content so be prepared to study. If you pay attention you will do fine on the exams. This class assured me I was picking the right major. ",
        "course": "SPHHRNG2230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Trena",
    "id": "VGVhY2hlci05NTY0OTg=",
    "lastName": "Shank",
    "legacyId": 956498,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a good teacher, but it could be confusing at times. Some classes were helpful while others were not necessary to go to. As long as you catch up and know what you're doing, you'll be okay.",
        "course": "ASL1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was a great ASL teacher. I would definitely recommend her! You need to go to class to fully understand what is going on, but there are a lot of outside resources to use if you miss a class.",
        "course": "ASL1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena is deaf which is awesome when learning ASL because it forces you to use it. Extremely caring and a clear, easy grader. 30 min zoom convos every week, easy points but recommend having a fun group. Made learning ASL fun and easy. Cancels Friday classes for zoom or tests. She lets class out early if we finish early! Would recommend to anyone!",
        "course": "ASL1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "this professor is deaf, but do not let that scare you. I learned a lot from having a deaf teacher and it helped me learn asl and the culture much better. she is hilarious. she also has a lot of projects and there's a weekly group 30 min convo, but they go by fats and it is easy points",
        "course": "ASL1102"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "I had Trena for both ASL 2 and 3, and she was an awful teacher. The class was easy, however, I learned nothing. She constantly cancelled class, was horrible at letting us know when assignments were due, and spent too much time focusing an easy topics while barely covering the more difficult ones. She also gave zero feedback on assignments.",
        "course": "ASL1102"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Trena cares a lot about ASl and the culture surrounding it. There is a communication barrier considering she is deaf and the students don't know ASL yet, but it forces you to use what you know and think about communication. She is available by text. There are a couple random in-class activities, but besides that, class is not mandatory.",
        "course": "ASL102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Trena was very caring and an easy grader. She made learning ASL fun and always let class out a little early. She always made it very cleer what was on the tests and no quizzes or suprises in her class. I'd recommend her to anyone!",
        "course": "ASL100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor I've ever had. Really genuinely cares about your success. I learned ASL so quickly from her. Her being deaf was not an obstacle at all, everything is set up so well. I learned so much about deaf people and deaf culture, and a TON of ASL. Trena is so freakin' chill.",
        "course": "ASL1101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena was one of the best teachers Ive ever had! Shes so sweet and makes learning ASL so much fun. I loved having the opprotunity to learn ASL and D/deaf culture from someone in the Deaf community. as long as you pay attention and practice in class, tests are a breeze. If you have the chance, definitely take her class!",
        "course": "ASL1101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Trena is the BEST professor at OSU! HANDS DOWN! She makes ASL so much fun! She explains the language with ease! Exams are very easy and theres a lot of point for in class assignments! I would take her over and over again!",
        "course": "ASL1"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was amazing! I learned so much and it was really easy and fun. Go to class so you don't fall behind with signs.",
        "course": "ASL1"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "It was really cool having Trena, especially when we would talk about Deaf culture and she would tell all these stories from her own life, some really funny. Having a Deaf instructor really makes you more aware of how to sign things and all the other physical aspects that go into signing.",
        "course": "ASL1102"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome Teacher! Wish she could teach ASL 1103. She gives new signers the experience of interacting with a real person in the Deaf Community. makes you have to be creative on how to communicate without words.",
        "course": "ASL102"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena was absolutely amazing, if I didn't love ASL before, she made me fall in love with it. I got to the end of the semester and didn't want to stop. She's \"tough\" on her students to make sure they know what they're doing, but she does it in a way that no matter what, you learn from it. She's effective, creative, and all around the greatest prof",
        "course": "ASL1102"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Yes, she is deaf and very proud, but she doesn't seem to mind hearing people.  In fact, she is very patient and seems to love what she does.  Surprisingly, communication is not a problem.  She will make you go sign in front of class, but it's not uncomfortable, and she never makes you feel stupid or slow.  I wish she was teaching my 1103 class!",
        "course": "ASL1102"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great professor. She enjoys her job and makes class interesting. She plays lots of games to make class fun. Shes great!",
        "course": "ASL102"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite teachers in the department.  She is always willing to put the extra effort into those willing to make the effort.  Happy to clarify, will accommodate all learning styles, and is excited to come to class every day.  Show up for class, participate and show an interest in the language and you'll have a major ally in the department.",
        "course": "ASL104"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class. I was pretty well considered the joke of my class and I still ended up w/ a b+.Trena is nice and understanding.  Assignments are easy and help pad your grade (deaf even is FUN too.  go to the picnic!)Just review the material when you have time and you'll be set.  Highly roccommended.",
        "course": "ASL100"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena is so CUTE. and so helpful, nice, and friendly. she really wants you to learn and understand what is going on as well as understand more about the Deaf community. She is def one of the best prof I've ever had. as long as you go to class and pay attention the class isn't very hard, and it's really fun.",
        "course": "ASL1"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Incredibly helpful, sweet, and funny. Just study the vocab and stay on top of the unit and you will be fine for class. :) She gives you a lot of chances to succeed and do well as long as you try and put in the work. Very understanding and will work with you if you have trouble. Best prof I have had so far. :)",
        "course": "ENGASL"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is the best teacher I have ever had! She is funny and kind and always helpful. I wish she taught 103 and 104. If you can't handle not talking in class then you don't belong here. You cant learn that way anyway. She is awesome, seriously.",
        "course": "ASL102"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved being in her class! She was VERY helpful, funny, and organized.  If she saw you doing a sign wrong, she would help you fix it without you having to ask.  It was a challenge having a deaf teacher at first, but I think it helped overall.",
        "course": "ASL2"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Trena is the best ASL teacher I have had so far! She is eager to teach and eager to get your mind working to make sure you understand the language.",
        "course": "ASL102"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "I had her at Columbut State for ASL 4. She was amazing. Shes very nice and extremely approachable. She will teach you so much. If you're planning on being an interpreter I would highly recommend her. She even wrote me a letter of recommendation to transfer to RIT. She's a tough grader but I'm glad. Hard work still got me an A. If you can, take her.",
        "course": "ITT144"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is best teacher!! She loves discussing about Deaf culture and share her experience with her life. She loves teaching. I admire her!!!",
        "course": "ENG101"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "Always smiling and generally happy personality make you want to come to class! She will always stop and explain if you just ask her. She does expect you to study your vocab and come to class, which are both good ideas if you don't want to get lost in class.",
        "course": "ENG101"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "Miss Shank is Deaf & EXTREMELY proud, almost to a fault. When I went to her for help she was unwilling and unreasonable. It was almost as if she was punishing me for being Hearing! She taught with a fast pace- and never stopped to explain or make sure everyone knew what she was talking about. I would recommended to find another section!",
        "course": "ENGL101"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is one of my favorite teachers. Trena is so nice and funny. You need to study and remember your vocabulary if you do not want to get lost in class. She is awsome!",
        "course": "ENG101"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 2,
        "comment": "Trena is amazing. She can seem a little busy with all her classes at times, but is always willing to answer questions. Not to mention she is very cute and has a fabulous sense of humor, there is hardly a day I don't laugh in class, but make sure you dont mind being picked on from time to time (all good fun of coure)",
        "course": "ASL2"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful and truly interested in seeing her students learn ASL. Can be unclear at times, but will never hesitate to clarify if you ask her to. Great sense of humour, too.",
        "course": "ENGL101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "Speech & Hearing Sciences",
    "firstName": "Janet",
    "id": "VGVhY2hlci0yNzA3NDMw",
    "lastName": "Vuolo",
    "legacyId": 2707430,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Vuolo was a great professor. The class is easy. Attendance isn't mandatory but will make the exams/quizzes hard to take if you don't show up. There are 3 exams (no final), weekly quizzes, 2 papers. There is also opportunity for extra credit. There are lots of guest lecturers and Dr. Vuolo is very passionate about what she is teaching.",
        "course": "SPHHRNG2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Vuolo is incredibly passionate about her field and it really shines through in her teaching. She always makes her lectures interesting and engaging. She also brings in many guest speakers. The course has weekly, 5 point take home quizzes, 3 midterms, 2 papers and no final. There are also multiple opportunities for extra credit. Best prof ever!",
        "course": "SPHHRNG2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Love her, favorite professor! quizzes each week worth 5 points. Three midterms, no final. You definitely have to study for midterms but her tests are straight forward and she gives you hints in the review session. Put in effort on the two papers (two pages, super easy) and you should be fine. There was extra credit at the end that raised grade 8%!",
        "course": "SPHHRNG2230"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Vuolo is very passionate about her field and you can tell shes values us learning as well. She answers all questions, keeps lectures exciting, and also has lots of guest speakers. The course material is hard but manageable and exams are typically not too bad if you study.",
        "course": "SPHHRNG2230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.2,
    "department": "Speech & Hearing Sciences",
    "firstName": "Lawrence",
    "id": "VGVhY2hlci0xMjk4ODY2",
    "lastName": "Feth",
    "legacyId": 1298866,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "horrible class. he is a good person but bad professor. he will give cryptic answers in emails and gets mad at people for asking questions in class. gen chem is more organized than this.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely terrible course and professor. Nothing makes sense, lectures are useless and boring, tests are difficult and worth many points, and homework takes hours to complete. Do not take this class with Dr. Feth unless you absolutely must.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Unfortunately I think he is the only prof for this class at OSU, but as a pre-warning, good luck. It's understandable that because I took this course during COVID it was bound to be a little messy, but communication in this class couldn't have been worse. The content is tough, but the lack of communication was the biggest downfall.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "With the online format due to covid-19, this class was draining and unreasonably hard out of the other required classes for this major. Lectures are hard to sit through because they are very monotone. The homework take hours to do and it is for completion.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class was super hard what made it worse is the fact that it was so unorganized. It was online due to COVID-19.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr Feth might be the worst professor and person I have ever met. He is boring and monotone during lecture, making it necessary to read the book in order to learn anything. He is unfair, and changed grading criteria AFTER the FINAL EXAM. Be prepared to teach yourself and get no email responses. Study and know ALL material for exams!!",
        "course": "SPHHRNG3340"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "The content of the course is very difficult. It is necessary to study continually if you want to pass. Professor Feth could be better, but also isnt the worst. Assignments are very long and difficult, and exams need to be well prepared for. Lectures can be hard to follow. The class was disorganized but that could just be the online format.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Feth isn't the best teacher but he's genuinely nice. Honestly, I think he's too smart to teach non-math or non-engineering students the material which is why people struggle with the class. He cares about his students and I think he's definitely adjusted his expectations appropriately after a few rough semesters. Not as bad as people say he is",
        "course": "SPHHRNG3340"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Feth gets a lot of hate and he honestly does not deserve it. His class is hard but you put in what you get out, if you study as you go you will understand. Dr. Feth wants to help and answer questions. Before the class I only heard negative things and I truly only had positive experiences with him. Sometimes lectures are boring but its not bad",
        "course": "SPHHRNG3340"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Feth is by far the worst professor Ive ever had. The class was hybrid and it took him weeks to publish an assignment schedule list and even after that, he still would publish lectures weeks late. His tests are a lot more difficult than lecture material and he is extremely bad at communication, rarely answers questions, and is just plain rude.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Material isnt the easiest but its not terrible. What makes it hard is Feths terrible communication skills. On the rare occasion he actually answers an email, hes defensive &amp; wont give a clear answer. He lowered final exam grades after already publishing them because he decided to change to a more detailed rubric. Dislike is not strong enough.",
        "course": "SHS340"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lectures dry and topics you don't cover in lecture or on the textbook until later in the class do sometimes pop up on the exams. He usually does not respond to emails and if he does, he talks around the question without an answer. The hybrid version of this class is a disaster.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "Lectures were dry, and he often went into tangents to the point where it was difficult if what he was talking about was relevant or not. The tests are easy if you have a physics background, but you really need to study the math if you don't. Two extra credit points available, both fairly easy. (3-page paper and research participation)",
        "course": "SPHHRNG3340"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Feth's lectures are dry and slow. His weekly quizzes are challenging and worded weird. He refuses to listen to feedback on quiz/exam questions. Ryan, one of the TAs, is the only person to actually learn from. He is kind and knowledgeable, and willing to help with anything. You have to study a lot for exams, &amp; don't take this unless you have to",
        "course": "SPHHRNG3340"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Oh Larry... He's a nice man but just awful as a professor. The saving grace for this class is the TA's (specifically Ryan Harrison). He changed the textbook for this semester and it made NO SENSE. Luckily homework and labs are for completion, so that will give you a little bit of cushion. Do not recommend if you don't have to take it.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Coming from someone who is struggling in this class &amp; realizes how hard it can be, I don't think Dr. Feth deserves half the posts on this page. He's a very intelligent professor and is approachable if you make the effort. He is understanding and is able to explain your questions if you ask them. Also can't help but laugh at his dad jokes. :-)",
        "course": "SHS3340"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Feth's lectures are long and boring - super hard to pay attention to. His notes are unclear and super disorganized, which he even admits to. Put in the work outside of class and you'll be alright, but things are weighted heavily and on a weird scale, so make sure you do well on exams. Definitely not my favorite class",
        "course": "SPHHRNG3340"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Feth's class was one of the hardest classes I've taken at OSU, his lectures are long and boring and he doesn't really explain things well. Make sure you have a good TA.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Feth's lectures are pretty hard to pay attention to as he tends to ramble. He does speak clearly so that you are able to take notes and catch almost exactly what he says. Two exams and one cumulative final with an opportunity for bonus points also. The labs and homework are easy as long as you have the textbook.",
        "course": "SHS3340"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Feth is amazing! He loves his field of study and is always willing to help. Although he seems hard to get to know, he's an amazing professor and a really cool guy. Reach out to him! He knows everything.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Feth is really helpful. He is great about responding to emails and meeting with students if they have questions. He may seem a bit intimidating, but he really is interested in teaching students and getting them interested in acoustics. Work hard in this class and ask questions whenever necessary and you will be fine!",
        "course": "SHS340"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "It was not that bad of a class. Lectures are pretty boring. Just make sure to study for the final. Quizzes and HW are no biggy, quite easy if you have the textbook.",
        "course": "SHS340"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very, Very Boringggg",
        "course": "SHS320"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "You def. need the book. Honestly, if you study, it isn't that bad. Must attend the lab/rec. He is good at answering questions and emails, so if you need help... ask. Just 2 tests and a bunch of busy work",
        "course": "SPHRG340"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class ever. He is an old man that is worthless and there is no point of going to class. Not helpful, honestly, I doubt this man even knows how to do the math himself.",
        "course": "SH340"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 3,
        "comment": "ughhh math. well this class was okay, but only out of 100 points, so everything matters. at least homework and labs are only graded on completion, not correctness. need to buy the book or share with someone. i feel bad because everyone talks over him while he lectures, so attending class is pretty pointless, all you need is in powerpoints",
        "course": "SPNHR340"
      }
    ],
    "SEI": []
  }
]