[
  {
    "avgDifficulty": 4.3,
    "avgRating": 3.8,
    "department": "Speech  Hearing Sciences",
    "firstName": "Youkyung ",
    "id": "VGVhY2hlci0xOTUxNzU4",
    "lastName": "Bae",
    "legacyId": 1951758,
    "numRatings": 12,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Bae was my favorite SHS professor! She has so much knowledge and is extremely passionate about what she teaches. The course is very difficult, but if you attend lectures, take notes, and ask questions, you will be fine. Reviewing material each week will also make preparing for exams much easier.  ",
        "course": "SHS4420"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 5,
        "comment": "This course is extremely difficult. She says a lot of things during lectures so go to class! Exams are difficult, but the nature of the class is hard in general. Very fast pace. You learn a lot, but I am glad to be (almost) done with this course.",
        "course": "4420"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Bae is a very intelligent woman with a lot of passion for the material.  She can be a bit intimidating a first, but is super friendly and lovely to talk to once you get to know her a bit.  Pay attention during lectures, take plenty of notes, keep up with reviewing the material, and you should be able to succeed.",
        "course": "SPHHRNG4420"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Bae is an excellent teacher, but the class is extremely difficult. The lectures are packed with information and assignments are graded harsh. Would not take again.",
        "course": "SPHHRNG4420"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. Bae is extremely smart, and she is funny which helps make class fun. However, she will make you feel dumb if you are not as smart as she is. She will not write you a letter of rec or consider for research positions if you do not receive an A in this class. I found her extremely rude and demeaning to her students.",
        "course": "SPHHRNG4420"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bae is a great professor. Her classes can be somewhat difficult, but you cannot be afraid to ask questions, as it is very important to her that students actually understand the material beyond memorization. Reviewing throughout the semester makes studying for the exams pretty easy. Go to class and engage when you're there and you should do well",
        "course": "SPHHRNG4420"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Baes class is very lecture heavy. When you ask questions she can be a little aggressive. Probably one of the hardest classes I have ever taken, and would never take her again if I didnt have to. Not a fan.",
        "course": "SHS4420"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Bae is an incredibly intelligent woman and does her best to keep lectures interesting. Myself and a few other people in her speech anatomy class have gone to office hours, and she is pretty rude towards you if you don't understand something right away. She will eventually answer your question, but expect some attitude when she does.",
        "course": "SHS4420"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bae is my favorite professor I've had in SHS. She really cares that you understand the material and do well. The course is a lot of memorizing material just because that's the nature of anatomy, but she writes very fair tests. If you go to lecture and study before the exams you will do well.",
        "course": "SHS4200"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Bae is a good instructor, and if you study her PowerPoints you can do well on the exams. She doesn't really curve, but if there was tough question on the exam, she will give back the point. She grades on exams, quizzes, lab and attendance. When she takes attendance it is random, and usually when a lot of people start to skip.",
        "course": "SHS4420"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Love this professor. By no means is it an easy course, but you leave every class feeling like you've learned a ton.",
        "course": "4420"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Bae is absolutely brilliant and makes taking this class at 8am worth it. You learn so much and she truly cares about the students and us being successful in the future. The class is tough, but going to lecture and office hours really helps.  I feel more prepared to be an SLP from this class than all of the others combined.",
        "course": "4420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.8,
    "department": "Speech  Hearing Sciences",
    "firstName": "Evelyn",
    "id": "VGVhY2hlci0yMDYzODM2",
    "lastName": "Hoglund",
    "legacyId": 2063836,
    "numRatings": 22,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "She is very kind but does does not know answers about the midterms she creates if a student asks about content on upcoming exams. If you ask her questions about a rubric for a paper or project, she does not really know. There are very few grades but she's an easy grader if you put effort in. Content can be confusing but exams aren't too bad. ",
        "course": "SPHHRNG4430"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "She was an alright professor. Kind person, but conveys material confusingly and will go back on what she said. Very few assignments. Tests not as bad as I thought, but go over the notes several times to make sure you know the info. Isn't great at replying to emails. Overall, if you can find another prof then I probably would, but she's not too bad.",
        "course": "SPHHRNG4430"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a sweetheart with great knowledge of the field. She has great intentions. ",
        "course": "SPHHRNG4430"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 2,
        "comment": "She's nice, but she takes forever to grade. It can be hard to know how well you're doing. The best part is that there are no exams other than a simple final. If you generally pay attention in the course the online final should be okay especially since it's not timed. All assignments are projects, can be tedious but not bad.",
        "course": "SPHHRNG4510"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "Shes okay. Nothing too special. She takes forever to grade and most of the class is projects. Because she takes a lot to grade its hard to know how well youre doing. Her directions and expectations can be unclear. She sometimes deducts points for invalid reasons.",
        "course": "SPHHRNG4510"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "I loved Professor Hoglund! Probably my favorite professor so far. She's so kind and gives engaging lectures; I learned a lot from her. Grades are largely based on tests (but not totally) which can be tough for some people, but she allowed us to use our notes on all the exams. So, if you pay attention and take notes in class you will do just fine!",
        "course": "SPHHRNG4430"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 4,
        "comment": "Avoid her. She isn't that good at teaching. She knows her stuff. She wants you to learn. She cares. But she can't teach. On the final exam she asked a question related to the five domains of language. Yes, we learned about the, but she didn't call them that in lecture. That happens with many things. She is unorganized, unclear on carmen +lecture",
        "course": "SHS3350"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Grade was based almost solely on exams and they were super long. Need to do the reading from textbook and lecture material. Basically reads off the slides and doesn't expand upon the information too much. Felt like I got better info from the book than her. Be sure to study a lot before the exams, not set up to get an easy grade without the work.",
        "course": "SPHHRNG3330"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 1,
        "comment": "The grade is based on two midterms, a final, and a final group project. We barely used any class time to work on the project and it was expected to get with the group outside of class. There were also no hard guidelines as to what had to be in the presentation.",
        "course": "SPHHRNG3350"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "She was a horrible introduction to the major. Her lectures are absurdly boring and vague and her PowerPoints suck.",
        "course": "SPHHRNG2230"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a wonderful professor who truly seems to care about the material and her students. The class depends mainly on 3 exams with some film assignments and an interview along the way. I would recommend it for anyone majoring in speech and hearing sciences; this class is full of great information and I felt like I learned a lot!",
        "course": "SPHHRNG2230"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 3,
        "comment": "Professor Hoglund's lectures can be boring at times and she reads off the slides so going to class isn't really necessary. However, she is super sweet and caring and communicates the information clearly.",
        "course": "SPHHRNG2230"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Attendance is not mandatory but useful to go to in order to do good on the midterms. There are only a few grades but the group project can boost your grade. Fairly easy grader. Midterms and the final are all short answer so be prepared to write!",
        "course": "SPHHRNG3350"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 4,
        "comment": "The information is very interesting. She just reads off of the powerpoint the whole class. Even when you ask for clarification, she typically just says the same thing on the slide again. It is a lot of information to know and understand for each exam. Putting loads of study time and knowing every single detail is about the only way to get an A.",
        "course": "SHS2230"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 4,
        "comment": "3 exams that make up the majority of your grade. 4 other 10-20 point grades in the class but they don't change your overall score even if you get 100%. Exams full of poorly worded trick questions. She walks around questions without answering. Won't curve or offer extra credit. Must study a LOT to get a good grade. Avoid her if at all possible.",
        "course": "SPHHRNG2230"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "I found this class very difficult for an introductory class. The majority of our final grade was made up of 3 very difficult exams. Her tests were full of trick questions instead of asking about the content. When she was asked questions, a direct answer wasn't fully given. She does not curve nor give extra credit no matter how low the test average.",
        "course": "SPHHRG2230"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was unnecessarily hard for an intro class. She never directly answered questions, she would dance around them. Always said details weren't important but would then put them on the test. Her wording is really hard to understand on tests and she puts a lot of unfair questions on them. Avoid her.",
        "course": "SPHRNG2230"
      },
      {
        "index": 18,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was ok - not great, but not the worst. Lectures were given word-for-word based on PPTs, so sometimes things were a bit monotonous. Asking questions was sort of encouraged, but sometimes they weren't answered to students' satisfaction. There wasn't a lot of expansion upon the ideas; a lot of it was just rote memorization/recall.",
        "course": "SHS2230"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class was pretty difficult especially because the lectures were long snd boring and not mandatory so no one really went. And on top of that you only got 3 grades which were 2 midterms and the final. So you needed to have a pretty good idea on every single exam.",
        "course": "SPHHRNG2230"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "There are only 3 tests, so it's a high stakes class. Her lectures only consist of her reading verbatim Powerpoint presentations; attendance is optional. She gives information that is so vague that it straddles the line of being misinformation and does not address students' concerns. She's not the worst but I wouldn't give her professor of the year.",
        "course": "SHS2230"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 4,
        "comment": "Lectures are basically her reading straight off of slides. The material covered in class is so detailed and has so much information compared to her tests which are more big picture. Only 3 exams, but those are the only grades in the class. Not good at taking students' concerns over questions that majority missed on tests into consideration. ",
        "course": "SHS2230"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "No homework, tests are challenging but an A is definitely within reach. Going to lecture will cover almost all information tested over. Notes are posted online and are almost word for word what she says in class so missing once or twice isn't an issue.",
        "course": "SHS2230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 3.6,
    "department": "Speech  Hearing Sciences",
    "firstName": "Allison",
    "id": "VGVhY2hlci0xOTc4OTc0",
    "lastName": "Bean Ellawadi",
    "legacyId": 1978974,
    "numRatings": 17,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One assignment a week class with papers and quizzes that are not difficult. No exams but a final research paper they give you feedback on. Highly recommend this class.",
        "course": "SPHHRNG4530"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I didn't hear from Dr. Bean much since her TA did most grading, but I'm not sure why people complain about this class. It's super easy, asynchronous, open book for everything, and gives good feedback. Some of the assignments are vague, but they're lenient graders, and I actually enjoyed the case studies (which don't stress out about they're easy)",
        "course": "SPHHRNG3330"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "Knowledgeable from textbook standards but really struggled with real-world clinical experience. Not sure she's ever even had a caseload outside of an academic/research setting. She made offensive and borderline discriminatory comments on occasion and she overcompensated for her incompetence by making exams unnecessarily difficult.",
        "course": "SPHHRNG3330"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Each lecture was monotone, very basic, unhelpful, and uninformative and only around 2 minutes so it was hard to even process everything. It sounded like she was reading a script. There were knowledge checks and case studies but they were application based which made it very hard to get a good grade because the lectures hardly went over anything.",
        "course": "SPHHRNG3330"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "the lectures are very dry and uninformative ? each video is about 2 minutes long and nothing is explained well- she just reads off a script. the knowledge checks are application-based so it makes it very hard to get a good grade on these when you dont understand the basic material. she seems nice enough but i would not take a class with her again.",
        "course": "SPHHRNG3330"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Gosh awful lectures that last two minutes, no extra credit. Half the exam material is made up. Terrible professor do not take its a waste of money!",
        "course": "SHS3330"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bean is fantastic. She cares about your education and well being, and will always be there if you have any questions or are struggling in the course. I would definitely take her again. She is phenomenal.",
        "course": "SHS3330"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Bean is one of the greatest professors that I've had in the major. She is super caring, nice, and wants to make sure the students do well. The class is based off four exams, but they are open book open note. Show up for class and write down everything she says in your powerpoint slides, and you'll have no problems.",
        "course": "SHS3330"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "The class is graded based on 4 exams. The first two exams were really rough and the class average was low. It made it almost impossible to get an A after that. After the online switch due to Covid19, she seemed to stop caring. She gave us literally 2 minute lectures for an entire section. Then she was rude and snappy when anyone said anything.",
        "course": "SHS3330"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fun and easy, tests weren't tricky lectures were interesting no bs projects or anything. One easy assignment and multiple choice exams. Super nice too",
        "course": "SPHHRNG4350"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Ellawadi is one of my absolute favorite teachers. The material she teaches is very clear and doing the study guides for the exams are a must. And don't be afraid to approach her outside of class, she is very accommodating and very helpful.",
        "course": "SHS3330"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Ellawadi is very kind, warm, and accessible. She is very knowledgable about speech-language pathology and autism, it seems, but it doesn't seem like language acquisition (the subject of SHS 3330) is her area of expertise. She reads right off the powerpoints and seems to struggle adding in relevant information that is not directly on the slides.",
        "course": "SHS3330"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Ellawadi is super sweet and very knowledgeable. She has lots of funny examples to help explain the concepts and is very easy to reach if you don't understand something. I genuinely enjoy her class and don't mind that it is lecture heavy. Do the study guide for the test and you're good to go!",
        "course": "SHS3330"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 3,
        "comment": "Long, sometimes dry lectures. Has funny stories and is kind. Gives study guides that closely match the 4 exams (only grades in the class), which make it easy to get good grades. Good at explaining confusing concepts, expects participation but doesn't grade on it. Attend class and make a quizlet of the study guide for the exams and you'll be fine.",
        "course": "SHS3330"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Ellawadi is a nice lady and really knows what she is talking about, but he classes are really tough and so are her tests. A lot of the material she gives you for the review is just the basics compared to what you need to know on the exam.",
        "course": "SHS3330"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Ellawadi is really clear in what will be on tests. She can be kind of intense and intimidating, but she's a pretty cool teacher. The class is pretty easy, you just fill in powerpoint notes during class. There are a lot of midterms, but they're really straight forward and easy.",
        "course": "SHS3330"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty interesting class and nice professor. She is very clear with her notes and explanations. Going to class isn't mandatory but really helpful, because she adds a lot of information to her PowerPoints during class. Study the review sheets for exams.",
        "course": "SHS3330"
      }
    ],
    "SEI": []
  }
]