[
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.7,
    "department": "Speech & Hearing Sciences",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yODYxOTQ0",
    "lastName": "Leopold",
    "legacyId": 2861944,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr Leopold is a great person, she is so nice and obviously cares about her students. That being said, I don't think I learned a single thing in this class that I will remember. I did not retain anything or follow the lectures at all. Graded only by a few quizzes, two group projects, and one final exam that was all short answer. ",
        "course": "3340"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Sarah is a nice person. Her class is relatively difficult by nature, but she is willing to repeat any difficult concepts during class. Graded by only two projects, 6 quizzes, & an exam. Attendance not required. Her final project expectations were unclear. She does not reply to emails. Exam all written response. Overall, I would recommend her!",
        "course": "3340"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "The structure of this course was a bit confusing, since reading the textbook outside of class was more relevant to getting a good grade than attending the lectures. Other than that, Sarah was helpful when asking questions about the group projects and she's not a super difficult grader.",
        "course": "3340"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "3340",
        "Class Name": "Introduction to the Art and Science of Sound",
        "Class Number": "22490",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3340",
        "Class Name": "Introduction to the Art and Science of Sound",
        "Class Number": "21476",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "34",
        "Rating": "4.73"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3340",
        "Class Name": "Introduction to the Art and Science of Sound",
        "Class Number": "22387",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5785",
        "Class Name": "Research Methods I",
        "Class Number": "30506",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "3.75"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3340",
        "Class Name": "Introduction to the Art and Science of Sound",
        "Class Number": "21257",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.55"
      }
    ]
  },
  {
    "avgDifficulty": 4.1,
    "avgRating": 2.2,
    "department": "Speech & Hearing Sciences",
    "firstName": "Lawrence",
    "id": "VGVhY2hlci0xMjk4ODY2",
    "lastName": "Feth",
    "legacyId": 1298866,
    "numRatings": 26,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "horrible class. he is a good person but bad professor. he will give cryptic answers in emails and gets mad at people for asking questions in class. gen chem is more organized than this.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Absolutely terrible course and professor. Nothing makes sense, lectures are useless and boring, tests are difficult and worth many points, and homework takes hours to complete. Do not take this class with Dr. Feth unless you absolutely must.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Unfortunately I think he is the only prof for this class at OSU, but as a pre-warning, good luck. It's understandable that because I took this course during COVID it was bound to be a little messy, but communication in this class couldn't have been worse. The content is tough, but the lack of communication was the biggest downfall.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "With the online format due to covid-19, this class was draining and unreasonably hard out of the other required classes for this major. Lectures are hard to sit through because they are very monotone. The homework take hours to do and it is for completion.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class was super hard what made it worse is the fact that it was so unorganized. It was online due to COVID-19.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr Feth might be the worst professor and person I have ever met. He is boring and monotone during lecture, making it necessary to read the book in order to learn anything. He is unfair, and changed grading criteria AFTER the FINAL EXAM. Be prepared to teach yourself and get no email responses. Study and know ALL material for exams!!",
        "course": "SPHHRNG3340"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 5,
        "comment": "The content of the course is very difficult. It is necessary to study continually if you want to pass. Professor Feth could be better, but also isnt the worst. Assignments are very long and difficult, and exams need to be well prepared for. Lectures can be hard to follow. The class was disorganized but that could just be the online format.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Feth isn't the best teacher but he's genuinely nice. Honestly, I think he's too smart to teach non-math or non-engineering students the material which is why people struggle with the class. He cares about his students and I think he's definitely adjusted his expectations appropriately after a few rough semesters. Not as bad as people say he is",
        "course": "SPHHRNG3340"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Feth gets a lot of hate and he honestly does not deserve it. His class is hard but you put in what you get out, if you study as you go you will understand. Dr. Feth wants to help and answer questions. Before the class I only heard negative things and I truly only had positive experiences with him. Sometimes lectures are boring but its not bad",
        "course": "SPHHRNG3340"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Feth is by far the worst professor Ive ever had. The class was hybrid and it took him weeks to publish an assignment schedule list and even after that, he still would publish lectures weeks late. His tests are a lot more difficult than lecture material and he is extremely bad at communication, rarely answers questions, and is just plain rude.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Material isnt the easiest but its not terrible. What makes it hard is Feths terrible communication skills. On the rare occasion he actually answers an email, hes defensive &amp; wont give a clear answer. He lowered final exam grades after already publishing them because he decided to change to a more detailed rubric. Dislike is not strong enough.",
        "course": "SHS340"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lectures dry and topics you don't cover in lecture or on the textbook until later in the class do sometimes pop up on the exams. He usually does not respond to emails and if he does, he talks around the question without an answer. The hybrid version of this class is a disaster.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "Lectures were dry, and he often went into tangents to the point where it was difficult if what he was talking about was relevant or not. The tests are easy if you have a physics background, but you really need to study the math if you don't. Two extra credit points available, both fairly easy. (3-page paper and research participation)",
        "course": "SPHHRNG3340"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dr. Feth's lectures are dry and slow. His weekly quizzes are challenging and worded weird. He refuses to listen to feedback on quiz/exam questions. Ryan, one of the TAs, is the only person to actually learn from. He is kind and knowledgeable, and willing to help with anything. You have to study a lot for exams, &amp; don't take this unless you have to",
        "course": "SPHHRNG3340"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Oh Larry... He's a nice man but just awful as a professor. The saving grace for this class is the TA's (specifically Ryan Harrison). He changed the textbook for this semester and it made NO SENSE. Luckily homework and labs are for completion, so that will give you a little bit of cushion. Do not recommend if you don't have to take it.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "Coming from someone who is struggling in this class &amp; realizes how hard it can be, I don't think Dr. Feth deserves half the posts on this page. He's a very intelligent professor and is approachable if you make the effort. He is understanding and is able to explain your questions if you ask them. Also can't help but laugh at his dad jokes. :-)",
        "course": "SHS3340"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 3,
        "comment": "Dr. Feth's lectures are long and boring - super hard to pay attention to. His notes are unclear and super disorganized, which he even admits to. Put in the work outside of class and you'll be alright, but things are weighted heavily and on a weird scale, so make sure you do well on exams. Definitely not my favorite class",
        "course": "SPHHRNG3340"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Feth's class was one of the hardest classes I've taken at OSU, his lectures are long and boring and he doesn't really explain things well. Make sure you have a good TA.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Feth's lectures are pretty hard to pay attention to as he tends to ramble. He does speak clearly so that you are able to take notes and catch almost exactly what he says. Two exams and one cumulative final with an opportunity for bonus points also. The labs and homework are easy as long as you have the textbook.",
        "course": "SHS3340"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Feth is amazing! He loves his field of study and is always willing to help. Although he seems hard to get to know, he's an amazing professor and a really cool guy. Reach out to him! He knows everything.",
        "course": "SPHHRNG3340"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Feth is really helpful. He is great about responding to emails and meeting with students if they have questions. He may seem a bit intimidating, but he really is interested in teaching students and getting them interested in acoustics. Work hard in this class and ask questions whenever necessary and you will be fine!",
        "course": "SHS340"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 4,
        "comment": "It was not that bad of a class. Lectures are pretty boring. Just make sure to study for the final. Quizzes and HW are no biggy, quite easy if you have the textbook.",
        "course": "SHS340"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 5,
        "comment": "Very, Very Boringggg",
        "course": "SHS320"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "You def. need the book. Honestly, if you study, it isn't that bad. Must attend the lab/rec. He is good at answering questions and emails, so if you need help... ask. Just 2 tests and a bunch of busy work",
        "course": "SPHRG340"
      },
      {
        "index": 25,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class ever. He is an old man that is worthless and there is no point of going to class. Not helpful, honestly, I doubt this man even knows how to do the math himself.",
        "course": "SH340"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 3,
        "comment": "ughhh math. well this class was okay, but only out of 100 points, so everything matters. at least homework and labs are only graded on completion, not correctness. need to buy the book or share with someone. i feel bad because everyone talks over him while he lectures, so attending class is pretty pointless, all you need is in powerpoints",
        "course": "SPNHR340"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 4.8,
    "department": "Speech & Hearing Sciences",
    "firstName": "Janet",
    "id": "VGVhY2hlci0yNzA3NDMw",
    "lastName": "Vuolo",
    "legacyId": 2707430,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Vuolo was a great professor. The class is easy. Attendance isn't mandatory but will make the exams/quizzes hard to take if you don't show up. There are 3 exams (no final), weekly quizzes, 2 papers. There is also opportunity for extra credit. There are lots of guest lecturers and Dr. Vuolo is very passionate about what she is teaching.",
        "course": "SPHHRNG2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Vuolo is incredibly passionate about her field and it really shines through in her teaching. She always makes her lectures interesting and engaging. She also brings in many guest speakers. The course has weekly, 5 point take home quizzes, 3 midterms, 2 papers and no final. There are also multiple opportunities for extra credit. Best prof ever!",
        "course": "SPHHRNG2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Love her, favorite professor! quizzes each week worth 5 points. Three midterms, no final. You definitely have to study for midterms but her tests are straight forward and she gives you hints in the review session. Put in effort on the two papers (two pages, super easy) and you should be fine. There was extra credit at the end that raised grade 8%!",
        "course": "SPHHRNG2230"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Vuolo is very passionate about her field and you can tell shes values us learning as well. She answers all questions, keeps lectures exciting, and also has lots of guest speakers. The course material is hard but manageable and exams are typically not too bad if you study.",
        "course": "SPHHRNG2230"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "19658",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "72",
        "Rating": "4.75"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6725",
        "Class Name": "Language Acquisition and Early Intervention in Language Delay",
        "Class Number": "19673",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.96"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "20712",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "31",
        "Rating": "4.55"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6763",
        "Class Name": "Motor Speech Disorders",
        "Class Number": "20930",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.87"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "17682",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "44",
        "Rating": "4.81"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6725",
        "Class Name": "Language Acquisition and Early Intervention in Language Delay",
        "Class Number": "17697",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.96"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "14839",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "4.91"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6763",
        "Class Name": "Motor Speech Disorders",
        "Class Number": "15057",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.86"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6725",
        "Class Name": "Language Acquisition and Early Intervention in Language Delay",
        "Class Number": "21487",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.92"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "20989",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.72"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6763",
        "Class Name": "Motor Speech Disorders",
        "Class Number": "21205",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.75"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "24037",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "48",
        "Rating": "4.85"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6725",
        "Class Name": "Language Acquisition and Early Intervention in Language Delay",
        "Class Number": "24052",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.72"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "2230",
        "Class Name": "Introduction to Communication and Its Disorders",
        "Class Number": "21251",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.71"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6763",
        "Class Name": "Motor Speech Disorders",
        "Class Number": "21461",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.89"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 4.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Trena",
    "id": "VGVhY2hlci05NTY0OTg=",
    "lastName": "Shank",
    "legacyId": 956498,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "She is a good teacher, but it could be confusing at times. Some classes were helpful while others were not necessary to go to. As long as you catch up and know what you're doing, you'll be okay.",
        "course": "ASL1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "She was a great ASL teacher. I would definitely recommend her! You need to go to class to fully understand what is going on, but there are a lot of outside resources to use if you miss a class.",
        "course": "ASL1103"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena is deaf which is awesome when learning ASL because it forces you to use it. Extremely caring and a clear, easy grader. 30 min zoom convos every week, easy points but recommend having a fun group. Made learning ASL fun and easy. Cancels Friday classes for zoom or tests. She lets class out early if we finish early! Would recommend to anyone!",
        "course": "ASL1102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "this professor is deaf, but do not let that scare you. I learned a lot from having a deaf teacher and it helped me learn asl and the culture much better. she is hilarious. she also has a lot of projects and there's a weekly group 30 min convo, but they go by fats and it is easy points",
        "course": "ASL1102"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 2,
        "comment": "I had Trena for both ASL 2 and 3, and she was an awful teacher. The class was easy, however, I learned nothing. She constantly cancelled class, was horrible at letting us know when assignments were due, and spent too much time focusing an easy topics while barely covering the more difficult ones. She also gave zero feedback on assignments.",
        "course": "ASL1102"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Trena cares a lot about ASl and the culture surrounding it. There is a communication barrier considering she is deaf and the students don't know ASL yet, but it forces you to use what you know and think about communication. She is available by text. There are a couple random in-class activities, but besides that, class is not mandatory.",
        "course": "ASL102"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Trena was very caring and an easy grader. She made learning ASL fun and always let class out a little early. She always made it very cleer what was on the tests and no quizzes or suprises in her class. I'd recommend her to anyone!",
        "course": "ASL100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best professor I've ever had. Really genuinely cares about your success. I learned ASL so quickly from her. Her being deaf was not an obstacle at all, everything is set up so well. I learned so much about deaf people and deaf culture, and a TON of ASL. Trena is so freakin' chill.",
        "course": "ASL1101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena was one of the best teachers Ive ever had! Shes so sweet and makes learning ASL so much fun. I loved having the opprotunity to learn ASL and D/deaf culture from someone in the Deaf community. as long as you pay attention and practice in class, tests are a breeze. If you have the chance, definitely take her class!",
        "course": "ASL1101"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Trena is the BEST professor at OSU! HANDS DOWN! She makes ASL so much fun! She explains the language with ease! Exams are very easy and theres a lot of point for in class assignments! I would take her over and over again!",
        "course": "ASL1"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was amazing! I learned so much and it was really easy and fun. Go to class so you don't fall behind with signs.",
        "course": "ASL1"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "It was really cool having Trena, especially when we would talk about Deaf culture and she would tell all these stories from her own life, some really funny. Having a Deaf instructor really makes you more aware of how to sign things and all the other physical aspects that go into signing.",
        "course": "ASL1102"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome Teacher! Wish she could teach ASL 1103. She gives new signers the experience of interacting with a real person in the Deaf Community. makes you have to be creative on how to communicate without words.",
        "course": "ASL102"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena was absolutely amazing, if I didn't love ASL before, she made me fall in love with it. I got to the end of the semester and didn't want to stop. She's \"tough\" on her students to make sure they know what they're doing, but she does it in a way that no matter what, you learn from it. She's effective, creative, and all around the greatest prof",
        "course": "ASL1102"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Yes, she is deaf and very proud, but she doesn't seem to mind hearing people.  In fact, she is very patient and seems to love what she does.  Surprisingly, communication is not a problem.  She will make you go sign in front of class, but it's not uncomfortable, and she never makes you feel stupid or slow.  I wish she was teaching my 1103 class!",
        "course": "ASL1102"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a great professor. She enjoys her job and makes class interesting. She plays lots of games to make class fun. Shes great!",
        "course": "ASL102"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite teachers in the department.  She is always willing to put the extra effort into those willing to make the effort.  Happy to clarify, will accommodate all learning styles, and is excited to come to class every day.  Show up for class, participate and show an interest in the language and you'll have a major ally in the department.",
        "course": "ASL104"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy class. I was pretty well considered the joke of my class and I still ended up w/ a b+.Trena is nice and understanding.  Assignments are easy and help pad your grade (deaf even is FUN too.  go to the picnic!)Just review the material when you have time and you'll be set.  Highly roccommended.",
        "course": "ASL100"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "Trena is so CUTE. and so helpful, nice, and friendly. she really wants you to learn and understand what is going on as well as understand more about the Deaf community. She is def one of the best prof I've ever had. as long as you go to class and pay attention the class isn't very hard, and it's really fun.",
        "course": "ASL1"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 4,
        "comment": "Incredibly helpful, sweet, and funny. Just study the vocab and stay on top of the unit and you will be fine for class. :) She gives you a lot of chances to succeed and do well as long as you try and put in the work. Very understanding and will work with you if you have trouble. Best prof I have had so far. :)",
        "course": "ENGASL"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is the best teacher I have ever had! She is funny and kind and always helpful. I wish she taught 103 and 104. If you can't handle not talking in class then you don't belong here. You cant learn that way anyway. She is awesome, seriously.",
        "course": "ASL102"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved being in her class! She was VERY helpful, funny, and organized.  If she saw you doing a sign wrong, she would help you fix it without you having to ask.  It was a challenge having a deaf teacher at first, but I think it helped overall.",
        "course": "ASL2"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "Trena is the best ASL teacher I have had so far! She is eager to teach and eager to get your mind working to make sure you understand the language.",
        "course": "ASL102"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "I had her at Columbut State for ASL 4. She was amazing. Shes very nice and extremely approachable. She will teach you so much. If you're planning on being an interpreter I would highly recommend her. She even wrote me a letter of recommendation to transfer to RIT. She's a tough grader but I'm glad. Hard work still got me an A. If you can, take her.",
        "course": "ITT144"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is best teacher!! She loves discussing about Deaf culture and share her experience with her life. She loves teaching. I admire her!!!",
        "course": "ENG101"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 4,
        "comment": "Always smiling and generally happy personality make you want to come to class! She will always stop and explain if you just ask her. She does expect you to study your vocab and come to class, which are both good ideas if you don't want to get lost in class.",
        "course": "ENG101"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 5,
        "comment": "Miss Shank is Deaf & EXTREMELY proud, almost to a fault. When I went to her for help she was unwilling and unreasonable. It was almost as if she was punishing me for being Hearing! She taught with a fast pace- and never stopped to explain or make sure everyone knew what she was talking about. I would recommended to find another section!",
        "course": "ENGL101"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is one of my favorite teachers. Trena is so nice and funny. You need to study and remember your vocabulary if you do not want to get lost in class. She is awsome!",
        "course": "ENG101"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 2,
        "comment": "Trena is amazing. She can seem a little busy with all her classes at times, but is always willing to answer questions. Not to mention she is very cute and has a fabulous sense of humor, there is hardly a day I don't laugh in class, but make sure you dont mind being picked on from time to time (all good fun of coure)",
        "course": "ASL2"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very helpful and truly interested in seeing her students learn ASL. Can be unclear at times, but will never hesitate to clarify if you ask her to. Great sense of humour, too.",
        "course": "ENGL101"
      }
    ],
    "SEI": [
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "13078",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "13079",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.15"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "23829",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "17",
        "Rating": "4.29"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "34104",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "16791",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.4"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "16792",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.69"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "16797",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "16798",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.18"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "11104",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "5"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "11105",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.7"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "11106",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.27"
      },
      {
        "Subject": "ASL",
        "Catalog": "1103",
        "Class Name": "Intermediate American Sign Language",
        "Class Number": "11107",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.67"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "10917",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.46"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "10919",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.38"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "10920",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.35"
      },
      {
        "Subject": "ASL",
        "Catalog": "1102",
        "Class Name": "Elementary American Sign Language II",
        "Class Number": "22405",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Foreign Language Center",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.38"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Devan",
    "id": "VGVhY2hlci0yODIzNjcw",
    "lastName": "Lander",
    "legacyId": 2823670,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Devan is a good instructor who cares about her students. You do need the textbook for weekly quizzes but the class material is very interesting. There are 3 exams including the final that you do need to study quite a bit for. I would recommend her to anyone taking Introduction to Communication Disorders! ",
        "course": "SPHHRNG2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Devan was an amazing professor who really cared about her students. There are weekly quizzes taken outside of class and a final group project I found enjoyable. There are a lot of notes and a lot of content so be prepared to study. If you pay attention you will do fine on the exams. This class assured me I was picking the right major. ",
        "course": "SPHHRNG2230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 2.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "William",
    "id": "VGVhY2hlci0xMTA4NDgz",
    "lastName": "Secord",
    "legacyId": 1108483,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Secord has alot of knowledge in the field.  However, he didn't teach that often and made his PhD students do powerpoint lectures to us.  PhD students weren't useful because they were so nervous.  Excellent personality and very down to earth.  I wish he would have taught the class not the PhD students",
        "course": "SHS330"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "This guy is a joke.  Not only does he NOT teach, but he gets all of his grad students to lecture for him and they all do horribly.  It's a wonder why I went to class half the time.  I learned more from reading the textbooks than I did from listening to any of his/his grad. students lectures.",
        "course": "SHS330"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "annoying, didn't learn anything, but still got an A. the class was at 7 30 a.m. and attendence wasn't mandatory so you could use powerpoints AND voice recordings for everything. basically a waste of time, especially since everyone in the class got a 40/40 on the writing assignments that i actually spent time doing.",
        "course": "SH330"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "class was a joke, didn't learn a thing, but got an A anyways.",
        "course": "SHS330"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "completely useless and a blowhard; sent me a rude email when i politely asked for help. do not take his classes if you can avoid it",
        "course": "SHS330"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 1,
        "comment": "UG students think he's OK because they don't care about learning any way. When you're in grad school preparing to BE an SLP, he couldn't be worse, because the things he is SUPPOSED to be teaching you actually NEED to know. Good luck in clinic and on the PRAXIS when you didn't learn ANYTHING about child language in class. And he has no research!",
        "course": "SPHS725"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was a fantastic teacher. I disagree with the two comments above, he cares greatly about the job he does and it was refreshing to have him last quarter. He is one faculty member that actually cares about the students and not so distracted by his research. I loved his lectures on leadership and feel they are extremely valuable. A++++",
        "course": "SH330"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class was a waste of time. He said he wanted to teach us in a different way to help us remember things better, but I honestly don't feel like I learned a THING. It's definitely an easy A, but not worthwhile at all. He &quot;taught&quot; us too much about leadership and not enough about language.",
        "course": "SHS330"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "Secord is a huge tub of hot air. He's so incredibly useless that it's no wonder he didn't get tenure the first time he was at OSU. All of his classes were exactly the same--and worthless. There's absolutely no content in any thing he says. (and p.s. it's Wayne Secord, not William) He only gives As to make people like him.",
        "course": "SPHS710"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am a big fan of Dr. Secord.  He is adorable and really cares about his students! Assignments and tests are all in essay form, and I actually enjoyed them.  The class is an easy A, and he puts all of the notes on Carmen.",
        "course": "SPHS330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Robert",
    "id": "VGVhY2hlci0xMzA0NTA1",
    "lastName": "Fox",
    "legacyId": 1304505,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Fox is a tough instructor but he really wants you to understand the material. His quizzes are more terminology and his exam questions except for the final are the same questions in the back of every chapter of the book. The two midterms were identical to those questions. Ask questions if you don't understand anything he says.",
        "course": "SPHS420"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "6786",
        "Class Name": "Statistics in Speech and Hearing Science",
        "Class Number": "20775",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "1.71"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5605",
        "Class Name": "Multicultural Aspects of Communication",
        "Class Number": "17695",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.12"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6786",
        "Class Name": "Statistics in Speech and Hearing Science",
        "Class Number": "14902",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "3.2"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3320",
        "Class Name": "Principles of Phonetics",
        "Class Number": "21469",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.1"
      }
    ]
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 2.4,
    "department": "Speech & Hearing Sciences",
    "firstName": "Zinny",
    "id": "VGVhY2hlci0xNzI5MzE5",
    "lastName": "Bond",
    "legacyId": 1729319,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Bond's 8 am lecture is horribly long. Every lecture I found myself wondering why I even showed up that week. You'' learn most things in recitation from your TA. Zinny is so scatter brained and she never answers questions clearly. The class itself is not too hard.",
        "course": "SHS3320"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Bond is a sweet professor who clearly has a passion for what she teaches. The lectures can be pretty long sometimes, but she gives a lot of bonus opportunities during class. Recitation is helpful. There are 6 quizzes throughout the semester that are unannounced until the day of in recitation. Pay attention and you'll be fine!",
        "course": "SHS3320"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Dr. Bond is a sweet and knowledgeable professor. However, you must read the book and attend recitation in order to understand the course content and do well on exams. She regularly gives opportunities for bonus points. Lectures are not really necessary to attend, but reading over the slides can be helpful in addition to the textbook and recitation.",
        "course": "SHS3320"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Bond is very sweet. She is very willing to work with students and offer a lot of extra credit. Recitation is very helpful to go, although lectures are not always very informative. ",
        "course": "SPHHRNG3320"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Bond is an incredibly sweet woman with a clear passion for phonetics. While the lectures drag, sometimes she shares helpful information. Lots of bonus points to be had if you show up consistently. Tests are tricky, the book is necessary; everything you need to know is inside it. Not difficult if you devote some time to studying it on your own.",
        "course": "SHS3320"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Boring, unorganized lectures and annoying unrelated stories constantly. Lecture does not help whatsoever. Read and outline the book, and go to recitation, and an A is easy to earn.",
        "course": "SHS3320"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "Her TA is a much better educator than she is.  Try taking this class when Diana Chang is the instructor, because listening to Dr. Bond in difficult at best.  Lecture is mindless blathering.",
        "course": "SHS3320"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "If possible, DON'T TAKE HER CLASS!Wastes time in class talking about unrelated topics, slides posted online but not helpful on exams, so going to class is optional. Most of the learning comes from reading the text on your own. She's nice but not good at teaching. If you read the text book you should do fine on the exams.",
        "course": "SPHHR320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.6,
    "department": "Speech & Hearing Sciences",
    "firstName": "Marcia",
    "id": "VGVhY2hlci0xMDA4OTc4",
    "lastName": "Woodfill",
    "legacyId": 1008978,
    "numRatings": 23,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Marcia is super friendly and flexible, and really wants to help you do well. She wants to help you if you want to help yourself. The language takes a little practice and requires paying attention, because it is a foreign language, but Marcia definitely works with you. I would HIGHLY recommend her as a professor, I loved her class and her teaching.",
        "course": "ASL1102"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Marcia is my favorite ASL Professor I've had at Ohio State! She is incredibly kind, and very willing to help you understand. She really made sure that everyone was included, and got to know all of us. She has tons of experience, but still grades very fairly. Most definitely take Marcia if you can!",
        "course": "ASL1102"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Absolutely love Marcia. I've had three different ASL teachers and she is hands down my favorite. She's great, very helpful, and will show you any sign you ask her. Understanding and patient for those who are having a hard time picking up the material. Lots of group conversations to get to know each other",
        "course": "ASL103"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher!!!!",
        "course": "SPH5714"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "I came to every class except 2 random days, and on those days, she decided to give \"participation points.\" (which is really attendance because you can't do it if you aren't there). I also don't take the student evaluations serious bc they know your handwriting and might change your grade (if you know what I mean). Take a different professor.",
        "course": "ASL1103"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "I don't like old professors because they are harsh graders, so I never really came to class. I didn't like how everyone sat in the same seats. In ASL 2, and 1 we had to sit in different seats to get a different perspective, but this wasn't the case for this professor. ",
        "course": "ASL1103"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Marcia was absolutely fantastic. I wish she could teach all my speech and hearing classes from here on out. She cracks jokes at herself and others all the time, and keeps lectures interesting. She has a lot of work stories that relate well to the lecture at the time. As a bonus, her classes rarely go the full time (I had 1 hour 20 minute lecture)",
        "course": "SHS5714"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved her and her class. Just go to class and pay attention and you should be fine!",
        "course": "ASL1102"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is a VERY NICE PERSON! Attend class, you'll do well. skip class, don't be surprised if you have no clue what she is signing. ",
        "course": "ASL1102"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Marcia is fantastic. Show an interest in the class and she'll show an interest in making sure you succeed.",
        "course": "ASL101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "AWESOME teacher! :)  Make sure to go to class and to participate whenever you can, but Mrs. Woodfill was one of my favorite teachers here at OSU.  She is VERY knowledgeable in the material with her background and genuinely cares about her students--Phenomenal teacher, I wish there were more like her :)",
        "course": "SHS5714"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the best professor I have had out of my three years so far. Extremely helpful and kind, and is willing to go the extra mile if it will help her student. She is also very funny and down to earth, which makes it easy to come to class!",
        "course": "SHS714"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Marcia is so nice. She is hilarious and is really cool to have as a teacher. As far as ASL teachers so far she has been my favorite.",
        "course": "ASL103"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best ASL teacher I've had! She's awesome and makes class fun. Test aren't bad and she grades very fair.",
        "course": "ASL103"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "An amazing class! I would recommend this class to everyone who has the class as an upper level option! Classes were actually fun to attend.  Marcia is the absolute best!",
        "course": "SHS714"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "LOVEEE marcia!!!! such a nice lady! incredible. very easy class. fun to go to! keeps lectures short and sweet. extemely fair tests!! if you need to skip class to study, shes totally cool with it. sooo helpful!! lovee",
        "course": "SHS714"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Simply the best! Better than all the rest! She is kind of hot for an older lady too:) Loved her sense of humor. Really down to earth!!!!",
        "course": "ASL3"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "I absolutely loved her.  She was easy to understand and get along with.  I tried to take her again,but unfortunately she didn't teach 716 this quarter.  I definitely recommend her! One of my favorites at OSU",
        "course": "SHS714"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was awesome!!! :-)",
        "course": "SHS714"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "An amazing teacher - she actually wants everyone to do well. Her experience in the field makes her a great resource, too. She is really relaxed and gives easy tests.",
        "course": "SHS716"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Teacher!!  Her class is fun and she's very helpful!",
        "course": "SHS714"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "SPH716"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 1,
        "comment": "Greatest professor I have ever had at OSU. Very helpful and is extremely flexible. She adjusts her schedule to fit yours! Class ends early everyday and she's really fun! If you have any interest in ASL please take 714 with Marcia. By far the best!!!",
        "course": "SPHSASL"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Robin",
    "id": "VGVhY2hlci0xNjkxMDcz",
    "lastName": "Price",
    "legacyId": 1691073,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best ASL teachers I have had! Her class is extremely enjoyable and interesting. She teaches the signs very clearly and helps anyone that is confused. I definitely recommend her!",
        "course": "ASL101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Robin is one of the best ASL teachers I have ever had. I've now moved on to ASL 103 and was so upset she wasn't teaching 103! Robin is an amazing professor who sets up games everyday and brings prizes such as candy for the winners! She is so fun and kept me laughing every class period. By the way, she is a hearing professor! TAKE HER!!!",
        "course": "ASL104"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I'm surprised Robin only has one comment! She one of my favorite professors I've had at OSU. She is very nice, understanding,always willing to help, and has never made me feel dumb for asking questions. Her classes are never boring and she makes sure you are involved with the material. For sure take her 101 or 102 classes.",
        "course": "ASL102"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "very good professor. cares about all her students and wants you to understand ASL. class is never boring.",
        "course": "ASL101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4.2,
    "avgRating": 2,
    "department": "Speech & Hearing Sciences",
    "firstName": "Michael",
    "id": "VGVhY2hlci0xNjAxOTQ4",
    "lastName": "Trudeau",
    "legacyId": 1601948,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "He clearly is passionate about the material that is covered in class. He uses the whole class time, and tends to go off topic in lectures. He records his lectures for those who can't make it to class. LABS are a must! Do not skip. His TAs teach the material more clearly and make everything easier to understand. 2 exams both open note.",
        "course": "SPHHRNG3320"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Dr. Trudeau's class is pretty boring and he does not explain the material as it would be on the test. Although the midterm and final are both open book/note/computer, don't rely on not studying or learning the material because there isnt enough time to google them all. Also, ask your TA for help because they are very knowledgeable in SHS2230.",
        "course": "SHS3320"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "Knows what he's talking about. Wants you to understand so he explains anything you ask. My favorite professor and class by far!",
        "course": "SPHHRG3320"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "He is exceptionally knowledgeable on the topic, but does go off on tangents that have nothing to do with what we're being tested on. Difficult class overall, a lot of people who didn't have him said that this class was easy.  But it was not with him!  Open noteopen book exams?  Yeah, well be aware that you'll rarely be able to find the answers.",
        "course": "2230"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "He's clearly knowledgeable on the subject, but he doesn't care about students. He got his powerpoints from another prof and doesn't even know what they mean half of the time, lectures on random tangents and tests VERY specific things from the book or topics mentioned one time. Get ready to read if you want to do well and pray you have a good TA.",
        "course": "SPHS3320"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Attendance not mandatory for this 8am class, but Dr. Trudeau offended by lack of attendance for his long, drawn-out lectures where he goes off on tangents for majority of time (lectures recorded and on Carmen). Not welcoming of questions or requests for special accommodations. Very sweet TA (Jing Yang). You can tell Dr. Trudeau is a retired prof.",
        "course": "SHS3320"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "This is the nicest professor on the planet.",
        "course": "SPHHRNG3320"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor i have ever had. He does not help at all and tests over content that was not taught! I enjoyed recitation but it also didn't help when it came to exams! chances are you won't do well in this class even if you do try.. Avoid him at all costs! WORST PROFESSOR EVER",
        "course": "SHS3320"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "If you can avoid getting him as a professor I would have. I didnt think he was going to be as awful as he is. He explains nothing clearly. We went over the same thing for 3 weeks, and yet only 2 questions on the midterm, and he barley explain in the 3 weeks. And doesn't give a review sheet. Hands down not a good teacher at all!!!!",
        "course": "SPHHRNG3320"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "He is indeed the worst professor I have ever had. His lecture is so pointless and he goes off topic ALL THE TIME.I have no idea how to study for his exam and he does not provide any help.I tried very hard to study for his class but still got a bad grade for no reason. He is knowledgeable but he cannot teach well at all. Avoid taking him if possible",
        "course": "SHS3320"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrid teacher with an attitude. He won't provide a study guide, apparently we are supposed to be prepared for anything and everything. He is cruel and mean. Made us think he would push the midterm back and then didn't and got mad that we said that wasn't fair. He is rude and will answer email with attitude. #TheWorst",
        "course": "3320"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst professor I have ever had, be prepared to receive no help and have him be a total stuck up jerk. Recitation was the only good part of the class but really doesn't help you.",
        "course": "SPHHRNG3320"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "pointless to attend classes! completely rambles on and on about pointless things to were you lose the actual point of the class.go to class if you can tune rambles out but if you cant listen to recorded lectures. 2 midterms. take average of midterm grades so do have to take final or you can take final and that be your final grade.. final is hard!",
        "course": "SPHRN420"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "Class was basically pointless to attend. Too hard to pay attention to b/c he got off subject and was at 8AM on Mon. and Wed. Lectures were recorded. Exams were open book, open note, yet the average score was still an 80%. 2 midterms, 1 final for final grade. Rec, was the best part of the class.",
        "course": "SHS420"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 2.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Monique",
    "id": "VGVhY2hlci0xNTQyODU2",
    "lastName": "Mills",
    "legacyId": 1542856,
    "numRatings": 19,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Mills is a good lecturer. She is very straight forward. If you read the book, you don't have to go to class to do well. However, most people don't do that. If that is the case, she does a great job of summarizing the book each lecture. There are 4 exams that are based off the book.  Easy A if you actually try.",
        "course": "SHS3330"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great Professor!",
        "course": "SHS3330"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "I really enjoyed Dr. Mills's class! Sometimes she wasn't clear but always made a point to look up what she didn't know & get back to students about it. Study guides for the 4 exams were true to test. Didn't need to ask Q's, but she seemed receptive. Book accompanied class well; tests clear & she threw out Q's that a lot of people got wrong.",
        "course": "SHS3330"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 3,
        "comment": "Tests are more difficult than expected, details are often focused on. Lectures aren't always helpful, information is presented much more clearly in the textbook. A study guide is provided for each exam and is pretty true to what is on the test.",
        "course": "SHS3330"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's great, she is makes dry material interesting and is clearly passionate about her field. She let's you know exactly what she expects from you on exams. Lectures are very helpful, but you need to do the required readings if you want an A! ",
        "course": "SPHS3330"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "Had her last semester for one of my final SHS courses. Very scatterbrained and UNCLEAR!She seems nice and approachable at first, but I actually had a few personal encounters with her as well. Not only did she call me out in front of the entire class, she also was very rude in an email with a snide remark which was somewhat hurtful.",
        "course": "SHS5605"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Absolutely LOVED this class! Dr. Mills is a wonderful professor and is probably the most available professor I've ever had. She is incredibly helpful if you go to her office hours and very obviously cares about the needs of her students. She sometimes mis-states things, but is always quick to correct herself and answer any questions. Great prof!",
        "course": "SHS3330H"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 1,
        "comment": "Dr. Mills is an incredibly sweet professor. She's willing to help and has good intentions, but struggles a bit to convey important material across to her students. Overall, though, the class was really easy and manageable to get an A in.",
        "course": "SHS3330"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is not a good professor at all. She does not know how to convey the information we need to very well and she confuses herself which in turn confuses the class. On exam review days she gets an attitude when no one knows the answer to any questions. Don't even try and ask for help from the TA. Stay away from her.",
        "course": "SHS3330"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 2,
        "comment": "Dr. Mills is a terrible teacher. She is extremely disorganized and always seemed uncomfrotable speaking in front of the class. She constantly lost her train of thought, was constantly stating the wrong thing and then correcting herself. VERY unapproachable and very rude and short in her emails. Very unhelpful. Do NOT take this class from her.",
        "course": "SHS330"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "Awful teacher! You have to rely on the book because she is hard to understand. She has to correct herself a lot, which makes lecture frustrating. She does not prepare student very well for tests. She was no help on the group project also. She is a nice lady, but not a good professor. Avoid her if you can.",
        "course": "SPH330"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 4,
        "comment": "Monique is extremely disorganized and is not a good teacher. I took HDFS 364 which correlated well with this course. I learned more for this class because of HDFS. This class is only out of 300 points. half of them are from exams, and 100 is a group project that she does not explain whatsoever, you need to ask a lot of questions. Avoid if you can",
        "course": "SHS330"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "She's a nice lady just very unaware of how to communicate what she wants to get across to the class, she always confuses herself then goes back and tries to start over which just confuses everybody. She also always hands out in class activities that nobody understands because she is NOT a good teacher.",
        "course": "SHS330"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "She was confusing to listen to during lecture, but was laid back and easy to get along with. Learned more from studying the book/powerpoints than I did from her lectures. But class was overall easy to get an A in!",
        "course": "SHS330"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "AWFUL. avoid her. SO disorganized. unclear about tests and projects. Changed the syllabus last minute. I learned nothing from this class. Terrible class/teacher.",
        "course": "SHS605"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "Monique seems really cool during the first class and really easy going but this is FALSE. She needs to go back to being a speech therapist because teaching is not her strong suit. For the final project, she gave us the rubric AFTER we presented. Avoid her if you can!",
        "course": "SPHHR0010"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 2,
        "comment": "Keeping in mind that this was her first quarter teaching, she could definitely use improvement. Nice person, but when it came to learning I would never know what to expect on quizzes and she changed dates for our projects and a quiz. Overall just kind of unorganized, but she was alaways good about e-mailng me back if I had questions. GOOD LUCK!",
        "course": "SHS330"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "I would agree with the other poster that this class was way more frustrating -- except this was a different course.  Avoid having her if you can.  Very unclear and is not helpful at all.",
        "course": "SHS605"
      },
      {
        "index": 19,
        "rating": 2,
        "difficulty": 4,
        "comment": "Terrible and very frustrating class. Study guides she gave were useless when it came to quizzes. I studied and still never knew what she would throw on the test. You pretty much have to go to class because her powerpoints are only half done. This class was way more complicated than it needed to be.",
        "course": "SHS330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 3.3,
    "department": "Speech & Hearing Sciences",
    "firstName": "Michelle",
    "id": "VGVhY2hlci0xNDU2MzIx",
    "lastName": "Bourgeois",
    "legacyId": 1456321,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "I loved her. She was wonderful and really wanted every student to succeed.",
        "course": "SHS320"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "So quiet and mummbley. VERY easy class though..",
        "course": "SPH230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 2.6,
    "department": "Speech & Hearing Sciences",
    "firstName": "Rebecca",
    "id": "VGVhY2hlci0xMjc4MDc2",
    "lastName": "McCauley",
    "legacyId": 1278076,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "She does not teach! All she does is invite speakers into her class (the same speakers you need to listen to in 360 Observation). Powerpoints and her talking does not pertain to the online tests or quizzes. Overall the class is easy but she has no interest in teaching about Communication Disorders, she's only interested in researching.",
        "course": "SPHS230"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I hear people complain in class about her teaching style, but honestly I don't have a problem with her. She is very knowledgeable and friendly. You deff. need to read the book to do well on the quizzes, and the interview project is a bit of a drag. Other than that, it's really not that bad!",
        "course": "SH230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Rebecca is amazing!!  If you do not get an A in her class then you just did not try!  It is an easy, clear intro class to Speech and Hearing Science and I enjoyed her class.  Will admit some of our presenters were a...drag, same with some of her lectures.  However, it really was not an horrible class=]",
        "course": "SPH230"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 5,
        "comment": "power points have no usefulness. i feel like i am teaching myself this class.",
        "course": "SPHHR230"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "SPH230"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "seriously one of my most hated classes. did not learn hardly anything. i suggest taking this class with someone so that you can take turns attending class and signing each other in. quizzes have almost nothing to do with lecture, so you have to buy the book. most classes have a guest speaker, so its pointless to go. online final made it all better",
        "course": "SPHR230"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "5785",
        "Class Name": "Research Methods I",
        "Class Number": "21583",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.3"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6710",
        "Class Name": "Speech Sound Disorders in Children",
        "Class Number": "19683",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.48"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6740",
        "Class Name": "Fluency: Theory and Treatment",
        "Class Number": "20781",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.74"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8950",
        "Class Name": "Seminar in Speech and Hearing Science",
        "Class Number": "20779",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6740",
        "Class Name": "Fluency: Theory and Treatment",
        "Class Number": "14908",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.37"
      }
    ]
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Speech & Hearing Sciences",
    "firstName": "Christina",
    "id": "VGVhY2hlci05NTc4NDI=",
    "lastName": "Roup",
    "legacyId": 957842,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "this class was easy. i always studied justs the powerpoints for tests and didn't miss a point. you do need the book to do well on the quizzes",
        "course": "SHS540"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "There is SO much information presented in this class you almost feel like your head is going to explode.  But she does a great job on her lecture notes, definitely study those hard for the tests.  Goes over audiogram interpretation ad infinitum, but you KNOW it.  test are long but no tricks",
        "course": "SHS540"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She'll love you if you go to her office hours.  Generally the class is easy as long as you attend and know what is important to review for exams--Her reviews are thorough and she doesn't try to trick you on the exams.",
        "course": "SHS540"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "22494",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6705",
        "Class Name": "Audiologic Assessment I",
        "Class Number": "19797",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6705",
        "Class Name": "Audiologic Assessment I",
        "Class Number": "19798",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8935",
        "Class Name": "Research to Practice",
        "Class Number": "25191",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "21341",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.33"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6733",
        "Class Name": "Adult Audiologic Rehabilitation",
        "Class Number": "20929",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "21417",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6705",
        "Class Name": "Audiologic Assessment I",
        "Class Number": "17821",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "3"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8935",
        "Class Name": "Research to Practice",
        "Class Number": "36026",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6733",
        "Class Name": "Adult Audiologic Rehabilitation",
        "Class Number": "15056",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "22310",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6733",
        "Class Name": "Adult Audiologic Rehabilitation",
        "Class Number": "21204",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8935",
        "Class Name": "Research to Practice",
        "Class Number": "33643",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "22390",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6705",
        "Class Name": "Audiologic Assessment I",
        "Class Number": "24174",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6705",
        "Class Name": "Audiologic Assessment I",
        "Class Number": "30126",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8935",
        "Class Name": "Research to Practice",
        "Class Number": "35093",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6733",
        "Class Name": "Adult Audiologic Rehabilitation",
        "Class Number": "21460",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Leigh",
    "id": "VGVhY2hlci0xNDExMzI0",
    "lastName": "Smitley",
    "legacyId": 1411324,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good teacher. Cares about her students' success in the class. Phonetics was an easy class.",
        "course": "SHS320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.7,
    "department": "Speech & Hearing Sciences",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0xODYxNDg5",
    "lastName": "Brello",
    "legacyId": 1861489,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jen is absolutely amazing. Anyone who is an aspiring SLP can learn so much from her. She will help you with anything- including grad school application questions- without ever making you feel dumb. She is truly inspiring with the work she does for the people in the Aphasia Initiative. The woman deserves an award!",
        "course": "SHS2230"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "Class is not challenging.  As everyone else said - you dont need the text, you dont have to go to class, you can go to the study session before the test and know exactly what you will be tested on.  Expected more for a course in my future profession.",
        "course": "SHS2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Three tests, three labs and four response papers on guest speakers. As everyone else has said, Jen is very approachable and very good at what she does. Look over major points from each lecture, and you'll do fine on the tests.",
        "course": "SPHHRNG4520"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jen Brello is a great professor, very nice and exams are simple. No need to purchase the textbook whatsoever. Also.. you can get an A as long as you go to the review sessions the class before the exam and study the notes you take there. Would recommend taking any course with her, keeps everyone interested and knows her stuff. ",
        "course": "2230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jen is amazing. She was one of the sweetest professors I've had at OSU. I'm looking forward to having her again. The class itself was very easy. The review sessions before the midterms are VERY close to the actual test. Easy A. ",
        "course": "SHS2230"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's the best!",
        "course": "SHS230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jen is a fantastic teacher. She is one of the nicest people I have ever met and truly cares about her students. She will do anything to help a student. Her lectures are interesting and she prepares you very well for her three exams.",
        "course": "4520"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "absolutely love jen! Talked to her after class many times with questions about speech and hearing sciences career options, grad school etc and she was so eager to help and truly cares. Her class is a must take!",
        "course": "SPEECH2230"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lectures are interesting and as long as they need to be. If she finishes her lecture early, class will end early. Brello is a great communicator. Went to office hours and got advice about graduate school. She truly cares. ",
        "course": "INTROTOSLP"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "DR Brello was an awesome professor. I enjoyed the class a lot. It was very fun and interesting. ",
        "course": "2230"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Jennifer was Great! Loved all the guest speakers. Book not needed. Just attend review sessions and you will get an A!",
        "course": "SHS2230"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Attendance of this class not mandatory, but you will at least want to attend review sessions prior to exams. Do this and you will pass. Jennifer is super sweet. 2 additional assignments along with three exams are easy, and there is no final.",
        "course": "SHS2230"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Jen Brello was an excellent professor. The exams are nearly 100% based upon lecture material. ATTEND REVIEW LECTURES! I went to a total of about 7 lectures through the entire semester and pulled an A- by taking good notes and studying hard the night before exams.",
        "course": "SHS2230"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "3360",
        "Class Name": "Observation in Speech-Language Pathology and Audiology",
        "Class Number": "21849",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3360",
        "Class Name": "Observation in Speech-Language Pathology and Audiology",
        "Class Number": "20935",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.17"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3370S",
        "Class Name": "Service Learning in Adult Neurogenics for Speech-Language Pathology",
        "Class Number": "28838",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6753",
        "Class Name": "Clinical Seminar in Speech and Language Disorders III",
        "Class Number": "28822",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.38"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "N/A",
        "Class Name": "Service Learning in Adult Neurogenics for Speech-Language Pathology",
        "Class Number": "22956",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "N/A",
        "Class Name": "Service Learning in Adult Neurogenics for Speech-Language Pathology",
        "Class Number": "22959",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "N/A",
        "Class Name": "Service Learning in Adult Neurogenics for Speech-Language Pathology",
        "Class Number": "22960",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "3360",
        "Class Name": "Observation in Speech-Language Pathology and Audiology",
        "Class Number": "15062",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.21"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6753",
        "Class Name": "Clinical Seminar in Speech and Language Disorders III",
        "Class Number": "22944",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.69"
      }
    ]
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Sharon",
    "id": "VGVhY2hlci04MDcwODU=",
    "lastName": "Ross",
    "legacyId": 807085,
    "numRatings": 18,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Here are the facts, people. This is unbiassed truth. Sharon is a really nice person, a little bit strange but who isn't? She loves linguistics and has complete confidence in her abilities and her knowledge, however she makes impossible online quizzes and projects that she grades like no one's business. Extremely hard to do well / 2 E J S z H s bit",
        "course": "LING1100"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Probably the worst professor Ive had at OSU. She assigned these IMPOSSIBLE online tests that have no clear answers. Had a B+, but because she waited until after the semester was over to give me FIFTIES on the project I finished w a C-. Some how I did better in calc 2 then I did her class and I really tried. Don't take her unless you have to.",
        "course": "LING1100"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is very unorganized when it comes to assignments. Any assignment she gives you is really busy and she is very picky. She is a very tough grader and when you ask questions, she makes you feel really dumb. She also has you read a bunch of papers and wants you to take notes. The notes are graded and if you do not put every detail in them, ur toast",
        "course": "LING3710"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hard exam, a lot of exams, low grades for project.",
        "course": "LING1100"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Having Sharon as a professor was a stressful experience. If you are somone who needs or prefers structure in learning, I wouldnt recommend taking her class. It was difficult to keep track of assignments, as there is no detailed syllabus/schedule. Shes knowledgeable about linguistics, but her disorganization undermined her efficacy as a professor.",
        "course": "LING2367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 4,
        "comment": "This class is ridiculous. It is set up really clearly but her tests are so hard and she doesn't create power points or helpful lectures to correspond with them. Class lectures are really all over the place. If I had a do-over I would NOT take Sharon and go with the other linguistics prof.",
        "course": "LING1100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is a very tough grader and deducts major points for slight errors. Test are taken on Carmen but they are very difficult and you never see what you were marked off for. I dread this class every week and would not recommend.",
        "course": "LING1100"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "She started off great, made us all feel like we could be open and ask questions and then when we would she was blunt and would say that she wouldnt answer them. Even to tell us that they were dumb questions.",
        "course": "ENG3271"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 4,
        "comment": "Terrible experience in this class. She says she wants to help those struggling but makes you feel stupid for asking questions. Very sarcastic and rude and then wonders why people do not want to come to office hours. I do not recommend taking this course from her at all.",
        "course": "LINGUISTICS201"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "I found this class pretty easy. Hw credit is just for turning it in. No tests, just 'problem sets' which are tough but she lets you revise them. She is extremely nice & helpful. She let the class learn at its own pace. Some students really struggled with the concepts though. If you're not good at algebraic type thinking, you'll probably struggle.",
        "course": "LING2001"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is helpful when you ask and she cares about the topic. The issue lies in that no set agenda for the class or layout as to what we would do that in class. I like to have a schedule so this was hard for me. She will help you learn about linguistics and writing, but make sure you are interested in linguistics or else you will get bored.",
        "course": "LING2367"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is all over the place. I regret taking her class because I feel that it could have been a lot better but she is no the best teacher to teach it. She seems like she means well at first but is a tough grader and expects everyone to care about linguistics as much as she does. You're better off taking another gen ed.",
        "course": "LING2367"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "Absolutely hated this course. Her teaching is so sporadic. She doesn't provide lecture notes online, even though the notes given in class aren't helpful whatsoever. Grades unnecessarily hard. Gets moody and annoying at times. Going to this class is the worst part of my day/week. ",
        "course": "LING2367"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is really interested in teaching and offers test corrections.  However, there is a lot of work - so you better come to class and you better do the readings.",
        "course": "LING371"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Sharon's great. She really, really, really wants you to understand the material and will go out of her way to help you if you ask. She offers revisions on problem sets (which is extremely helpful as they're pretty hard). If you have to take linguistics, I highly recommend her. As long as you go to class, you'll do fine.",
        "course": "LING280"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 3,
        "comment": "Although she sometimes seems like she's in her own little world of Linguistics, Sharon is a great TA. She always does her best to ensure her students understand the material. The problem sets can be difficult, but she offers revisions. She doesn't count attendance, but going to every class is important for comprehension of the material.",
        "course": "LING280"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "offers test corrections, and lectures in a clear orderly fashion",
        "course": "LINGU280"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "It was extremely boring and she was annoying.  Also, she has a record for bringing people in for academic misconduct- when it isn't even their fault, some kind of power trip... All in all, not a good class",
        "course": "LINGUISTICS201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.6,
    "department": "Speech & Hearing Sciences",
    "firstName": "Chris",
    "id": "VGVhY2hlci0xMDcxMTgz",
    "lastName": "Driscoll",
    "legacyId": 1071183,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "CD was a great prof for a student that has taken asl in high school. for new asl learners, I could see the frustration. there was a disconnect. he would get frustrated for students using their first language (English), and the students were frustrated because they couldn't communicate well in asl.",
        "course": "DSI1110"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Chris Driscoll was the best professor I have had to date. He is funny, wants his students to do well, and very understanding. I still remember everything he taught me! I recommend taking him, especially if it is your first experience with ASL",
        "course": "ASL101"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Chris is a great teacher and a great person! He really wants to see his students excel and will do everything in his power to help! If this is your first exposure to ASL, be prepared! From day 1 there is no speaking in his class.  It really forces you to learn sign though! Study vocab and you should be fine!",
        "course": "ENG101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Deaf! In every sense of the word!  Ha! Take his class. You will not regret it.",
        "course": "ASL103"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "American Sign Language Class.  Fantastic teacher.  One of the best in my time here.  Very clear and helpful.  Also, tests are very easy.  Pay attention and practice and this is an easy A.",
        "course": "ENG101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4.5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Eric",
    "id": "VGVhY2hlci0yNTkzMTYz",
    "lastName": "Johnson",
    "legacyId": 2593163,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Eric is amazing. He's super smart and also a naturally talented teacher. He has creative ways to make the more complicated concepts straightforward, and explains things clearly and concisely. Also, just a really great person. Would highly recommend.",
        "course": "SHS4440"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class is pretty straightforward if you attend and make some effort. Dr. Johnson has some great analogies that help you better understand the material. Downside is the grade is based on 4 exams that are all under 100pts each. There is extra credit but not enough to save you if you mess up drastically.",
        "course": "SHS4440"
      }
    ],
    "SEI": [
      {
        "Subject": "MEDREN",
        "Catalog": "5610",
        "Class Name": "Manuscript Studies",
        "Class Number": "33951",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Center-Medieval & Ren Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "MEDREN",
        "Catalog": "5610",
        "Class Name": "Manuscript Studies",
        "Class Number": "33952",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Center-Medieval & Ren Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "5"
      },
      {
        "Subject": "MEDREN",
        "Catalog": "5610",
        "Class Name": "Manuscript Studies",
        "Class Number": "34984",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Center-Medieval & Ren Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.83"
      }
    ]
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Leah",
    "id": "VGVhY2hlci0yNTUwMjI3",
    "lastName": "Demko",
    "legacyId": 2550227,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Leah was awesome and very laid back while remaining professional. She was always easy to talk to &amp; I often emailed her random Deaf culture videos that I wanted to learn more about. Class is a little more difficult if you dont have any ASL experience. I recommend finding some who is also learning ASL that you can practice with or the SignSchool app",
        "course": "SHS5714"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Speech & Hearing Sciences",
    "firstName": "Sarah",
    "id": "VGVhY2hlci0yNDg5NDEy",
    "lastName": "Little",
    "legacyId": 2489412,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Sarah was a good teacher. She cared about the material and went over each topic more than once to ensure that the information was clear. She provided review days before the exams & reviewed information in recitation for the quizzes. If you give an effort and show interest, you will do well. You cannot just skate by but it is not hard to get an A.",
        "course": "SHS3320"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Nothing terrible or amazing in the way she taught. The main issue with her is her way of grading. She clearly had favorites. People would submit answers to an assignment with the same responses and she would give one person a higher grade. She either disliked or loved you and that would be the determinant of how she graded your assignments.",
        "course": "SPHHRNG3320"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Andrew",
    "id": "VGVhY2hlci0yODYyNjI5",
    "lastName": "Blank",
    "legacyId": 2862629,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Andrew was awesome. I took him for the senior gened seminar, not speech and hearing, but he was very accessible and truly cared about our success. He gave great feedback, graded quickly, and was super responsive. Great guy. ",
        "course": "GENED4001"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "TAKE HIM!!!!!! I love this man with all of my heart. He is kind, funny, understanding, and does a great job of explaining the material. Much of the grade is taken from turning in his guided notes, which you can fill out by either going to the in-person lectures or watching his online versions. He gives a lot of free points. Every test is open-note!",
        "course": "SPHHRNG4440"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "4440",
        "Class Name": "Anatomy, Physiology, and Science of Hearing",
        "Class Number": "22493",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "21477",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "35",
        "Rating": "4.79"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "21008",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4440",
        "Class Name": "Anatomy, Physiology, and Science of Hearing",
        "Class Number": "22389",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "24042",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "32",
        "Rating": "4.97"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4440",
        "Class Name": "Anatomy, Physiology, and Science of Hearing",
        "Class Number": "21263",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "29",
        "Rating": "4.93"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4540",
        "Class Name": "Introduction to Audiology",
        "Class Number": "21266",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.89"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Eric",
    "id": "VGVhY2hlci0yODY2MzEy",
    "lastName": "Bielefeld",
    "legacyId": 2866312,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class as a Neuro major. Most of the content wasn't knew to me, but it probably was to the others who were mostly SHS. Lots of kids were going to grad school for audiology or related fields, and Dr. Bielefeld was a big help to them. The three exams are fair, the weekly quizzes are easy points, and he curves at the end. Great professor.",
        "course": "SPHHRNG5760"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Bielefeld wants everyone to pass his class. I think he just wants to share the knowledge of hos field and help people who want are interested. There was 3 exams and a few quizzes. Each 25% of the the grade. He has a very generous grade scheme. The exams are easy if you pay attention but there is quite a lot of content. He recorded each lecture.",
        "course": "SPHHRNG5760"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "24389",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "32",
        "Rating": "4.84"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6775",
        "Class Name": "Anatomy and Physiology of the Auditory System",
        "Class Number": "19678",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4440",
        "Class Name": "Anatomy, Physiology, and Science of Hearing",
        "Class Number": "21337",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.86"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "20756",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "53",
        "Rating": "4.89"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4440",
        "Class Name": "Anatomy, Physiology, and Science of Hearing",
        "Class Number": "21416",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "22411",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.82"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6775",
        "Class Name": "Anatomy and Physiology of the Auditory System",
        "Class Number": "17702",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "14883",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.86"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8934",
        "Class Name": "Hearing Conservation",
        "Class Number": "22987",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4440",
        "Class Name": "Anatomy, Physiology, and Science of Hearing",
        "Class Number": "22309",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "25781",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.71"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6775",
        "Class Name": "Anatomy and Physiology of the Auditory System",
        "Class Number": "21492",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "21032",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "33",
        "Rating": "4.85"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "8934",
        "Class Name": "Hearing Conservation",
        "Class Number": "37379",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "28097",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.58"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "6775",
        "Class Name": "Anatomy and Physiology of the Auditory System",
        "Class Number": "24057",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "5760",
        "Class Name": "Neurology of the Speech and Hearing Mechanism",
        "Class Number": "21290",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.92"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Speech & Hearing Sciences",
    "firstName": "Bethany Beth",
    "id": "VGVhY2hlci0yNTkzMTU5",
    "lastName": "Frick",
    "legacyId": 2593159,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Beth is awesome! Her exams are not the best (very application based) but as a lecturer &amp; person she is awesome. She is very open &amp; easy to talk to, genuinely seems like she cares about her students. She was great about that online transition after the Covid19 outbreak. Extra credit is available too.",
        "course": "SHS4430"
      }
    ],
    "SEI": [
      {
        "Subject": "SPHHRNG",
        "Catalog": "6150",
        "Class Name": "The SLPs Role Working with Individuals with Autism",
        "Class Number": "35092",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.8"
      },
      {
        "Subject": "SPHHRNG",
        "Catalog": "4520",
        "Class Name": "Introduction to Clinical Methods in Speech-Language Pathology",
        "Class Number": "21265",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Speech & Hearing",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "30",
        "Rating": "4.7"
      }
    ]
  }
]