[
  {
    "avgDifficulty": 2.8,
    "avgRating": 5,
    "department": "Speech amp Hearing Sciences",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0yMzA5NzM0",
    "lastName": "Lundine",
    "legacyId": 2309734,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lundine is brilliant, kind, and passionate about the subject matter she teaches. Not a work heavy course, but very engaging and easy to learn a lot. ",
        "course": "SPHHRNG3330"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is amazing!! She loves what she teaches and keeps the class interested. She reads the slideshows so attendance isn't necessary but I think it helped because she would explain topics in more detail and give examples. You have weekly quizzes, discussion posts, and one group project. It was an awesome class and I would take it again. ",
        "course": "SPHHRNG3330"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor overall. Lectures were long and there was lots of note taking but it was interesting and she always answered any questions I had",
        "course": "SPHHRNG3330"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "She gives interesting and interactive lectures, is super open to questions, and genuinely cares about student feedback. Having her as a professor was a great experience. Course content included: weekly discussion posts, module quizzes, and one group project + presentation.",
        "course": "SPHHRNG3330"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lundine is one of my favorite professors at OSU! The class was relatively straightforward with 3 exams and a couple written assignments, and Dr. Lundine is very approachable if you have any questions. Not only is she at the top of her field, but she enjoys teaching and welcomes student discussion/feedback. 10/10 recommend taking her class!",
        "course": "SPHHRNG3330"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Speech amp Hearing Sciences",
    "firstName": "Victoria",
    "id": "VGVhY2hlci0yNzcxMTUy",
    "lastName": "Sevich",
    "legacyId": 2771152,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Victoria is an absolute angel.  The content can get a bit difficult at times (as is the nature of any anatomy course), but she gives you plenty of opportunities to gain points outside of the exams and boost your grade if needed.  She is positive, caring, funny, and understanding, and I would recommend her in a heartbeat.",
        "course": "SPHHRNG4440"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 5,
    "avgRating": 1,
    "department": "Speech amp Hearing Sciences",
    "firstName": "Evelyn",
    "id": "VGVhY2hlci0yMjgyMzIz",
    "lastName": "Hougland",
    "legacyId": 2282323,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "She's not great at helping those in SLDS, was actually quite rude when speaking about the need for it. Zooms through the material without much explanation. Huge project at the end that involves interviews and is mainly exam-based. Do not take it, it's not worth it.",
        "course": "4430"
      }
    ],
    "SEI": []
  }
]