[
  {
    "avgDifficulty": 1.7,
    "avgRating": 5,
    "department": "Teaching amp Learning",
    "firstName": "Cynthia",
    "id": "VGVhY2hlci0yMjg3MzI2",
    "lastName": "Tyson",
    "legacyId": 2287326,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Exactly what you want from an online gen ed class. Just look up YouTube videos of read alouds of the picture book for the book reports. Super easy and can get the work done for the week in about 30 minutes. The final is a 5-7 page essay though, but since the rest of the class is a breeze you really can't complain about it.",
        "course": "EDUTL2368"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had this course online so it was really easy. You're just reading picture books and children's books and discussing what you learned from that week in a page-long summary, book report, or other assignment. She's not super fast at emailing back, but she was a chill professor, and it was an easy A. The only large assignment was the final essay.",
        "course": "EDUTL2368"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took Intro to Children's Literature, so you're discussing children's books and to make it better, Cynthia is very down to earth. She is funny and sassy which makes the class bearable. She expects you to be in class with the books read and work done, but overall its a fun class to take!",
        "course": "EDUTL2368"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Teaching amp Learning",
    "firstName": "Peter",
    "id": "VGVhY2hlci0yNDg0NTY2",
    "lastName": "Sayer",
    "legacyId": 2484566,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I have had Dr. Sayer twice now and I think that he is one of the most chill professors and is flexible with due dates. There is reading to do every week but it was never long or difficult to understand. He also incorporated a lot of group work during class so he isn't just a sit and listen to me talk type of professor. Take his class if you can!",
        "course": "5640"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 5,
    "department": "Teaching amp Learning",
    "firstName": "Tamara",
    "id": "VGVhY2hlci0yMzg5OTYz",
    "lastName": "Roose",
    "legacyId": 2389963,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is my favorite professor! There are two to three assignments each week. The class is all about writing the essay and presentation. She really cares about her students and their grades! We only need to attend the zoom meeting once a month. If you submit all the assignments in time, it's an easy A!!!",
        "course": "EDUTL1901"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Tamara is a great professor and we all love her. She did a great job in the lecture that we can have a relax and funny class. She really cares about her students and she would do anything that can help you for your grade or essays even not fo this class. Only an essay and a presentation is matter for this class, and its easy to get.",
        "course": "EDUTL1902"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "My favorite prof at OSU so far!",
        "course": "EDUTL1902"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of my favorite prof at OSU! Today I met her at the lib and she recognized me even tho I took her class a year ago! Didn't expect that at all! Aw, that's so sweet. She's just so kind and she DOES care about international students! Not harsh on grades, respects on your opinions, you'll get a good grade as long as you put work on it!",
        "course": "EDUTL1902"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Love her",
        "course": "EDUTL1902"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Respect students and give good feedback. Learn a lot. Weekly HW paper is not very long, and could be completed within 1 hour. Make sure you don't arrive late or leave early, because the participation matters. Overall, a good professor and a easy class.",
        "course": "EDUTL1902"
      }
    ],
    "SEI": []
  }
]