[
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Teaching & Learning",
    "firstName": "Eric",
    "id": "VGVhY2hlci0yOTc3NTYz",
    "lastName": "Jaburek",
    "legacyId": 2977563,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Mr. Eric is a great teacher who truly cares about his students. He makes the lessons entertaining even though this is a boring class, and makes sure he knows all of his students. He checks in on students that appear to be struggling, & makes the environment very easy going. Shockingly enough I actually looked forward to going to his class everyday",
        "course": "GenEd1201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Eric is a nice guy and he always tries to make the lecture appealing to students even although this is a boring 1-credit-hour class. Easy to pass and get an A !",
        "course": "GenEd1201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "GenEd 1201 was not a fun class and had a lot of repeated information. However, Eric made the class a lot more fun and appealing to go to. Accepted late credit, made the class a fun learning opportunity, and was an easy person to talk to. 10/10",
        "course": "GenEd1201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 4.2,
    "department": "Teaching & Learning",
    "firstName": "Shannon",
    "id": "VGVhY2hlci0yOTAzMjI5",
    "lastName": "Gonzales-Miller",
    "legacyId": 2903229,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Gonzales-Miller was a very good professor. She truly cared for the students. The course itself is pretty easy and boring at times. She was pretty lenient on deadlines and wanted her students to succeed.  ",
        "course": "GENED1201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "As we all know, GE Launch is a boring class but this professor makes it better as she is caring, entertaining, and gives great feedback on assignments. Also she let us out of class early 90% of the time. ",
        "course": "GENED1201"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Gonzales-Miller is very nice and thoughtful, and she offers interesting perspectives in her lectures. However, the course as a whole is a drag and waste of time.",
        "course": "GENED1201"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor, but the class felt unnecessary.",
        "course": "GENED1201"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Gonzales-Miller was a little droning in her lecturing, but she conveyed what we students needed to know adequately enough. She was very nice and did give great feedback on my assignments, too. She is not the problem--the course material is the problem. GE Launch Seminar is the most pointless and mind-numbing course ever to exist.",
        "course": "GENED1201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 1.1,
    "department": "Teaching & Learning",
    "firstName": "Ruby",
    "id": "VGVhY2hlci0yODcyNTAy",
    "lastName": "Pentsil-Bukari ",
    "legacyId": 2872502,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "I had her for GE launch which is just a terrible class to begin with but somehow she made it worst. We would have assignments weekly and every assignment was just rewriting our goals over and over just restated and she would still give 50% no matter how much effort you put into it. It was just a miserable experience overall. ",
        "course": "GENED1201"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do not take this professor. I am warning you. Very harsh grader, did accomodate to my SLDS accommodations. Refuses to regrade an assignment that was submitted accidentally. Gives out 50 percents like it's nothing. When I asked how to improve my grade, she simply told me to look at Carmen. She does not care about her students.",
        "course": "GENED1201"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "She made the class way more difficult than it had to be. She told me to write in a way that I had learned not to write in high school. (I was in Honors and AP ELA all throughout school) Anyways she takes offense to people doing bad on the assignments but there is 0 guidance or explanation ",
        "course": "GENED1201"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 1,
        "comment": "Worst gen ed teacher available. Do not take her! She grades papers like they are for a Harvard literature class. Average was 60 on some assignments. Far too difficult for a one credit class, and you should avoid at all costs.",
        "course": "GENED1201"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Made a 1 credit hour GE course weirdly hard. ",
        "course": "GENED1201"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Actually a terrible teacher.  What makes what should be an informative class about GE one of the hardest classes.  Feels like she purposefully makes it hard on purpose.  Grading is super strict, does not respond to emails or comments.  Seems like she genuinely just wants students to have to work very hard for a 1 hour credit class.",
        "course": "GENED1201"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "The class was very harsh, and the class atmosphere was not good. There were no students who wanted to deal with her, and they were always delayed. The students who wanted to seek help were also negatively responded by her. ",
        "course": "GENED1201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Teaching & Learning",
    "firstName": "Kelli",
    "id": "VGVhY2hlci0zMDA0MjY3",
    "lastName": "Whitcomb",
    "legacyId": 3004267,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Her upbeat attitude and generosity helps make class a breeze! I understand it would be difficult to interest people in this superfluous 1-unit class that is necessary to graduate and get out of the way. The material that the university deems necessary, is honestly sort of just fluff. The assignments are easy, so complete them and you will pass.",
        "course": "GENED1201"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 3,
    "department": "Teaching & Learning",
    "firstName": "Myung-Jin",
    "id": "VGVhY2hlci0yNjAzNDc4",
    "lastName": "Kim",
    "legacyId": 2603478,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class made me think of what sort of teacher I would like to be. Not a lecture but like a seminar. Participation matters... At first, I was a little nervous since I had to move, act out, and sit in a circle.",
        "course": "EDUTL5101"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 3,
        "comment": "Well meaning, but I couldn't tell you one thing I got out of this class. Instructions are often unclear and it seems like we spend every week doing the same thing, which is saying a lot considering its a 2.5 hour class. MJ puts a lot of emphasis on everyone having a say but then makes us participate in her way, how she wants it, very frustrating",
        "course": "EDUTL5101"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "I would never take her class again, she is very hard to understand and shes kinda rude sometimes. She tells you that you are doing her work wrong but doesn't explain it good enough. If she is my instructor again I'll drop the class.",
        "course": "EDUTL5101"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Myung Jin was an awesome professor! Through her class, I have developed a deep love for teaching using drama (acting out!). What I loved about her class was that it was fun; the fact that I enjoyed almost every lesson. Being surrounded by like-minded peers and professor who share their passion for teaching, allowed me to build a creative pedagogy!",
        "course": "EDUTL5101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 3.2,
    "department": "Teaching & Learning",
    "firstName": "Emilie",
    "id": "VGVhY2hlci0yNTIzNTY5",
    "lastName": "Curtis",
    "legacyId": 2523569,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy class and easygoing professor. Lots of assigned reading but you can get away with not doing a lot of it, and didnt take long to complete assignments. Enjoyed the small group discussion and activities.",
        "course": "EDUTL5225"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Way too much work assigned for the end of the semester, over 70+ pages of writing in just the last two weeks of class for projects only worth 10-15 points. Prof grades too harshly for someone that gives unclear instructions, time crunching due dates, and pathetic feedback. The amount of work you put into this class will not show in your final grade",
        "course": "EDUTL5225"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Flexible about assignments/deadlines and good about responding to emails, but a ton of reading and assignments piled up towards end of semester- partly on me for not starting to work on those earlier tho. Also major assignments didn't seem like they were worth enough points for the effort required.",
        "course": "EDUTL5225"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "By far the WORST professor Ive had during my academic career. She preaches self-care but I dont think she truly cares about it with the insane amount of assignments and projects she makes you do in a short amount of time. She takes forever to grade things. When she does grade she is so hard and tough. DONT TAKE THIS CLASS WITH HER!",
        "course": "EDUTL5225"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "I have never had such a terrible a professor. Assigned four projects the last two weeks of class, all of which took over 6 hours each to complete. Did not teach helpful material during class and assigned an overload of readings every week.",
        "course": "EDUTL5225"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "I didn't learn much. It was lecture heavy. She gives a ton of projects with little to no explanation so my whole class was confused. I wouldn't want another class with her as my professor.",
        "course": "EDUTL5225"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is an amazing professor but there were times where I felt like I really didn't need to come to class. She was flexible on when assignments were but she also assigned a ridiculous amount of work at the end of the year and didn't really care that a lot of us are taking 4 other classes.",
        "course": "EDUTL5225"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class requires you to rent/buy multiple books. The books are easy reads, but it is heavy on the reading. I didn't read like half of the books and I manages to fake my way through. Emilie is very kind and you can tell she cares about her work. I looked forward to this class each week. I bet it would be even better in person.",
        "course": "EDUTL2368"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "shes a good teacher. easy workload. just show up, participate and youll be good. shes really nice and cares about her students well being!",
        "course": "EDUTL2368"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Emilie is a wonderful professor. She gives clear expectations and is wonderful at talking about difficult topics with large groups. There is a lot of really in this class but it's enjoyable.",
        "course": "EDUTL2368"
      }
    ],
    "SEI": []
  }
]