[
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Textiles  Clothing",
    "firstName": "Joyce",
    "id": "VGVhY2hlci0xOTcyMjY1",
    "lastName": "Brooks",
    "legacyId": 1972265,
    "numRatings": 3,
    "summary_comment": "Professor Brooks is highly regarded for her dedication to student success,展现出她对学生成功的深切关怀。她知识渊博，善于与学生沟通，并且非常理解学生，允许开放笔记考试，鼓励积极参与课堂。总的来说，她是一位深受学生尊敬和喜爱的优秀教师。",
    "summary_comment_short": "Professor Brooks is highly regarded for her supportive and understanding approach, allowing open-note midterms and offering lenient grading to help students succeed. She is known for her extensive knowledge of the industry and her ability to connect with students, making her a beloved and respected professor.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joyce is a teacher who truly wants her students to have the opportunity to succeed. She is super nice and understanding &amp; allowed all of her midterms to be open-note. Loved this class!",
        "course": "CSFRST4585"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "I absolutely LOVE Joyce's classes. She is a very understanding teacher and knows a lot about the industry. She is very knowledgable and relates to students well. Joyce is the type of teacher that students respect and adore! ",
        "course": "3474"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joyce is one of my all time favorite professors. She is very lenient when it comes to grading and she cares about her studentswants them to succeed. She tells a lot of random stories but you learn to listen and laugh along. Great professor. Participation points given by signing in to each class. ",
        "course": "CSFRST3474"
      }
    ],
    "SEI": []
  }
]