[
  {
    "avgDifficulty": 3,
    "avgRating": 2.5,
    "department": "Textiles & Clothing",
    "firstName": "Trina ",
    "id": "VGVhY2hlci0yOTc3NjEx",
    "lastName": "Gannon Blair",
    "legacyId": 2977611,
    "numRatings": 2,
    "summary_comment": "Professor Gannon Blair's teaching quality is highly variable according to student feedback. Some students find her classes overwhelming with excessive homework and quizzes, leading to significant stress. Others, however, appreciate her clear organization and passion for the subject, noting that she is supportive and accessible, which helps them excel once they adjust to the workload.",
    "summary_comment_short": "Professor Gannon Blair's teaching approach is characterized by an overwhelming amount of homework and frequent quizzes, which some students find extremely demanding and stressful. Conversely, others appreciate her clear organization and passion for the subject, noting significant personal growth once they adapted to her teaching style.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "I have immense rage for this class. Why on EARTH is there so much homework. There was sometimes TWO QUIZZES plus more homework and doing the quizzes would take forever. I would do ANYTHING but take this class again. Why is there more homework in this class than classes for my major. Don't take this class unless you want to go through torture",
        "course": "CSFRST2374"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I took CSFRST 2374 for my history gened req and I dont regret it. Took me a while to get into the swing of things, but then I excelled in the course. Trina is very helpful, easily accessible and organizes her course very clearly. She seemed to love what the course had to offer and I did too!",
        "course": "CSFRST2374"
      }
    ],
    "SEI": [
      {
        "Subject": "CSFRST",
        "Catalog": "2374",
        "Class Name": "Twentieth Century Fashion and Beyond",
        "Class Number": "10099",
        "Term": "SU 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.7"
      },
      {
        "Subject": "CSFRST",
        "Catalog": "2374",
        "Class Name": "Twentieth Century Fashion and Beyond",
        "Class Number": "10618",
        "Term": "SU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.62"
      },
      {
        "Subject": "CSFRST",
        "Catalog": "2374",
        "Class Name": "Twentieth Century Fashion and Beyond",
        "Class Number": "14296",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "123",
        "Rating": "4.35"
      },
      {
        "Subject": "CSFRST",
        "Catalog": "2374",
        "Class Name": "Twentieth Century Fashion and Beyond",
        "Class Number": "14088",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "106",
        "Rating": "4.52"
      }
    ]
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.6,
    "department": "Textiles & Clothing",
    "firstName": "Kathleen",
    "id": "VGVhY2hlci0xMjM4Mjg3",
    "lastName": "Penley",
    "legacyId": 1238287,
    "numRatings": 21,
    "summary_comment": "Professor Penley is known for her engaging and passionate teaching style, making classes interesting and fun. However, she is noted for being very particular and harsh in grading, often taking off points for minor issues and being difficult to please, especially in projects. Students find her exams and pop quizzes manageable, but warn that the class requires consistent effort and punctuality.",
    "summary_comment_short": "Professor Penley is known for her passionate and engaging teaching style, making classes interesting and fun. However, students find her grading to be quite stringent and sometimes difficult to navigate, with many citing issues related to point deductions and subjective assessments.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Nice, interesting & approachable. Answers to the pop quizzes are quite subjective, very frequently disagree with her explanation. Exams are  fine. A fair grader, might be a bit picky on projects. Up to 30 or 40 extra credit. No need of book. Materials are easy but hard to apply to real examples. ",
        "course": "2370"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Pop quizzes are at the beginning of class; she won't let you take them if you're a few minutes late.  You will lose a lot of points for unknown reasons, even when you ask or try to explain.  Very snooty and all knowing. Group projects will kill your grade because what is okay in your drafts will not be okay in your final.  Extremely harsh grader.",
        "course": "CSFRST2370"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "If possible, don't take her class!!!!! You even don't know why you got points off, very ridiculous and strict. Easy class, but easy to loose points. Worst teacher i ever have in OSU. ",
        "course": "2370"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 4,
        "comment": "Ms. Penley is very particular about her answers. She takes points off everywhere she could. The materials are interesting, but not so much on group projects. There's also the personal branding project at the end, where she judges it based on \"HER personal opinions\". This class reminded me why fashion majors have a hard time finding jobs.  ",
        "course": "2370"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "So you think this class is about fashion? NOPE. You have to design architecture, landscapes, etc based off an object or word. It takes a lot of time, and she doesn't tell you exactly what you have to do, then she takes off a bunch of pts. You don't need the book, but I don't recommend this class, esp. if you just want a fun elective.",
        "course": "2370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the best professor in the fashion major here at Ohio State.  You can tell she has such a strong passion in her classes! Makes classes so much fun & interesting!",
        "course": "CSFRST"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class is a lot of work but its not bad, she breaks it down so its manageable.  Get to class on time she is picky about it. No text needed which is nice.  Only a final, in class assign, hw, and attendance.  Not a difficult class but she is picky and its quite a bit of work.",
        "course": "CSFRS4575"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 5,
        "comment": "Good teacher she just tends to make things ahrder than they need to be. she also grades VERRRRy hard",
        "course": "FRS270"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "In class assignments randomly. She's very picky about the answers that she's looking for regarding fashion terms on assignments and tests. Hard grader with group and individual projects. Text NOT needed at all.",
        "course": "FRS270"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Awesome teacher, she keeps the class entertained and keeps the lectures interesting. The class itself is not hard, just a lot of work. Group projects are a big part of your grade so you NEED a good group. and she gives an insane amount of extra credit. i never even picked up the book. I would highly recommend this teacher!",
        "course": "FRTS270"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class requires work/studying (which I'm not mad about, so whoever said Fashion students hate doing work can shut up). If you want an A, go to class, read the Powerpoints, and glance at the book every once in a while. Projects are worth a lot so make sure your group doesn't suck. Difficult as far as CSFRNTS classes go, but not impossible.",
        "course": "CSFRN270"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "As far as the fashion courses go Whitman's classes are the most difficult. However, that's not really saying much. Fashion students just get mad when they have to do any work or studying. She's incredibly intelligent, quirky sense of humor, knows her stuff, and actively engages the  class. Plus she has an insanely gorgeous silhouette.",
        "course": "FRS372"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is a very fun, upbeat teacher and her lectures go by really fast because it's not boring. Her classes are hard, but you learn a lot if you apply yourself. Love having her as a teacher!",
        "course": "FRS375"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "Whitman is a really good teacher, but her classes are notoriously hard. If you work hard and show that you're making an effort, she's really willing to help you out and give you suggestions.",
        "course": "FRS375"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is young, fun, and tries to make the subject interesting. Depending on the class, the material can be slightly hard, but if you have to take it I would definitely recommend her!",
        "course": "FSNRT525"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 5,
        "comment": "She's really nice and helpful when you talk to her, but she grades REALLY HARD on tests and projects. Overall though, she's a great teacher who knows what she's talking about.",
        "course": "FRS525"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 4,
        "comment": "Does not seem to know what she's talking about. Given that she has a degree in interiors, does not make her suitable to teach fashion. Waste of my time, I didn't learn anything.",
        "course": "TC525"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 5,
        "comment": "She is friendly, I'll give her that. She does give a lot of work and tries to make them harder than it really needs to be.",
        "course": "TC375"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 5,
        "comment": "seems the classes I have taken from her so far arehard and lots to learn.",
        "course": "TXTCL375"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 4,
        "comment": "she is really cool. not super easy but is young and fun and not bad to look at. go to class and listen to her teach and you will have no issue. treats you like a peer not a student",
        "course": "CSTXT371"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "She is nice, but I was so disappointed that Nathlich was teaching this class. Nathlich was so much easier with her exams. Whitman is trying to be a serious and hard professor in a class that doesnt need to be so hard.",
        "course": "TXTLC375"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.2,
    "department": "Textiles & Clothing",
    "firstName": "Patricia",
    "id": "VGVhY2hlci0xNTU3ODQ5",
    "lastName": "Cunningham",
    "legacyId": 1557849,
    "numRatings": 5,
    "summary_comment": "Professor Cunningham offers a relatively easy course with minimal assessments, focusing on weekly reflection papers instead of tests or quizzes. The class includes field trips, guest speakers, and free food, making it appealing to many students. However, some find the class quite boring and less engaging.",
    "summary_comment_short": "Professor Cunningham offers a fun and easy A class with minimal testing, focusing instead on weekly reflection papers and frequent field trips or guest speakers. However, some students find her lectures very boring despite her nice demeanor and easy grading standards.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was so much fun. No tests or quizzes, only weekly reflection papers that were easy to write. There was always food in class and we went on field trips or had guest speakers often. Would definitely recommend!",
        "course": "ESHESA2570"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was a fun course, very small class. We went on field trips and had food in every class period. Super easy A. No midterm or final, just a weekly reflection.",
        "course": "ESHESA2570"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Okay first off let me tell you she is very very boring. She a nice teacher. Grades really easy. Some of the material on exams are not in notes or readings but its common sense so no worries. If your looking for an easy A then take her but be warn her class is no fun!!!!",
        "course": "CSFSN200"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "easy to follow and doesn't grade too hard. she also posts all power points online. definitely would recommend her",
        "course": "CSFNR200"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "Such a nice lady but so boring. SO BORING.",
        "course": "FRS374"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 2.4,
    "department": "Textiles & Clothing",
    "firstName": "Patricia",
    "id": "VGVhY2hlci0xMTA4ODgy",
    "lastName": "Cummingham",
    "legacyId": 1108882,
    "numRatings": 9,
    "summary_comment": "Professor Cunningham is known for her extensive knowledge of fashion, particularly among students who appreciate her expertise. However, her classes are often described as extremely boring and difficult to engage with due to her age, hearing issues, and tendency to go off-topic. Despite these challenges, she is generally considered an easy grader and is viewed more positively by newer students who find her more knowledgeable than other professors in the field.",
    "summary_comment_short": "Professor Cunningham is known for her extensive knowledge of fashion, making her lectures informative despite their often tedious nature. However, her age and hearing difficulties can make in-class interactions challenging, and some students find her classes overly boring with random activities that can be monotonous.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "This woman is at least 75 years old, but she is still stylish. She can't hear and is oblivious to what goes on in the classroom. Her TA is psycho. But this class is the easiest I have ever taken at OSU. You have to go to class because of random activites but bring something to do becuase it gets boring.",
        "course": "CSFRS200"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 1,
        "comment": "She has the knowledge of someone who's only read fashion magazines all her life. She is old, hard of hearing, never answers ANY of your questions properly. She reminds me of a geriatric valley girl. She is so peppy it's hard to hate her, but I hated her class and hope I never have to take another.",
        "course": "TC0010"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "I could not stand listening to her. Super boring, but she had quizzes randomly which also determined attendance so you had to go. The book was NOT worth buying, never used it. AND she had the worst TA ever- super snobby and knew nothing about fashion!",
        "course": "FRS200"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Painfully boring. She's hard to talk to because she can't seem to hear well. Tends to go on tangents and not get back to the main point of the lecture, but a very easy grader, and very nice. Not the worst professor, but not the best.",
        "course": "FRCSTFRS"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "she knows her subject well and is tremendously helpful when needed.",
        "course": "TC374"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's not as bad as I thought (previous reviews). This is my first time having her and she seems to know more about fashion than the rest of the professors I had (e.g whitman). Her lectures can be a bit boring, but she really knows what she's talking about!",
        "course": "TC374"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "make sure to write down everything she says because the smallest thing will be on the test, it's all true and false and drink a lot of caffeine prior to class. She is soooooooo boring",
        "course": "TXT674"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "so boring!!!!! every minute in her class was agony",
        "course": "TC674"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "TC374"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 3.6,
    "department": "Textiles & Clothing",
    "firstName": "Julia",
    "id": "VGVhY2hlci0xMTQ1MDU0",
    "lastName": "Cooper",
    "legacyId": 1145054,
    "numRatings": 30,
    "summary_comment": "Professor Cooper is described as having mixed reviews, with some students finding her classes easy and entertaining, while others found her abrasive and unprepared. Many noted that attendance is important due to in-class activities and point contributions, and that the material can be straightforward, allowing for good grades with minimal effort. However, there are also criticisms of her teaching style, with some students finding her lectures and examples overly simplistic or irrelevant.",
    "summary_comment_short": "Professor Cooper is known for her entertaining and occasionally challenging teaching style, with some students finding her classes easy and others feeling they were not adequately prepared or engaging. Her approach can vary widely, with some students appreciating her effort to make the material fun and accessible, while others find her lectures and teaching methods lacking in depth and preparation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "I've had Cooper a few times and it takes a little time to know the real her. She genuinely cares and has good intentions, but she sometimes has mood swings. She'll go out of her way to talk to you and, if you make her mad, she's quick to forgive. Easiest classes ever! She's not that clear about what she wants because she's not particular. Easy A",
        "course": "FRS275"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Cooper is terribly abrasive and obnoxious. She flaunts her authority in class everyday and is quite pretentious. She clearly plays favorites so get on her good side. Terrible prof. She gives the most colloquial examples EVER for a consumer behavior class: please stop treating us like we're 7th graders- we can comprehend more complex examples. Easy",
        "course": "CONSC543"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Must go to class because it is worth points and she does in class activities but class is super easy. I just looked over the notes a couple times before the exams and got A's. Reports for the class take a half hour tops. Super easy and Cooper is nice if you stay on her good side, which I would definately recommend!!",
        "course": "CNSCI543"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "I guess she is kind of funny and entertaining also a little obnoxious and blunt. But her class is easy and I think she was right in thinking it wasn't necessary to meet twice a week about it, I preferred doing it at home, though maybe she should make it an official online class. Skim the book, you'll do great and might learn a little something.",
        "course": "CSFRS275"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 2,
        "comment": "Ms. Cooper was hilarious and crazy. She always tried to make coming to the class fun and entertaining. The material was kind of boring throughout the slides but overall it wasn't a bad class to go to at 8:30 am.",
        "course": "FRS270"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "She changed 275 to a &quot;hybrid&quot; course; meaning that it was ALL online (yes, even the tests). I would go over the powerpoints that she provided just before taking the test (and also look at them during the test) and got a 100% every time. EASIEST A EVER!",
        "course": "TXT275"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 2,
        "comment": "She is not funny at all. She doesn't teach. Just put slides online and you do the quizes online too. She gave bonus, but when you late 1sec, u don't get it.!!",
        "course": "FRS275"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 2,
        "comment": "Easy teacher but super boring and snobby. She thinks she is better than everyone else and is very rude to students (especially foreign ones who can't pronounce certain designers right). She is also never prepared and easily the laziest teacher I have ever had in my life.",
        "course": "FRS270"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 2,
        "comment": "I have no idea why people are giving her good ratings....other than the fact that she is easy. Cooper is definitely  THE laziest teacher I have ever had. The class only meets 3 times during the quarter but it's completely pointless and all you do is hand in your case as an attendance grade. Definitely don't recommend her. Subject matter is boring.",
        "course": "CFS275"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 1,
        "comment": "Miss Cooper is WONDERFUL! She may be incredibly easy, and not necessarily the smartest woman in the world, but she's great. She will help you when you need it, and she's HILARIOUS in class. You can easily do well in this class, but you do have to go-attendence is graded. I would recommend taking a course with her! Love her!",
        "course": "FASH270"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 1,
        "comment": "i agree w/person below:she is very lazy when it comes to teaching. she ends class really early but u still have to go because attendance is a part of your grade. i would get the textbook b/c u use it in con340 as well. test are easy if u review powerpoint slides a few days b4 exam. she does keep class interesting which helps. Overall...easy A",
        "course": "CON543"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "One of the laziest teacher i know. You have to teach yourself because she dont know what she's talkin about and she got a smart month. Class is easy and easy A..",
        "course": "CONSC543"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing teacher! Has tons of energy and makes the class fun and interesting. She only wants the students to do well and will help you if you have questions about anything!",
        "course": "CNSCI543"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher! Really fun and friendly, and makes class interesting. As long as you show up for class and look over the slides, you'll do well in the class.",
        "course": "FRS275"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's a great teacher, always willing to go the extra mile to help you out. At times she can be hilarious.",
        "course": "CS694"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 1,
        "comment": "Her class is easy and you are usually out within an hour",
        "course": "CS543"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "funny crazy lady but if your nice to her she'll do the same for you",
        "course": "TXTCL275"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 1,
        "comment": "I got a B- in the class. Then again i never studied. class its self was easy and ms cooper tried to keep your attention",
        "course": "CS543"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "She kept it really fun, but like others mention, she doesn't treat it very seriously. Easy exams and assignments, but this was the first time she taught this course. Overall, a fun class. She does use attendance as a grade, but she told us when.",
        "course": "CS543"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "i love ms. cooper! she can have an attitude, but her classes are SUPER easy.",
        "course": "TXT200"
      },
      {
        "index": 21,
        "rating": 3,
        "difficulty": 1,
        "comment": "She doesn't seem smart and can be a bit rude. The class is kinda of pointless but it's an easy A even though the final exam is a bit difficult.",
        "course": "TC270"
      },
      {
        "index": 22,
        "rating": 2,
        "difficulty": 1,
        "comment": "She's rude, outspoken, and wants everyone to have the same opinion as her... the class itself is an easy A.",
        "course": "TC200"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 1,
        "comment": "Probably one of the most laid-back professors @ OSU. Very cordial, but will tell it like it is- don't be late to class & interrupt! States on syllabus on what days to attend for attending points. Genuinely wanted to help students, she even wrote a recommendation for me for grad school!",
        "course": "TC275"
      },
      {
        "index": 24,
        "rating": 2,
        "difficulty": 1,
        "comment": "Really worthless class and she is a really moody teacher, do not catch her on a bad day!",
        "course": "CSTXT200"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is my favorite lecturer at OSU.I have taken her for 3 classes and have enjoyed each.Her notes are clearly outlined in powerpoint on carmen.Shes trying to put more assignments online so coming to class isn't mandatory,however I very much encourage attendance, even if you don't come regularly,she knows you and will point you out. Highly recommend",
        "course": "CSTXT275"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is an extremely easy class, but if you take this class seriously, you are going to be disappointed: she doesn't.  Lectures are boring, and you won't learn a thing, but you'll definitely get an A.",
        "course": "CSTXC275"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "She makes the class easy, the lecture is light, and you will end up with an A. But don't BE LATE. She may go off on you if she likes.",
        "course": "TXTLC275"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take her at any chance you can get! Super easy and super helpful! All tests open notes/book!",
        "course": "TC270"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "TC270"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Teacher! Makes everything very easy to understand.",
        "course": "TC270"
      }
    ],
    "SEI": [
      {
        "Subject": "INTMED",
        "Catalog": "7100.04",
        "Class Name": "Advanced Clinical Skill: Cancer Counseling",
        "Class Number": "34703",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "Internal Medicine",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "INTMED",
        "Catalog": "7100.04",
        "Class Name": "Advanced Clinical Skill: Cancer Counseling",
        "Class Number": "37070",
        "Term": "SP 22",
        "College": "The College of Medicine",
        "Department": "Internal Medicine",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "INTMED",
        "Catalog": "7100.05",
        "Class Name": "Advanced Clinical Skills - Genetic Counseling Specialties",
        "Class Number": "37081",
        "Term": "SP 23",
        "College": "The College of Medicine",
        "Department": "Internal Medicine",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "INTMED",
        "Catalog": "7100.05",
        "Class Name": "Advanced Clinical Skills - Genetic Counseling Specialties",
        "Class Number": "3531",
        "Term": "SP 24",
        "College": "The College of Medicine",
        "Department": "Internal Medicine",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      }
    ]
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 3.6,
    "department": "Textiles & Clothing",
    "firstName": "Jean",
    "id": "VGVhY2hlci0xMTAxNTkz",
    "lastName": "Nathlich",
    "legacyId": 1101593,
    "numRatings": 7,
    "summary_comment": "Professor Nathlich is known for her extensive knowledge and willingness to help students, though her lectures are often described as rambling and unclear, which can make it difficult for students to follow and prepare for tests. Despite this, many students appreciate her supportive nature and her allowance of notes during exams. Overall, while some find her approachable and helpful, others feel that her teaching style could be more structured and engaging.",
    "summary_comment_short": "Professor Nathlich is known for her extensive knowledge and willingness to help students, though her lectures are often described as boring and unclear, with a tendency to ramble. Despite this, many students appreciate her approachable nature and her support during exams and when clarifying material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "NO NO NO NO NO! I dont think you can avoid her if your a T&C major, but i wish you could! she is incredibly boring. she also isnt clear about what she is lecturing about or about what is on her tests. rambler.",
        "course": "TXT100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very nice lady, but could've gotten a lot more out of the class then what I did. The projects were very scatter-brained & I wish they were more organized. I felt like she played favorites to an extent.",
        "course": "TC375"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very willing to help you!",
        "course": "TC371"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's great",
        "course": "TC371"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher! Really wanted you to understand the material and helped you in any way possible. Would definatley recommend!",
        "course": "TC371"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Absolute sweetheart.  Has a bit of a hard time working with Carmen, because she doesn't really understand how to make corrections to quizzes et cetera.  Let's you use notes and your books on exams, and pretty much walks you through anything you need help with.  Such a nice lady!",
        "course": "TC371"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Great knowledge.  Willing to correct poorly worded quiz questions.  Gets off subject alot.",
        "course": "TC375"
      }
    ],
    "SEI": []
  }
]