[
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Matthew",
    "lastName": "Yde",
    "legacyId": 1153687,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "Interesting information.  Creative.  Kind.  Became newspaper theatre critic in later years."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "great"
      },
      {
        "index": 2,
        "rating": "4.5",
        "comment": "Such a good teacher! Definitely easy to get an A if you read the plays and go to class. He will look over your papers before you hand them in and give you feedback. He is also super nice!"
      },
      {
        "index": 3,
        "rating": "4.0",
        "comment": "Easy A. Just do the readings(which aren't that long) and show up+A."
      },
      {
        "index": 4,
        "rating": "4.0",
        "comment": "Very biased. I am liberal, but Mr.Yde takes it to a whole new level. Very easy course overall. It was also very informative. And there wasn't much reading in the course : )"
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "He is a genius.  It is an eye opening experience to take this course and the course is highly interesting."
      },
      {
        "index": 6,
        "rating": "4.5",
        "comment": "Not anti-american at all, just anti-stupidity. Definitely biased, but he was really cool about differences in opinion and encouraged a lot of discussion. Showed awesome films."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Well-versed.  Informative.  Protege of Dr. Woods, and a fine disciple.  Great future for this talented instructor.  He is motivated to be a good teacher, as well as keeping a fine eye upon the stated objectives of the class."
      },
      {
        "index": 8,
        "rating": "5.0",
        "comment": "Overall, I thought it was a great class, I do think that he should give some more thought to the way the group projects are put together, but that will come with time."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Loved it. Matt is great and really well-versed in the subject matter. Though the class was nothing like what I thought it would be, I ended up really enjoying myself and getting quite a lot out of it."
      }
    ]
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0xMTUzNjg3",
    "lastName": "Yde",
    "legacyId": 1153687,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Interesting information.  Creative.  Kind.  Became newspaper theatre critic in later years.  ",
        "course": "THEAT597"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "great",
        "course": "THEA597"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Such a good teacher! Definitely easy to get an A if you read the plays and go to class. He will look over your papers before you hand them in and give you feedback. He is also super nice!",
        "course": "THEAT100H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A. Just do the readings(which aren't that long) and show up+A.",
        "course": "THEAT597"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very biased. I am liberal, but Mr.Yde takes it to a whole new level. Very easy course overall. It was also very informative. And there wasn't much reading in the course : )",
        "course": "THE597"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a genius.  It is an eye opening experience to take this course and the course is highly interesting.",
        "course": "THEAT597"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not anti-american at all, just anti-stupidity. Definitely biased, but he was really cool about differences in opinion and encouraged a lot of discussion. Showed awesome films.",
        "course": "THEAT597"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Well-versed.  Informative.  Protege of Dr. Woods, and a fine disciple.  Great future for this talented instructor.  He is motivated to be a good teacher, as well as keeping a fine eye upon the stated objectives of the class.",
        "course": "THEAT597"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Overall, I thought it was a great class, I do think that he should give some more thought to the way the group projects are put together, but that will come with time.",
        "course": "THEA597"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loved it. Matt is great and really well-versed in the subject matter. Though the class was nothing like what I thought it would be, I ended up really enjoying myself and getting quite a lot out of it.",
        "course": "THEAT597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.9,
    "department": "Theater",
    "firstName": "Karen",
    "id": "VGVhY2hlci0xMzgzMjc1",
    "lastName": "Mozingo",
    "legacyId": 1383275,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class was fine. I had a great TA, so I enjoyed it.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher and super sweet! She's easy to talk to and is usually fine with giving extensions. You have to read textbook chapters but they're easy. As long as you show up and participate, you'll be fine in her class.",
        "course": "THE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mozingo is great! She's very passionate about what she teaches which makes it engaging. Play assessments are more participation, but still read! Get all required plays a couple weeks ahead. Most are online. Buy or sign up to volunteer to see the plays early!",
        "course": "THE2100H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class online and it was fairly easy. It was mainly run by the TA or a different professor but Professor Mozingo managed the course. It was organized very well and you know exactly what to do every week. There was a decent amount of work with the readings and discussion boards but you can easily get a good grade if you put in effort.",
        "course": "THEATRE2100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Took at an accelerated pace and was a ton of work, at a normal pace would be super easy and manageable. Lots of reading - some interesting some not.",
        "course": "THEATRE2100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Mozingo is very passionate about theatre but is aware students are taking this class to fulfill GE requirements. Very easy grader. Most readings can be found with online PDFs. Discussion-based classes, so be willing to contribute to the discussion.",
        "course": "THEATRE2100H"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Professor Mozingo was super passionate about theater. There are no exams, but learning assessments after reading the plays. I never had to buy a play, but normally found online pdf versions. Super easy class and gen ed.",
        "course": "THEATRE2100H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Interesting plays. Clear weekly material and assignments.",
        "course": "THEATRE2100"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "If you're planning to take THEATRE 2100, online with Karen Mozingo, don't. The class requires you to read a play every single week but they cost additional money and can be very expensive. The material is not engaging whatsoever and require a lot more work than a GE should require. ",
        "course": "THEATRE2100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was structured well and made theatre interesting even though I am not into theatre and took the class for the GE credit.",
        "course": "THEATRE2100"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was super easy. Whenever I had problems with the online course I got a response quickly and fast.",
        "course": "2100H"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very fair and straightforward. Participate some in class and stay on time with weekly assignments (plus a few papers and a presentation) and an A is no problem. Very friendly too",
        "course": "THEATRE2100H"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took theatre 2100 online and it was so easy. The asych class only has a few requirements per week. You will get 10/10 on all of the discussion posts if you complete them and 20/20 on all of the quizzes. Easy class, but a lot of work for the final project.",
        "course": "THTR2011"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Super easy class. Attendance is graded, but is just a sign in sheet, participation doesn't matter too much. A lot of reading, very little of which is really required or tested on. For the hybrid I took, it was a quiz at the end of each week, class, 2 essays over performances, 1 presentation, and final project, no exam or midterms.",
        "course": "2100H"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 1,
        "comment": "Super easy professor. Group project 10 page final paper. Gives you 100% on everything. Super boring tho. Very kind.",
        "course": "2100H"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "I took Theatre 2100H as an easy GE honors class, but it was a lot more work than I anticipated. We read a play every week (around 14 plays) and write a discussion on them. We also had to write 3 performance reviews (2-3 pgs), a final paper (7-10 pgs), and do a final group project. However, she is an incredibly easy grader, so you'll do well.",
        "course": "THE2100H"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 1,
        "comment": "Took her for a GE class, very easy to get an A as long as you show up (dont need to participate, only because she takes attendance). Had to see plays and write a lot of papers, but as long as you do well on those you can pass without doing any of the other reading she assigns. Dont buy the textbook. Be prepared to fall asleep a lot in class.",
        "course": "THEATRE2100H"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "I learned a lot about theatre, and we read contemporary plays about human rights. I enjoyed the group project, and Dr. Mozingo is a caring teacher.",
        "course": "2100H"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "This was a lot of work for a theatre GE. We read a play every week, wrote 4 papers, and had half a dozen events to attend outside of class. Incredibly easy grader so the assignments weren't high stress, there was just a lot of them. The final project is to write and perform a short play. Karen is a little strange but overall not a terrible class.",
        "course": "THE2100H"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "I was expecting this to be a very basic/surface level course covering general knowledge about theater, but it quickly turned into an acting class. Within the first week she required the class to prepare and perform a monologue with props and the whole nine yards. If you're not into acting, find a different professor.",
        "course": "2100H"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Mozingo is a great lady and really cares about her students. The class isn't too difficult and the class discussions are interesting. You read lots of plays, but I found that interesting so I liked them. There is some writing of papers, but she's a pretty easy grader.",
        "course": "2100H"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "There was a LOT of reading involved, but she really cares about her students and you can get by if you can't do all the readings. There were a lot of class discussions and a couple of group projects, but other than that not much went into the grade. Not a tough grader though.",
        "course": "THTR2100H"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "There is lots of reading but no tests or quizzes, just journals and discussions about the reading. There was one final paper and a final group project, both were fairly easy. Would take again.",
        "course": "THEATRE2100H"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 1,
        "comment": "Mozingo was a fine teacher, the subject (criticizing TV) was interesting, it was a lot of discussion rather than learnings anythings. None of the assignments were difficult or that complex, but were often vague. You did not have to go to every class or read the book to pass, but you definitely do to get an A as it is used sparingly.",
        "course": "TH2367"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class was a mix of musical theatre history and studio sessions. Guest instructors added to the variety of dance and vocal work we did. There was a big group project and doing class readings was important because many sessions  included group work and discussion. Karen was available to help and gave good feedback when I asked questions.",
        "course": "TH577105"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was really amazing, in part because of her discussion leadership. We had wonderful discussions concerning a multitude of topics, especially concerning women's issues. The opportunity to interview a real playwright at the end of the semester was great, and was largely facilitated by Dr. Mozingo herself. You won't be disappointed!",
        "course": "THEATRE2101H"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dreadful. Avoid this class at all costs. You watch videos of people sitting for hours with their hair tied together and compose nightly responses to bogus articles by people you have never heard of and will never hear again who write about awful, boring, obscure topics.",
        "course": "2100H"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class is super easy but incredibly boring. I expected a standard theatre class using well known plays like Shakespeare or something but instead the whole class was about Nonwestern rituals and the concept of play and \"nonreality.\" I didn't buy any of the books and I got by just fine. The only problem is that everything she says is basical",
        "course": "THTR100H"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 3,
        "comment": "She's really nice and we occasionally had wonderfully stimulating class discussions, but if you don't like Dance, her class is painful. Also, we had to attend 10 performances, which I found a bit excessive. I really didn't learn much about theatre, but I did learn a heck of a lot about post-modern dance--I have learned that I hate it.",
        "course": "THE100H"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "So kind, always willing explain concepts misunderstood. Always positive attitude and truly cares about students. Really liked the dance discussion because I used to dance. Thought was going to have to act theatrical performances. Really more heavily focused on the performances of daily life. Fun- I liked the &quot;Play&quot; activity!",
        "course": "THTR101H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Scott",
    "id": "VGVhY2hlci0yMTQ2NTQ4",
    "lastName": "Spears",
    "legacyId": 2146548,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor! Would highly reccommend!",
        "course": "TH5321"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "He wants you to create projects that he likes in his style above all else. Nice enough guy outside of class but can expect too much in class, although at the end of the day he's an easy grader. I also don't think he's really fully qualified to be teaching a class like this based on the projects of his we saw",
        "course": "TH5321"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "The grading is subjective with no rubrics, while not difficult there is an interesting attendance policy. His opinion is fact in his room, however he can help a ton. Heed some advice, not all, play into his humor and do not miss class and you will pass! ",
        "course": "TH5331"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Spears was pretty chill. He had a lot to share about the film industry and he was very passionate about it. Assignments weren't too difficult - write one or two scripts. The readings were easy and the quizzes were sparse. Only issue is he compared everyone's scripts to other films or shows. His feedback was very helpful and critique, too.",
        "course": "THEATRE5331"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Scott is a goofy guy and is very knowledgeable about screenwriting. This class is kind of a free for all; you learn the basics of writing a screenplay, then you write drafts. He has pretty straightforward feedback and wants you to succeed and understand the business.",
        "course": "THEATRE5331"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Scott is great! He has such a hyper personality and is clearly very passionate about movies. I gained a lot of screenwriting knowledge thanks to his class. I also loved coming in and just watching things and talking about it! I loved that he started each class with allowing us to share what we thought of the most recent thing we watched.",
        "course": "THEATRE5331"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Spears has wonderful, practical advice. However, he has a tendency to give long, rambling lectures with needless examples of his own devising. For me, it was not a useful teaching technique.",
        "course": "THEATRE5331"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Knowledgeable, good practical advice, excellent assignments and feedback, accessible and funny. Fair workload and grading. I learned a great deal about how to write a screenplay.",
        "course": "TH5332"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Scott is an overall great professor. He works hard to fill his lectures with engaging, relevant content and he is always open to student input. He has an approachable, down-to-earth personality, and a great sense of humor. Also, he prefers quality over quantity when it comes to student work. Come to Scott's class expecting to learn!",
        "course": "TH5331"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Scott has worked on many films out in LA, and thus brought great insight into this video production class. He's also very goofy, which makes class enjoyable. However, the class was relatively unstructured, so if you need structure you should probably look elsewhere.",
        "course": "TH5321"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "DON'T take this course! It only has four lectures and he will only teach very few things. The rest of the time will be writing and discussing. In the discussion, NEVER EVER challenge or question Scott, you will fail. BTW, he has no rubric and only post letter grades. He's gonna teach video production next semester, hope you consider seriously.",
        "course": "TH5331"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yODYwNTc3",
    "lastName": "Quiroz",
    "legacyId": 2860577,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor who cares about his students. Never taken a theatre class in my life but this class was very enjoyable and engaging. ",
        "course": "THEATER2811"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Was half online half in person, so it was only two days a week. Easy class, had to read/watch one play a week, and then take a 5-question quiz on it on the second day of in-person class. Online it was a textbook to read with a 20-question multiple choice test a week, literally got 100% every time. Very nice and UNDERSTANDING professor.",
        "course": "THEATER2811"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chris was a great professor and I definitely learned a lot from his course. This class is a great option for students wanting to fulfill a performing arts GE as well. You definitely can't miss in person classes because your grade rests upon participation, but theres only two papers throughout the entire semester for outside of class work. ",
        "course": "THEATER2811"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chris was the best professor I have had during my time at OSU. Not only was the class informative and fun, but the course created an atmosphere of respect, understanding, and team building. This was the first ever class that I felt like the professor actually took time to get to know the students and facilitate team building. ",
        "course": "THEATER2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Theater",
    "firstName": "Colton",
    "id": "VGVhY2hlci0yNzU3NzQx",
    "lastName": "Weiss",
    "legacyId": 2757741,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Grades way too harshly for entry level. way too many assignments and is passive aggressive if you question him/his grading. leaves vague reasoning for why a certain grade is given. switch immediately if you get him for GE intro!",
        "course": "2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is not for 2100!\nI had Colton Weiss as my CSE-CIS Academic Advisor. He breaks all stereotypes about advisors. He helps me keep on track to graduate, figure out my related field, and is always patient with me. I always feel better prepared after I leave our appointments. I highly recommend!",
        "course": "2100"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "This dude was assigned as my academic advisor, who never responded, even it was about a student's graduation, what a joke.",
        "course": "2100"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "ABSOLUTELY TERRIBLE!!  The worst professor I have ever had in my entire life. If you have this man switch out!! He is the least caring, compassionate individual I have eve met.  So beyond rude to his students it is concerning.  I have never hated a man more.  Cannot stress how much I dislike this guy!",
        "course": "2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yNTcxNTA0",
    "lastName": "Streeter",
    "legacyId": 2571504,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "i genuinely looked forward to his class. funny guy and very understanding. ",
        "course": "THEATER2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take him! Very caring and did not have many assignments in his class. The essays are on pretty easy topics and he is very helpful if you need any help. He is also pretty flexible with deadlines. ",
        "course": "THEATER2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely loved Josh! Hes a grad student so he genuinely understands and cares for his students. He made his class very easy and entertaining. If you need credit for a GE take criticizing television with him. It is such a fun course and Josh makes it so simple for you to do well in.",
        "course": "THEATRE2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super nice dude and tries his best to make everything easy to understand as well as remain accessible to anyone who needs help. The class was not boring at all, he brought a sense of fun to the material which was nice. There are about 4-5 short essays for which he gives good feedback. Overall a superb professor and I enjoyed the class.",
        "course": "THEATER2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "A very nice guy. He's a grad student so he's new and scatterbrained, but you'll love it. No exams, just four or so short 500-700 word essays. You discuss readings every week in class, but since there are no exams on it, you can get by without buying it. Just make sure to contribute some in class. Overall, easy A. would take him again",
        "course": "THEATRE236703"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yMTczMTEx",
    "lastName": "Truett",
    "legacyId": 2173111,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "While this professor is kind during individual interactions, conduct observed in their classes leaves much to be desired. I have taken several courses taught by this professor, a consistent theme of disorganization persisted. The classroom atmosphere was characterized by a chaotic, disorderly energy, with many superfluous tasks in their curriculum.",
        "course": "TH3120"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took the online version, did EVERYTHING (quizzes, lectures, readings) the day of. Some weeks I wouldn't watch the episodes (just read the synopsis or did nothing at all) and I did well. Gives extra credit and I would say is an easy (or at least lenient) grader.",
        "course": "THEATRE236703"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Theres a good amount of weekly homework and few big assignments throughout the semester but hes very lenient and wants to work with you. Im the worst writer and still got an A in this class.",
        "course": "THEATRE236703"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He gave lots of quizzes but they were easy if you did the reading and watch the TV shows. He was very easy to approach with issues and ask questions. He seems to care about his students.",
        "course": "THEATRE2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Truett gives you really good feedback on each of your assignments. Before this semester I had never taken a theatre class but due to the assignments he had us complete such as reading various plays and going to see live productions it has me further interested in theatre.",
        "course": "THEATRE2100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class is structured so poorly. It says an assignment was due on a Monday and when you clicked on that assignment it would tell you that the first part of the assignment was due the Friday before, so there would be no way to get points for it. This caused me to miss multiple assignments. This professor is RUDE and will not care about you.",
        "course": "THEATRE2100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "The most unorganzied class I've ever taken. So many episodes to watch and readings to do every night that you do nothing with in class.. Class is pointless but if you skip, he'll hold a grudge against you. He's so rude if you ask questions and changes rules in the syllabus all the time",
        "course": "THEATRE2367"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible, terrible instructor. If you miss a class, you miss points. Gives 5 40 minute episodes along with a few articles to read per class. Very rude when asked any type of question. Do nothing in class, but lots of homework.",
        "course": "THEATRE2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yOTc4MjAw",
    "lastName": "Smith",
    "legacyId": 2978200,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Josh is an amazing professor. He truly cares about what he teaches and his students. His main focus in acting is Improv and in craft of acting, you will play many improv based games. I loved his class and it really gave me the confidence to attemp improv.",
        "course": "THEATRE2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Caleb",
    "id": "VGVhY2hlci0yOTcxMjc0",
    "lastName": "Beidelman",
    "legacyId": 2971274,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Caleb was really great and I really enjoyed his teaching. He was kind, caring, and extremely helpful. This class was set up strangely and required the purchasing of eight plays to read, however, he helped students access these materials to the best of his ability. Super easy class to get a good grade in and a great performing arts GE option. ",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.4,
    "department": "Theater",
    "firstName": "Adrienne",
    "id": "VGVhY2hlci0yNjI4NjU4",
    "lastName": "Oehlers",
    "legacyId": 2628658,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Adrienne is very sweet. She cares about acting and theater. However, 3812 was very slow and felt like an elementary-type theater class. There is so much reading and writing-- too much, in my opinion, for an acting class. She is a very nice person and I would probably go to her if I needed a letter of rec, but her class was not too stimulating. ",
        "course": "THTR3812"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor who created a comfortable atmosphere for exploring acting with scene partners.",
        "course": "THTR3812"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Oehlers made this class very difficult for no reason. I was very excited to take this class but it was not enjoyable. We are in the middle of a pandemic and she does not give any room for late work knowing some of us are going through difficult times. School is already hard enough.",
        "course": "THEATRE2367"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Oehlers made this class hard for no reason. There were not that many points throughout the whole semester so if you forgot to do something, it messed up your whole grade. She tries to seem lenient but really isn't.",
        "course": "THEATRE2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Adrienne was an engaging professor that respected her students and truly cared for them during a weird semester. She leans most of her class material towards liberalistic views and bashes the opposite political viewpoint despite claiming she tries to leave politics out of her class, but overall an interesting class.",
        "course": "THEATRE2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.7,
    "department": "Theater",
    "firstName": "Stratos",
    "id": "VGVhY2hlci0xMTgyNzY2",
    "lastName": "Constantinidis",
    "legacyId": 1182766,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "An absolute gem. We read/watched 13 plays over the semester and each class was discussion based. He was one of the most kind, genuine, and thoughtful professors I've ever encountered. He welcomed new ideas and wanted everybody to learn and succeed. I would highly recommend this class, even to those who don't particularly enjoy theatre.",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I don't even like theatre, but thoroughly enjoyed his class. He grades fairly, but make sure that you submit your work on time. He does not use canvas to upload grades, it's all through email. Also, if you miss three lectures, your grade drops to a B. Your camera must stay on, but it was a pretty fun class. ",
        "course": "THEATRE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "He genuinely cares about the well-being of his students and it shows. If you participate and complete your papers on time you will get a good grade!",
        "course": "THEATRE2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor C was one of the most loving, caring professors I have had in my college career. He is always willing to help, looks out for his students, and is a very reasonable man. Would 100% recommend this professor.",
        "course": "THEATRE2100H"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Stratos is amazing. He really cares about his students. This class is just reading plays and discussing them as a group the next day. You also have to see a production of theatre then write a review on it. The only thing is he doesn't use carmen so make sure your checking your syllabus on when assignments are do.",
        "course": "THEATRE2100H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "The writing assignments take some effort but are generally graded fairly. 2 6 page reports, 1 7 page term paper, and 1 2 page performance review. Stratos is an amazing professor. He truly cares about his students and is always willing to help and give feedback. He doesn't use carmen so you only know the letter grades of your assignments from emails",
        "course": "THEATRE2100H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take this course! I was dreading an honors art GE but Stratos is hilarious and will give you a high score (A) if you put in effort. 100% best choice I made taking it --- yeah there are writing assignments but only 3 and graded easy/fair.",
        "course": "THEATRE2100H"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. is Greek. Old guy who really cares about theatre. You have to show up to class, but he is eager to help you understand. Highly recommend having him look over papers before you turn in. He appreciates and gives great feedback. A lot of writing, but zero acting, so that was nice. You don't have to actually read all the assigned screenplays.",
        "course": "THEATRE2100H"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class for GE credit. Tbh I was expecting this to be my least favorite class, turns out it was my favorite. Stratos was an amazing prof. Made every lecture interesting and is a hilarious guy. Just put in the minimal effort for the few assignments and you'll pass. Worst part was the commute to the drake building.",
        "course": "THEATRE2100H"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Constantidis was one of the most caring professors Ive had. The class was a lot of work, but its all outlined on the first day, and he grades everything very easily. I think we just got an A if we did what he asked. He cares about making the class interesting, and he is always willing to help! I learned a lot in this class + really enjoyed it",
        "course": "THEATRE2100H"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "The Professor himself was amazing. You can tell he's very knowledgeable and passionate for what he does, and I loved his personality. My only beef is that the class was a lot more work than I thought it'd be. Yes, it was an easy A in the sense that he grades very fair and easy. But it was more writing than I ever had to do for a class.",
        "course": "THEATRE2100H"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Stratos is by far the best professor I've ever had. He's one of the kindest and most hilarious people I've ever met, and really cares about his students. There is a good amount of writing (it is a writing course) but if you put in at least some effort you will easily get As on everything. Participation and attendance is required but you'll want to.",
        "course": "THEATRE2367"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I have ever had. He is passionate and funny about teaching! Super easy A if you 1) participate in class 2) do the assignments. He is a super easy grader and as long as you put in some effort like going to his office hours when it is required, you'll be set.",
        "course": "THEATRE2100H"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is THEE best professor I've ever had at OSU. The plays selected by Dr. Constantinidis are relevant and enjoyable for even non theater major students. Takes attendance, so go! Follow his rubric and have original ideas and you will do very well if you put forth the effort. He goes out of his way to make himself available. He Cares. Fun class!",
        "course": "THEATRE2367"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was my favorite class at OSU. There are a lot of papers but he is an easy grader if you complete the assignments. If you go to lecture and read the plays you won't have to study for the final. He's very smart and knows a lot, and challenges you to think on deep topics. It's very discussion based. If you're looking for an easy GE, take this.",
        "course": "THEATRE2367"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class as my second year writing course. Stratos is the best professor I have ever had. He is so funny and his lectures are more discussions than anything. The assignments are spread out, and they aren't hard. You have to write reports on readings and do a longer paper, but he will check it as many times as you want before the due date.",
        "course": "THE2367"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 2,
        "comment": "Stratos is very inconsistent with expectations for assignments (Paper could be 6 pages single or double-spaced). He discusses scenes in lecture that weren't in the play, just the film. He also believes in a \"right\" interpretation of a text and dismisses other opinions. I'm very interested in theatre and eager to learn, but here, I learned nothing.",
        "course": "THEATRE2397"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "This man is the best professor at OSU, there's nothing else to say.",
        "course": "THEATRE2100H"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "Stratos is intensely passionate and knowledgeable about the theatre and its history. I didn't know what to expect from this class but loved every minute of his lectures because he cares and wants to teach us to care. If you can, take this class. Profs like Stratos won't be around forever. He's very old school, in all the good ways. ",
        "course": "TEHATRE3731"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy GE. Read (or google) play each week and write 1 page on it. Term paper isn't too bad(5 pages)and he is willing to meet with you and look over a draft. But note it is 30% of grade. We often watch movie clips. Not fun but not hard either",
        "course": "THEATRE2100H"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy GEC. You read a play every week and have to write a one-page summary each week. One final paper and final exam. He gave us the questions to the final exam and the final paper is on a topic of your choice. Would recommend for an easy A.",
        "course": "THEATRE2100H"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 1,
        "comment": "I loved theatre, and after taking this class, I loved it even more. He really caters to the interest of the class and makes it as easy as possible to get an A. If you need an easy GEC this is the class to take.",
        "course": "THE100H"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "So fun and sweet. Loves teaching the material. Always there to help on that dreaded final paper!",
        "course": "THE532"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best teachers at this school.  Take his H100 class now.",
        "course": "THRH100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Alex",
    "id": "VGVhY2hlci0yMzIyNTE4",
    "lastName": "Oliszewski",
    "legacyId": 2322518,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fantastic",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's very invested in his subject and just wants to encourage his students to take an interest in it. Super fun class. He's a very easy grader and actually cares abt our mental health. He's a joy to talk to. 100% would recommend everyone take his class for Visual Arts GE.",
        "course": "THEATRE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was a wonderful intro to the theatre! Alex's lectures were engaging and I always looked forward to attending. As long as you're willing to put in at least a minimal amount of effort, you'll do well. He really just wants his students to gain an interest in the subject he loves.",
        "course": "THEATRE2100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Daniella",
    "id": "VGVhY2hlci0yODg5MDE4",
    "lastName": "Valdivieso",
    "legacyId": 2889018,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "She was very kind and caring but weirdly yelled sometimes, there was a lot of work and papers for an elective class for non-theatre majors, and a lot of memorization. This was the most work-heavy class I took this semester. I like her as a person but not a teacher. I would recommend this course for people who are can memorize scripts/write papers.",
        "course": "2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Shannon",
    "id": "VGVhY2hlci0yODQ4ODU3",
    "lastName": "McCarren",
    "legacyId": 2848857,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "A very funny, caring teacher who led an amazing class and went the extra mile for her students. Cannot recommend her enough!",
        "course": "THTR2811"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Shannon knows so much about acting and is one of the best kind of people you could wish for as a lecturer.",
        "course": "THTR2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Sean",
    "id": "VGVhY2hlci0yNTE2MTM1",
    "lastName": "Naughton",
    "legacyId": 2516135,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing instructor!",
        "course": "THEATRE2812"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took Theatre 2700 Criticizing TV with Sean and it was absolutely one of my favorite classes! The lecture time is discussion based so participation is expected but enjoyable. The semester grade was a total of only 100 points so the papers are very important and graded with strong feedback. Absolutely loved the class though, would take again :)",
        "course": "THEATRE2811"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I really loved having Sean as an acting professor. He does a fantastic job introducing the art of acting to those who have no experience, and you can learn a lot from him even if this is the only acting class you take. A great GE to take, and SO MUCH FUN!",
        "course": "THEATRE2811"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is the BEST acting professor I've ever had. He is thoughtful, kind and very very very good at feedback. I love how he speaks to his students and how much he knows about what he is teaching.",
        "course": "THTR195"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "John",
    "id": "VGVhY2hlci0yNzMzNDcw",
    "lastName": "Sefel",
    "legacyId": 2733470,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Doctor John is the most respected person that I have ever met during my university career. His enthusiasm and kind heart to his students makes him a great professor and also a friend to me. I enjoy every of his lectures, and found my interests in learning theatre even I have a STEM major. In all, he is a great professor.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Just write papers about the plays you go see, which you have to pay for, but its pretty easy. Final is a group project about one of the plays you read in the semester.",
        "course": "THEATRE2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am a business major and took Theatre for my GE requirement and it was by far my favorite class this semester. John Sefel was so caring, understanding, and seriously wished the best for his students. I took this class in person 2 times a week and all you have to do to pass is show up and sometimes participate. Really really awesome professor",
        "course": "THEATRE2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. John is truly a caring professor and you can tell that he loves what he does. Exit tickets are done at the end of every class in order to keep track of attendance, so show up to recitation. He mostly just goes over the background of that week's play one day of class, and then you discuss the play the other day of class. Social diversity credit.",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Connor",
    "id": "VGVhY2hlci0yNzMzNzg0",
    "lastName": "Graham",
    "legacyId": 2733784,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Connor Graham is probably the most interesting and kind TA I've had at OSU. The course is very laid back, weekly quizzes are online and 100% is guaranteed since the textbook allows you to check your answers before submitting. The only other grades are a small group project and 2 short essays and he is a very easy grader. Highly recommend for a GE. ",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a very caring instructor. You learn a lot in his class and he makes learning fun. I would recommend taking any class with him that you can.",
        "course": "TH3831"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Connor's class was so much fun and he was very understanding and made our workload manageable. It was an easy A and I would definitely recommend his class to anyone needing a GE credit.",
        "course": "THEATRE2300"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "He was very nice and understanding. Class lectures weren't very interesting though. Overall, very easy A and general education credit.",
        "course": "THEATRE2100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wonderful instructor, always willing to help a student out, classes were interesting, but still an easy A.",
        "course": "TH2100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely loved his class and loved him as a teacher. Would recommend him to anyone.",
        "course": "THEATRE2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Claudia",
    "id": "VGVhY2hlci0yNzU5NTU4",
    "lastName": "Wier",
    "legacyId": 2759558,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Did NOT know how to use Carmen: be prepared to DIG for course materials that are unclearly labeled. She gave a lot of homework with no clear grading rubric, seemed arbitrary almost. LOTS OF HOMEWORK for a GE course--no exams though!",
        "course": "MUSIC3347"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "She is a lovely person and very enthusiastic about the material. For me, her class had a rough lack of organization. Grading criteria was never specified, she did not know how to use Carmen, and she would often surprise us with assignments. That said, she was very open to feedback and gave lots of opportunity for grade improvement.",
        "course": "THEATRE236703"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0yNjI0MjM4",
    "lastName": "Fox",
    "legacyId": 2624238,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class back in Fall of 2020, and she was one of the most caring professors I had that semester. In the midst of a pandemic, you wouldn't think that theater would be a good class to take, but it was still super fun. Gave me 100% on all of my papers and genuinely cares about her students.",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Fox is incredibly caring, intelligent, and kind. She tries to make her class relevant to today's world and has no problem accommodating difficult situations. I would love to have her as a professor again. I took this class as a GE but I am so glad that I took it because I genuinely left this class better than I was before.",
        "course": "2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "She was genuinely the sweetest professor so far. Even though it was online I still felt so connected with her, she really cares about your mental health and gets it. 10/10 would recommend!",
        "course": "THEATRE2100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Jeanine",
    "id": "VGVhY2hlci0yNzU3NTQ1",
    "lastName": "Thompson",
    "legacyId": 2757545,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took THEATRE 4000.08 with Jeanine and she is quite honestly the nicest and most caring professor Ive ever had. She is an incredibly nice grader as well. I wish everyone could experience being in her class, and if you do get that opportunity dont be scared to talk to her outside of class, shed love it.",
        "course": "THEATRE4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Janet",
    "id": "VGVhY2hlci0yMTQ2NTU1",
    "lastName": "Parrott",
    "legacyId": 2146555,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "It's clear Janet is very knowledgeable about film production, but her class is not organized in a way that makes it an effective learning experience. She is very nice but is very hard to reach outside of class, and she often comes to class 10-15 minutes late. You'll learn the very basics from her but that's about it. Overall, pretty disappointing",
        "course": "MVNGIMG2201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good lectures",
        "course": "MVNGIMG2201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Janet is good overall. She is very knowledgeable and experienced in video production. And she is very kind to students. But just don't expect she will reply your email and never expect she will do what she promised.",
        "course": "TH5323"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Janet is pretty nice. At first she can be a little intimidating. She is very helpful, which was goo dfor me because I had never taken an editing class. You won't really need the textbook unless you wantto reference it, but she has a textbook in the class.",
        "course": "THTRE633"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 2.8,
    "department": "Theater",
    "firstName": "Dave",
    "id": "VGVhY2hlci0xMzI5NzY0",
    "lastName": "Fisher",
    "legacyId": 1329764,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "As someone who will most likely pursue a career in the television industry, this class and professor were extremely disappointing. Dave is clearly very knowledgeable and also very nice, but the class is so disorganized and does not provide an effective learning experience in any way. Do not waste your time with this professor or class. DO NOT TAKE",
        "course": "THEATRE3351"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dave was a good professor! I loved Television Production 1! I you want a hands on course in TV take his class because you'll get it! You also get to take cameras out and shoot your own footage! If you want to work in TV take his class and get the experience you need!",
        "course": "3351"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class is getting harder and can be fairly boring, but dave is a good teacher. take this class.",
        "course": "THEAT300"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Genius.",
        "course": "THEAT415"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "matthew",
    "id": "VGVhY2hlci0yNTYxMzQy",
    "lastName": "greenburg",
    "legacyId": 2561342,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Matt was awesome! As a business student, I took theatre to knock off specific GE's and ended up loving the class. There was 4-6 plays you we read and attendance was mandatory. You also had to attend one play through Ohio StateClass was honestly fun, ranging from games to discussions to group projects. If you read and participate, you will get an A.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Matt is a caring and thoughtful instructor. He challenges me but fully supports me while doing so. I have never had a better professor at OSU and have learned so much from him.",
        "course": "THEA3831"
      }
    ],
    "SEI": []
  }
]