[
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Janet",
    "id": "VGVhY2hlci0yMTQ2NTU1",
    "lastName": "Parrott",
    "legacyId": 2146555,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "It's clear Janet is very knowledgeable about film production, but her class is not organized in a way that makes it an effective learning experience. She is very nice but is very hard to reach outside of class, and she often comes to class 10-15 minutes late. You'll learn the very basics from her but that's about it. Overall, pretty disappointing",
        "course": "MVNGIMG2201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Good lectures",
        "course": "MVNGIMG2201"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Janet is good overall. She is very knowledgeable and experienced in video production. And she is very kind to students. But just don't expect she will reply your email and never expect she will do what she promised.",
        "course": "TH5323"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Janet is pretty nice. At first she can be a little intimidating. She is very helpful, which was goo dfor me because I had never taken an editing class. You won't really need the textbook unless you wantto reference it, but she has a textbook in the class.",
        "course": "THTRE633"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 2.8,
    "department": "Theater",
    "firstName": "Dave",
    "id": "VGVhY2hlci0xMzI5NzY0",
    "lastName": "Fisher",
    "legacyId": 1329764,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "As someone who will most likely pursue a career in the television industry, this class and professor were extremely disappointing. Dave is clearly very knowledgeable and also very nice, but the class is so disorganized and does not provide an effective learning experience in any way. Do not waste your time with this professor or class. DO NOT TAKE",
        "course": "THEATRE3351"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dave was a good professor! I loved Television Production 1! I you want a hands on course in TV take his class because you'll get it! You also get to take cameras out and shoot your own footage! If you want to work in TV take his class and get the experience you need!",
        "course": "3351"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class is getting harder and can be fairly boring, but dave is a good teacher. take this class.",
        "course": "THEAT300"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "Genius.",
        "course": "THEAT415"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0yNjI0MjM4",
    "lastName": "Fox",
    "legacyId": 2624238,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class back in Fall of 2020, and she was one of the most caring professors I had that semester. In the midst of a pandemic, you wouldn't think that theater would be a good class to take, but it was still super fun. Gave me 100% on all of my papers and genuinely cares about her students.",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Fox is incredibly caring, intelligent, and kind. She tries to make her class relevant to today's world and has no problem accommodating difficult situations. I would love to have her as a professor again. I took this class as a GE but I am so glad that I took it because I genuinely left this class better than I was before.",
        "course": "2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "She was genuinely the sweetest professor so far. Even though it was online I still felt so connected with her, she really cares about your mental health and gets it. 10/10 would recommend!",
        "course": "THEATRE2100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "John",
    "id": "VGVhY2hlci0yNzMzNDcw",
    "lastName": "Sefel",
    "legacyId": 2733470,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Doctor John is the most respected person that I have ever met during my university career. His enthusiasm and kind heart to his students makes him a great professor and also a friend to me. I enjoy every of his lectures, and found my interests in learning theatre even I have a STEM major. In all, he is a great professor.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Just write papers about the plays you go see, which you have to pay for, but its pretty easy. Final is a group project about one of the plays you read in the semester.",
        "course": "THEATRE2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I am a business major and took Theatre for my GE requirement and it was by far my favorite class this semester. John Sefel was so caring, understanding, and seriously wished the best for his students. I took this class in person 2 times a week and all you have to do to pass is show up and sometimes participate. Really really awesome professor",
        "course": "THEATRE2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. John is truly a caring professor and you can tell that he loves what he does. Exit tickets are done at the end of every class in order to keep track of attendance, so show up to recitation. He mostly just goes over the background of that week's play one day of class, and then you discuss the play the other day of class. Social diversity credit.",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Connor",
    "id": "VGVhY2hlci0yNzMzNzg0",
    "lastName": "Graham",
    "legacyId": 2733784,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Connor Graham is probably the most interesting and kind TA I've had at OSU. The course is very laid back, weekly quizzes are online and 100% is guaranteed since the textbook allows you to check your answers before submitting. The only other grades are a small group project and 2 short essays and he is a very easy grader. Highly recommend for a GE. ",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He's a very caring instructor. You learn a lot in his class and he makes learning fun. I would recommend taking any class with him that you can.",
        "course": "TH3831"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Connor's class was so much fun and he was very understanding and made our workload manageable. It was an easy A and I would definitely recommend his class to anyone needing a GE credit.",
        "course": "THEATRE2300"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "He was very nice and understanding. Class lectures weren't very interesting though. Overall, very easy A and general education credit.",
        "course": "THEATRE2100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Wonderful instructor, always willing to help a student out, classes were interesting, but still an easy A.",
        "course": "TH2100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely loved his class and loved him as a teacher. Would recommend him to anyone.",
        "course": "THEATRE2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Claudia",
    "id": "VGVhY2hlci0yNzU5NTU4",
    "lastName": "Wier",
    "legacyId": 2759558,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "Did NOT know how to use Carmen: be prepared to DIG for course materials that are unclearly labeled. She gave a lot of homework with no clear grading rubric, seemed arbitrary almost. LOTS OF HOMEWORK for a GE course--no exams though!",
        "course": "MUSIC3347"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 2,
        "comment": "She is a lovely person and very enthusiastic about the material. For me, her class had a rough lack of organization. Grading criteria was never specified, she did not know how to use Carmen, and she would often surprise us with assignments. That said, she was very open to feedback and gave lots of opportunity for grade improvement.",
        "course": "THEATRE236703"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 1,
    "department": "Theater",
    "firstName": "Anna",
    "id": "VGVhY2hlci0yNjYxNDM0",
    "lastName": "Guse",
    "legacyId": 2661434,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "I'm sure Ms. Guse means well, but she made this class much more confusing and complicated than it needed to. She is unclear with grading criteria and attacks you when you ask questions about what to do. First professor I've had at OSU who literally just couldn't care less about the class or her students. Trust me when I say to avoid at all costs!!!",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Shannon",
    "id": "VGVhY2hlci0yODQ4ODU3",
    "lastName": "McCarren",
    "legacyId": 2848857,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "A very funny, caring teacher who led an amazing class and went the extra mile for her students. Cannot recommend her enough!",
        "course": "THTR2811"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Shannon knows so much about acting and is one of the best kind of people you could wish for as a lecturer.",
        "course": "THTR2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Sean",
    "id": "VGVhY2hlci0yNTE2MTM1",
    "lastName": "Naughton",
    "legacyId": 2516135,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing instructor!",
        "course": "THEATRE2812"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took Theatre 2700 Criticizing TV with Sean and it was absolutely one of my favorite classes! The lecture time is discussion based so participation is expected but enjoyable. The semester grade was a total of only 100 points so the papers are very important and graded with strong feedback. Absolutely loved the class though, would take again :)",
        "course": "THEATRE2811"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "I really loved having Sean as an acting professor. He does a fantastic job introducing the art of acting to those who have no experience, and you can learn a lot from him even if this is the only acting class you take. A great GE to take, and SO MUCH FUN!",
        "course": "THEATRE2811"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is the BEST acting professor I've ever had. He is thoughtful, kind and very very very good at feedback. I love how he speaks to his students and how much he knows about what he is teaching.",
        "course": "THTR195"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "matthew",
    "id": "VGVhY2hlci0yNTYxMzQy",
    "lastName": "greenburg",
    "legacyId": 2561342,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Matt was awesome! As a business student, I took theatre to knock off specific GE's and ended up loving the class. There was 4-6 plays you we read and attendance was mandatory. You also had to attend one play through Ohio StateClass was honestly fun, ranging from games to discussions to group projects. If you read and participate, you will get an A.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Matt is a caring and thoughtful instructor. He challenges me but fully supports me while doing so. I have never had a better professor at OSU and have learned so much from him.",
        "course": "THEA3831"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Jeanine",
    "id": "VGVhY2hlci0yNzU3NTQ1",
    "lastName": "Thompson",
    "legacyId": 2757545,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took THEATRE 4000.08 with Jeanine and she is quite honestly the nicest and most caring professor Ive ever had. She is an incredibly nice grader as well. I wish everyone could experience being in her class, and if you do get that opportunity dont be scared to talk to her outside of class, shed love it.",
        "course": "THEATRE4000"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.4,
    "department": "Theater",
    "firstName": "Adrienne",
    "id": "VGVhY2hlci0yNjI4NjU4",
    "lastName": "Oehlers",
    "legacyId": 2628658,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Adrienne is very sweet. She cares about acting and theater. However, 3812 was very slow and felt like an elementary-type theater class. There is so much reading and writing-- too much, in my opinion, for an acting class. She is a very nice person and I would probably go to her if I needed a letter of rec, but her class was not too stimulating. ",
        "course": "THTR3812"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor who created a comfortable atmosphere for exploring acting with scene partners.",
        "course": "THTR3812"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Professor Oehlers made this class very difficult for no reason. I was very excited to take this class but it was not enjoyable. We are in the middle of a pandemic and she does not give any room for late work knowing some of us are going through difficult times. School is already hard enough.",
        "course": "THEATRE2367"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Oehlers made this class hard for no reason. There were not that many points throughout the whole semester so if you forgot to do something, it messed up your whole grade. She tries to seem lenient but really isn't.",
        "course": "THEATRE2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Adrienne was an engaging professor that respected her students and truly cared for them during a weird semester. She leans most of her class material towards liberalistic views and bashes the opposite political viewpoint despite claiming she tries to leave politics out of her class, but overall an interesting class.",
        "course": "THEATRE2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.7,
    "department": "Theater",
    "firstName": "Stratos",
    "id": "VGVhY2hlci0xMTgyNzY2",
    "lastName": "Constantinidis",
    "legacyId": 1182766,
    "numRatings": 24,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "An absolute gem. We read/watched 13 plays over the semester and each class was discussion based. He was one of the most kind, genuine, and thoughtful professors I've ever encountered. He welcomed new ideas and wanted everybody to learn and succeed. I would highly recommend this class, even to those who don't particularly enjoy theatre.",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I don't even like theatre, but thoroughly enjoyed his class. He grades fairly, but make sure that you submit your work on time. He does not use canvas to upload grades, it's all through email. Also, if you miss three lectures, your grade drops to a B. Your camera must stay on, but it was a pretty fun class. ",
        "course": "THEATRE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "He genuinely cares about the well-being of his students and it shows. If you participate and complete your papers on time you will get a good grade!",
        "course": "THEATRE2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor C was one of the most loving, caring professors I have had in my college career. He is always willing to help, looks out for his students, and is a very reasonable man. Would 100% recommend this professor.",
        "course": "THEATRE2100H"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Stratos is amazing. He really cares about his students. This class is just reading plays and discussing them as a group the next day. You also have to see a production of theatre then write a review on it. The only thing is he doesn't use carmen so make sure your checking your syllabus on when assignments are do.",
        "course": "THEATRE2100H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "The writing assignments take some effort but are generally graded fairly. 2 6 page reports, 1 7 page term paper, and 1 2 page performance review. Stratos is an amazing professor. He truly cares about his students and is always willing to help and give feedback. He doesn't use carmen so you only know the letter grades of your assignments from emails",
        "course": "THEATRE2100H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take this course! I was dreading an honors art GE but Stratos is hilarious and will give you a high score (A) if you put in effort. 100% best choice I made taking it --- yeah there are writing assignments but only 3 and graded easy/fair.",
        "course": "THEATRE2100H"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof. is Greek. Old guy who really cares about theatre. You have to show up to class, but he is eager to help you understand. Highly recommend having him look over papers before you turn in. He appreciates and gives great feedback. A lot of writing, but zero acting, so that was nice. You don't have to actually read all the assigned screenplays.",
        "course": "THEATRE2100H"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class for GE credit. Tbh I was expecting this to be my least favorite class, turns out it was my favorite. Stratos was an amazing prof. Made every lecture interesting and is a hilarious guy. Just put in the minimal effort for the few assignments and you'll pass. Worst part was the commute to the drake building.",
        "course": "THEATRE2100H"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Constantidis was one of the most caring professors Ive had. The class was a lot of work, but its all outlined on the first day, and he grades everything very easily. I think we just got an A if we did what he asked. He cares about making the class interesting, and he is always willing to help! I learned a lot in this class + really enjoyed it",
        "course": "THEATRE2100H"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "The Professor himself was amazing. You can tell he's very knowledgeable and passionate for what he does, and I loved his personality. My only beef is that the class was a lot more work than I thought it'd be. Yes, it was an easy A in the sense that he grades very fair and easy. But it was more writing than I ever had to do for a class.",
        "course": "THEATRE2100H"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Stratos is by far the best professor I've ever had. He's one of the kindest and most hilarious people I've ever met, and really cares about his students. There is a good amount of writing (it is a writing course) but if you put in at least some effort you will easily get As on everything. Participation and attendance is required but you'll want to.",
        "course": "THEATRE2367"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I have ever had. He is passionate and funny about teaching! Super easy A if you 1) participate in class 2) do the assignments. He is a super easy grader and as long as you put in some effort like going to his office hours when it is required, you'll be set.",
        "course": "THEATRE2100H"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is THEE best professor I've ever had at OSU. The plays selected by Dr. Constantinidis are relevant and enjoyable for even non theater major students. Takes attendance, so go! Follow his rubric and have original ideas and you will do very well if you put forth the effort. He goes out of his way to make himself available. He Cares. Fun class!",
        "course": "THEATRE2367"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was my favorite class at OSU. There are a lot of papers but he is an easy grader if you complete the assignments. If you go to lecture and read the plays you won't have to study for the final. He's very smart and knows a lot, and challenges you to think on deep topics. It's very discussion based. If you're looking for an easy GE, take this.",
        "course": "THEATRE2367"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class as my second year writing course. Stratos is the best professor I have ever had. He is so funny and his lectures are more discussions than anything. The assignments are spread out, and they aren't hard. You have to write reports on readings and do a longer paper, but he will check it as many times as you want before the due date.",
        "course": "THE2367"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 2,
        "comment": "Stratos is very inconsistent with expectations for assignments (Paper could be 6 pages single or double-spaced). He discusses scenes in lecture that weren't in the play, just the film. He also believes in a \"right\" interpretation of a text and dismisses other opinions. I'm very interested in theatre and eager to learn, but here, I learned nothing.",
        "course": "THEATRE2397"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "This man is the best professor at OSU, there's nothing else to say.",
        "course": "THEATRE2100H"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 4,
        "comment": "Stratos is intensely passionate and knowledgeable about the theatre and its history. I didn't know what to expect from this class but loved every minute of his lectures because he cares and wants to teach us to care. If you can, take this class. Profs like Stratos won't be around forever. He's very old school, in all the good ways. ",
        "course": "TEHATRE3731"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy GE. Read (or google) play each week and write 1 page on it. Term paper isn't too bad(5 pages)and he is willing to meet with you and look over a draft. But note it is 30% of grade. We often watch movie clips. Not fun but not hard either",
        "course": "THEATRE2100H"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy GEC. You read a play every week and have to write a one-page summary each week. One final paper and final exam. He gave us the questions to the final exam and the final paper is on a topic of your choice. Would recommend for an easy A.",
        "course": "THEATRE2100H"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 1,
        "comment": "I loved theatre, and after taking this class, I loved it even more. He really caters to the interest of the class and makes it as easy as possible to get an A. If you need an easy GEC this is the class to take.",
        "course": "THE100H"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "So fun and sweet. Loves teaching the material. Always there to help on that dreaded final paper!",
        "course": "THE532"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the best teachers at this school.  Take his H100 class now.",
        "course": "THRH100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Alex",
    "id": "VGVhY2hlci0yMzIyNTE4",
    "lastName": "Oliszewski",
    "legacyId": 2322518,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Fantastic",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's very invested in his subject and just wants to encourage his students to take an interest in it. Super fun class. He's a very easy grader and actually cares abt our mental health. He's a joy to talk to. 100% would recommend everyone take his class for Visual Arts GE.",
        "course": "THEATRE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was a wonderful intro to the theatre! Alex's lectures were engaging and I always looked forward to attending. As long as you're willing to put in at least a minimal amount of effort, you'll do well. He really just wants his students to gain an interest in the subject he loves.",
        "course": "THEATRE2100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Daniella",
    "id": "VGVhY2hlci0yODg5MDE4",
    "lastName": "Valdivieso",
    "legacyId": 2889018,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "She was very kind and caring but weirdly yelled sometimes, there was a lot of work and papers for an elective class for non-theatre majors, and a lot of memorization. This was the most work-heavy class I took this semester. I like her as a person but not a teacher. I would recommend this course for people who are can memorize scripts/write papers.",
        "course": "2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.8,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Zack",
    "id": "VGVhY2hlci0yMTM2OTk4",
    "lastName": "Meyer",
    "legacyId": 2136998,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Zach is an awesome teacher. He really cares about theatre and his students.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "He is a great TA to have for theatre 2100. Very informative and helpful. Does not expect more than necessary for an arts gen ed. Essays are extremely straight forward but midterms are hit or miss. If you watch the lectures online and read the textbook then this class will be a breeze. Zach is great!",
        "course": "THEATRE2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Zack Meyer is a blessing to The Ohio State University. His lectures are thoughtful and insightful while not slipping in the tedious. He speaks with authority on a wide range of topics and clearly knows a great deal about not only theatre but life. Zack Meyer is a candle is the darkness and a shining example of what true theatre can be.",
        "course": "THE2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Zack Mayer (not to be confused with Zack Meyer) is a fantastic educator and a master pirate! The Theatre Department at Ohio State is luck to have him as the captain of their ship!",
        "course": "THE3831"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Blake",
    "id": "VGVhY2hlci0yMjA1NDEz",
    "lastName": "Edwards",
    "legacyId": 2205413,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Blake is the funniest teacher I have ever had. He made every day worth going. He's a great recitation leader and I highly recommend him for any theater students. The class is stupid easy as long as you don't slack. If you're taking theater 2100 then definitely try and get Blake !",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "i LOVED having blake as an instructor! his class is awesome and i learned so much. he genuinely cares about everyone he teaches and does a really great job of it. showing up is important so you can actually get feedback on your work, but he makes going to class fun anyways so it's fine. 10/10 would reccomend!!!",
        "course": "THEATRE2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Shannon",
    "id": "VGVhY2hlci0yMjk2ODc0",
    "lastName": "Savard",
    "legacyId": 2296874,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Quite a costly class. You have to buy your own tickets for the play. But overall pretty easy.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "If you think this class is an easy A, you're wrong. Reading the text and plays is very important as you will have a quiz on those after every reading. You must attend plays outside of class and they aren't cheap. The final project for the play is simply annoying to do. DO NOT recommend this class if you aren't a theatre major.",
        "course": "THEATRE2001"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Jacob",
    "id": "VGVhY2hlci0yNDAyODY5",
    "lastName": "Athyal",
    "legacyId": 2402869,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took Theatre 2100 in the first semester of my Freshman Year. I expected it to be miserable as I had it as an 8 AM. However, Jacob made the class awesome. Hes genuinely passionate about what hes teaching and will always listen to everyones feedback, and he also grades generously. Easily the best 2100 teacher. Would highly recommend.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Such a good teacher. Easy to get an A in his class. Cares about his students and is understanding. Made the class more interesting and was super funny.",
        "course": "THT2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Jacob was awesome, really cared about the subject and introducing it to people who may not have any theater experience. Made sure the class was fun and everyone got involved. Worked with anyone with scheduling issues. Really a teacher who cared about the students and the subject.",
        "course": "THT2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.8,
    "department": "Theater",
    "firstName": "Mary",
    "id": "VGVhY2hlci04MDQ0NzU=",
    "lastName": "Tarantino",
    "legacyId": 804475,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "Mary is passionate about lighting design. Unfortunately, she's really disorganized. Her lectures are all over the place. Due dates for assignments change frequently. Don't get behind in this class. You will not be able to catch up. Unavailable outside of class. Unless you want to do lighting design, take another design class.",
        "course": "TH3611"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 1,
        "comment": "agghh",
        "course": "THEA11"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "Mary is hot. Her class is much more detailed then you'll ever need for a theatre general requirement. She grades tough on papers and tests. And has no extra credit available.",
        "course": "TH221"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "LIGHTING221"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great class to take. Mary and Matt always put together a great class, even if it's a little unorganized.",
        "course": "694PE"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Thomas",
    "id": "VGVhY2hlci0yNDUyNjkx",
    "lastName": "Dugdale",
    "legacyId": 2452691,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "It is clear that Dr. Dugdale is a kind and hardworking individual who wants his students to not only succeed in his class, but also learn. There was enough work to keep students busy, but not enough to overwhelm us. Even to me (someone who had little interest in theater) the material was engaging and Dr. Dugdale had insightful commentary.",
        "course": "THEATRE2100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 3.7,
    "department": "Theater",
    "firstName": "Lesley",
    "id": "VGVhY2hlci0xNDA0MTc0",
    "lastName": "Ferris",
    "legacyId": 1404174,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Ferris was wonderful! She always came to class with positive energy and ready to teach. The class was small with many discussions. Very knowledgeable about her craft and selected plays from a variety of cultural and historical backgrounds. Only critique is that you don't know your grade throughout the semester and a lot of plays to read.",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had her for honors introduction to theatre. Super easy class as long as you attend lecture! Very chill class but learned some important content. It was a nice break from the rest of my business classes. Only downside was that almost 70% of your grade is determined by the last two weeks of class.",
        "course": "THEATRE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic teacher. Super knowledgeable!",
        "course": "THE805"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a fascinating professor with a massive amount of knowledge. ",
        "course": "THEATRE"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 1,
        "comment": ".",
        "course": "THE805"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Don't waste your time with this teacher. Miss Ferris is unorganized and not well-focused on her job. A huge disappointment for a Theatre major.",
        "course": "THE600"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Caroline",
    "id": "VGVhY2hlci0yNDM0Njc3",
    "lastName": "Hill",
    "legacyId": 2434677,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Shes great and really looks out for her students.",
        "course": "TH2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 3.8,
    "department": "Theater",
    "firstName": "Melissa",
    "id": "VGVhY2hlci0xODgzMDE3",
    "lastName": "Lee",
    "legacyId": 1883017,
    "numRatings": 20,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Super Easy if you are looking for something alongside more difficult courses!",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was the easiest class I have ever taken and was even interesting",
        "course": "THEATRE2100"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Took the hybrid version. This class was the easiest A I've ever taken, but also one of the most high-effort GEs -- there are quizzes over the lectures, the textbook, and whatever play you had to read every week, and the group project required meeting outside of class. Not a bad class, but I wish I had put that work into something more interesting.",
        "course": "THEATRE2100"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "had her for online theatre- video lectures can be crazy long so thats a definite con, besides that projects and quizzes are pretty easy. Books and reading material are needed.",
        "course": "THEATRE2100"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "If you want an easy GE, take this class. Not interested in theatre at all but I learned a lot.",
        "course": "THEATRE2100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 3,
        "comment": "wasn't interested in theater, but learned a lot. some video lectures were dry, but mostly painless. she is a good lecturer and really passionate about the subject! tests, papers, and projects were straightforward if you attend class and read. overall ended up really enjoying her class",
        "course": "THEATRE2100"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Unless you are really interested in theatre, I would not recommend taking this course, especially if you're taking it alongside classes that require a lot of work. You'll get an A if you do the work assigned, and she gives extra credit. Overall it was a huge waste of my time.",
        "course": "THEATRE2100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took the honors section of the class and it probably wasn't as much work as the regular section. Obviously Melissa has a huge interest in theater, so as long as you participate in discussions, she'll like you. There were 3 papers, 4 \"pop\" writing assignments, and 4 shows to attend. Shows are free if you sign up to usher! Overall, would recommend.",
        "course": "THEATRE2100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Even with a strong interest in theatre, I found it difficult to stay interested in Professor Lee's lectures.  She gives textbook quizzes on Carmen to see if you've done the reading, but I got an A on every one without cracking the book. Overall, it's an easy A for a course that covers two gen eds.",
        "course": "THEATRE2100"
      },
      {
        "index": 10,
        "rating": 3,
        "difficulty": 4,
        "comment": "Took the class online, and it was WAY too much effort. There were some weeks where nothing would be due and others where you would have several papers and quizzes due all at the same time. You are expected to see several plays ($15 per play and we saw 3) and you also read several plays as well. We also had to post our own video journals too",
        "course": "THEATRE2100"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 1,
        "comment": "The class is an easy A however I really didn't like her. She takes a lot of pride in teaching the course and expects you to be as serious about it.  She always got mad at the class for packing up a few minutes before the class ended. Regularly went off on tangents or repeated herself. Try to get Benito as your TA. Consider taking online.",
        "course": "THEATRE2100"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 4,
        "comment": "I took this class online and WOW is it A LOT of work. There were some weeks when there was 2-3 quizzes, 2 papers, a discussion post and a video journal due! It is way more time and effort than I think a GE should take. Also, going to the shows and buying the plays gets expensive (100$+). Grading is done by TA's and they aren't too tough. TOO MUCH. ",
        "course": "THE2100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "Weekly quizzes from the lecture and occasional textbook quizzes. I honestly skimmed through the textbook before each quiz and got all the questions correct. You do have to attend actual plays and write responses on them. Also you read several full length plays and make video journals on your reaction. All in all, very easy.",
        "course": "THE2100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy gen ed. I ended with over a 100% in the class without much effort. Pay attention during lecture and take good notes and its a breeze. Recitation is really just a lot of busy work I would highly recommend taking her class but online so you don't have to inconvenience yourself with recitation twice a week.",
        "course": "2100"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Melissa Lee feels a little like reading the same sentence over and over again. She is super ditsy and definitely finds herself comical. She's really into theatre, but I get the sense she's faking her way through sounding knowledgeable. Lectures are painful. Don't feel bad if you don't have the will to go. I basically missed the last half ",
        "course": "THEATRE2100"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lectures are boring, notes are not posted online and a lot of the exams come from what she says opposed to what is typed on the powerpoint. Pop quizzes were given in recitation along with a lot of group work and participation points. ",
        "course": "THEATRE2100"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's an alright teacher. She kind of expects you to be super into the subject though, which for a GE class almost no one was. The projects you do are kind of pointless, but they're all easy so no big deal. She's a pretty fair teacher and is decently helpful, and the midtermsfinal are super easy. Overall an easy A. Have to pay to see shows though.",
        "course": "THEATRE2100"
      },
      {
        "index": 18,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is passionate about what she teaches but expects students to be just as passionate. I skipped lecture more than I went, and still ended up with an A in the class. This class requires a lot of outside work and money to go see the mandatory plays. Not a bad class overall though.",
        "course": "THEATRE2100"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "Melissa is very into the subject and expects the students to care a lot more than most do for a GE class. There are 3 required productions you need to see and each one costs $15. Relatively easy class but not really worth the timemoney.",
        "course": "THEATRE2100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class! Combination of reading plays (order books) and online Carmen articles. Grades very easily and is very passionate about subject. A lot of class dialogue required but very easy to do. A GREAT teacher and class to take. Touch a lot on Performance/Censorship.",
        "course": "THEATRE3597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Nadine",
    "id": "VGVhY2hlci0yNDIxODkw",
    "lastName": "George-Graves",
    "legacyId": 2421890,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Nadine wasnt necessarily a terrible teacher, but she acted like theatre was the most important thing in the world throughout our class. She assigned a lot of homework that I didnt do, yet I skated by with ease. She appreciates when students show interest in the class. The class was primarily based on participation. Be prepared to attend shows.",
        "course": "THEATRE2100H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Joe",
    "id": "VGVhY2hlci0yMzMzOTU5",
    "lastName": "Kopyt",
    "legacyId": 2333959,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had him back in 2017. Great acting teacher; never leaned too heavily into the abstract touchy-feely nonsense that plagues other acting classes.",
        "course": "THEATRE2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Theater",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0yMDQ3MDY2",
    "lastName": "Wellman",
    "legacyId": 2047066,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Wellman is a good teacher. She is able to push her students to do their best in subjects that might not be the most interesting. This was a great class and probably one of my favorite theatre courses. She gives a great method for analyzing a text. Dr. Wellman Is really good at leading discussions about sensitive topics.",
        "course": "TH2367"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr Wellman is very sweet but the class itself is pretty boring. The conversations are basic and there isnt really a clear goal of the class.",
        "course": "THEATRE236703"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very sweet and caring professor and the class was interesting to take, but her lectures and grading were all over the place.",
        "course": "THEATRE236702"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Wellman is a very amazing teacher. You would love her class so much . She tries her best to provide majority of the reading books on carmen. Her classes are so interactive and always happy to go to class. She is just wonderful ! I would recommed you taking her class if you have too. Thank me later!!",
        "course": "THEATRE2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Elizabeth was one of the best professors Ive ever had in my entire life. Her class was engaging, interesting, and enlightening. I highly recommend taking this class for your literature credit because we hardly read anything. Even if you dont read, you can skate by if you know a summary. She does give pop quizzes, but they are easy. I loved her!",
        "course": "THEATRE236702"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Wellman is a wonderful, loving woman. This class is fun, not too difficult, and a great way to introduce theatre. She grades fairly easy and I would definitely recommend taking it as a GE. You will have to do some acting and a lot of reading.",
        "course": "THEATRE2100H"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is such a sweet lady! One of my favorite profs I've had. Especially for people who may not like theatre, she makes it fun. Read the plays so you do well on the quizzes and show up to class. Would definitely recommend!",
        "course": "THEATRE2100H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Ms. Wellman is a great teacher, but I would not recommend taking 2367.03 during summer unless it is the only course you take. Lots of reading and episodes to watch. Average homework load is 30 pages of reading plus 3-5 hours of episodes to watch, for a single day. Besides, there are pop quizzes.",
        "course": "THEATER2367"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Elizabeth is such a great woman. If you have the chance to take one of her classes you definitely should. I always felt comfortable in her class and really feel like I learned a lot about the subject and myself. I recommend her to everyone, theatre majors and non majors! InterACT is such an amazing opportunity and you should take advantage of it.",
        "course": "THEATRE3921S"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Allison ",
    "id": "VGVhY2hlci0yMDA1NDE4",
    "lastName": "Brogan",
    "legacyId": 2005418,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Best GE at OSU. Watch some shows and turn in most of the assignments to get the easiest A ever. Enjoyable class and Allison is a super nice teacher that makes it worth walking to the Drake Center.",
        "course": "THT236703"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great class. Must take. Easy but also learned a lot. Really fun class. ",
        "course": "2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Allison was a great teacher, really understanding, really helpful, and just open minded to all our ideas. She does assign plays but they are easy reads with easy assignments. The project and presentation were nice and easy going, as long as you pick an interesting topic. Def recommend taking her!",
        "course": "236701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Aubrey",
    "id": "VGVhY2hlci0yMzc0ODUx",
    "lastName": "Neumann",
    "legacyId": 2374851,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Each week there was a quiz on a selected (long) play reading There were also short assignments scattered throughout including responses/analyses. The toughest part were the two Production Analyses where you had to watch plays and then right essays on them. There was also a group project at the end where we actually put on a play amongst our group.",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Pamela",
    "id": "VGVhY2hlci0xMjUyOTk3",
    "lastName": "Decker",
    "legacyId": 1252997,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "Ok. Ok. I believe this is the same &quot;doctor&quot; Decker I had; not at OSU, but at Baldwin Wallace University. Wouldn't recommend her, at all. She doesn't even seem to know that much about theatre. She thinks she does though. Acts as if she's the greatest teacher around even when the musical theatre students know more about theatre than she doe does.....",
        "course": "THEATRE236702"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "What a cool class. I initially took it just for the GE credit, but I'm so glad I did. It definitely changed the way I see many things. She is a wonderful professor. She is fantastically clear, humorous, well-prepared, and very approachable. She is also a generous grader- as long as you read and listen, you'll get a good grade. Would recommend!!!",
        "course": "236702"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "I loved this class. She is very organized and leads great conversations. You just need to read the books before class to participate. You will also have some writing to do but it is always interesting topics and the plays are very interesting. I advise all students to take this class.",
        "course": "236702"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "The only points I missed in the class were from the weekly discussions. The lectures are very helpful, and the quizzes are from the lectures and book.",
        "course": "2100"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Really passionate about subject. There is a fair amount of reading, but really small plays that you can usually get via library and there are lots of class discussion to understand course concepts. She is really help and great with questions. As long as you communicate with her, she is willing to be flexible, when necessary.",
        "course": "THEATRE236702"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "I had her for an african american theater history course. She did an excellent job reviewing for the first midterm. She required a lot of books but some of them you could sparknotes or even just read the wikipedia entry and still do fine with. There are two major writing assignments outside of exams/midterms.",
        "course": "THEATRE236702"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "THEAT100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Theater",
    "firstName": "Linnea",
    "id": "VGVhY2hlci0yMTUxMzI2",
    "lastName": "Bond",
    "legacyId": 2151326,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was very fun. We made our own skits, and learned about the inner-workings of the theatre, which I really enjoyed. Most of the class is graded off of small things, that are realtively fun and simple. There was a standard midterm and final exam, but they didn't affect your grade a whole lot, and were pretty straight-forward and easy.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Linnea was such an inspiring and enjoyable presence. This was the one class I actually looked forward to attending everyday. She cared so much about each of us, and she wanted nothing more than for us to succeed. You definitely don't need a background in theatre, but if you do have one you won't be bored either. Much better GE class than TH2100!",
        "course": "TH2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.9,
    "department": "Theater",
    "firstName": "Karen",
    "id": "VGVhY2hlci0xMzgzMjc1",
    "lastName": "Mozingo",
    "legacyId": 1383275,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "This class was fine. I had a great TA, so I enjoyed it.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher and super sweet! She's easy to talk to and is usually fine with giving extensions. You have to read textbook chapters but they're easy. As long as you show up and participate, you'll be fine in her class.",
        "course": "THE2100H"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mozingo is great! She's very passionate about what she teaches which makes it engaging. Play assessments are more participation, but still read! Get all required plays a couple weeks ahead. Most are online. Buy or sign up to volunteer to see the plays early!",
        "course": "THE2100H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took this class online and it was fairly easy. It was mainly run by the TA or a different professor but Professor Mozingo managed the course. It was organized very well and you know exactly what to do every week. There was a decent amount of work with the readings and discussion boards but you can easily get a good grade if you put in effort.",
        "course": "THEATRE2100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy class. Took at an accelerated pace and was a ton of work, at a normal pace would be super easy and manageable. Lots of reading - some interesting some not.",
        "course": "THEATRE2100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Mozingo is very passionate about theatre but is aware students are taking this class to fulfill GE requirements. Very easy grader. Most readings can be found with online PDFs. Discussion-based classes, so be willing to contribute to the discussion.",
        "course": "THEATRE2100H"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Professor Mozingo was super passionate about theater. There are no exams, but learning assessments after reading the plays. I never had to buy a play, but normally found online pdf versions. Super easy class and gen ed.",
        "course": "THEATRE2100H"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Interesting plays. Clear weekly material and assignments.",
        "course": "THEATRE2100"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "If you're planning to take THEATRE 2100, online with Karen Mozingo, don't. The class requires you to read a play every single week but they cost additional money and can be very expensive. The material is not engaging whatsoever and require a lot more work than a GE should require. ",
        "course": "THEATRE2100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class was structured well and made theatre interesting even though I am not into theatre and took the class for the GE credit.",
        "course": "THEATRE2100"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was super easy. Whenever I had problems with the online course I got a response quickly and fast.",
        "course": "2100H"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very fair and straightforward. Participate some in class and stay on time with weekly assignments (plus a few papers and a presentation) and an A is no problem. Very friendly too",
        "course": "THEATRE2100H"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took theatre 2100 online and it was so easy. The asych class only has a few requirements per week. You will get 10/10 on all of the discussion posts if you complete them and 20/20 on all of the quizzes. Easy class, but a lot of work for the final project.",
        "course": "THTR2011"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 2,
        "comment": "Super easy class. Attendance is graded, but is just a sign in sheet, participation doesn't matter too much. A lot of reading, very little of which is really required or tested on. For the hybrid I took, it was a quiz at the end of each week, class, 2 essays over performances, 1 presentation, and final project, no exam or midterms.",
        "course": "2100H"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 1,
        "comment": "Super easy professor. Group project 10 page final paper. Gives you 100% on everything. Super boring tho. Very kind.",
        "course": "2100H"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 2,
        "comment": "I took Theatre 2100H as an easy GE honors class, but it was a lot more work than I anticipated. We read a play every week (around 14 plays) and write a discussion on them. We also had to write 3 performance reviews (2-3 pgs), a final paper (7-10 pgs), and do a final group project. However, she is an incredibly easy grader, so you'll do well.",
        "course": "THE2100H"
      },
      {
        "index": 17,
        "rating": 2,
        "difficulty": 1,
        "comment": "Took her for a GE class, very easy to get an A as long as you show up (dont need to participate, only because she takes attendance). Had to see plays and write a lot of papers, but as long as you do well on those you can pass without doing any of the other reading she assigns. Dont buy the textbook. Be prepared to fall asleep a lot in class.",
        "course": "THEATRE2100H"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "I learned a lot about theatre, and we read contemporary plays about human rights. I enjoyed the group project, and Dr. Mozingo is a caring teacher.",
        "course": "2100H"
      },
      {
        "index": 19,
        "rating": 3,
        "difficulty": 2,
        "comment": "This was a lot of work for a theatre GE. We read a play every week, wrote 4 papers, and had half a dozen events to attend outside of class. Incredibly easy grader so the assignments weren't high stress, there was just a lot of them. The final project is to write and perform a short play. Karen is a little strange but overall not a terrible class.",
        "course": "THE2100H"
      },
      {
        "index": 20,
        "rating": 3,
        "difficulty": 3,
        "comment": "I was expecting this to be a very basic/surface level course covering general knowledge about theater, but it quickly turned into an acting class. Within the first week she required the class to prepare and perform a monologue with props and the whole nine yards. If you're not into acting, find a different professor.",
        "course": "2100H"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Mozingo is a great lady and really cares about her students. The class isn't too difficult and the class discussions are interesting. You read lots of plays, but I found that interesting so I liked them. There is some writing of papers, but she's a pretty easy grader.",
        "course": "2100H"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 2,
        "comment": "There was a LOT of reading involved, but she really cares about her students and you can get by if you can't do all the readings. There were a lot of class discussions and a couple of group projects, but other than that not much went into the grade. Not a tough grader though.",
        "course": "THTR2100H"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 2,
        "comment": "There is lots of reading but no tests or quizzes, just journals and discussions about the reading. There was one final paper and a final group project, both were fairly easy. Would take again.",
        "course": "THEATRE2100H"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 1,
        "comment": "Mozingo was a fine teacher, the subject (criticizing TV) was interesting, it was a lot of discussion rather than learnings anythings. None of the assignments were difficult or that complex, but were often vague. You did not have to go to every class or read the book to pass, but you definitely do to get an A as it is used sparingly.",
        "course": "TH2367"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class was a mix of musical theatre history and studio sessions. Guest instructors added to the variety of dance and vocal work we did. There was a big group project and doing class readings was important because many sessions  included group work and discussion. Karen was available to help and gave good feedback when I asked questions.",
        "course": "TH577105"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was really amazing, in part because of her discussion leadership. We had wonderful discussions concerning a multitude of topics, especially concerning women's issues. The opportunity to interview a real playwright at the end of the semester was great, and was largely facilitated by Dr. Mozingo herself. You won't be disappointed!",
        "course": "THEATRE2101H"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 4,
        "comment": "Dreadful. Avoid this class at all costs. You watch videos of people sitting for hours with their hair tied together and compose nightly responses to bogus articles by people you have never heard of and will never hear again who write about awful, boring, obscure topics.",
        "course": "2100H"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class is super easy but incredibly boring. I expected a standard theatre class using well known plays like Shakespeare or something but instead the whole class was about Nonwestern rituals and the concept of play and \"nonreality.\" I didn't buy any of the books and I got by just fine. The only problem is that everything she says is basical",
        "course": "THTR100H"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 3,
        "comment": "She's really nice and we occasionally had wonderfully stimulating class discussions, but if you don't like Dance, her class is painful. Also, we had to attend 10 performances, which I found a bit excessive. I really didn't learn much about theatre, but I did learn a heck of a lot about post-modern dance--I have learned that I hate it.",
        "course": "THE100H"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "So kind, always willing explain concepts misunderstood. Always positive attitude and truly cares about students. Really liked the dance discussion because I used to dance. Thought was going to have to act theatrical performances. Really more heavily focused on the performances of daily life. Fun- I liked the &quot;Play&quot; activity!",
        "course": "THTR101H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.8,
    "avgRating": 3,
    "department": "Theater",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yMTczMTEx",
    "lastName": "Truett",
    "legacyId": 2173111,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "While this professor is kind during individual interactions, conduct observed in their classes leaves much to be desired. I have taken several courses taught by this professor, a consistent theme of disorganization persisted. The classroom atmosphere was characterized by a chaotic, disorderly energy, with many superfluous tasks in their curriculum.",
        "course": "TH3120"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took the online version, did EVERYTHING (quizzes, lectures, readings) the day of. Some weeks I wouldn't watch the episodes (just read the synopsis or did nothing at all) and I did well. Gives extra credit and I would say is an easy (or at least lenient) grader.",
        "course": "THEATRE236703"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Theres a good amount of weekly homework and few big assignments throughout the semester but hes very lenient and wants to work with you. Im the worst writer and still got an A in this class.",
        "course": "THEATRE236703"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "He gave lots of quizzes but they were easy if you did the reading and watch the TV shows. He was very easy to approach with issues and ask questions. He seems to care about his students.",
        "course": "THEATRE2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Truett gives you really good feedback on each of your assignments. Before this semester I had never taken a theatre class but due to the assignments he had us complete such as reading various plays and going to see live productions it has me further interested in theatre.",
        "course": "THEATRE2100"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 3,
        "comment": "This class is structured so poorly. It says an assignment was due on a Monday and when you clicked on that assignment it would tell you that the first part of the assignment was due the Friday before, so there would be no way to get points for it. This caused me to miss multiple assignments. This professor is RUDE and will not care about you.",
        "course": "THEATRE2100"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "The most unorganzied class I've ever taken. So many episodes to watch and readings to do every night that you do nothing with in class.. Class is pointless but if you skip, he'll hold a grudge against you. He's so rude if you ask questions and changes rules in the syllabus all the time",
        "course": "THEATRE2367"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible, terrible instructor. If you miss a class, you miss points. Gives 5 40 minute episodes along with a few articles to read per class. Very rude when asked any type of question. Do nothing in class, but lots of homework.",
        "course": "THEATRE2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yOTc4MjAw",
    "lastName": "Smith",
    "legacyId": 2978200,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Josh is an amazing professor. He truly cares about what he teaches and his students. His main focus in acting is Improv and in craft of acting, you will play many improv based games. I loved his class and it really gave me the confidence to attemp improv.",
        "course": "THEATRE2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Caleb",
    "id": "VGVhY2hlci0yOTcxMjc0",
    "lastName": "Beidelman",
    "legacyId": 2971274,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Caleb was really great and I really enjoyed his teaching. He was kind, caring, and extremely helpful. This class was set up strangely and required the purchasing of eight plays to read, however, he helped students access these materials to the best of his ability. Super easy class to get a good grade in and a great performing arts GE option. ",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Matthew",
    "id": "VGVhY2hlci0xMTUzNjg3",
    "lastName": "Yde",
    "legacyId": 1153687,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Interesting information.  Creative.  Kind.  Became newspaper theatre critic in later years.  ",
        "course": "THEAT597"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "great",
        "course": "THEA597"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "Such a good teacher! Definitely easy to get an A if you read the plays and go to class. He will look over your papers before you hand them in and give you feedback. He is also super nice!",
        "course": "THEAT100H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A. Just do the readings(which aren't that long) and show up+A.",
        "course": "THEAT597"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "Very biased. I am liberal, but Mr.Yde takes it to a whole new level. Very easy course overall. It was also very informative. And there wasn't much reading in the course : )",
        "course": "THE597"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a genius.  It is an eye opening experience to take this course and the course is highly interesting.",
        "course": "THEAT597"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not anti-american at all, just anti-stupidity. Definitely biased, but he was really cool about differences in opinion and encouraged a lot of discussion. Showed awesome films.",
        "course": "THEAT597"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Well-versed.  Informative.  Protege of Dr. Woods, and a fine disciple.  Great future for this talented instructor.  He is motivated to be a good teacher, as well as keeping a fine eye upon the stated objectives of the class.",
        "course": "THEAT597"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Overall, I thought it was a great class, I do think that he should give some more thought to the way the group projects are put together, but that will come with time.",
        "course": "THEA597"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loved it. Matt is great and really well-versed in the subject matter. Though the class was nothing like what I thought it would be, I ended up really enjoying myself and getting quite a lot out of it.",
        "course": "THEAT597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4,
    "department": "Theater",
    "firstName": "Scott",
    "id": "VGVhY2hlci0yMTQ2NTQ4",
    "lastName": "Spears",
    "legacyId": 2146548,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor! Would highly reccommend!",
        "course": "TH5321"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "He wants you to create projects that he likes in his style above all else. Nice enough guy outside of class but can expect too much in class, although at the end of the day he's an easy grader. I also don't think he's really fully qualified to be teaching a class like this based on the projects of his we saw",
        "course": "TH5321"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "The grading is subjective with no rubrics, while not difficult there is an interesting attendance policy. His opinion is fact in his room, however he can help a ton. Heed some advice, not all, play into his humor and do not miss class and you will pass! ",
        "course": "TH5331"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Spears was pretty chill. He had a lot to share about the film industry and he was very passionate about it. Assignments weren't too difficult - write one or two scripts. The readings were easy and the quizzes were sparse. Only issue is he compared everyone's scripts to other films or shows. His feedback was very helpful and critique, too.",
        "course": "THEATRE5331"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Scott is a goofy guy and is very knowledgeable about screenwriting. This class is kind of a free for all; you learn the basics of writing a screenplay, then you write drafts. He has pretty straightforward feedback and wants you to succeed and understand the business.",
        "course": "THEATRE5331"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "Scott is great! He has such a hyper personality and is clearly very passionate about movies. I gained a lot of screenwriting knowledge thanks to his class. I also loved coming in and just watching things and talking about it! I loved that he started each class with allowing us to share what we thought of the most recent thing we watched.",
        "course": "THEATRE5331"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Spears has wonderful, practical advice. However, he has a tendency to give long, rambling lectures with needless examples of his own devising. For me, it was not a useful teaching technique.",
        "course": "THEATRE5331"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "Knowledgeable, good practical advice, excellent assignments and feedback, accessible and funny. Fair workload and grading. I learned a great deal about how to write a screenplay.",
        "course": "TH5332"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "Scott is an overall great professor. He works hard to fill his lectures with engaging, relevant content and he is always open to student input. He has an approachable, down-to-earth personality, and a great sense of humor. Also, he prefers quality over quantity when it comes to student work. Come to Scott's class expecting to learn!",
        "course": "TH5331"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Scott has worked on many films out in LA, and thus brought great insight into this video production class. He's also very goofy, which makes class enjoyable. However, the class was relatively unstructured, so if you need structure you should probably look elsewhere.",
        "course": "TH5321"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 3,
        "comment": "DON'T take this course! It only has four lectures and he will only teach very few things. The rest of the time will be writing and discussing. In the discussion, NEVER EVER challenge or question Scott, you will fail. BTW, he has no rubric and only post letter grades. He's gonna teach video production next semester, hope you consider seriously.",
        "course": "TH5331"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0yODYwNTc3",
    "lastName": "Quiroz",
    "legacyId": 2860577,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor who cares about his students. Never taken a theatre class in my life but this class was very enjoyable and engaging. ",
        "course": "THEATER2811"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Was half online half in person, so it was only two days a week. Easy class, had to read/watch one play a week, and then take a 5-question quiz on it on the second day of in-person class. Online it was a textbook to read with a 20-question multiple choice test a week, literally got 100% every time. Very nice and UNDERSTANDING professor.",
        "course": "THEATER2811"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Chris was a great professor and I definitely learned a lot from his course. This class is a great option for students wanting to fulfill a performing arts GE as well. You definitely can't miss in person classes because your grade rests upon participation, but theres only two papers throughout the entire semester for outside of class work. ",
        "course": "THEATER2811"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chris was the best professor I have had during my time at OSU. Not only was the class informative and fun, but the course created an atmosphere of respect, understanding, and team building. This was the first ever class that I felt like the professor actually took time to get to know the students and facilitate team building. ",
        "course": "THEATER2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 2,
    "department": "Theater",
    "firstName": "Colton",
    "id": "VGVhY2hlci0yNzU3NzQx",
    "lastName": "Weiss",
    "legacyId": 2757741,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Grades way too harshly for entry level. way too many assignments and is passive aggressive if you question him/his grading. leaves vague reasoning for why a certain grade is given. switch immediately if you get him for GE intro!",
        "course": "2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is not for 2100!\nI had Colton Weiss as my CSE-CIS Academic Advisor. He breaks all stereotypes about advisors. He helps me keep on track to graduate, figure out my related field, and is always patient with me. I always feel better prepared after I leave our appointments. I highly recommend!",
        "course": "2100"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "This dude was assigned as my academic advisor, who never responded, even it was about a student's graduation, what a joke.",
        "course": "2100"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "ABSOLUTELY TERRIBLE!!  The worst professor I have ever had in my entire life. If you have this man switch out!! He is the least caring, compassionate individual I have eve met.  So beyond rude to his students it is concerning.  I have never hated a man more.  Cannot stress how much I dislike this guy!",
        "course": "2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Joshua",
    "id": "VGVhY2hlci0yNTcxNTA0",
    "lastName": "Streeter",
    "legacyId": 2571504,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "i genuinely looked forward to his class. funny guy and very understanding. ",
        "course": "THEATER2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take him! Very caring and did not have many assignments in his class. The essays are on pretty easy topics and he is very helpful if you need any help. He is also pretty flexible with deadlines. ",
        "course": "THEATER2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely loved Josh! Hes a grad student so he genuinely understands and cares for his students. He made his class very easy and entertaining. If you need credit for a GE take criticizing television with him. It is such a fun course and Josh makes it so simple for you to do well in.",
        "course": "THEATRE2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Super nice dude and tries his best to make everything easy to understand as well as remain accessible to anyone who needs help. The class was not boring at all, he brought a sense of fun to the material which was nice. There are about 4-5 short essays for which he gives good feedback. Overall a superb professor and I enjoyed the class.",
        "course": "THEATER2367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "A very nice guy. He's a grad student so he's new and scatterbrained, but you'll love it. No exams, just four or so short 500-700 word essays. You discuss readings every week in class, but since there are no exams on it, you can get by without buying it. Just make sure to contribute some in class. Overall, easy A. would take him again",
        "course": "THEATRE236703"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Theater",
    "firstName": "Paul",
    "id": "VGVhY2hlci0yMDMzNTc0",
    "lastName": "Peloquin",
    "legacyId": 2033574,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pauls class was great! His lectures are long and this class is only offered at night! His exams are hands on and the second part is TF fill in the blank multiple choice. He invites his students to WOSU to see how a TV studio is ran. If you want to work in the TV industry take this class!",
        "course": "2351"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.5,
    "department": "Theater",
    "firstName": "Melonie",
    "id": "VGVhY2hlci0xNzk0MDcy",
    "lastName": "Mazibuko",
    "legacyId": 1794072,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Is very interested in the subject but understands that not all of her students are theater majors. Is there for help when it's needed and grades participation, quizzes, and group work. One of our group assignments was worth more than our final.",
        "course": "THEATRE2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Melonie is full of passion for theatre and really made me enjoy getting up for class (says the night owl). She creates an encouraging atmosphere where acting in front of classmates is not a problem, even if you have stage fright. She always has enriching feed back and always wants us to succeed. Take her class!!",
        "course": "THEATRE2811"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "One of the best, she just needs more experience. Take her if you have a chance very good teacher",
        "course": "THEAT2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is an AWESOME TA. Full of energy. Very interactive class, with minimal homework, especially in comparison to the other TA's.",
        "course": "THTRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Alisson",
    "id": "VGVhY2hlci0xODQ3Njkx",
    "lastName": "Brogan",
    "legacyId": 1847691,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Brogan's Theatre second writing course is the easy GPA booster you've been dreaming of.  She'll shorted HW, or cancel it all together if she doesn't feel like doing it that week.  There's required reading, but you barely go a few inches in depth about any of the plays so you can pretty much skim the assignments.  Super nice and friendly, must take.",
        "course": "236701"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely fun class. Very fun teacher. She watches movies a lot and class and their is a lot of discussion on various entertainment topics. Great course.",
        "course": "THEATRE236701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Meg",
    "id": "VGVhY2hlci0xNzgxMTYw",
    "lastName": "Chamberlain",
    "legacyId": 1781160,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Didn't think much of 2200 going in but Meg made it more enjoyable than I would have ever imagined. Even at 8am, she knew how to wake us up and make us semi-productive. Would definitely take again, just not at 8am.",
        "course": "THEATRE2200"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I recommend taking theatre online at OSU. But Meg is awesome in person. Grades pretty tough on assignments unfortunately and I hear she was tougher than the other TAs. She let me make up for a slow start with extra credit by seeing extra plays.  Not an easy A. Have to do the work and attend class. She is awesome though.",
        "course": "THEATRE1100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Meg is seriously so great and talented if you just memorize the stuff for this class (two short scenes) and participate you will get an A for sure! She is also super nice and hilarious!",
        "course": "THEAT2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Jim",
    "id": "VGVhY2hlci0xMzM2MTc5",
    "lastName": "Knapp",
    "legacyId": 1336179,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Jim is a great person. Sometimes he can spend a little too long on a topic to beat it into the most dense person's head, which can mean the real meat of material is never discussed. He'll always try to answer questions and is very friendly. Group projects are a thing, but not very many outside of class assignments. Don't be late or skip class.",
        "course": "THEATRE5241"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good class and a lot of fun. We spent a lot of time discussing things that we had already learned and kept repeating some things till it was idiotic. Could have learned so much more if we hadn't gone over things so many times. But how many classes I generate 70,000 dollars worth of work in them.",
        "course": "THEATRE5241"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was Jim's projections class and it was awesome! You should take it!",
        "course": "THE694"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "All of Jim's classes are great. Whether you are a seasoned professional or someone that's never touched a sound board, Jim always has something to teach you. He's understanding of lateness and other problems that may arise during the quarter. I will continue to take classes with him!",
        "course": "THEAT626"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Patrick",
    "id": "VGVhY2hlci0xOTY3MzA0",
    "lastName": "Wiabel",
    "legacyId": 1967304,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great teacher. Has fun and really gets into what he does",
        "course": "2811"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 4.9,
    "department": "Theater",
    "firstName": "Chris",
    "id": "VGVhY2hlci0xNDg5OTE1",
    "lastName": "Matsos",
    "legacyId": 1489915,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loved this guy. I wish I could become a theater major just to hang out with him again! Easy A as long as you study.",
        "course": "THEA100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher! I only missed one question on the final and midterm! I went to lecture and took notes directly off slides and that is exactly what was on the exams. Plays were easy to read. Easy GEC. I highly recommend Matsos!",
        "course": "THTR100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Had his acting class at 9:30 twice a week in Drake. Even though it was a hike to class I never wanted to miss it because the class was so fun and he had you laughing for the majority of it. You also get to know you classmates well because you are always interacting. Amazing teacher!!!",
        "course": "THEAT280"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best GEC's I've ever taken. Makes the class funny cause he knows people are there just for the credit, and the work is really easy. TAKE THIS CLASS if you're looking for a GEC.",
        "course": "THTR100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was by far the best teacher I have ever had the pleasure of having. I highly suggest taking his course.",
        "course": "THEAT280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 4,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Vera",
    "id": "VGVhY2hlci0yMjUzMTM5",
    "lastName": "Brunner-Sung",
    "legacyId": 2253139,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Had VBS for Crit TV. She's a tough grader, and the course was a lot harder than I was expecting, especially for a class about tv. However, she provided really good constructive criticism on papers, and I feel like she really helped me to improve my writing skills. Overall, one of the more interesting and helpful professors I've had at OSU.",
        "course": "THEATRE2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Christopher",
    "id": "VGVhY2hlci0xMzQ4OTcy",
    "lastName": "Hill",
    "legacyId": 1348972,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Chris Hill is a good physics 1250 professor. His class test average were always higher than other lecturers and I believe that is because of his broken down conceptual way of teaching physics. Would recommend!",
        "course": "PHYS1250"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "A wonderful professor! He is so kind and helpful. 100% would take again. I had him for Acting 1 and amazing teacher, he really cares about his students. You can talk with him about anything. He is all for safe spaces. Makes sure you are comfortable, but at the same time makes you come out of your comfort zone. AT YSU: HE DOESN'T ROUND UP.",
        "course": "THTR2628"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best professors I've had so far! He was super clear and concise with his instructions, and he was always willing to help us out in any sort of way regardless of how busy he was. He appreciated the sharing of thoughts and opinions, which was the main purpose of the class time. He made theatre much more enjoyable, so I got a lot out of it!",
        "course": "THEAT367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "AWESOME!",
        "course": "THEAT100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.5,
    "department": "Theater",
    "firstName": "Jessie",
    "id": "VGVhY2hlci0xNjIwNzIw",
    "lastName": "Glove",
    "legacyId": 1620720,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The only tag I used was participation matters because as long as you do the work you will get an A. I put in zero effort, wrote essays in under two hours, and didn't read the textbook at all. I knew nothing about theatre going in and ended with over 100% in the class. It is the easiest thing you can take and Jessie is an easy grader.",
        "course": "THEA2100"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "This professor is almost completely inaccessible via email. If you can get ahold of her, get ready for vague non-answers if you want to improve your grade. She also \"doesn't believe\" in a perfect score on anything. AVOID.",
        "course": "THEATRE2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a good professor. She gives study guide before the exam which is very helpful. You get extra credits if you go and see additional plays, but it just worth 3 ppts for each. She is not a bad choice for GEN ED takers.",
        "course": "THEA100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Tyrrell",
    "id": "VGVhY2hlci0yMjA4NTI0",
    "lastName": "Davidson",
    "legacyId": 2208524,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Tyrrell's the best. She's one of those teachers that really loves the curriculum. She's incredibly intelligent. Sometimes she gets off topic but you'll end up learning something neat anyway. Not a hard class but you have to read the textbook and the plays. You also have to see 3 plays (one off campus). It'll be your favorite class.",
        "course": "TH2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Tyrrell Davidson is the most enthusiastic teacher I have ever had. If you get her for Theatre 2100, consider yourself lucky. She is seriously the best and made me very interested about Theatre. Pro tip: READ THE RUBRIC AND YOU WILL GET A 100 on the Assignment. Got a 99 in the class.",
        "course": "THTR2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Tyrrell rocks! She is so intelligent and truly cares about the subject material. Her lectures keep you engaged and entertained. I would 10/10 recommend Tyrrell any day!",
        "course": "THTR2100"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Tyrrell was a great instructor for Intro to Theatre! She was always enthusiastic to teach and was very funny, and she knew a lot about theatre that she was eager to talk about.",
        "course": "THEATRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.8,
    "department": "Theater",
    "firstName": "Francesca",
    "id": "VGVhY2hlci0xNzM4Mzcw",
    "lastName": "Spedalieri",
    "legacyId": 1738370,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Nice Prof for sure, really caring about her students and grading you HWs extremely carefully,",
        "course": "THR104"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 5,
        "comment": "She is not only a sensational person outside of class but she takes her time to explain anything that is misunderstood. Yes, her classes are challenging and you get the grade you deserve but she is more than willing to help! She is also Italian and has an adorable personality.",
        "course": "THEATRE2110"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a very nice and interesting teacher. Class is definitely thought provoking but valuable to take.",
        "course": "THR597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 3.8,
    "department": "Theater",
    "firstName": "Ashley",
    "id": "VGVhY2hlci0xNDE1MDg2",
    "lastName": "Kobza",
    "legacyId": 1415086,
    "numRatings": 4,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Ashley pushes you out of your comfort zones. Class is filled with games, lectures, and getting out of your desk; it's weird but in a good way. Take her class!",
        "course": "TH105"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Currently at SDCCD. Her class was so much fun. You get to practice and play with the lessons. If you don't like interaction with other don't take her class. If you love it than she is the best choice. This class was so much fun.",
        "course": "DRAM105"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "All over the place and disorganized with her lexturing and teaching. Unreasonable. Unclear about her expectations until the very last minute. If you have an unrelated opinion she gets very defensive, and goes on about herself instead of listening, thinks it's about her. Brags about her masters degree. Who cares if I'm not learning anything.",
        "course": "DRAMA105"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty cool down to earth TA. Very fair and will help you out.",
        "course": "THTRE101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Philip",
    "id": "VGVhY2hlci0xMjM3Nzgx",
    "lastName": "Garrett",
    "legacyId": 1237781,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Prof. Garrett has extensive experience in film and does a good job of teaching.  He knows what works in developing a film project and tries to think about more than just getting the work done.  It's been an eye opening course.",
        "course": "VISUALNARRATIV"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Good class, solid approach to the material with practical outcomes. Teaches the essentials of cinematic storytelling and crafting a quality screenplay.  Workshops are one of the best parts of this course.",
        "course": "THEA636"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great course in screenwriting.",
        "course": "THEAT636"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great class.",
        "course": "THEA636"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "THEA636"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "Professor Garrett is an adjunct/guest lecturer who taught an introductory screenwriting course. He is very passionate about what he teaches and sometimes he struggles to communicate his critiques, but he has a great detector for what works in a screenplay. He also has professional experience in film-making. I highly recommend him.",
        "course": "THEAT636"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.5,
    "department": "Theater",
    "firstName": "Nicholas John",
    "id": "VGVhY2hlci0xNjIwMTg3",
    "lastName": "Dekker",
    "legacyId": 1620187,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is such an easy GE, take it! DR. Dekker is super awesome and keeps lecture entertaining.",
        "course": "THTRE2100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 4.4,
    "department": "Theater",
    "firstName": "Joy",
    "id": "VGVhY2hlci01MTU3Nw==",
    "lastName": "Reilly",
    "legacyId": 51577,
    "numRatings": 59,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "Joy is awesome, nice, approachable, and funny. This class was extremely easy, everyone will get an A. Attendance is mandatory, but worth it. No acting is necessary. Don't waste time reading the plays, you can sparknote them. Take brief notes because she doesn't provide you with her powerpoints. - you will have to write about them for the midterm",
        "course": "THEATRE2100H"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Didn't want to take this class, but ended up loving it.  It is not high intensity and she is very funny.  Would recommend for anyone needed the visual and preforming arts GE",
        "course": "2100H"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dr. Reilly is an incredibly kind professor, and she loves teaching. As a STEM major, I originally did not want to take a visual and performing arts class, but this class truly developed an interest for theatre within me and made me appreciate the art. Take this class for the GE and enjoy yourself for once in a class!",
        "course": "THEATRE2100H"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lectures are really fun and she is very funny. If you attend class, you will get an A; I don't think she actually keeps track of actual individual grades. She requires you to read play scripts, but they are really cheap. Don't buy her study guide. ",
        "course": "2100H"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Easy A for Honors GE. She is so scatter-brained and it's hilarious but she is an extremely nice person. The group projects were fun and the plays we had to read were interesting!",
        "course": "2100H"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joy is one of my favorite people on this earth. Such an easy class, not sure how you could screw this one up really.",
        "course": "2100H"
      },
      {
        "index": 7,
        "rating": 2,
        "difficulty": 1,
        "comment": "She has been doing the same thing for 30 years. She needs to retire.",
        "course": "TH100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a wonderful professor and former professional in the field. I loved her! Probably one of my teachers I've ever had.",
        "course": "THTRE100"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easiest A I have ever received at OSU, enough said.",
        "course": "THE100"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor! She always keeps things interesting and is available for help when you need her. I would definitely reccomend any of her classes.",
        "course": "THE101"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Made this subject so interesting, lot of fun, easy, great teacher.",
        "course": "THEAT100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was funny and kept lectures interesting! I liked her a lot! This was a very easy GEC!",
        "course": "THTR100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was so much fun and I never wanted to miss a lecture!",
        "course": "THE100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "VERY EASY GEC.  Also, entertaining at sometimes.  Lecture is optional and the exams are easy.  What more could you ask for&#63;",
        "course": "THTRE100"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 4,
        "comment": "Pretty good teacher, good for a GEC, invaluable for Theatre.",
        "course": "TH100"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great class and teacher.  Did a new specialization on comedy throughout the class, improv exercises and creative projects fun to make and alot of fun to watch.  Really enjoyed class and had a good time learning about theatre and all about different comedians and how they got their start.  Would reccommend teacher and class to anyone!",
        "course": "THEATH100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class! Dr. Reilly was an absolutely wonderful professor who I would recommend to anyone. She kept lectures interesting and was a very enthusiastic lady. I actually learned quite a bit from this class and it was surprisingly fun!! HIGHLY RECOMMENDED.",
        "course": "THTR100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Okay class, really easy. The material wasn't really that interesting, but Joy tried to make it fun. Creative Projects were the most interesting part. Pop quizzes are more to see if you attend lecture than your knowledge. Scan over the book, she's trying to add in more text questions into the exams. Easy GEC.",
        "course": "THTR100"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "If it wasn't for the creative project, which actually required a tiny amount of time and effort outside of class, I'd say this was the easiest class I've ever taken in four years at OSU. Worst part was having to drop $20 to go waste a couple evenings seeing plays. If you stress over this class, u ain't making it through college.",
        "course": "THTR100"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 1,
        "comment": "Class is very boring but her personality does a little to help...Very easy class but a lot of work for a GEC...I would recommend this class for a GPA boost.",
        "course": "THEAT100"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy GEC. she tries to make class fun but should try harder and more often. exams are easy, and especially for the final, your TA will pretty much give you the answers beforehand. dont have to buy the book if you go to lecture.",
        "course": "THEAT100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dominant for theater, take her over schlueter, lectures are fun and interesting, a bit crazy but cool, tests are mostly note based with a question or two from the text, too much work&#63; no way, project requires a lil' time but nothing terrible, Recit. is usless but fun, 5 &quot;pop&quot; quizzes that are laughable, best GEC ever with the best lecturer ever!",
        "course": "THE100"
      },
      {
        "index": 23,
        "rating": 3,
        "difficulty": 1,
        "comment": "She crazy, but in a good way.  The class is boring, but easy.  You don't need to bother purchasing the book...provided you go to class and take the notes.  Exams are multiple choice, not cumulative and very easy.",
        "course": "THET100"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very good lecturer, explains stuff pretty well. Is entertaining at times(first half of quarter), but after the midterm, the subject material becomes very dull and her lecture becomes dull as well. All you do is watch movies the second half of the quarter. Her exams are very straight forward(strictly based off lecture notes) They will tell you that you must read the book for the midterm, but its not true. Good GEC to take, I highly recommend this teacher if you take this course.",
        "course": "THEATER100"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is an awesome teacher and a great lady...this class is a lot of work for a GEC though.",
        "course": "THEATRE100"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "such a great lady -- she's entertaining and she really tries to make the huge class personal; she's very interested in meeting students and having them do well.",
        "course": "100"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nice lady, and she makes the class interesting. For upper class students just wanting to just finish a GEC, this may not be the class for you because of the amount of work involved, but first or second year students will have fun. She likes to stick random factoids from the book on the exam, which is annoying, and means you should read the book.",
        "course": "THEATRE100"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "Absolutely wonderful Prof, couldn't ask for much more.  Go to Lecture and do extra credit, it is really easy and takes a load off for finals.  Highly recommended Prof!",
        "course": "THEATRE100"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 1,
        "comment": "GREAT CLASS!  Show up to lectures because you get quized every now and then, and you also should show up to recitation because there are participation points.  This is not a class for people who don't want to show up, BUT WHO WOULDN'T WANT TO&#63;  This class is awesome, easy, and Reilly is a trip!  You will always be entertained in this class!",
        "course": "THEATRE100"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is adorable!  Lectures were really fun, class was really easy.",
        "course": "THEATRE100"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Reilly Friggin Rocks!",
        "course": "INTROTOTHEATR"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was probably one of the most amusing professors I had Autumn 04. Very nice, and she had interesting stories, and kept people on their toes during lecture. It's best if you get involved in the class, and actually take notes.",
        "course": "THEATRE100"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a little nuts, which is what you want in a Theatre professor. She's had a pretty interesting life, and she throws little stories into lecture all the time. She'll let you know at the start of class if there's a pop quiz at the end, so you know to pay attention a little better. The workbook makes the notes super easy to take and understand.",
        "course": "100"
      },
      {
        "index": 34,
        "rating": 4,
        "difficulty": 3,
        "comment": "A lot of useless information in the lectures unless you actually want to know the history of theatre.  Creative project was fun!  Must attend lectures and take notes for the exams.  Exams are 40 multiple choice questions and come right from your notes most of the time.  Put in a little work and you can get an A.",
        "course": "THEATRE100"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy class, try to take whitlock instead because reiley is alittle boring, speaks english, good GPA booster.  Quizes during lecture, make sure to go to lectures on days you have quizes.",
        "course": "100"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is very nice and funny.  She likes to tell stories.  Lectures go by pretty quickly.  Can be boring at times but it isn't bad.  This class is very easy.  I recommend this professor.",
        "course": "THEATRE100"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 2,
        "comment": "i loved her lectures, she was always really funny and interesting to listen to, you never knew what crazy thing she might do next, as long as you went to lecture and remembered names of people the tests werent that hard",
        "course": "THEATRE100"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great prof! Good teaching style, always interesting, keeps students attention, and makes the class go by quick. Enojoyed her sometime dramatic lectures that show her acting skills. TA's were also good!",
        "course": "THEATRE100"
      },
      {
        "index": 39,
        "rating": 2,
        "difficulty": 3,
        "comment": "Way too much work for a GEC",
        "course": "THEATRE100"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 4,
        "comment": "Thought she was a good prof., very nice lady, and the quizzes are very easy. But the midterm/finals were extremely tough, and if u have a @#$%#*& terrible TA who grades the group project insanely tough, then u might be in trouble in what should be a joke class!",
        "course": "THEATRE100"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nice and fun lecture, the group project can be a pain but quizes are easy. I would recommend this to fulfill your Visual arts GEC...Definetly easier than art hist!",
        "course": "THEATRE100"
      },
      {
        "index": 42,
        "rating": 4,
        "difficulty": 2,
        "comment": "she is so fun and makes listening a little more fun. Really simple class.",
        "course": "THEATRE10"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really loved this lady. you could never really be sure what she was going to do next. And she kept the class interesting so it was not a hassle to go to class",
        "course": "THEATER"
      },
      {
        "index": 44,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's really nice and its a very interesting and fun class!",
        "course": "THEATER100"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 1,
        "comment": "if u want a GPA boost, this class is it, just dont skip lecture cause she gives a lot of answers on midterms in class..entertaing as well so i dont fall asleep",
        "course": "THEATER100"
      },
      {
        "index": 46,
        "rating": 3,
        "difficulty": 2,
        "comment": "I liked Prof. Reilly but it was sometimes hard to take notes on her lectures.  She doesn't go along with the workbook very well.  And get a good group for the creative project, it is a lot of points. I loved my recitation leader.",
        "course": "THEATRE100"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great professor.....funny, nice, and helpful, definantly get her lecture class",
        "course": "THTR100"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very enjoyable class and teacher.",
        "course": "THR100"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 1,
        "comment": "I loved her class! I am a science major, and it was nice to take such a fun and interesting class. She loves theatre and has an interesting way to teach things. There is a lot of variety in her lectures.",
        "course": "THEATRE100"
      },
      {
        "index": 50,
        "rating": 4,
        "difficulty": 1,
        "comment": "We learned about the **** Monologues too.",
        "course": "THEATRE100"
      },
      {
        "index": 51,
        "rating": 4,
        "difficulty": 1,
        "comment": "Fair prof, she enjoys what she does. Would definitely reccomend.",
        "course": "THEATRE100"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 3,
        "comment": "A pleasant woman who is deeply interested in what she is teaching.",
        "course": "THEATRE100"
      },
      {
        "index": 53,
        "rating": 1,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "COMM"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's wonderful!",
        "course": "THEATRE100"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 1,
        "comment": "I'm in Engineering and this had to be the best GEC I've taken at Ohio State.",
        "course": "THEATRE100"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's a fun teacher and it doesn't get boring",
        "course": "THEATRE100"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great instructor, I love this woman!!! Never had her at OSU, but she is a great lady.",
        "course": "ACTINGCAMP"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great theatre teacher!  Very knowledgable and helpful!",
        "course": "THR100"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "THEATRE10"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci04NTY1NTA=",
    "lastName": "Stoessner",
    "legacyId": 856550,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Loved this teacher. She's extremely dynamic and always made class very fun. Really enjoyed her personality!!",
        "course": "TA100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher.  Tests from powerpoint slides. Book is not really helpful.  Memorize EVERYTHING on slides for the exams...lots of info but none of it is hard...just facts to remember.  Online quizes are easy, just read book and check out sparknotes if confused.  No attendance but gives out 5 pop (EASY) quizes. So dont miss class too much.",
        "course": "THT100N"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lots of fun and helpful. Great teacher!",
        "course": "THEAT100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent TA, lots of fun.  Cares about her students.",
        "course": "THTR100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Excellent TA. Grades the papers, creative project, very easily. Always willing to answer questions. Will always give encouraging comments to her students. You can tell she really loves theater. Will give extra credit on top of the 9 points extra credit given in theater 100 class by the lecturer. If you take this class definitely take her as your TA",
        "course": "THEATER100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Nicholas",
    "id": "VGVhY2hlci01OTIwNDQ=",
    "lastName": "Dekker",
    "legacyId": 592044,
    "numRatings": 73,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr.Dekker is super funny and always makes lecture a good time.  Definitely not boring, I actually enjoyed going to lecture. Super easy GE, there's a fair amount of work, but it's easy material.  As long as you have a decent TA you'll be fine.",
        "course": "THEATER2100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dekker is a great professor he makes class fun. I really enjoyed this class. Super easy GE a little bit of work but if you put an effort into it you should get an A.",
        "course": "THEATRE2100"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "This guy was fantastic.  Really genuinely the nicest prof I've ever had at OSU.  Really helps you understand the material, though it isn't that hard.  He's a really really nice guy, I totally recommend taking this class.  Show up every day, and you'll get an A easy.",
        "course": "THEATRE2100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor, fun and easy going. Provides notes during lectures which the exams pull straight from. This is what all GECs should be like... he knows that most people in the class are not theatre majors. Easy A with minimal work ALTHOUGH, depending on TA, that might change. Assignments not hard, busy work. A lot of extra credit opportunities.",
        "course": "THEATRE2100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome class, it's very easy and a lot of fun. Definitely a must take class. Don't do it online unless you just don't have time because Dr. Dekker is a great professor and his lectures are a lot of fun.",
        "course": "THEATRE2100"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Dekker makes this class very easy!",
        "course": "THEATRE2100"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "super easy GE credit. You won't spend much time on this class at all, maybe 1.5 hr per week. Took it online. As long as you do the work, it isn't hard, you'll get an A. TAKE THIS CLASS",
        "course": "THEATRE2100"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Extremely easy GE course!!",
        "course": "THEATRE2100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy A. The exams are cake but you have to go to 3 plays and write papers. Also some reading. There is a decent amount of work but if you do it all and do well on the exams it's an easy A! Dekker is the man TAKE THIS CLASS!",
        "course": "THEATRE2100"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took this class online and it was and easy class. Weekly assignments, quizzes and online discussions. Had to watch 3 productions and write a response which were graded on the easy side. Had one final project which was also easy to do. Take this class for your GEC!!",
        "course": "THEATRE2100"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Easy class. All exams are multiple choice and based on lectures, unless the textbook is mandatory still..then read. He is a funny guy and great prof.",
        "course": "THTRE2100"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher. The kinda dude you want to go to a bar with. Interesting/ funny teacher. He's great.",
        "course": "THEAT2100"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "This guy actually made going to class fun! Overall, he was a good professor considering this was a GEC and I had no interested in theater at all, the course was pretty good. If you're going to take theater, take Dekker!",
        "course": "THEAT2100"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "He's a great professor. Lectures were very interesting and since he has so much theatre experience, he told a lot of relevant stories. Just go to class, and scan over the online textbook for important terms.",
        "course": "THEAT2100"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "Dr. Dekker is a nice professor and seems to enjoy what he teaches. He likes to throw in funny videos during lecture, which keeps things interesting. Exams are easy and straightforward as long as you attend class.",
        "course": "THEAT2100"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Dekker is very knowledgable about what he is teaching. He is funny, and knows how to keep the classes attention. He brings in guest speakers and has TAs teach occasionally. Honestly, the best professor I had this semester.",
        "course": "THEAT2100"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dekker is a really cool guy. He is extremely knowledgeable in the world of theatre and truly cares about what he's talking about. He got frequently annoyed at the constant chatter in the 700 person lecture, but what do you expect? Recitation is a bit rough (lots of plays, lots of group work), but that all depends on the TA. Overall easy teacher.",
        "course": "THEAT2100"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Dekker is a really good guy, the class is easy and he is pretty nice. He keeps the class entertaining. multiple choice exams not much writing, take his class!",
        "course": "THEAT1100"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "terrible, class is so boring. He is one of those professors that actually expects you to talk in a class with 700 other students. Theatre sucks",
        "course": "THTRE1100"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dekker is a super nice guy and he is really funny. He loves his subject and explains things really well, and his lectures are fun. Sometimes he shows some cool videos. Midterm and final are ridiculously easy - 35 multiple choice questions straight from the notes. Easy quizzes and assignments, and one group project. Overall a great, easy class.",
        "course": "THEA100"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy course. Study and you'll do well. Everything is straight off the powerpoints. Take it if you want to fulfill a GEC easily.",
        "course": "THR100"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this online and it was extremely easy. The class consists of discussion questions, easy quizzes, small assignments over plays that you have to read, writing a response to two plays, and a creative project. The most time spent was reading the 5 (short) plays and watching the 2 plays outside of class. The work itself was easy enough.",
        "course": "THEA100D"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 1,
        "comment": "TAKE THIS CLASS ONLINE! Easiest class I have ever taken. I put in about 1 hour PER WEEK and only missed 2 points the whole quarter. Great GEC class to take and since it is 5 credit hours its also a good GPA booster!",
        "course": "THEAT100"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Go to class everyday, as there are in class quizzes and you'll want to take notes there too. His exams are straight from his notes word for word. If you do the work, his class is an easy A. Make sure you don't slack though, because he doesnt curve. Overall, great professor!",
        "course": "THE100"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Dekker is funny and keeps our 550 student lecture class entertained and listening. He jokes around and really explains everything so we understand it. The only books are 4 small cheap playbooks that you read and get quizzed on in recitation. I would definately reccomend this class for a GEC over any other ones!",
        "course": "THEA100"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easiest class ever. He is very enthusiastic about what he is teaching. Really nice guy. As long as you take notes and read plays your good! Pop lecture quizzes are open notes over the notes you take during that lecture. Play quizzes are really easy and most of them are on youtube. Perfect way to satisfy your social diversity and fine arts credit.",
        "course": "THEAT100"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor, one of the best I've had.",
        "course": "THEAT100"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "&quot;Good morning, DR.Dekker!&quot; He is a fun guy. I like to take his class!!! And also, its very easy if u take every notes.",
        "course": "THEAT100"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 1,
        "comment": "His lectures were clear and interesting.  Easy class, just do the homework.",
        "course": "THTR101"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 1,
        "comment": "This teacher is awesome and its the easiest class I've taken thus far.  Going to lecture is recommended as there are in-class quizzes which are open note.  For exams, just read over your notes the night before and you'll ace it.",
        "course": "THTR100"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 1,
        "comment": "well-prepared lecturer",
        "course": "THEAT100"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr Dekker has put together a wonderful online course.  Expect about 3-4 hours of work a week, depending on your reading ability.  I enjoyed the course so much, I wish I had taken it in person!",
        "course": "THTR100D"
      },
      {
        "index": 33,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took this class online. If you get Charmel Joiner as a  TA be prepared for a quarter of frustration. She doesn't return e-mail and takes forever to grade. This class is an easy A otherwise.",
        "course": "THTR100"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dekker is in charge of the online version of Theatre 100. The class requires 2-3 hours of fairly simple work each week. Reading comprehension doesn't need to go past SparkNotes' level so if you're in a pinch, check out the sparknotes instead of reading. Overall, hard to NOT get an A if you're a decent student and keep up with the work.",
        "course": "THEAT100D"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 1,
        "comment": "Initally I didn't think I would enjoy this class but I actually did and highly recommend it. Dr. Dekker is  awesome and he's a fair grader.",
        "course": "THEAT100"
      },
      {
        "index": 36,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome GEC to take online. The work is outlined for you and it is easy. The work is not even that hard. It took me 3 hrs to do the posts and weekly asignment, aka the weekly work. Take it! He's cool as well.",
        "course": "THEAT100"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 1,
        "comment": "dr. dekker kept it real - such an easy class which i loved because with the less pressure situation, i actually learned something other than cram and forget. five quizzes are given in lectures, so you pretty much have to go to lecture.. but thats really not a problem because lecture is fun anyways! :) great prof, great class!",
        "course": "THEAT100"
      },
      {
        "index": 38,
        "rating": 5,
        "difficulty": 1,
        "comment": "Took it online, but could still tell how good of a teacher Dekker is. He's really interested in the material, and by the end of the class, I was enjoying myself quite a bit.",
        "course": "THEAT100D"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 1,
        "comment": "this class was very easy, he was funny to listen to and he is great at teaching the material. he makes the class enjoyable, attendance wasnt required, but he did lecture quizzes so you kinda need to go",
        "course": "THRE100"
      },
      {
        "index": 40,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very nice guy, probably my favorite teacher at OSU so far. Makes lectures fun, he actually enjoys teaching. Has lots of entertaining videos. Class is very easy, quizzes were open notes. I didn't really like theatre but this class was fun.",
        "course": "THEAT100"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class online and I'm pretty sure there was a lot more work that was required out of the students than there would be if I took the class in an actual classroom. Even though there is a lot of work, it is pretty easy and can be done in few hours. I just took it for the easy A since it did fulfill a GEC requirement of mine.",
        "course": "THTRE100"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. D!Amazing professor! Fun, easy and makes the subject veryyy interesting! Two thumbs up!! Highly recommended! =)",
        "course": "THTR100"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great teacher; makes things very understandable and FUN",
        "course": "THEAT100"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy and somewhat enjoyable class.  What does suck is that you basically have to attend.  Recitation is mandatory (and participation - yuck!).  Also have to go to lecture because of pop quizes, AND he doesn't put the notes online.  In other words, you are forced to waste your time going to class.  Attendance grades FTL.",
        "course": "THR101"
      },
      {
        "index": 45,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very manageable honors class. A lot of reading. He's very interested in the subject. I would recommend taking him for honors.",
        "course": "THEAH100"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's great. His lectures are pretty interesting because they're rather simple and he's got a lot of good stories he throws in. Ask him about the West Side Story performance his friend was in! Overall a very easy, enjoyable GEC.",
        "course": "THTR100"
      },
      {
        "index": 47,
        "rating": 4,
        "difficulty": 1,
        "comment": "i took the online version... it was great! i enjoyed the flexibility of the class. i learned so much without all of the time being put into. he responded to emails quickly, which is helpful considering its online class. take this class you won't regret it :)",
        "course": "THEAT100"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor and fun guy. Don't need the textbook. I took the LR class two days a week and it seemed much better than the 4 day course. Need to go to class to take easy lecture quiz and get participation points.",
        "course": "THEAT100"
      },
      {
        "index": 49,
        "rating": 5,
        "difficulty": 1,
        "comment": "Straightforward, easy, pretty funny too",
        "course": "THEA100"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good teacher. just by the plays and not the textbook, you don't need it. Easy note quizzes, but you have to show up to class to take them",
        "course": "THEAT100"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome professor.  So cool and original-  I wish all professors were like him.",
        "course": "THEAT100"
      },
      {
        "index": 52,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easiest class I have taken at OSU.  Skipped class all of the time and bought the notes from Buckeye Class Notes and made an A.  Recommend taking this class to boost GPA",
        "course": "THEA100"
      },
      {
        "index": 53,
        "rating": 5,
        "difficulty": 1,
        "comment": "Funny guy, easy class to fulfill a GEC add this class to have a easier quarter or to take more credits little work required rewarding experience",
        "course": "THEAT100"
      },
      {
        "index": 54,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was one of the best teachers I've ever had. He was really funny and his lectures were extremely interesting. I loved this class and it was really easy.",
        "course": "THEAT100"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 1,
        "comment": "VERY funny teacher. I recommended him to all of my friends. Easy A for the class. All you have to do is read the plays or look on sparknotes for help for the quizzes. All lecture quizzes are open note. :) Very fun class :D",
        "course": "THEAT100"
      },
      {
        "index": 56,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Dekker is HILARIOUS! He is a great teacher, and does anything he can to get people to understand. He also gives pop quizzes, but his lectures are fun so its not too bad to go to them. I recommend him to everyone!",
        "course": "THEAT100"
      },
      {
        "index": 57,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is probably the easiest class at the entire university. I took it to fufill a GEC requirement, but definately take it if u need a boost for your GPA. Dekker is an awesome teacher, no book needed, just go to class and take the notes and it's a breeze. The project can be a little time consuming so don't put it off",
        "course": "THEAT100"
      },
      {
        "index": 58,
        "rating": 5,
        "difficulty": 1,
        "comment": "easiest class ever. go the lecture because there are pop quizzes.",
        "course": "THEAT101"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 3,
        "comment": "An absolutely brilliant prof. Super cute and very intelligent. He makes the class fun and keeps the topic interesting. I love how he incorporates his nuggets of knowledge about dark beer. I wish he taught more classes.",
        "course": "THEAT100"
      },
      {
        "index": 60,
        "rating": 4,
        "difficulty": 1,
        "comment": "definitely take the online class...easyyyyyyy as can be!",
        "course": "THEAT100"
      },
      {
        "index": 61,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class as a GEC and enjoyed it. He tries to keep you involved - it's a huge lecture so you don't HAVE to go... but there are pop quizzes, so I reccomend going. Sweet guy!",
        "course": "THEAT100"
      },
      {
        "index": 62,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy! Go to class- pop quizzes.",
        "course": "THEAT100"
      },
      {
        "index": 63,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Dekker is enthusiastic, but I prefered his substitute. He only lectures and leaves the teaching to the GA's in recitation. Exams are off the notes, so go to class, because there are no study guides. Hope for an easy GA, because they make or break your grade. Easy GEC, easy pass.",
        "course": "THE101"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 1,
        "comment": "Take this class! Deckker is entertaining and makes lectures easy to sit through. Has a great personality.  IF YOU GO TO CLASS AND TAKE THE NOTES YOU'LL GET AN A. Tests are based off of lectures. Easy GEC. TAKE IT!",
        "course": "THE100"
      },
      {
        "index": 65,
        "rating": 5,
        "difficulty": 1,
        "comment": "I was afraid to take this class, but it was so easy and enjoyable. If you attend class you will receive all of the points you need to get an A in the class for a level 100 course.",
        "course": "THEA100"
      },
      {
        "index": 66,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Dekker was extremely nice and enthusiastic. Although he covers an enormous amount of material, all of the information is very clear. Attendance isn't mandatory but w/out the notes you'll fail the class.",
        "course": "THEAT100"
      },
      {
        "index": 67,
        "rating": 4,
        "difficulty": 1,
        "comment": "vey helpful and fuuny in class",
        "course": "THEAT100"
      },
      {
        "index": 68,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very hard class made very easy. Love to talk movies so its a good way to get him off topic ;) Pretty easy grader but it doesn't mean you can blow off. Put some effort into it.",
        "course": "THEATRE210"
      },
      {
        "index": 69,
        "rating": 5,
        "difficulty": 1,
        "comment": "He made class so much fun. He was so enthusastic and just basically awesome. It was probably my favorite class at OSU so far. He's a great guy and if you take this class, you should def. try to get him as your TA.  Plus, he gives out candy on the last day of class. That's how cool he is.",
        "course": "THEATRE36701"
      },
      {
        "index": 70,
        "rating": 5,
        "difficulty": 1,
        "comment": "Freakin' Great, Man! Way to be AWESOME!!!!",
        "course": "THE100"
      },
      {
        "index": 71,
        "rating": 5,
        "difficulty": 1,
        "comment": "Nick is the best teacher I've ever had at OSU.  He makes coming to lecture worthwhile and fun!  I wasn't interested in theatre before this class, now I actually am.  He's so enthusiastic and hilarious that it makes class fly by.",
        "course": "THEATRE100N"
      },
      {
        "index": 72,
        "rating": 5,
        "difficulty": 1,
        "comment": "Looking past the corny jokes and his psychotic  obsessesion with Star Wars, Nick is so cool!  He, makes class interesting and you can really tell he loves theatre which makes it that much more fun to learn.  I would recommend going to lecture simply to be entertained.",
        "course": "THEATRE100"
      },
      {
        "index": 73,
        "rating": 5,
        "difficulty": 2,
        "comment": "Nick Rocks.   Even though he is a nerd (and he admits it), he is the coolest nerd ever.   Oh yeah, he is very helpful and makes class interesting with stories and such.",
        "course": "THEATER100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.3,
    "department": "Theater",
    "firstName": "Anthony",
    "id": "VGVhY2hlci01MTU3NQ==",
    "lastName": "Hill",
    "legacyId": 51575,
    "numRatings": 15,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very good professor.Has excellent knowledge of reading material. Love his humor!",
        "course": "THEA367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "Good teacher- very helpful.class material is current.",
        "course": "THEAT367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took this class because I heard that Dr Hill is highly regarded as one of the best in this field-it was an excellent class!He is very knowledgeable and was extremely helpful.He always took the time to assist-a good teacher in this field. As most professors who've published, he does use one of his books as a text.(Not uncommon) Great Plays!",
        "course": "THEAT367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very helpful and also learned a lot in Dr Hill's class. He is one of the best in a Theatre Dept that typically has boring teachers.",
        "course": "THEAT367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing professor, I've known him a long time. Great knowledge of the subject matter, easy A if you come to class and do some of the readings (which are usually pretty interesting).",
        "course": "THEA23"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not sure if the prof was great OR that the class was super easy.  Papers were more about content than writing ability.  Very easy to get an A:  attend class, do the assignments, MAYBE study for the midterm.  Was allowed to work together with classmates on the final.  One 6 page research paper, weekly SHORT writing assignments.",
        "course": "THEAT367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 5,
        "comment": "excellent prof -and good material used.",
        "course": "AABBAB"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "very good defin knows his subj /field-  liked the plays we discussed. good class.",
        "course": "THEAT367"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 1,
        "comment": "Easy A if you put a LOT of work into it. Attendance is worth a lot of points and there is busy work due almost daily. He is very disorganized and had to change the syllabus several times.",
        "course": "THEATRE36702"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 4,
        "comment": "good prof- knows his stuff. lectures r good.",
        "course": "36702"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "THEATRE36702"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 1,
        "comment": "boring lectures but the ta's go over everything that is on the test... i recommend taking this class for your 2nd writing course",
        "course": "THR36701"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "THR36701"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "Fairly easy class, very redundant lectures though.....takes attendance and you lose lots of points if you dont go....",
        "course": "36702"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great lecturer, very interesting class",
        "course": "THEATRE36"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Moopi",
    "id": "VGVhY2hlci0xNjY1ODc2",
    "lastName": "Mothibeli",
    "legacyId": 1665876,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "The most enjoyable class that I've had at OSU. He was a really nice guy who really loves his craft and helps you understand it well. Amazing Instructor!!",
        "course": "THE208"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.6,
    "department": "Theater",
    "firstName": "Kal",
    "id": "VGVhY2hlci0xMTk3NDAw",
    "lastName": "Poole",
    "legacyId": 1197400,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is an awesome professor. His class is actually fun. Strongly recommend.",
        "course": "THEA280"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Kal is a really good professor and a sweetheart.  He took an actual investment in every student and was always fully into the discussion at hand.  While some exercises seemed a bit tedious at times, Kal always managed to make them fun and give them a definitive purpose.",
        "course": "THEAT310"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Kal is a great teacher - fun class",
        "course": "THEA280"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "THEA280"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Love Kal!! Very understanding and easy. Organized and fun.",
        "course": "THE694"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 3.3,
    "department": "Theater",
    "firstName": "Alan",
    "id": "VGVhY2hlci05NDUyOTM=",
    "lastName": "Woods",
    "legacyId": 945293,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "I think this was his last quarter teaching, so this rating is probably irrelevant. Anyway, interesting class, very easy. Lectures were kind of boring and pointless but attendance was taken and part of the grade. TAs did most of the teaching and handled grades. ..Still waiting on the grades, actually.. Overall, great, funny guy. He'll be missed!",
        "course": "THEAT597"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 1,
        "comment": "He was never on point, but his class was certainly interesting.  His TA's did most of the teachiing, but the work was miniscule and easy. None the less he did open my mind to all things controversial and to why censorship is so hard to box into the should~ should not category. I enjoyed his class.",
        "course": "THEA597"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "Simply put: the worst class/professor I've had at Ohio State. Most of the lectures were irrelevant to the topic, never stayed on the syllabus, showed us things in class simply to shock us/because he could. There is no way I could ever recommend him to anyone for anything.",
        "course": "THEAT597"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 2,
        "comment": "He was difficult to hear and talked about random topics that were not on the syllabus. No notes or real lecture, you just sit there and listen. The class was unorganized.",
        "course": "THE597"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor, take him for any class he teaches, I also took him for 367.01 it was great as well. Great professor all around",
        "course": "THEAT597"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "nicest guy, easy class, very fun and open minded",
        "course": "THEAT597"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Robin",
    "id": "VGVhY2hlci04MTc4NTc=",
    "lastName": "Post",
    "legacyId": 817857,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Robin will definitely challenge you, but the experience is SO rewarding!  InterACT is amazing, and I've learned more from her than any of my other professors so far.",
        "course": "THE684"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Inter*ACT is an amazing experience.  It's a new course that just began fall 2006 and I couldn't imagine having anyone else teach the class, besides Robin.  She is extremely helpful, understanding, and always available to her students. She rocks. Honestly.",
        "course": "THE694"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 5,
        "comment": "She is a great teacher. I hope she conitnues to teach in the area.",
        "course": "VOICE"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.8,
    "department": "Theater",
    "firstName": "Beth",
    "id": "VGVhY2hlci04NDQzMTE=",
    "lastName": "Kattleman",
    "legacyId": 844311,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interested in what she's teaching, which comes through in the readings and video clips she shows us. Genuinely interested in listening to her students thoughts. Overall very entertaining and compelling class. She really knows her stuff and is particularly articulate.",
        "course": "FRESH137"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "pretty easy class, if you are interested in theater. honestly though, this class kind of made me HATE theater. You have to go and see plays ($10 tickets) and then write papers/take tests on them. the exams are over lecture notes only.. and there are lecture pop quizzes that can make or break your grade. but 9pt extra credit for seeing 3 extra plays",
        "course": "100"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "The lectures are boring. All you do is write notes (which you will use to study for the midterm and final). There are surprise pop quizzes which are there just for the sake of making people attend...you can have turns to go to class with your friends and each person can turn in quizzes for their friends. Grades depend on the TA and not the lecturer",
        "course": "THEATER100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.2,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Scott",
    "id": "VGVhY2hlci0xMDAwMTM3",
    "lastName": "Wilson",
    "legacyId": 1000137,
    "numRatings": 5,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Scott made comedy really fun to write and perform. I felt like he wanted us to be creative AND learn at the same time. Plus, he looks like Seth Rogen.",
        "course": "THEAT694"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Scott was fun, energetic, and fully immersed in the material without taking it, the class, or himself too seriously.  Always able to punch up a topic with his quick wit and lighthearted mentality, he made the class enjoyable while keeping it educationally valuable.  I would DEFINITELY recommend him to other students.",
        "course": "THEAT384"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Super fun and good at what he does. Always there to help!",
        "course": "THE384"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Theatre 100 is the easiest classes possible if you have a good TA.  Scott is one of them.  Don't buy the text or the workbook, just go to class. He's really nice and he is one of the cool grad students who will get to know you.  Easygoing. Does his besto give you an A.",
        "course": "THEAT100"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Another grad student, Scott is a great teacher and always willing to help out whether or not you're still in one of his classes. He's also very amusing and usually in 2 or 3 plays a year.",
        "course": "TH280"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.1,
    "department": "Theater",
    "firstName": "Christina",
    "id": "VGVhY2hlci0xMDAwMTM0",
    "lastName": "Ritter",
    "legacyId": 1000134,
    "numRatings": 8,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took her for my 367 class. Class was interesting, we read good plays and watched a lot of movies. The project was easy, the midterm had like 15 multiple choice questions. I forgot a paper once and she let me drop it off later. Take her if you can.",
        "course": "TH367"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "The workload was really light for a writing class. The material was interesting and we spent a lot of class time watching movies/plays. I only wish I had borrowed all the books instead of buying them because the test material came from notes/lectures.",
        "course": "THEAT367"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class is somewhat easy. The class should be out of more points. The class can be sort of boring because she kinda lacks a personality. Read the plays and you'll be fine.",
        "course": "THEAT367"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Super easy class, the only bad side is that the whole class is only out of 100 points, so each little bit counts. Basically just read plays and do short little activities. You have to write one paper but the topic is broad and you can make it about movies or TV. Have to do a short presentation at the the end of the quarter.",
        "course": "THTR367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "fairly easy class, great for 2nd writing requirement if you're interested in plays and theatre. I just wish she could have facilitated discussion better. Lack therof made class kinda dull.",
        "course": "THEAT367"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "Stick figure with her own performances to worry about outside of class. Easy class, felt like I paid for nothing. No challenge. She didn't even complete the writing assignments or quizzes for the quarter had to give us the points at the end for free. Worthless professor, didn't teach anything, especially writing. Read plays, watched film clips.",
        "course": "THEAT367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "Christina is a wonderful teacher.  Very knowledgeable on the topic of the American Stage.  I would most certainly take another class taught by her.  I think she is certainly coming into her own as a Professor, and will only get better.",
        "course": "THAR367"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "Just getting her PhD, and will be teaching at OSU as a professor in the fall. She taught 210, script analysis, and it took the first project and talking with her to determine her expectations, but after that, the class is relatively straightforward, if not a bit too fast.",
        "course": "TH210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Theater",
    "firstName": "Christopher",
    "id": "VGVhY2hlci01Nzk5NjE=",
    "lastName": "Roche",
    "legacyId": 579961,
    "numRatings": 10,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Amazing class taught by an amazing teacher. Chris is so helpful, and really makes you think about why things are the way they are. He is also very down to earth and you feel like youre going to class to just hang out. The first half of the class relies heavily on the book... so read it! And work hard on your final, all he wants is good effort.",
        "course": "THEAT534"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Amazing. Take any class he teaches!!!!",
        "course": "THEA534"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Awesome guy, best class at OSU. He is fun, clear, but makes you get to work and helps you produce some of the best things ever. Great guy. Nothing but praise for him.",
        "course": "THEATER100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chris Roche is pretty much my hero! take this class! It makes me all warm and fuzzy inside",
        "course": "280"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "An amazing person all around! He is the most genunie adorable fantastic graduate teacher on this planet! Take a class with him before he graduates!",
        "course": "THEATRE280"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Roche friggin rules, and will make the hottest Frank-n-furter ever!",
        "course": "INTROTOACTING"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "O MY GOD HE IS SOOO COOL!  he was the best theater teacher i have had in my entire life.  he's down to earth, honest, and encouraging...so much so i still have the notes he gave me for the final monologue.  i love him to death!",
        "course": "THEATER280"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "I LOVED THIS MAN! I wish he taught my entire undergraduate career.",
        "course": "THEATRE280"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chris is awesome.  He really helps you and is very nice.  I would definitely recommend taking a class from him.",
        "course": "THEATRE280"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Chris is very funny.  You usually get out of class early which is awesome.  He is always willing to help.  It is easy to stay awake in his class, you will want to go.",
        "course": "THEATRE100"
      }
    ],
    "SEI": []
  }
]