[
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Theology",
    "firstName": "Hugh",
    "id": "VGVhY2hlci0yNDA4NTg=",
    "lastName": "Urban",
    "legacyId": 240858,
    "numRatings": 48,
    "summary_comment": "Professor Urban is highly regarded for his passion and engagement in teaching, making his class both interesting and accessible. He prioritizes student interaction, often checking in with students personally and ensuring attendance is mandatory to fully benefit from the discussions and content. Assessments are minimal, consisting mainly of a few papers and a final exam, though attendance plays a significant role in the overall grade.",
    "summary_comment_short": "Professor Urban is highly regarded for his passion and knowledge in the classroom, making his lectures engaging and discussion-oriented. He places a strong emphasis on attendance, which is mandatory and contributes significantly to the grade, and assigns a few key papers and a final exam essay, with minimal other homework.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "This was my favorite class, and Dr. Urban was so great. He really cares about what he's teaching and he knew everyone's names. Attendance is mandatory but there's only 2 papers and 2 tests.",
        "course": "RELSTDS2370"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Professor Urban is a phenomenal teacher and person. Every day he makes a point to approach each student and check in with them. It's amazing how humble he is despite being possibly the most well spoken person I have ever met. Discussion-oriented lectures (attendance mandatory), minimal assignments, open-ended group project for a final. ",
        "course": "RS3666"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Fantastic, one of the best classes I've taken & one of my favorite professors. He clearly cares about his students and wants them engaged with the content and takes the time before class just to talk to you about how your day has gone. There's not a lot of opportunities for points, but they're easy to get, so just be careful for the four papers!",
        "course": "RS3666"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Urban is a phenomenal teacher. The class is very interesting and students learn valuable information about how to understand various religions and religion as a whole. He is beyond knowledgeable of the topic and presents it in a very fair and unbiased way. I wish every student in the world could take this class. The field trips were very cool!",
        "course": "RELSTDS2370"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's a very nice guy, he makes an effort to know your name and asks how your day was before class if he has time. Class is very easy but is interesting. Very few assignments - occasional essay, one midterm (easy if you study), and then there is a final exam essay. Lecture attendance is mandatory as it is part of the grade. Easy GE.",
        "course": "RELSTDS2370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is very passionate about what he teaches. There is a lot of in-class discussion and he asks fascinating questions. If you attend class and pay attention then you will likely do very well in this class (RELSTDS S2370).",
        "course": "RELSTDS2370"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Urban is the coolest man ever. He is so down to earth and everyday would go around and ask us students who our weekend was and how our day is going. 3 papers, worth 45% of your grade but are super easy. Group project as final but can be whatever you want it to be about. There are a crap ton of readings but I didn't read a single thing and got an A",
        "course": "RS3666"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had professor Urban for Religious Studies 2370. The lectures were honestly pretty interesting and I didn't find the class to be super difficult. Attendance is worth a decent chunk of the grade and it's hard to know what to write papers on if you don't show up but overall I would recommend taking the class. ",
        "course": "RELSTDS2370"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cool guy",
        "course": "RELSTDS2370"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Hugh was a really great professor. He cares about his students and tries to make conversation with everyone before class starts. His powerpoints cover everything that's on the exam. So you don't have to buy or study the textbook. You have to go on 2 field trips outside of campus and write observation papers about what you saw and experienced.",
        "course": "RELSTDS2370"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 2,
        "comment": "I've taken several courses with Prof Urban and I have enjoyed all of them. He truly cares about his students. However, material from course to course was the same in some places so it was repetitive for me. I still enjoyed it though. Loves final group projects so pick who you will work with early on. Really great dude!",
        "course": "RS4873"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "My man Hugh. . .What can I say? This dude really knows his stuff and I honestly left the semester feeling confident that I actually learned something! Enjoyed/learned so much, I am taking another one of his classes! HIGHLY RECOMMENDED!!!",
        "course": "COMPSTD2102"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very nice, and cares about student opinion. He is very well spoken, and does his best to explain all questions, would take again.",
        "course": "RELSTDS4578"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "You need to go to lecture to be able to pass the class. He is very lecture heavy, but they are really interesting classes so it's actually fun to go to. He loves to debate, and loves to listen to everyone's opinion. Not very many grades in the class except you have to write a discussion post once a week. Really great professor, I loved his class.",
        "course": "RELSTDS2370"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 1,
        "comment": "Showing up to class is automatically 30% of your grade. He is a great professor, his class is interesting and well taught, and the material is fairly easy.",
        "course": "COMPSTD210202"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Honestly, this guy is the best. I'm amazed at his ability to keep a lecture on religion discussion-based, level headed, and conducive to learning. ",
        "course": "COMPSTD2102"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof. Urban deals very well with the touchy subject of religion, and keeps his own opinions to himself pretty well. He really lets the students discuss the issues than touting his own opinion and he does very well at moderating the discussion, too. Attend lecture & recitation and take notes, and you shouldn't have problems with papers and tests.",
        "course": "COMPSTD2102"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Definitely one of the rock star professors at OSU. His class will be interesting and worthwhile.",
        "course": "CS525"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "Greatest professor in Comp Studies! If you have a chance, take a class he is teaching. Any class. Do the work and you will be fine.",
        "course": "CS525"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 1,
        "comment": "Class is very easy, he explains things very clearly the tests are easy.  You have to do two papers a quarter but their only three pages",
        "course": "COMSD270"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Urban has a way of making what could be a very controversial subject fair and balanced.  He is fantastic at seeing all points of view and encourages discussion.  You would never know that he disagreed with your point of view.  He gets the modern student. He does not make you read his own work, but you should anyway.",
        "course": "COMP270"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "I absolutely LOVED this class and Dr. Urban. The content of the class was extremely interesting and the professor was awesome. By far, one of the best classes I've taken thus far. I definitely recommend this class and professor.",
        "course": "CS270"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a great professor! Comp Studies 270 was one of the best classes I've ever taken at Ohio State. If you're looking for an A and an interesting class all in one, this is the class for you. He is very clear with his teachings and is very passionate about it. I would recommend this class and Urban to anyone!",
        "course": "CS270"
      },
      {
        "index": 24,
        "rating": 5,
        "difficulty": 1,
        "comment": "Good teacher, very very very easy. If you're looking for a class you can blow off and not put any work into I suggest taking his classes. You will never have to prove that you did any of the readings. His class was fun but I didn't learn much because I wasn't forced to.",
        "course": "CS525"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 2,
        "comment": "Most amazing prof...ever",
        "course": "CSTD526"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 2,
        "comment": "He is a great professor . . . take as many classes as possible from him.",
        "course": "CS526"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 3,
        "comment": "The Hughru is a GREAT professor. He is very passionate about the subject matter and likes to have a good time while teaching. He uses a lot videos and class discussion to keep you interested. He is very skilled at rewording your answer to make you sound like a genius.",
        "course": "CS526"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher. The class itself was very interesting, and Urban made it even better. The questions he posed were always thought-provoking and I frequently discussed them with friends and family for days afterwards. If you put any effort into this class whatsoever you can expect and A- minimum.",
        "course": "CS270"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 2,
        "comment": "very good",
        "course": "CS270"
      },
      {
        "index": 30,
        "rating": 3,
        "difficulty": 2,
        "comment": "very knowledgeable",
        "course": "COMP270"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 2,
        "comment": "so wonderful, don't graduate without taking a class from him!",
        "course": "CS651"
      },
      {
        "index": 32,
        "rating": 5,
        "difficulty": 1,
        "comment": "AWESOME! I loved this class. EXTREMELY interesting and I learned a lot. Attendance is taken every class so GO and you should pull off an A no problem. Tons of extra credit opportunity. All together AMAZING class and prof!",
        "course": "COMP270"
      },
      {
        "index": 33,
        "rating": 5,
        "difficulty": 2,
        "comment": "He was a really good teacher with a real grasp of the information he was teaching.",
        "course": "COMP270"
      },
      {
        "index": 34,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hugh is fantastic. He helps in class; he helps outside class; he helps after you graduate. Forget that he is internationally recognized in his field, Dr Urban teaches each class like someone who still believes in teaching and someone who cares about small discussion and growth. Take whatever classes you can with this man!",
        "course": "COMST720"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "He's an awesome professor!! I loved this class!! If you still need to fill this GEC, TAKE THIS CLASS!!",
        "course": "CMPST270"
      },
      {
        "index": 36,
        "rating": 4,
        "difficulty": 1,
        "comment": "Great prof.  Makes religion interesting even if you don't believe in it.  Plenty of extra credit so there is no excuse for getting lower than an A if you try and do the extra credit.  Several field trips requried and 4 papers.  Easy and interesting GEC.  I would highly recommend for GPA booster if you're not afraid to do all the extra work.",
        "course": "CS270"
      },
      {
        "index": 37,
        "rating": 5,
        "difficulty": 1,
        "comment": "He was such a great professor and I would recommend him to everyone! He made class very interesting with videos and references to the simpsons.  Also you get to take field trips to different religious buildings.  Overall an awesome class.  Didn't really read the books and print outs much...just take notes and youll be fine!",
        "course": "CMPST270"
      },
      {
        "index": 38,
        "rating": 1,
        "difficulty": 1,
        "comment": "awful! useless!",
        "course": "CS270"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 2,
        "comment": "This was the best GEC that I took at OSU, mainly because of Dr. Urban. He was very clear about each subject, and very helpful with questions. His lectures are actually interesting to attend. Dr. Urban tells you exactly what you need to know for his tests. If you go to lecture, easy A.",
        "course": "COMPSTUD270"
      },
      {
        "index": 40,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very easy to follow along with and explains himself very well!!  Very easy class overall.",
        "course": "CS270"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Urban is the Man, he is very in touch with the modern student and makes even the most difficult subjects relateable.  i recomend very highly any course he offers.",
        "course": "RELIGIOUSSTS"
      },
      {
        "index": 42,
        "rating": 5,
        "difficulty": 1,
        "comment": "He's friggin awesome, he's also my advisor and he ROCKS!",
        "course": "CS270"
      },
      {
        "index": 43,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Urban is very good at what he does. You will learn quite a bit from him, and his classes are entertaining as well. I would highly recommend him.",
        "course": "RELIGIOUSST"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the best classes of my sophomore year...",
        "course": "COMPSTD270"
      },
      {
        "index": 45,
        "rating": 4,
        "difficulty": 1,
        "comment": "By far the best professor I've had so far.  He is really funny and is incredibly knowleadgable.  The midterm and final are a cinch...definitley recommended.",
        "course": "CS270"
      },
      {
        "index": 46,
        "rating": 5,
        "difficulty": 1,
        "comment": "My favorite teacher by far. So funny, very helpful, tests are easy but you learn a lot. He is such an interesting person with so much knowledge, and he really wants to help and encourage people to think for themselves.",
        "course": "COMPSTUD"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 1,
        "comment": "He is a really good teacher that doesn't expect too much.  Well worth taking any class with him.",
        "course": "RELSTUDY"
      },
      {
        "index": 48,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great sense of humor, encourages students to think for themselves.",
        "course": "H270"
      }
    ],
    "SEI": [
      {
        "Subject": "COMPSTD",
        "Catalog": "6300",
        "Class Name": "Critical Foundations: Cultural and Social Theory",
        "Class Number": "36532",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "13",
        "Rating": "4.77"
      },
      {
        "Subject": "INTSTDS",
        "Catalog": "4873",
        "Class Name": "Contemporary Religious Movements in Global Context",
        "Class Number": "37232",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "UG International Studies Prog",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.91"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "2370",
        "Class Name": "Introduction to Comparative Religion",
        "Class Number": "25548",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "53",
        "Rating": "4.85"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "3666",
        "Class Name": "Magic in the Modern World",
        "Class Number": "28474",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "25",
        "Rating": "4.8"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "4873",
        "Class Name": "Contemporary Religious Movements in Global Context",
        "Class Number": "33015",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "5"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "2370",
        "Class Name": "Introduction to Comparative Religion",
        "Class Number": "26697",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "33",
        "Rating": "4.91"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "3666",
        "Class Name": "Magic in the Modern World",
        "Class Number": "35477",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "30",
        "Rating": "4.83"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "3972",
        "Class Name": "Theory and Method in the Study of Religion",
        "Class Number": "18617",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "5"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "2370",
        "Class Name": "Introduction to Comparative Religion",
        "Class Number": "28914",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "51",
        "Rating": "4.94"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "4873",
        "Class Name": "Contemporary Religious Movements in Global Context",
        "Class Number": "37047",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.75"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "3666",
        "Class Name": "Magic in the Modern World",
        "Class Number": "30373",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.85"
      },
      {
        "Subject": "RELSTDS",
        "Catalog": "3972",
        "Class Name": "Theory and Method in the Study of Religion",
        "Class Number": "19028",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "5"
      }
    ]
  }
]