[
  {
    "avgDifficulty": 3.8,
    "avgRating": 2.6,
    "department": "Visual Communication Design",
    "firstName": "Keith",
    "id": "VGVhY2hlci0yMDQwNDU5",
    "lastName": "Novicki",
    "legacyId": 2040459,
    "numRatings": 5,
    "summary_comment": "Professor Novicki is known for a heavy workload and repetitive lectures that fail to provide practical skills, with many students finding the class a waste of time and money. Despite some positive comments highlighting his dedication and effectiveness as a teacher, many criticize his unprofessional behavior, excessive mandatory meetings, and lack of individual feedback.",
    "summary_comment_short": "Professor Novicki is known for his demanding and repetitive teaching style, with lectures often repeated throughout the term and little focus on practical typography skills. Many students find his class a waste of time and money, as employers express no interest in the projects produced.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Creeps on the women. bad grade if you don't show up for extra Zoom meets outside of class. Requires proof of absence (doctor's note or obituary like we're in grade school) \nSame lecture repeated throughout term, didn't learn actual typography practice, EMPLOYERS say they don't care to see projects from this class. waste of time and money.",
        "course": "DESIGN3503"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Wastes so much time in class. I think he just likes hearing himself talk. Repeated same lecture probably ten times instead of giving individual feedback, forcing people to stay after class. Critiques our work, then goes back on it after we make changes. Really creepy towards girls and lacks personal space / boundaries / general respect. ",
        "course": "DESIGN3503"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "Graded on one task all year. 5 minutes late equals a full absence. Heavy workload 10+ pages per class. Assignments given are abstract and experimental, benefiting our future careers in design in no way. Spends an hour or two talking about nonsense so, he demands after-class meetings, claiming they're optional, but they're crucial for a good grade.\n",
        "course": "DESIGN3503"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Keith tough me SO much through out this semester; from typography, to work ethics. At first I thought he was odd and didnt like him as a prof, but boy was I wrong. Hes literally like a sensei in a karate movie that the kid hates at first because of the harsh work the senseis making him do, but then realizes how lucky he is be under his wing.",
        "course": "DESIGN3503"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Keith is the best, most interesting, and most inspirational professor I have ever had. He Knows what he is doing. I trust his opinion and I have learned so much from him. I would not be the designer I am now without Keith. He knows how to critique in an extremely productive manner for the learner. His aesthetic for design is exceptional.",
        "course": "DESIGN3503"
      }
    ],
    "SEI": [
      {
        "Subject": "DESIGN",
        "Catalog": "3503",
        "Class Name": "Typographic Design",
        "Class Number": "14626",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Design",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "3"
      },
      {
        "Subject": "DESIGN",
        "Catalog": "3503",
        "Class Name": "Typographic Design",
        "Class Number": "12650",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Design",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.9"
      },
      {
        "Subject": "DESIGN",
        "Catalog": "3503",
        "Class Name": "Typographic Design",
        "Class Number": "16628",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Design",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "3.6"
      },
      {
        "Subject": "DESIGN",
        "Catalog": "3503",
        "Class Name": "Typographic Design",
        "Class Number": "19507",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Design",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "1.53"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 3.3,
    "department": "Visual Communication Design",
    "firstName": "Asheer",
    "id": "VGVhY2hlci0xMjI3MDcw",
    "lastName": "Tashfeen",
    "legacyId": 1227070,
    "numRatings": 4,
    "summary_comment": "Professor Tashfeen has mixed reviews; while some students find him helpful and enjoyable, others describe his teaching as unclear and unengaging, with poor communication. Many advise against taking his class due to its perceived low value and ineffective teaching methods.",
    "summary_comment_short": "Professor Tashfeen has mixed reviews; while some students found him very helpful and enjoyable, others describe his teaching as unclear and unengaging, with ineffective communication and assignments they found unsatisfactory. Overall, many would not recommend taking his class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best teacher ever!",
        "course": "DES230"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very helpful. I enjoyed this class a lot.",
        "course": "DES230"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 2,
        "comment": "Started off pretty easy but then became very unclear because he does not explain things well and don't bother emailing him because he either won't email you back or takes forever to do it. Does not seem like he wants to teach at all. He is a cool person but as a teacher, I would not recommend taking him.",
        "course": "DSIGN230"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Worst class/professor I've ever had.  Had us purchase a text book we never even opened.  Projects were the dumbest things I've ever been asked to do.  DO NOT take this class",
        "course": "DSGN230"
      }
    ],
    "SEI": []
  }
]