[
  {
    "avgDifficulty": 2,
    "avgRating": 3.3,
    "department": "Welding",
    "firstName": "David Harper",
    "id": "VGVhY2hlci0xNzAwNTAx",
    "lastName": "Philips",
    "legacyId": 1700501,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Good professor but extremely unaccommodating and inconsiderate. You could be laying the hospital with every bone in your body broken and he wont do so much as give you an extension. Aside from that though his courses are well put together and quite informative. He likes to throw pointless curveballs in questions to trip you up.",
        "course": "WELD4002"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Philips is a great professor! His exams are straight from the lecture material. You need to go to lecture because the lecture slides are not enough to understand the material. His exams are pretty easy though, if you actually understand the material. He loves what he does and teaches it well!",
        "course": "WELD300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Welding",
    "firstName": "David",
    "id": "VGVhY2hlci0yNjU0NDA2",
    "lastName": "Phillips",
    "legacyId": 2654406,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Phillips has easy open book quizzes and then written exams, which aren't too bad if you study. He also has a \"mulligan\" rule where he removes your lowest quiz score with your second lowest. I enjoyed his class.",
        "course": "WE4002"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Phillips is the best - he's my favorite professor! I've also had him for WELDENG 2001 and MATSCEN 3333. He's incredibly passionate about teaching and inspires future welding engineers. If you pay attention and put in the effort, getting a good grade is very doable. Plus, he's always available to explain things after class! ",
        "course": "10312"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 4.7,
    "department": "Welding",
    "firstName": "Avraham",
    "id": "VGVhY2hlci04MjA3Mzk=",
    "lastName": "Benatar",
    "legacyId": 820739,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Avi is definitely the best in the WE program. He recognizes students who put forth effort, and those who consistently skip class and don't bother with the homework.  He gives warning at beginning of the semester, class assignments will take at least 8-9 hours at least to complete and he's not joking.  Amazing class and even better professor. A+++++",
        "course": "4201"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Don't waste time going to class. He develops equations entire time. Just find the equations in the notes and use them. Tests are hard but fair. Quizzes are hard and totally based on the hw.",
        "course": "WE620"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Nice teaching and easy to understand. 5-6 hws, 3-5 online quizes and 2 midterm + 1 final. Avarage final grade was B. he gives E, if you deserve. not like many other WE faculty, he is the most fair grader. if you are looking for an easy A, this class is not for you. ANSYS and MathCad is required. You will do 1D-2D heat equations, some FEA and FEM.",
        "course": "WE620"
      }
    ],
    "SEI": []
  }
]