[
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Women's Gender  Sexuality Studies",
    "firstName": "Juno",
    "id": "VGVhY2hlci0yMjU0Mzkz",
    "lastName": "Parreñas",
    "legacyId": 2254393,
    "numRatings": 2,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Parre&ntilde;as really know how to pick material and create good class discussion. Dr. Parre&ntilde;as is a bit unorganized but has very clear expectations. She enjoys using group projects as part of the final project. Overall fun and good energy person.",
        "course": "WGSS3101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Juno is clearly very intelligent. However, she didn't put in any grades in Carmen for the entire semester, and it turns out that the take-home final was basically 100% of our grade, which freaked everyone out. I got an A, but Im hesitant to call it an easy A, because I'm a good writer and I don't know how others did. The class is super chill though",
        "course": "WGSST2296H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4,
    "department": "Women's Gender  Sexuality Studies",
    "firstName": "Tess",
    "id": "VGVhY2hlci0yMjUyMTYz",
    "lastName": "Cumpstone",
    "legacyId": 2252163,
    "numRatings": 3,
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Tess seems like a chill person but she is just straight up not a good professor. She is clearly into the course material but has absolutely no idea how to explain it. Her exam prompts are unclear and she grades irrationally hard. She also does not seem to realize that literally, every person is taking this class as a GE credit.",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Tess is amazing! She always made sure you were well-prepared and answered questions quickly and well thought out. If you can take her, you should. She is sweet and funny and isn't afraid to curse in front of her students. She gave us a feminist sex ed lesson and it was great. She really wants you to learn and be passionate about the content.",
        "course": "WGSS2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Tess is amazing; she's funny and super smart. It's clear she's passionate about what she's teaching and she knows a lot about it in lectures. Her lectures were also super creative to facilitate learning. She connects with her students on a personal level and really nice. The class requires a lot of reading and writing, so be prepared.",
        "course": "WGSS1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Women's Gender  Sexuality Studies",
    "firstName": "Tatiana",
    "id": "VGVhY2hlci0yMjQ2ODcx",
    "lastName": "Faria",
    "legacyId": 2246871,
    "numRatings": 1,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The teacher was very sweet and passionate. She clearly cares about her students. Easy A. Interesting discussions. Learned a lot",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  }
]