[
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Melissa",
    "lastName": "Wiser",
    "legacyId": 1140265,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 0,
        "rating": null,
        "comment": "She thinks that her class is the only thing going on in all of her students lives. The way that she interacts with people is rude and borderline insulting. If you don't show up to one of her classes expect an extremely rude and disgusted look. The classes are boring and there is no correlation to the course work with any of the lectures."
      },
      {
        "index": 1,
        "rating": "5.0",
        "comment": "Melissa Wiser was my favorite professor I've had at OSU. If you put in the effort to speak in class and go up to her after to ask for feedback, she will acknowledge your hard work. As long as you do your work and actually participate in class, you will do well in her classes!"
      },
      {
        "index": 2,
        "rating": null,
        "comment": "Strict, assigned seating, can't use word “interesting” in papers. Boring classes."
      },
      {
        "index": 3,
        "rating": null,
        "comment": "Terrible. Does not care about student and does not give anyone good grades. Get ready to read a crap ton and ONLY talk about what was in the readings for entire classes."
      },
      {
        "index": 4,
        "rating": null,
        "comment": "It is clear she cares about her students, however extremely dull and most irrelevant information for this major. She also is a slow grader that will leave you to guess what grade you have just days before finals and graduation."
      },
      {
        "index": 5,
        "rating": "5.0",
        "comment": "Dr. Wiser is a gem if you put in even an ounce of effort into her classes. As long as you respect the class and consult the readings beforehand, you will be perfectly fine. There are so many things that you can learn from this course (and Dr. Wiser) that are truly valuable beyond the classroom if you just take a moment to listen to her insight."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "The content is not relevant to the class. There are things such as which fork is needed in fine dining and the class is about internships in sports. Takes forever to grade even though its an asynchronous class with minimal work. The modules are all copy and pasted with old information. She gives no effort and her questions are poorly worded. AVOID"
      },
      {
        "index": 7,
        "rating": "4.0",
        "comment": "I'm not sure why everyone doesn't like Prof. Wiser. She was honestly great. Yes tough, but put in the work and show up to class and you'll be great. She expects hard work and likes class participation (she will probably like you more if you participate). I would like to have her again, and she told me at the end of the semester I did a great job!"
      },
      {
        "index": 8,
        "rating": null,
        "comment": "Dr. Wiser's online class was well organized, and I understood her grading criteria. The content was all relatable and useful for the class even though it sometimes felt tedious."
      },
      {
        "index": 9,
        "rating": null,
        "comment": "Don't take this class if you don't have to. Lectures are very vague and if you have questions, don't expect clear or any answers (especially to emails). The final is a ton of work and makes you want to rip out all your hair. She has the expectation that everyone wants to pursue research after graduating."
      },
      {
        "index": 10,
        "rating": null,
        "comment": "Participation and being in class is so important, especially since she is the only professor I know that makes you turn in hard copies and on carmen. She genuinely cares about teaching so I would say if you take any class take this. Good discussion, just keep up on the readings or at least skim them."
      },
      {
        "index": 11,
        "rating": null,
        "comment": "She is the worst professor Ive ever had. She expects way too much, and thinks her class is the most important. I learned nothing from the class, because I was so focused on turning in all the assignments. She is a very tough grader, and takes months to grade things. Would avoid at all costs."
      },
      {
        "index": 12,
        "rating": null,
        "comment": "Horrendously tough grader. I wish this class wasn't mandatory for my major or they'd get a new professor to teach it."
      },
      {
        "index": 13,
        "rating": "5.0",
        "comment": "I had Dr. Wiser for three classes during my undergrad and as much as they were a pain at times, I actually had to try. You can sleep walk through a lot of classes and still get a decent grade but not with her. Yes, she was tough and yes, she expects more out of you for an A in the class. Unless you're lazy, unmotivated or both, she is respectful."
      },
      {
        "index": 14,
        "rating": null,
        "comment": "How she is employed at a major university is mind blowing. The cashiers at McDonalds have better communication & people skills than her. Wouldn't doubt that they have a higher IQ than her too. Keep politics out of the classroom and stop crying that your candidate lost because you act like a kid crying at the grocery store for not getting candy"
      },
      {
        "index": 15,
        "rating": "5.0",
        "comment": "Dr. Wiser is a tough professor but if you try hard enough and actually have some care for what she's teaching then her classes are incredibly valuable and engaging. You don't have to buy -in to everything she says, but if you make the effort to engage and participate with the material regardless she will be more amenable."
      },
      {
        "index": 16,
        "rating": "5.0",
        "comment": "Dr. Wiser is above the rest, she is very passionate about the class and she throughly cares for the subject. Even though her classes aren't a walk in the park, if you participate and engage in lectures then you can be one of her favorite students. Take advantage of learning from her."
      },
      {
        "index": 17,
        "rating": null,
        "comment": "Her treatment of a class that is ludicrous and patronizing at its core is absolutely revolting. The class outlines how to act in the professional realm which in itself is a useless lesson as all students taking the class have successfully landed a job. She treats the class as if it is nuclear physics and grades way too tough. Avoid at all costs"
      },
      {
        "index": 18,
        "rating": null,
        "comment": "She is the worst. Seriously, the worst."
      },
      {
        "index": 19,
        "rating": null,
        "comment": "She is absolutely terrible. You can't ask her a question without her making you feel dumb. She doesn't explain much detail on her lectures and just overall is brutal. I wish I could have taken 20 classes this semester over her 1. She is not friendly and is rude. AVOID AT ALL COST, I repeat, AVOID AT ALL COST. This is here Sports Research class 4900"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "Women's Studies",
    "firstName": "Henryatta",
    "lastName": "Ballah",
    "legacyId": 767787,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 0,
        "rating": "4.0",
        "comment": "Professor Ballah was a great resource and she cares about all her students. There were a few short papers and a decent amount of reading in the class I took with her, but they were all manageable and clearly outlined in the syllabus before class began. I really enjoyed my time in this class and recommend it for history and non-history majors alike."
      },
      {
        "index": 1,
        "rating": "4.0",
        "comment": "HIST 175 @ W&L: Insane breath of content taught well. Readings aren't bad. There are \"pop-quizzes,\" but you can guess when they'll be. You do need to prepare; they aren't easy. Overall, she care more about understand the material than grades, so you'll get an a or a-. Prepare for three miserable papers. Speak up in class. Not life changing."
      },
      {
        "index": 2,
        "rating": "5.0",
        "comment": "HIST-175 @ W&L. Prof. Ballah is one of my favorite professors ever. Classes are discussion-based and questions are encouraged. She knows damn near anything you could ever ask her about Africa's History. You will succeed if you are intellectually curious and take good notes. Also my academic advisor, and she gives the best advice. A blessing."
      },
      {
        "index": 3,
        "rating": "5.0",
        "comment": "Professor Ballah is the best. Although she tends to ramble, her stories and her personal connection to her teachings is where she is the most brilliant. You get what you put into her classes. I absolutely recommend !"
      },
      {
        "index": 4,
        "rating": "4.0",
        "comment": "Com'n, you guys just demand too much. When a class is too demanding, you got frustrated; when it's too easy and flexible, you got more complaints... She's really excellent. No surprise or tricky questions in exams. And she cares her students a lot. A big thumb up! - Solid Aer"
      },
      {
        "index": 5,
        "rating": null,
        "comment": "At first I thought she would be a really great teacher...but it didn't turn out that way. She rambles pointless stories about herself and christianity. If you are not catholic or christian I imagine you would have been uncomfortable in the class. Insulted the entire class in saying we didnt know how to write thesis statments. Didn't like her."
      },
      {
        "index": 6,
        "rating": null,
        "comment": "She wasnt very helpful- rambles on about herself majority of the class. Very tough grader for a GEC class...You have to go to class or she'll call you out."
      },
      {
        "index": 7,
        "rating": "5.0",
        "comment": "Mrs. Ballah is an EXCEPTIONAL instructor.  The university is better for her being her.  I found her to be extremely knowledgeable and passionate about the material, and goes out of her way to make sure you understand it.  I would strongly recommend Mrs. Ballah to everyone.  She keeps the class interesting and entertaining as well."
      },
      {
        "index": 8,
        "rating": null,
        "comment": "It was a boring class I ever had. A lot of un neccessary talking in the class which s irrilevant to the subject matter. Boring text and reading articles posted on carmen. I have got nothing out of this class but just the A- FOR WHICH i DON`T KNOW nOTHING."
      },
      {
        "index": 9,
        "rating": "5.0",
        "comment": "Great TA, best I've ever had.  Willing to help you out if you have a health or family emergency.  She's a lot of fun in class."
      },
      {
        "index": 10,
        "rating": "4.5",
        "comment": "I liked that class and ms. ballah alot.  she was fair and made it really easy to talk about sensitive topics.  don't be mad cuz you got a bad grade :-P"
      },
      {
        "index": 11,
        "rating": null,
        "comment": "Ballah blows. She's crazy. She flips out in class, looks you in the eye while you are talking, and then two seconds later doesn't remember that you were just talking. Doesn't care about students, is an idiot. However, super easy class if you show up and turn everything in."
      },
      {
        "index": 12,
        "rating": "4.0",
        "comment": "Most of your grade is based on 3 papers and attendance/participation.  I honestly did not learn much from this prof.  There was a lot of reading and lectures were pretty boring sometimes.  I expected a lot more out of this class, but it was decent."
      },
      {
        "index": 13,
        "rating": "4.0",
        "comment": "She is very knowledgeable about women's health subjects. But there are too many topics in this course. It's about quanity not quality. However the the instructor's alright."
      }
    ]
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Melissa",
    "id": "VGVhY2hlci0xMTQwMjY1",
    "lastName": "Wiser",
    "legacyId": 1140265,
    "numRatings": 27,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": " She thinks that her class is the only thing going on in all of her students lives. The way that she interacts with people is rude and borderline insulting. If you don't show up to one of her classes expect an extremely rude and disgusted look. The classes are boring and there is no correlation to the course work with any of the lectures.",
        "course": "KNSISM5610"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Melissa Wiser was my favorite professor I've had at OSU. If you put in the effort to speak in class and go up to her after to ask for feedback, she will acknowledge your hard work. As long as you do your work and actually participate in class, you will do well in her classes!",
        "course": "KNSISM5614"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Strict, assigned seating, can't use word &#8220;interesting&#8221; in papers. Boring classes.",
        "course": "KNSISM5610"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "Terrible. Does not care about student and does not give anyone good grades. Get ready to read a crap ton and ONLY talk about what was in the readings for entire classes. ",
        "course": "KNSISM5614"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "It is clear she cares about her students, however extremely dull and most irrelevant information for this major. She also is a slow grader that will leave you to guess what grade you have just days before finals and graduation.",
        "course": "KNSISM4900"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wiser is a gem if you put in even an ounce of effort into her classes. As long as you respect the class and consult the readings beforehand, you will be perfectly fine. There are so many things that you can learn from this course (and Dr. Wiser) that are truly valuable beyond the classroom if you just take a moment to listen to her insight. ",
        "course": "KNSISM4900"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "The content is not relevant to the class. There are things such as which fork is needed in fine dining and the class is about internships in sports. Takes forever to grade even though its an asynchronous class with minimal work. The modules are all copy and pasted with old information. She gives no effort and her questions are poorly worded. AVOID",
        "course": "KNSISM3189"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "I'm not sure why everyone doesn't like Prof. Wiser. She was honestly great. Yes tough, but put in the work and show up to class and you'll be great. She expects hard work and likes class participation (she will probably like you more if you participate). I would like to have her again, and she told me at the end of the semester I did a great job!",
        "course": "KNSISM4900"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Wiser's online class was well organized, and I understood her grading criteria. The content was all relatable and useful for the class even though it sometimes felt tedious.",
        "course": "KNSISM3189"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't take this class if you don't have to. Lectures are very vague and if you have questions, don't expect clear or any answers (especially to emails). The final is a ton of work and makes you want to rip out all your hair. She has the expectation that everyone wants to pursue research after graduating.",
        "course": "KNSISM4900"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "Participation and being in class is so important, especially since she is the only professor I know that makes you turn in hard copies and on carmen. She genuinely cares about teaching so I would say if you take any class take this. Good discussion, just keep up on the readings or at least skim them.",
        "course": "KNSISM5614"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is the worst professor Ive ever had. She expects way too much, and thinks her class is the most important. I learned nothing from the class, because I was so focused on turning in all the assignments. She is a very tough grader, and takes months to grade things. Would avoid at all costs.",
        "course": "KNSISM5610"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrendously tough grader. I wish this class wasn't mandatory for my major or they'd get a new professor to teach it.",
        "course": "KNSISM4900"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Dr. Wiser for three classes during my undergrad and as much as they were a pain at times, I actually had to try. You can sleep walk through a lot of classes and still get a decent grade but not with her. Yes, she was tough and yes, she expects more out of you for an A in the class. Unless you're lazy, unmotivated or both, she is respectful.",
        "course": "KNSISM3189"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 2,
        "comment": "How she is employed at a major university is mind blowing. The cashiers at McDonalds have better communication &amp; people skills than her. Wouldn't doubt that they have a higher IQ than her too. Keep politics out of the classroom and stop crying that your candidate lost because you act like a kid crying at the grocery store for not getting candy",
        "course": "KNSISM3189"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wiser is a tough professor but if you try hard enough and actually have some care for what she's teaching then her classes are incredibly valuable and engaging. You don't have to buy -in to everything she says, but if you make the effort to engage and participate with the material regardless she will be more amenable.",
        "course": "KNSISM5614"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wiser is above the rest, she is very passionate about the class and she throughly cares for the subject. Even though her classes aren't a walk in the park, if you participate and engage in lectures then you can be one of her favorite students. Take advantage of learning from her.",
        "course": "KNSISM4900"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her treatment of a class that is ludicrous and patronizing at its core is absolutely revolting. The class outlines how to act in the professional realm which in itself is a useless lesson as all students taking the class have successfully landed a job. She treats the class as if it is nuclear physics and grades way too tough. Avoid at all costs",
        "course": "KNSISM3189"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is the worst. Seriously, the worst.",
        "course": "KNSISM5626"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is absolutely terrible. You can't ask her a question without her making you feel dumb. She doesn't explain much detail on her lectures and just overall is brutal. I wish I could have taken 20 classes this semester over her 1. She is not friendly and is rude. AVOID AT ALL COST, I repeat, AVOID AT ALL COST. This is here Sports Research class 4900",
        "course": "KNSISM4900"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "Honestly, one of the worst teachers I have ever had. The class should be an online class and the material that she teaches barely has anything to do with what she tests you over. Would not take this class again if you paid me! Absolutely terrible!",
        "course": "KNSISM5610"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is typically an 8am and should be online. The things we do in class are things that don't even relate to the sport industry. If you need to know how to eat in an interview and are super eager to answer every question in class take this course. If you just need it for your major, like most of us, take it online in the summer.",
        "course": "KNSISM3189"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 2,
        "comment": "Very power hungry. Takes the class much more serious than it needs to be. I would not recommend her to anyone. Feminist.",
        "course": "KNSISM3189"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "Too much irrelevant work for a class that is supposed to basically expose you to the sport industry field as a career, not job hunting. Much better would be online with focus on your field experience observations, not resumes and pronouns. Hard grader.  If you are in any way not totally feminist or supportive, whatever you do, don't talk about it",
        "course": "KNSISM3189"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "This MANDATORY IN-PERSON class should be online. It is completely unnecessary. I don't even know what else to say but be prepared to have to sit for over an hour one week, learning about pronouns and adjectives.. and no, that is not a typo. Also on the list, resume week, dinner etiquette, cover letters, how to dress for a interview, etc. Have fun!",
        "course": "KNSISM3189"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 5,
        "comment": "Too much. Unnecessarily, too much. That is all.",
        "course": "KNSISM3189"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very intriguing class with interesting topics and discussions.  Melissa is incredibly knowledgeable about the subjects she teaches and easily captures the student's attention.  Overall the class is easy as long as you do the weekly readings and take thorough notes.  I highly recommend taking it!",
        "course": "WSTDS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.6,
    "department": "Women's Studies",
    "firstName": "Jonathan",
    "id": "VGVhY2hlci0yMDUwOTkx",
    "lastName": "Branfman",
    "legacyId": 2050991,
    "numRatings": 16,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really kind, insightful, and organized. Also really funny! I never found myself checking the clock during his class.",
        "course": "ENGL3707"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's very organized and clear, but also supportive. And he made the most supportive class environment that I've ever been in. He learned all our names the first day, and helped us all learn each other's names. It was really a good community environment for learning. ",
        "course": "ENGL3707"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I learned something new in every class, and the readings always felt interesting/relevant. He has high expectations for essays, but also gives clear expectations and helpful feedback. In office hours, he really helped me improve my final essay. He also creates a really positive environment for class discussions.",
        "course": "ENGL3707"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Would take again. Sometimes the workload got heavy, if we had a film + a long article due together. But everything we watched/read was interesting, and sometimes really funny! Professor Branfman also gives clear expectations and feedback for essays. He also brings lots of energy to every class, and you can tell he cares about everyone's success.",
        "course": "ENGL3707"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great class, great professor. ",
        "course": "ENGL3707"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "He's heading to Stanford next, and Cornell will miss him.",
        "course": "ENGL3707"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "His first-year writing seminar was great! I thought I already wrote well before getting here, but he helped us all get much better at researching, outlining, writing, and proofreading. He has high standards, but he also really helps you meet them: he gives clear expectations and personalized feedback. Would take again!",
        "course": "ENGL3707"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Always looked forward to his class, and I'm trying to get a spot in his spring class. He's clear, funny, and fair, and the class topics always connect to real life. He has high expectations, but he makes a supportive environment for learning how to meet those expectations. If you take his class, you'll laugh a lot and learn a lot.",
        "course": "ENGL3707"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "He is not a great teacher. The class is discussion based, so you come to class just to talk about questions he poses. You have to speak at least 3 times which is frustrating because theres not always lots to say if you dont want to be repetitive (he will call u out for both). Directions are unclear and he waits till end of term to post grades..",
        "course": "FGSS4757"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Branfman is an incredibly captivating speaker and lecturer and is always very kind, open, and eager to help his students. His assignments were rather interesting and fun to do. He's funny, his enthusiasm is contagious, and whatever he has to say is guaranteed to be insightful.",
        "course": "FMST250"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely incredible professor. Gives great and informational lectures. Grades fairly and quickly. I learned an incredible amount from him and anyone would be lucky to take a class with him.",
        "course": "WGSST3317"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class as a gen ed and didn't know much about women studies. Jon did an AMAZING job. I recommend him and this class to all my friends. He always sets clear expectations and returns grade SO fast. Fair amount of reading but it was interesting and I didn't mind. If you do reading and pay attention, tests/ papers are easy to ace.",
        "course": "WGSST2230"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I recommend this prof to all my friends. Took his class for a GE and didn't expect much--but had an amazing time! I learned a ton that will really stick with me and applies to my everyday life. So glad I stumbled into this class and this prof. Jon was the best. Quick & fair grader, really engaging/fun teacher, and challenged us in the best way. ",
        "course": "WGSS 1110"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very helpful and approachable, always happy to answer questions. Very well-organized (I mean the semester plan overall, the assignments, the layout of each class, everything). Always totally clear what's expected from students and why we're doing what we're doing.",
        "course": "WGSS 2230"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent! Super genuine, creates a great positive classroom atmosphere, makes everyone feel valued when they participate. Passionate, smart, interesting, & knowledgable. Really great at respectfully challenging you to think critically about everything.",
        "course": "WGSS 2230"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Everything you could want: Passionate, energized, fast(!) grader,  totally clear explanations even on tough concepts, keeps your attention with funny lectures while still teaching you a ton. Plus Jon cares SO much about his students: If you seem down in class, or miss class, he'll always ask if you're okay.  You definitely have to read and show up.",
        "course": "WGSS 1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.3,
    "department": "Women's Studies",
    "firstName": "Sierra",
    "id": "VGVhY2hlci0yMzA5Mjky",
    "lastName": "Austin",
    "legacyId": 2309292,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "A: the class was really interesting. B: this professor was very caring and took the time to respond with thoughtful comments on multiple assignments of mine even thought it was an online course. She seems very excited to engage with students and hear their thoughts. Even though I was unable to attend, she also invited students to meet once.",
        "course": "WGSST2317"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sierra was fantastic. I appreciate that she doesn't grade on facts, she mostly asks for out opinion. This class had weekly modules consisting of a show or a few readings, and occasionally a Google Form with questions about the reading, or more often a discussion post about our thoughts. This was my easiest class all semester and was stress-free.",
        "course": "WGSST2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really liked Professor Austin. The course material was super interesting and while the class formatting was a little hard to get used to at first (no lectures, a lot of independent work) I think it was overall a great course. It is really easy to get a good grade if you just participate. I feel like I learned a lot and had fun doing it.",
        "course": "WGSST2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is one of my favorites. I am taking my fourth class with her and every time she has been great. She is very pleasant and will work with deadlines. If you don't understand some thing just ask and she will explain clearly of what she is looking for. Her assignments were fun yet challenging. She is very warm and cares about her student",
        "course": "WGSS2230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class reworked my feminism for the better. She is passionate and willing to talk outside of the course even though it's online. If you do the work and comprehend it, easy A and she works w/ you on deadlines. First few weeks are reading heavy so you have a good fundamental grasp of the issues, but past week 4 or 5 the work load wayy gets easier",
        "course": "WGSS2367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Sierra Austin is a PhD candidate whose online Black Women Writers class couldnt have been more irritating. Long story short, dont enroll in one of her online classes. She: provides no feedback as to what is an adequate analysis; isnt a consistent or standardized grader; is kinda petty; and literally doesn't teach. You get links to read &amp; thats it",
        "course": "WGSST2367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.8,
    "department": "Women's Studies",
    "firstName": "Cynthia",
    "id": "VGVhY2hlci0zOTcyODA=",
    "lastName": "Burack",
    "legacyId": 397280,
    "numRatings": 36,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Expected to read a number of pieces, but they are all interesting and manageable. The only assignments are weekly discussion posts, which are graded pretty fairly. Attendance isn't mandatory, but I enjoyed going to class. Burack is extremely knowledgable and really just wanted to have open discussion (not mandatory) with the class!",
        "course": "WGSST2215"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Burack provided very relevant material to read. This was the first time that I actually read every. single. book. for a literature class and loved them all. There are about 6 papers that are one page each (double spaced) and a weekly discussion post--not too much work. Truly enjoyed the material and loved both her teaching and the class. ",
        "course": "WGSST2215"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Her grading is specific and feedback equally so. All the papers were exactly one page long (with the exception of the journal due at the end of the semester). The lectures go with the flow and are quite laidback.",
        "course": "WGSS236703"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Expected a lot more from a writing class than nitpicking grammar or points off without meaningful feedback as to why. Had high expectations, but ended up often disappointed as lectures went off-track and the class became more history/polisci than lesbian literature. I really wanted to like this class, but I just couldn't. Would not take again.",
        "course": "WGSS236703"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Read a WLW book list instead. It could have just been the online format but neither this class nor Prof. Burack were great. Online lecture slides were lackluster + time spent in class wasn't spent teaching us but rather making us ask questions, then giving non-answers or personal anecdotes. Grading was fairly tough and expectations were unclear.",
        "course": "WGSST2367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "She grades based on 6 papers only and does not provide adequate feedback for these papers. She also never provides a rubric for these papers and expects you to just be good at writing. She only draws on her own experience as a lesbian and does not actually share knowledge with the class, she only discusses history from her point of view. Awful.",
        "course": "WGSST2367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors! Extremely smart and an expert in her field. No exams but does use group/class discussions in class. Lectures are not pre-prepared and instead flow with the conversation. Pushes students to think differently. Reading due each week with one-page responses. Also graded on quizzes and in-class work. Only met once a week.",
        "course": "WGSS4465"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "I felt like the exams were super easy, I can only remember missing one or two questions on each. Shes pretty straightforward about exam prep, but if you dont literally take notes during lecture, youre not going to do very well in the class. Felt like I deserved an A, but the grading criteria was not clear at all! Did not use Carmen at all!",
        "course": "WGSS2300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really great professor, incredibly knowledgeable and interested in her subject. I could listen to this woman talk about paint drying.",
        "course": "WGSS236703"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Six papers, but the max length for each one was 2 pages double spaced, and each had a different format (like one was a chart) so it was surprisingly easy for a writing II course, but she is a very tough grader! We read six books but they were all good, and overall the workload was very light. She is definitely cynical but has good things to say!",
        "course": "WGSS236703"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "I really did not like Prof. Burack. Her lectures were incredibly boring, and although it was supposed to be a discussion-based class, she rarely let students get a word in. Her discussion questions were boring and not thought-provoking. Everything was graded very vaguely and she literally had no grades in Carmen, ever.",
        "course": "WGSS2300"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Awesome class. The reading assigned is really good. I am a male and never felt Professor Burack discriminating towards me. Professor Burack is the best professor Ive had at Ohio State!",
        "course": "WGSS2300"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof Burack is refreshingly down to earth and gives great anecdotes. She can be cynical but I would definitely like to hear to lecture about anything just for her specific view point on certain topics.",
        "course": "WGSST236703"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cynthia was a professor I actually enjoyed listening to. Class was always interesting and I learned something new everyday. My TA was an easy grader and the Midterms and Finals were no-brainers at all. I aced bothed. Definitely the easiest and most interesting class to take!",
        "course": "WGSST1110"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's very knowledgeable and helpful. However, I've never received less than an A on papers prior to her class, but in this class I never received anything higher than a B. She is a stickler for writing rules that are completely asinine. But the class is really fun, especially when the class gets involved.",
        "course": "WGSS236703"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "great professor!",
        "course": "WGSST1110"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "I am a female and I took this class with my friend who is a male. We both wrote the papers together and did excessive amounts of reading. I got B+'s on my papers and he got C+'s consistently. He is a much better writer than me and its unfair how biased she is. Don't take the class unless your a girl who is good at sucking up.",
        "course": "WGSST2367"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Burack is one of the best professors I've had the privilege of learning from. She is an extremely articulate speaker and more than willing to go the extra mile to ensure that you understand the material. The class was one of my more difficult ones for the term, but if you put in the work required it really pays off. Would recommend to everyone!",
        "course": "WGSST367"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had professor Burack for WOM STDS 367 and WOM STDs 110, 110 was very interesting and well organized. 367 covered material very quickly. Professor Burack often runs off on tangents and looses track of where she was in lectures. TAKE NOTES! slides are not available online and ALL information on her slides are helpful for the tests.",
        "course": "WOMST110"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor. Clearly excited about the material. Fair to all students, both in opinion and grading. \r \r As a writing course, she didn't cover the art of composition in much detail, but she more than makes up for it in explaining and backing the reading material.\r \r I would definitely take her again - despite what a previous post says - I'm a gu",
        "course": "WMSTD367"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. Burack is very clear -everything was repeated to the point where taking notes became a formality; tests are easy.  However, she was my least favorite teacher at OSU.  She was incredibly rude to all of the boys in our class and not at all friendly with the rest of us.  I would not repeat this class with her, despite my interest in the subject.",
        "course": "WS110"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Horrible professor.  Always wanders off topic, is horribly biased against men, and refuses to back the points she makes in class outside of it.  She is incredibly condescending, but easy.  If you want a guaranteed A, it's a great class, and if you want a radically one-sided view of women's studies, take it, but otherwise STAY AWAY.",
        "course": "WOMSTDS110"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hands down the best professor I have ever had. Extremely intelligent and highly engaging. Cannot wait to take another of her classes.  Great lectures and fair grader.",
        "course": "WS520"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very good professor. Study guides before tests were very helpful. I learned a lot in this class.",
        "course": "WS110"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "110"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Comes off a little bit intimidating in the beginning, but as the quarter went on I found myself liking her more and more. Lectures were organized and interesting, and study guides before the finals made the class so much better. Highly recomended!",
        "course": "WS110"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 5,
        "comment": "She's great. No ifs, ands, or buts.",
        "course": "WS"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is, hands down, the best professor I had in the women's studies department.  I learned so much in her class not only because if I hadn't, I could've failed, but because she inspired me to.  I ended up with one of the most satisfying &quot;A's&quot; in",
        "course": "575"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "burack is the reason i decided to minor in women's studies.  she is straightforward and informative, but never dull.  she does have a great voice, and provides a great performance overall, and is in everyway the kind of professor i aspire to be.",
        "course": "WOMSTD110"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr Burack is one of those professors who is really smart and expects her students to keep up with her.  If you do the reading and work hard, it will be one of the most rewarding classes you will ever take.  If you don't, drop the class now.",
        "course": "WS575"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 4,
        "comment": "Her classes are tough and definitely *not* an easy A, but you get a lot out of it if you keep up.  Also, she's very willing to stay after class for a bit to talk theory or clear up a topic, but she's pretty inflexible in requirements for her class.",
        "course": "WS520"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 3,
        "comment": "I received an A- on the midterm, but I still dont' really like her. She gives off a vibe like she's totally unapproachable, and she's not very clear about what she's going to test you on. She also got rude w/ me when I told her I had to leave early once.",
        "course": "WS520"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 3,
        "comment": "Class was a small seminar, so students talked mostly.  Always very interesting, engaging, and friendly. Also, she has a beautiful, soothing voice that you just want to close your eyes and listen to.  She should get a radio job. :)",
        "course": "POLTHEORY"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "520"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is one of the best teachers I have ever had. You just need to be a little bit smart in order to keep up with her. She knows her stuff and I was priviledged to have her as a professor!!!!! A++++++",
        "course": "WST575"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 5,
        "comment": "She was one, if not the worst teacher that I have ever had.  I dropped the class solely because she was so utterly unhelpful.  She tells you flat out that she is not there to help you!!! Stay far far away from this prof.",
        "course": "WS520"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Deborah",
    "id": "VGVhY2hlci01NzgzNDg=",
    "lastName": "Kuzawa",
    "legacyId": 578348,
    "numRatings": 30,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I would highly recommend Dr. Kuzawa to anyone looking to take this class. While the class requires a lot of homework and effort, Dr K is incredibly caring and willing to help when necessary. If you are willing to put in the effort and engage in class you will be fine. I think the other reviews are incredibly harsh and not at all true. I loved her.",
        "course": "ENGR2301"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Honestly I was scared going into this class because of the reviews, but they couldn't have been more wrong. Dr. Kuzawa is extremely intelligent and truly cares about each student and each project, doing research for us outside class. She gives a lot of homework but that is expected with a 4 credit course. I'd seriously recommend her. ",
        "course": "ENGR2301"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "She treats a class that is a required gen-ed for engineering students like it's the most important graduate level course in the university. She doesn't grade super hard but is a stickler for citations and will actually read the sources you cite and give you lip if you don't interpret  sources right. She also gives way too many assignments. ",
        "course": "ENGR2301"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "This professor gives lot of homework and always talks about her grad students. Tries to run the Gen Ed class like a graduate level English class.",
        "course": "ENGR2301"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "AVOID THIS CLASS. Kuzawa is condescending, often has a bad attitude, and acts as if she's better than everyone else. Homework/lectures are often long, redundant, and disorganized. Grades are harsh even though she doesn't give good instructions. Save yourself.\n",
        "course": "ENGR2301"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Some instructions are not that clear but she's easy on the grading.",
        "course": "ENG367"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "my advisor suggested this class for me, which why I took it. This professor is probably the most condescending person I have ever met. Often is very moody and yells at students when they ask questions they should already know the answer. jumps to conclusions. high expectations and hardly ever gives anything higher than a B+. Avoid if u can.",
        "course": "ENG367"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Rude. Fake nice. Vague instructions and lectures are required but useless. Course organized horribly.",
        "course": "ENG367"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "She assigned much homework that we had to write at least three papers every week. She often changed the due time so that we have to spend a really long time to write the paper crazily. Moreover, she was a tough grader. what she said in class was boring and complicated that most people wanted to live. I suggest that none of you take this bad course",
        "course": "ENG367"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "ENGR 2367 suppose to be an easy GE but not the case for this teacher. We have in total 50 assignments a semester and she is a tough grader. Her instructions for homework are also very unclear and she always changes the due date which is also very annoying.",
        "course": "ENG367"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "Doesn't realize this is a gen ed that engineers have to take. Not only does she actively try not to give A's, the course load of this class is more than my actual major classes. Her class is boring and uninformative with most information already known. Prepare to have 4 assignments due in one week with little explanation. Worst class ever taken.",
        "course": "ENG367"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Her lecture is totally useless, but the attendance is required. There are tons of assignments. If you wanna get A for seconding writing class, avoid her. Also She always gives low grades. Literally, She should go to a community college.",
        "course": "ENG236"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class taught me real life things I should know, but the amount of work in this class is seriously over dramatic. Every class there multiple things due that are very pointless. Also, theres no explanation of anything. This class made my anxiety highten so much. Now, my anxiety is worse than before and carries into my non-school life. Good luck",
        "course": "ENG367"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "If you are willing to do the assignments you'll be fine. She is a harsher grade but in the sense that she doesn't give A's. If you get a B+ on all big assignments and A on the smaller ones you'll land with an A.",
        "course": "ENGR2367"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 3,
        "comment": "Almost everything that was said, is true. Very unorganized, not very clear with instructions, way too much work, not enough time for the work. However, it isn't impossible to get full credit for an assignment. So if you have the enduration to do 50+ assignments in a semester, then it will be an easy A, but I recommend that you avoid her.",
        "course": "ENG367"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was supposed to be an easy gen ed and she made it way too hard. So much work with not enough time or enough explanation. I would highly recommend taking this with someone else. ",
        "course": "ENGR2367"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "You want to avoid her class. While all the other classes had an easy time, Ms Kuzawa lectures forever while you should get time to work in class. She is a tough grader also",
        "course": "2367"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible I would say. Never clear on da assignments and when stuff is due. Very condescending. VERY HARSH GRADER",
        "course": "3"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "I found Deborah to be a good teacher. She obviously cares about teaching and knows her stuff. Some of the stuff we talked about wasn't new to me, but the examples she provided were really helpful. I liked all the interaction with my classmates and with Deborah. People saying she is condescending is at odds wit my experience. She was always helpful.",
        "course": "ENG367"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 1,
        "comment": "I felt like I was wasting half a tank of gas every time I drove to campus for this course. She is incredibly condescending and doesn't seem to know what she's talking about. She didn't really teach anything, just gave a ton of examples and talked about them. Thought we were going to learn how to write, not formats for business letters and resumes.",
        "course": "ENG304"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "Took it last year and have actually used some of the stuff I learned in the class for my other classes.  I liked that she was accessible, and that we actually spent time learning  how to write better instead of just reading a bunch of stories.",
        "course": "ENG110"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Deborah is my favorite English teacher that I have ever had. I would love to take her classes over and over again. She's very helpful and interested in teaching. I hated all my writing classes except her class. She grades fairly and she's an easy grader.",
        "course": "ENG110"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took English 110.03 with Deborah during Winter. As a international student, I thought she was very helpful with my English writing. I met with her often and she helped alot. She cares about teaching and her students. Sometimes she talked way to fast though.",
        "course": "ENG110"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "I am surprised by the negative comments here! Deborah was a helpful and dedicated instructor, although she does have a dry/sarcastic sense of humor.",
        "course": "ENG110"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 1,
        "comment": "Terrible teacher. Condescending and doesn't really have an idea what she's talking about. Didn't know a single person in my class that liked her, but still got an A.",
        "course": "ENG110"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very inefficient teacher. Disinterested, condescending and unfortunately took a composition class for me and made me less enthused about my own personal writing abilities.",
        "course": "ENG110"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very intelligent teacher, did not receive much from the class. Seemed like she was too &quot;by the book&quot; rather than being innovative or interactive.",
        "course": "ENG110"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty good teacher, grades fair.  She gives you the opportunity to re-write your papers if you didn't do too well.  Don't take this class if you don't like to read.  Pretty interesting stuff, and this is coming from a guy",
        "course": "WOMSTD36701"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 3,
        "comment": "Can be aggressive at times, and is a critical grader.  Knows her material well- and expects you to know it just as well.  Not bad if you keep up with the reading and plan to re-write your papers a few times.  Don't not take this class because of her- she is fair.",
        "course": "WS36701"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "I love English and I love women's studies, but this teacher is ridiculous. Some of the material is good, but her grading of papers is harsh. She claims to grade nicely on the final, so here's hoping. Avoid at all costs.",
        "course": "WS36701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "Women's Studies",
    "firstName": "Henryatta",
    "id": "VGVhY2hlci03Njc3ODc=",
    "lastName": "Ballah",
    "legacyId": 767787,
    "numRatings": 14,
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Ballah was a great resource and she cares about all her students. There were a few short papers and a decent amount of reading in the class I took with her, but they were all manageable and clearly outlined in the syllabus before class began. I really enjoyed my time in this class and recommend it for history and non-history majors alike.",
        "course": "HIST175"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "HIST 175 @ W&L: Insane breath of content taught well. Readings aren't bad. There are \"pop-quizzes,\" but you can guess when they'll be. You do need to prepare; they aren't easy. Overall, she care more about understand the material than grades, so you'll get an a or a-. Prepare for three miserable papers. Speak up in class. Not life changing.",
        "course": "HIST175"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "HIST-175 @ W&L. Prof. Ballah is one of my favorite professors ever. Classes are discussion-based and questions are encouraged. She knows damn near anything you could ever ask her about Africa's History. You will succeed if you are intellectually curious and take good notes. Also my academic advisor, and she gives the best advice. A blessing.",
        "course": "HIST122"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Ballah is the best. Although she tends to ramble, her stories and her personal connection to her teachings is where she is the most brilliant. You get what you put into her classes. I absolutely recommend !",
        "course": "AFAM122"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Com'n, you guys just demand too much. When a class is too demanding, you got frustrated; when it's too easy and flexible, you got more complaints... She's really excellent. No surprise or tricky questions in exams. And she cares her students a lot. A big thumb up! - Solid Aer",
        "course": "HIST121"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "At first I thought she would be a really great teacher...but it didn't turn out that way. She rambles pointless stories about herself and christianity. If you are not catholic or christian I imagine you would have been uncomfortable in the class. Insulted the entire class in saying we didnt know how to write thesis statments. Didn't like her.",
        "course": "HIST121"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "She wasnt very helpful- rambles on about herself majority of the class. Very tough grader for a GEC class...You have to go to class or she'll call you out.",
        "course": "HIST122"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mrs. Ballah is an EXCEPTIONAL instructor.  The university is better for her being her.  I found her to be extremely knowledgeable and passionate about the material, and goes out of her way to make sure you understand it.  I would strongly recommend Mrs. Ballah to everyone.  She keeps the class interesting and entertaining as well.",
        "course": "AFAM122"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 1,
        "comment": "It was a boring class I ever had. A lot of un neccessary talking in the class which s irrilevant to the subject matter. Boring text and reading articles posted on carmen. I have got nothing out of this class but just the A- FOR WHICH i DON`T KNOW nOTHING.",
        "course": "AAAS122"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great TA, best I've ever had.  Willing to help you out if you have a health or family emergency.  She's a lot of fun in class.",
        "course": "HIS121"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "I liked that class and ms. ballah alot.  she was fair and made it really easy to talk about sensitive topics.  don't be mad cuz you got a bad grade :-P",
        "course": "WS325"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 2,
        "comment": "Ballah blows. She's crazy. She flips out in class, looks you in the eye while you are talking, and then two seconds later doesn't remember that you were just talking. Doesn't care about students, is an idiot. However, super easy class if you show up and turn everything in.",
        "course": "WS325"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "Most of your grade is based on 3 papers and attendance/participation.  I honestly did not learn much from this prof.  There was a lot of reading and lectures were pretty boring sometimes.  I expected a lot more out of this class, but it was decent.",
        "course": "WOMSTD325"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is very knowledgeable about women's health subjects. But there are too many topics in this course. It's about quanity not quality. However the the instructor's alright.",
        "course": "WS325"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Lin",
    "id": "VGVhY2hlci04MjQ3MjY=",
    "lastName": "Distel",
    "legacyId": 824726,
    "numRatings": 13,
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "This was the worst class I have ever taken, I took it during the summer and it was 3 hour credit class, the work felt like I was taking a 5 hour credit class. She doesn't even follow MLA format, it seems like it is something she just made up. DO NOT TAKE!!!!",
        "course": "WGSST1110"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dude all I can say is, mistake of your life if you take this class. No one liked the class for a reason, you see the ratings. Dont do it to urself. Trust ",
        "course": "WGSST1110"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "im an A/B student and i took one of her classes before this that wasnt hard at all. however, this class was THE hardest class i think i have ever taken for a class that is only filling a GE for me. if i couldve picked ANY other class, I WOULDVE. do not recommend her at. all. i received a C+ in her class, and how i even managed that i have no idea.",
        "course": "2215WGSST"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Im sick of hearing dont drop this class everyone can do it shes by far one of the hardest and worst instructors Ive ever had. Shes very hard. If youre looking for hard work for a class that could be very simple, take her. I believe shes been doing this this for too long and needs to be done. She does the worst in explaining assignments.",
        "course": "WOMEN110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely loved this class and professor! Definitely take her class, you won't regret it!!",
        "course": "WOMEN110"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wish I would have researched this professor prior to taking her online class. I am an A student and this will be my first C ever. She does not explain things clearly, and even when you follower her ruberic, she will still tax you heavily &quot;grade wise&quot; if you are not specific enough to her standards. PLEASE AVOID HER AT ALL COST. VERY BAISED.",
        "course": "WOMEN110"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very difficult online class. Lin is a very tough grader and there are a lot of tests with super specific questions. There is a lot of work and a lot of readings every week. If you want an easy A dont take this class. You have to put in a lot of time and effort to pass.",
        "course": "WGSST1110"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lin Distel is a professor who makes you work for your grade. You will not pass if you dont review her syllabus and evaluative criteria. This is a session 1 online class and its very fast-paced. You have to read the assigned readings. You can get an A but you have to work for it, its too hard for a 1000 level GE.",
        "course": "WGSST1110"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly stay away from at least her online classes very unclear on the instructions and frankly not a very good class to take online.",
        "course": "WMNSTUDS326"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "I first liked this teacher...then one day after class she got in my face and yelled at me telling me i was disrespectful for talking in her class and that i was not aloud to sit next to my friend anymore..the funny thing is i never even said a word to my friend during the class period..all i did was laugh at something that was funny.",
        "course": "WOMEN110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "This teacher is absolutely amazing!  One of my favorites!  She keeps discussion interesting and listens to everyone's opinions.  Readings are easy and interesting because they apply to things that affect our daily lives.  I would definitely recommend taking this class for an easy grade that you actually enjoyed!",
        "course": "WS110"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best instruction I've had at OSU. very discussion based, very intellectually stimulating. Hard exams but very fair. Must participate in discussion for good grade. Loved going to her class. Brilliant woman.",
        "course": "WS324"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Distel is great. TAKE THIS CLASS.  Class is 100% discussion so be prepared to talk or it will seriously affect your grade. LOVED IT!",
        "course": "WMNSTUDS326"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.7,
    "department": "Women's Studies",
    "firstName": "Linda",
    "id": "VGVhY2hlci01NTc1ODM=",
    "lastName": "Mizejewski",
    "legacyId": 557583,
    "numRatings": 28,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "I was kinda surprised to see such high reviews. She seems like a nice person, but her class was very dull and taught just by lectures. Kind of felt like a high school class. And attendance was way too strict - you have 2 absences allowed for any reason, including being sick, if you miss any more your grade drops from an A to an A- or A- to B+, etc.",
        "course": "WGSS4527"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very friendly and easy to talk to, assignments and exams weren't too difficult. However, DO NOT MISS CLASS. She will take lots of points off for missed classes since a large portion of the grade is participation-based. Show up to class regularly and participate and you'll be fine.",
        "course": "WGSST2317"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "take the first year seminar with her! super caring professor who makes you think about love in different ways, very clear grading, and weekly readings, two movies, and a group project. very interesting and easy class taught by someone who is super sweet.",
        "course": "WGSS2326S"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mandatory attendance which is annoying, but if you pay attention in the lectures and watch the movies you can get an easy A. Offers to review your papers before submission which is a big plus. Definitely cares about student's success.",
        "course": "WGSST4527"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Easy as long as you attend lectures. She gives you 2 tries on the quizzes. I loved the films she picked they were all great. Overall a good Professor and an interesting class.",
        "course": "WGSST2317"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've taken three classes with Prof. M. and loved them all. She picks fun films to watch and the readings are helpful rather than boring. Her lectures are concise and facilitated discussions are always interesting and engaging. She's a professor that makes you want to participate and her exams, a midterm and a final, are easy if you take notes.",
        "course": "WGSS4527"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I can't say enough good things about Dr. M and this class. Highly recommend for anyone considering a service learning class. Had a fair amount of readings, but only met once a week instead of 2 because of our SL. Dr. M is incredibly sweet and a great professor, I hope I can take another class with her!",
        "course": "WGSST2326S"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was such a great professor! I loved this class so much. Sometimes we had a decent amount of reading, but everything we read was really informative and helpful. Her quizzes and papers were very reasonable. Prof M is really funny and made every class worth going to. If I get the chance to take another one of her classes, I will!",
        "course": "WGSS2326S"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "A lot of reading and watching movies but all worth it",
        "course": "WGSS4527"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mizejewski is hilarious, kind, interesting and wonderful. Her class is amazing and engaging and fun. TAKE IT.",
        "course": "WGSS4527"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved this course! She is a great lecturer, very interesting and funny. Shows a lot of films in class. Easy quizzes/2 tests, attendance, and two short papers make up your overall grade. One reading quiz and one movie quiz are dropped. Just come to class, skim the readings, and watch the movies and you will not only get an A but have fun doing it.",
        "course": "WGSST317"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is an easy A and yet you still learn a lot. Movie quizzes are v easy if you watched it, reading quizzes you're given a study guide with the potential questions. Midterms and exams also have a guide.",
        "course": "WGSST317"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lots of quizzes but as long as you actually watch the movie/skim the material they're easy. She shows lots of film clips in class which I appreciate. She has a lot of energy and even in a larger class she still knew all of our names.",
        "course": "WGSS4527"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's lively and brings excitement to the classroom. Movie quizzes are super easy, as long as you actually watch the film. Reading quizzes are relatively simple (provides a study guide). Readings hardly show up on exams. Provides a study guide for midterm and final. Must attend class (allowed 2 absences before half a letter grade is taken away).",
        "course": "WGSS4527"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class. You learn a surprising amount for the topic, bottom line is she's amazing and you'll pass if you try a little bit.",
        "course": "WGSS4527"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Quizzes were very straightforward a easy if you readwatched the film. Tests are easy because she gives you a study guide. As long as you study that, you'll do fine. She's very sweet and enthusiastic. Never not smiling. I took this just for my visual arts credit but ended up learning way more than I anticipated. She's a wonderful prof. ",
        "course": "3317"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was wonderful, as was Mizejewski. She is very passionate about the subject and does all she can to help you understand. She is very thorough. Plus her energy is fantastic.",
        "course": "WGSS4527"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor! The class was really interesting and the material was manageable. Take it!",
        "course": "ENG4527"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took Women, Hollywood and Film in Fall 2011, and I enjoyed it very much! She was a great lecturer, even though I'm sure lecturing in the gateway with all her students' faces barely visible in the weird lighting must have been weird. Very helpful, very nice, and I always recommend this class to whoever is open minded :)",
        "course": "WGSST317"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent professor, had her for Hollywood, Women and Film. Not only did she give detailed analysis of scenes in class, she also pointed out what she would be testing and even *gasp* eliminated a problem on a test because too many people had gotten it wrong. Be sure to show up for class, you won't regret it!",
        "course": "WGSST317"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "I had her for Women in Film Noir, she's definitely one of the best profs in the WS department.  She's super-nice and really dedicated to teaching, her class is a lot of fun.",
        "course": "WS317"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Mizejewski is so excited about teaching, and her energy level in the class could make anyone interested in the topics she lectures on. I took her film class about women in film, and it was interesting and it challenged my thinking.",
        "course": "WOM317"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love this class! You don't really need to read for class, but you definitely have to for the quizzes and tests. She made the class really interesting and easy to understand. I LOVED this class.",
        "course": "WMST317"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is easy. She give you everything you need to know in her powerpoints. She only allows two absenses and it helps to go to class and listen. There's one paper and every other class is a film. She discusses what's important. Take it you won't regret it...",
        "course": "WS317"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. M is such a great professor. She really knows what she's talking about. She's really enthusiastic and makes it easy to stay engaged throughout the whole class. Class is not hard at all if you show up. I would definitely take another class with her and recommend this one to anyone.",
        "course": "WOMST317"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is extremely knowledgeable and enthusiastic.",
        "course": "527"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. M, as you could call her, is extremely well-organized,highly knowledgeable, and integrated technology rather well into her pedagogy. She encourages students to run their drafts by her and offers very helpful comments in the process. Her choice of films for WS527 struck a fine balance between breadth & depth. &quot;Gender and Horror&quot; was enjoyable!",
        "course": "WS527"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great lecturer.  Very excited about her topic.  She's one of those knows too much for her own good professors, but it comes across well in class.  I actually learned alot from this class.  You would think that women in horror film would be generic and basic at best, but mizejewski made it fun.",
        "course": "WS520SOMETHING"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.7,
    "department": "Women's Studies",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0xMjY2OTk3",
    "lastName": "Suchland",
    "legacyId": 1266997,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite professors at the university! She never knew I was struggling with my mental health but always checked in on me when I wasn't participating. She encouraged me to complete my work and made the class one I looked forward to reading up on. I'm really interested in Russian culture and I'm glad I got to take this class :)",
        "course": "RUSSIAN2335"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "media provided to read or watch was always very confusing and hard to understand, plus oddly worded discussion boards and quizzes",
        "course": "RUSSIAN2335"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really chill and gives you opportunities to focus on what interests you. Very understanding if you are having issue with interesting lectures and not much homework.",
        "course": "RUSS3350"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Suchland is really easy-going and nice. Her lectures are interesting and keep you engaged. The assignments are difficult, but she will work with you and give extensions if needed. The readings are long, however; she will tell you if you can just skim it. Overall, she's great and the class is really informative.",
        "course": "SLAVIC5450"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor!  She is very well-informed and always knows what she is talking about.  Contents are super packed, thus, you will have to do a lot of reading outside of class.  And by a lot, I mean A LOT.  She is helpful and is glad to answer your questions.  Attendance and participations are required.   ",
        "course": "IS2250"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Cool lady, horrible class. Consists of an insane amount of reading every night, an impossible midterm, an irrelevant paper and a &quot;creative&quot; project that you supposedly have freedom to do whatever you want on, but she then criticizes you for not doing it in a way she would have preferred. So why doesn't she just make guidelines for it&#63; Who knows.",
        "course": "WS505"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "nice teacher, bad assignments. your grade is made up of 4 papers a group project and participation. i HATED the group wiki project. very difficult and annoying. there is a TON of reading and towards the end the reading is pointless b/c you arent tested on it and there are no more papers to use it for. attendance mandatory. papers were confusing.",
        "course": "WS505"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 3.1,
    "department": "Women's Studies",
    "firstName": "Nancy",
    "id": "VGVhY2hlci04MDE5MDM=",
    "lastName": "Jesser",
    "legacyId": 801903,
    "numRatings": 29,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Jesser is great. She really cares about her students and always makes the effort to provide detailed feedback. Lectures can feel dry, but she takes care to assign interesting and thought-provoking material. There might be more work than than in a typical GE course, but in my experience, you get out of this course what you put into it. ",
        "course": "COMPSTD3645"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Jesser is a nice professor who's passionate about her work and is quick to respond to emails. She grades for content and idea development, not for your ability to write well which is appreciated. The course requires a very large amount of reading for a GE and quite a few 3-4 page papers, but class time consisted primarily of group discussions.",
        "course": "COMPSTD3645"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Classes is mainly group work. She talks a lot and its easy to get distracted. Shes kinda passive aggressive on the comments for assignments, and expects way to much for a shortened course. She also does not give out grades until the semester is over. Classes is heavy and its a lot of reading",
        "course": "COMPSTD236704"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful. This work load was unlike anything I could fathom a teacher would genuinely find reasonable. Once a week we had 2-3 page papers and we had 2 1800 word papers, 1 2600 word paper and a 40 minute presentation. On top of that, she doesn't give you your grades until the end of the semester. How messed up?????",
        "course": "COMPSTD236704"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "I thought the class's content itself was pretty fun. I didn't like the way the discussions worked and felt it was forced when the content that was given to us was very straightforward in what it was trying to say. Most discussions felt dry and unengaging. There was a good bit of reading though she tells you what you're supposed to pick out of them.",
        "course": "COMP36702"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "Took her for Comp Studies 3645. Nancy is a bit dry and boring as a lecturer. Think she means well but just socially a bit awkward. Sometimes gets lost while lecturing or talks in weird circles. Papers are graded very easily. Try's to facilitate group discussion but she's so monotone in her talking no one wants to participate. Take for an easy A.",
        "course": "COMP36702"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "She cares about her work and class and is available for help. Sometimes it can be difficult to understand what she is meaning to say and the lectures can be a drag, but overall she teaches well and makes the topics intresting.",
        "course": "COMPSTD2341"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Makes literally everything more difficult than they need to be. Doesn't upload grades in an intuitive way (Carmen) so you're left wondering what your grade is for the entire semester. Takes &quot;playing devil's advocate&quot; to another level. It got to the point where she would just ask unnecessary questions. Unclear grading criteria. Avoid her if you can.",
        "course": "COMPSTD236704"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nancys good at facilitating class discussions that make class engaging. Lots and lots of reading (if you actually do it...). Can get by by only reading the books you are writing your papers on tho. Did this and ended with an A. A good choice for a lit and global studies gen ed. I like easy classes and this wasnt too bad. Sometimes boring tho.",
        "course": "COMPSTD2104"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Jesser embodies the idea of &quot;speaking a lot without saying anything at all.&quot; She routinely cut off students to interject with her own point, she would forget her own deadlines then be surprised when no one turned anything in and send the whole class a scathing email, and her grading schemes were awful. Avoid her if you can",
        "course": "COMPSTD236704"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "I dreaded going to class every single day. Classes are boring and discussion-based, where she would play devil's advocate after every single point being made. She goes to the extreme in order to prove an irrational and irrelevant point. She is totally disorganized and the class does not have a set structure. Not a hard class but wouldn't take again",
        "course": "COMPSTD3645"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really liked Dr. Jesser but I can see why other people found her boring. It took her a while to get comfortable with the class. She was good at pushing discussions further and making us question ourselves. With all of that said, I would not recommend her if you aren't genuinely interested in class material. She gives papers but grades easily.",
        "course": "CS4597"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "She is very knowledgeable about the material and readings in class but very boring. She is a pretty easy grader on papers and group projects. Some of the material in class can be interesting but usually sitting through class is painfully boring, but you receive 2 points per class for attending and answering a question about the assigned reading.",
        "course": "COMPSTD4597"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very nice teacher, a little bit boring. A lot of group project and 3 papers. Attendance is mandatory, she will pass an attendance sheet.",
        "course": "COMPSTD236704"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was not interesting for me at all. I read none of the readings. I simply attended every discussion and copied down the discussion points and regurgitated them on the 2 page papers due every week, receiving A's on every single one of them. I would recommend it as an easy A, but the discussions got old. Women are underprivileged. I get it.",
        "course": "CMPST535"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was a fair grade.  Since the midterms are take home, as long as you are a good writer, you shouldn't get anything lower than an A-.  Make sure during the group presentation you choose a topic that will get the class talking.  Overall a fair class and pretty easy to get an A.",
        "course": "CS272"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dry reading, but if you talk in class and do the reading you'll get a decent grade. She's really nice and will look over drafts/give feedback on ideas. Not a particularly hard grader. Attendance points! If you can stick it out through some dry reading and you're not a horrible writer, take this class for a fair A.",
        "course": "WS535"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Some of ya'll must be crazy or brain dead. I took Gender and Science with Dr. Jesser in Fall 2008 and class sessions were SO interesting that I was always disappointed when it was time to leave. YES, some of the reading material was dry, but it ALL pertained to important theoretical concepts! Jesser's class was the reason I pursued a WS minor!",
        "course": "WS535"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "She had a way of draining a subject dry...to the bone. When you thought there was nothing more possible to say about a topic she would find something. She purposely tried to take the opposite stance on a subject to &quot;challenge&quot; your thoughts. I understand what she was trying to do but it got old, quick. Nobody in my group ever wanted to talk to her.",
        "course": "CMSTD597"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good teacher, smart and easy to talk to. Material she picked was BORING though. 3 papers, 1 group project and daily quizzes that you were guranteed 50% just for writing your name (seriously). The best advice for her class is definitely that you should pick the people you work with carefully, as you'll be working with them on everything all quarter.",
        "course": "COMP597"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 2,
        "comment": "like everyone on here said..very very boring class, but easy if you can make it through the lectures. pick your group wisely because you will work with them all quarter. 3 5 page papers and 1 group presentation. papers are easy. i got an a.",
        "course": "COMP597"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class is based on group discussions.  There are 3 papers to write throughout the quarter, and a group presentation.  The subject matter was interesting and she is a very smart teacher.",
        "course": "CMPST597"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 2,
        "comment": "completely unclear about what we needed to do for most of the quarter. very boring. she is smart, but she just isn't cut out for teaching.",
        "course": "COMP518"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class is merely discussion only, 3 pt quizzes offered to track attendance. Not open to students opinions, not impressed with her attitude.",
        "course": "COMP597"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 2,
        "comment": "Super boring, reminds me of a bad high school teacher. But her class is a breeze if you have any common sense.",
        "course": "COMP597"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lectures are boring but the class only consisted of two papers and an in class led discussion. Very easy if you pay attention.",
        "course": "COMPS272"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "Keep up with the readings, put some thought into the three short papers, and try to go to every class.  Lectures can be really long and boring, but the discussion is the meat of the course.  Also, there's a final project/paper.  Overall, decent class.",
        "course": "WSCS535"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy, Just go to class and 3 papers. Not very clear on what was needed.",
        "course": "COMP36702"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's just another liberal more concerned with promoting her personal views than teaching the class.",
        "course": "CS36702"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Women's Studies",
    "firstName": "Lindsay",
    "id": "VGVhY2hlci0xMTAxMTMw",
    "lastName": "Bernhagen",
    "legacyId": 1101130,
    "numRatings": 6,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lindsay is so amazing! She is an incredible educator, really know her stuff. The best part about her as a professor is she makes a true relation/connection with her students, and very caring. Grading is great, and she has really taught me a lot. Assignments are pretty easy, and discussions in class are really interesting and educating.",
        "course": "EDUC205"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had this teacher for comparative studies just this last Autmun quarter and she was excellent. She is extremely helpful and laid back. She seems more like a fellow student who is really willing to help you rather than a strict professor. I learned a ton in her class and became a better writer as well. TAKE THIS CLASS IF YOU HAVE THE OPPORTUNITY!",
        "course": "COMPT367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Bernhagen is one of the sweetest lecturers. Totally articulate, really fair grader, and always ready to help students with their grades. She's also a cutie with a killer figure, but that's just the icing on top of her academic greatness.",
        "course": "COMP240"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lindsay is an awesome teacher. She is so nice, so fun, and very informative. I very much recommend her because going to her class and having a discussion is very similar to sitting around chatting with friends. She's great!",
        "course": "COMST367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very easy to do well in her class if you do the readings. You can email her at any time with questions or paper drafts and she will give you feedback. Keep an open mind and you will learn alot in this class.",
        "course": "WS367"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "WS367"
      }
    ],
    "SEI": []
  }
]