[
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Madeleine",
    "id": "VGVhY2hlci0yNzY1MTM2",
    "lastName": "McClung",
    "legacyId": 2765136,
    "numRatings": 7,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She grades very quickly and provides good feedback on almost every assignment. The class was very easy and interesting. There are weekly discussion posts and journals as well as a couple papers. Have access to many steaming platforms for the weekly shows/movies or access them in other ways. ",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She answered emails very quickly, which was nice for the final (which is a presentation of sorts). There is a discussion post and \"journal\" (200ish words) due each week. Pretty easy, although I found some weeks to be heavier than others. Some assignments/final take some thought",
        "course": "WGSST2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is great. She grades fast and always provides feedback. She encourages questions and is quick to respond. The class on the other hand, I hated it. I'm not saying that I didn't learn anything, because I did. Don't take the class if the title does not sound appealing to you.",
        "course": "WGSST2230"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "class was super easy. every week you do a journal (200 words), discussion (150-200) and one response (150). you dont have to read all the required articles/watch the shows. this class does require you to have some streaming services. Just do the assignments and more than likely you will get a 100% on it. \n",
        "course": "WGSST2230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Madeleine cares about her students and wants them to succeed. Just follow directions and you will receive full credit on everything. Lectures are entertaining and coursework is engaging and thought-provoking. Not a lot of work but very interesting. ",
        "course": "WGSST2230"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is amazing! Her class is easy; it is just weekly reading articles and watching shows. Then you will make a journal entry and discussion post about the content. Just remember to actually do the assignments on time. She understands that things happen and takes in late-work if you notify her. She is passionate about this topic and us as students. ",
        "course": "WGSST2230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Madeleine cares about her students and wants them to succeed. There are weekly modules where you have to do a few readings and watch some shows. As long as you participate in the weekly discussions, weekly journals, and responding to a peer's discussion post you will be fine. There is a final project at the end but it is not too difficult. ",
        "course": "WGSST2230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.4,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Sujatha",
    "id": "VGVhY2hlci0yMzczMjEz",
    "lastName": "Subramanian",
    "legacyId": 2373213,
    "numRatings": 9,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great teacher that truly cares about her material. I would definitely recommend her for any course. ",
        "course": "2215"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Passionate, great professor. She did not post announcements, but if you go to her weekly class she will communicate. Only downfall is she did not respond to any of my emails, but is an easy grader. Just do the papers and discussion board and you will earn an A.",
        "course": "WGSS2306"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Subramanian is a very kind and knowledgeable professor. All you have to do is the readings and a discussion post. And honestly, you don't have to read all of the papers, I usually just read the discussion question and skim the readings. There's three papers and one project, not too difficult. The weekly zoom isn't even a factor in your grade. ",
        "course": "WGSS2306"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "I love Sujatha so much, she is so sweet and kind and her course is mainly discussion lead. She really cares about her students and takes the time to make sure everyone feels heard. The only downside is the enormous amount of reading you are expected to do (30 or more pages of an academic journal between classes)  and two grades for the class",
        "course": "4520"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Subramanian has been an AMAZING professor. I'm in her online class and everything you need to know is clear cut. Post your weekly discussion posts and do what you need to do and you're fine. She responds to her emails quickly, you can easily set up an appointment in person or through skype if u have any questions. our final exam was a 3-page paper",
        "course": "WGSST1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is my second online class with Sujatha and I really enjoyed both of her classes. The subject matter is interesting and I enjoyed learning about it. You don't have to put in a lot of work for a good grade, as long as you answer the discussion questions and complete the papers on time you're pretty much guaranteed an A. Highly recommend!",
        "course": "WGSS2306"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class online for the WGSS minor requirement and it was super easy. She seems like a really caring person and doesn't grade harshly. Every week we only had to respond to a couple discussion questions. The midterm was a few short essays and for the final it was a paper. I'd recommend this class to anyone.",
        "course": "WGSS1100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "I enjoyed this class, it was lively and had many group discussions. The assignments were few and direct. Only suggestion for improvement is that sometimes the use of Carmen was not well-planned.",
        "course": "WGSST1110"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Sujatha is a super sweet and passionate teacher. You can tell she really cares about women's issues and I did learn a fair amount in this class. The class is only out of about 100 points but as long as you do the assignments, you will get an A. She does care about attendance but it never went into the final grade (at least it was never in Carmen).",
        "course": "WGSS1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Treva",
    "id": "VGVhY2hlci0yMzA4Nzk3",
    "lastName": "Lindsey",
    "legacyId": 2308797,
    "numRatings": 11,
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Lindsey is so intelligent and every lecture is so stimulating. On top of that, she's funny, real, and cares about her students deeply. We were graded on a few papers and she's really clear about what she's looking for. The work is super manageable, yet I learned SO much. Take her class!!",
        "course": "WGSST2550"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "There are only four grades for the entire class: an essay, a midterm project, a final project/paper, and in-class assignments. Technically there are weekly readings, but I never did them and was fine. The only time you need them is for the projects. Lectures are super interesting and engaging and you can tell that she is passionate about her work.",
        "course": "WGSST2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Lindsey is so passionate about what she teaches about and it really shows. Grading was a few small projects, attendance, and a few in-class activities that happen without warning (making it very valuable to be there everyday). If you have the chance to take WGSS 2230 with her, definitely do! She teaches it with a hip-hop lens which was so cool.",
        "course": "WGSST2230"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Lindsey is overall such a cool person. I learned a lot from this class, and it was not that hard. As long as you knew the terms, and could expand on them, you could get an A.",
        "course": "WGSST1110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely knowledgable and lively lecturer. Attendance is taken each class but you sign in at the beginning so you can leave early if you want. There are sometimes activities at the end that count as attendance tho so it's risky to leave. Very helpful at office hours. No tests, just a paper, short group midterm project, and individual final project",
        "course": "WGSST2230"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Treva Lindsey taught an amazing pop culture (focusing on hip hop) class. I learned so much I wouldve never expected and she is a very respected woman in her area. We even got to video chat with some well known authors and journalists. There are few grades but if youre willing to participate you will get an A.",
        "course": "WGSST2230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the most fun professors I've had. Very knowledge and makes the course so relevant. Very few assignments so the course is very manageable. Highly reccomend!",
        "course": "WGST2230"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lindsey is my favorite professor I have ever had at OSU. She is not only brilliant, but a wonderful professor. Her lectures keep you engaged and you can tell she is super passionate about Women's Studies. She's also nice to look at lol. Take any class with her, you won't regret it!",
        "course": "WGSS1100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love her, so passionate. Heavy weekly readings, you never know when there will be a pop quiz. This class is a must take. I declared this subject as my minor because of this class!",
        "course": "WGSST1110"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lindsay is incredible. She is so passionate about her work and is eager to share what she knows. The textbook readings are a must, but it's manageable. Make sure you read the supplemental readings at the end of the chapter, you'll need it for the 3 page research paper (which wasn't bad). I absolutely loved her! ABSOLUTELY TAKE THIS CLASS!",
        "course": "WGSST1110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lindsey is AMAZING. No other word to describe her other than a badass. She makes the class so fun and not difficult at all. Throughout the year there are 3 pop quizzes, 1 midterm and 1 final paper. No homework other than the readings. She offers lots of extra credit. Would highly recommend this class with her!!",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  }
]