[
  {
    "avgDifficulty": 3.7,
    "avgRating": 4.7,
    "department": "Womens  Gender Studies",
    "firstName": "Krista",
    "id": "VGVhY2hlci0xOTU3Njk0",
    "lastName": "Benson",
    "legacyId": 1957694,
    "numRatings": 3,
    "summary_comment": "Krista is highly regarded as an exceptional teacher and person, known for her comprehensive approach to learning that emphasizes deep understanding over rote memorization. Her classes require significant effort and engagement, particularly through extensive reading, writing, and biweekly participation, but students consistently report gaining substantial knowledge and skills.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Wonderful, wonderful, wonderful! Fantastic teacher, fantastic person. I learned an incredible amount from Krista, I want to take every class she teaches. Class wasn't hard per se, but focuses more on content than grammar in your writing which makes you put a little more focus on your work. I learned a TON, rather than just memorizing information.",
        "course": "WGSST2282"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class was much more work than I expected it to be, although most of it was not very difficult work, it just required a lot of thought. I thought the biweekly participation seemed unnecessary when we also had to respond to the readings separately. Krista does seem to care about the success of her students and will work with you to help.",
        "course": "WGSST236704"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Krista records online lectures, which can be time-consuming to listen to. They don't review the readings,so you have to do both readings and listen to lectures. Bi-weekly participation is tough, but did actually help me learn. There is a LOT of writing and reading, but it did all combine to make sense. I learned a lot, but had to really work for it",
        "course": "2350"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 5,
    "department": "Womens  Gender Studies",
    "firstName": "Anthoney",
    "id": "VGVhY2hlci0yMjQ0ODc5",
    "lastName": "Tenney",
    "legacyId": 2244879,
    "numRatings": 2,
    "summary_comment": "Professor Tenney is highly regarded for his respectful and accessible teaching style, particularly for sensitive subjects, making the class straightforward with minimal homework. Students appreciate his fairness and recommend him enthusiastically. On the other hand, Professor Anthoney is celebrated for his humor and care, providing additional support through open-note pop quizzes and inspiring students with engaging readings.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Im so thankful to have been lectured by Mr Tenney. He teaches very sensitive subject matter in a very respectful way. The class was super easy. Show up, pay attention, and youll pass. Homework was also short and do-able. I highly recommend him. However, if you are politically conservative, I recommend taking a different class for your credit.",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Anthoney is one of my FAVORITE professors ever! He is so funny and caring. He is a feminist and teaches WGSST classes, so that's a plus! He is an easy grader and gives help on pop quizzes with open notes! Just come to class and you'll be fine! The readings are all good readings and I was really inspired by this class.",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.5,
    "department": "Womens  Gender Studies",
    "firstName": "Denise",
    "id": "VGVhY2hlci0yMjE4ODg4",
    "lastName": "Fuller-Delgado",
    "legacyId": 2218888,
    "numRatings": 2,
    "summary_comment": "The professor is highly regarded for her clear feedback, prompt communication, and genuine care for student learning, making her a strong choice for those seeking a supportive academic environment. Conversely, another student found the class to be one of the worst they had experienced, citing excessive reading and a lack of flexibility in grading criteria.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's a wonderful choice for professor.  She leaves clear feedback with her grading, is prompt in uploading work and responding to students (online class), and grades easily.  She's also very understanding and easy to talk to, and really cared about our learning.  I highly recommend her.",
        "course": "WGSS2230"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 4,
        "comment": "Absolute worst class I've ever taken. It was intended to fulfill a GE VPA credit, but this is a SOCIOLOGY class. Way too much reading each week (30-60 pgs of thesaurus vomit) and you have to tell her what she's looking for, you don't get an opinion. Can get an A or B if you put in the time/effort. I wouldn't wish this class/prof on my worst enemy.",
        "course": "WGSST2230"
      }
    ],
    "SEI": []
  }
]