[
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Treva",
    "id": "VGVhY2hlci0yMzA4Nzk3",
    "lastName": "Lindsey",
    "legacyId": 2308797,
    "numRatings": 11,
    "summary_comment": "Professor Lindsey is highly regarded for her intelligence, engaging lectures, and passion for her subject matter. Students appreciate her clear expectations, manageable workload, and the opportunity to learn through various projects and in-class activities. Her classes are described as both intellectually stimulating and enjoyable, with many recommending them enthusiastically.",
    "summary_comment_short": "Professor Lindsey is highly regarded for her intelligence, engaging lectures, and passion for her subject matter, particularly when taught through a hip-hop lens. Students appreciate her clear expectations, manageable workload, and supportive approach during office hours, leading to positive learning outcomes and strong recommendations.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Lindsey is so intelligent and every lecture is so stimulating. On top of that, she's funny, real, and cares about her students deeply. We were graded on a few papers and she's really clear about what she's looking for. The work is super manageable, yet I learned SO much. Take her class!!",
        "course": "WGSST2550"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "There are only four grades for the entire class: an essay, a midterm project, a final project/paper, and in-class assignments. Technically there are weekly readings, but I never did them and was fine. The only time you need them is for the projects. Lectures are super interesting and engaging and you can tell that she is passionate about her work.",
        "course": "WGSST2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Lindsey is so passionate about what she teaches about and it really shows. Grading was a few small projects, attendance, and a few in-class activities that happen without warning (making it very valuable to be there everyday). If you have the chance to take WGSS 2230 with her, definitely do! She teaches it with a hip-hop lens which was so cool.",
        "course": "WGSST2230"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Lindsey is overall such a cool person. I learned a lot from this class, and it was not that hard. As long as you knew the terms, and could expand on them, you could get an A.",
        "course": "WGSST1110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Extremely knowledgable and lively lecturer. Attendance is taken each class but you sign in at the beginning so you can leave early if you want. There are sometimes activities at the end that count as attendance tho so it's risky to leave. Very helpful at office hours. No tests, just a paper, short group midterm project, and individual final project",
        "course": "WGSST2230"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Treva Lindsey taught an amazing pop culture (focusing on hip hop) class. I learned so much I wouldve never expected and she is a very respected woman in her area. We even got to video chat with some well known authors and journalists. There are few grades but if youre willing to participate you will get an A.",
        "course": "WGSST2230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of the most fun professors I've had. Very knowledge and makes the course so relevant. Very few assignments so the course is very manageable. Highly reccomend!",
        "course": "WGST2230"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lindsey is my favorite professor I have ever had at OSU. She is not only brilliant, but a wonderful professor. Her lectures keep you engaged and you can tell she is super passionate about Women's Studies. She's also nice to look at lol. Take any class with her, you won't regret it!",
        "course": "WGSS1100"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "I love her, so passionate. Heavy weekly readings, you never know when there will be a pop quiz. This class is a must take. I declared this subject as my minor because of this class!",
        "course": "WGSST1110"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Lindsay is incredible. She is so passionate about her work and is eager to share what she knows. The textbook readings are a must, but it's manageable. Make sure you read the supplemental readings at the end of the chapter, you'll need it for the 3 page research paper (which wasn't bad). I absolutely loved her! ABSOLUTELY TAKE THIS CLASS!",
        "course": "WGSST1110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Lindsey is AMAZING. No other word to describe her other than a badass. She makes the class so fun and not difficult at all. Throughout the year there are 3 pop quizzes, 1 midterm and 1 final paper. No homework other than the readings. She offers lots of extra credit. Would highly recommend this class with her!!",
        "course": "WGSST1110"
      }
    ],
    "SEI": [
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "18088",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.96"
      },
      {
        "Subject": "WGSST",
        "Catalog": "8800",
        "Class Name": "Topics in Feminist Studies",
        "Class Number": "22987",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2550",
        "Class Name": "History of Feminist Thought",
        "Class Number": "14220",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.94"
      },
      {
        "Subject": "WGSST",
        "Catalog": "7700",
        "Class Name": "Feminist Inquiry I",
        "Class Number": "24371",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "20698",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.89"
      }
    ]
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 5,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Joy",
    "id": "VGVhY2hlci0yMzc3Njk2",
    "lastName": "Ellison",
    "legacyId": 2377696,
    "numRatings": 5,
    "summary_comment": "Professor Ellison is highly regarded for their effective teaching methods and caring approach. Students appreciate the clear and engaging lectures, the accessible grading criteria, and the supportive environment that encourages discussion and understanding. They are seen as both a challenging and fair instructor who genuinely cares about student success.",
    "summary_comment_short": "Professor Ellison is highly regarded for their effective teaching methods and caring approach. Students appreciate the quick handling of material, excellent feedback, and a supportive environment that fosters learning and understanding.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Fantastic prof! Handles everything very quickly. Gives great feedback to make sure you understand everything going further.",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Joy is a wonderful person and a wonderful professor. They truly care about all of the students in the class, and the lectures are really good. I love how we have access to the grading criteria while writing papers, which is really nice. Overall, it was a wonderful class, and I really enjoyed getting to know them.",
        "course": "WGSS3317"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Overall, Joy was caring and passionate about their class. They engaged in discussion with students and assigned amazing readings to discuss in class. They are a fairly easy grader and grade mainly on effort/participation. If you complete assignments on time, you will do great in the class. Joy was my favorite professor this semester!",
        "course": "WGSST2230"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joy is great and really understanding. I struggled in their class, not due to the difficulty of the work, but because of personal issues and they were really gracious and helpful in allowing me to succeed in the class despite my issues. I totally recommend them.",
        "course": "WGST2882"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Joy is one of the best professors I've had at OSU. If you're looking to work hard and learn intersectionally then they're the professor for it. If you're looking for an easy A then they're also the ones for it. They truly understand what it's like to be a student so they're very caring. They're also great at making their classroom a safe space",
        "course": "WGSST3317"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 3.3,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Swati",
    "id": "VGVhY2hlci0yMjg1ODk1",
    "lastName": "Vijaya",
    "legacyId": 2285895,
    "numRatings": 3,
    "summary_comment": "Professor Vijaya is highly regarded for her approachable nature and stimulating course material, which focuses on gender stereotyping and feminism, leading to significant learning outcomes. The workload is manageable, consisting of two weekly discussion posts and two major papers. However, some students have criticized her grading practices, suggesting that grades were easy to obtain and possibly not reflective of individual effort or the quality of work submitted.",
    "summary_comment_short": "Professor Vijaya is highly regarded for her engaging and manageable teaching style, particularly in courses that explore gender stereotyping and feminism through literature. Her classes are praised for their stimulating readings and fair workload, though some students have noted issues with grading consistency and responsiveness to emails.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's a super nice professor. Since I had her for a literature course we read two female focused novels with two major papers and weekly discussion posts. I actually learned a lot more than I thought I would in this class.",
        "course": "WGSST2215"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Readings are stimulating and cover relevant topics in the realm of gender stereotyping and feminism. Work load is 100% manageable, with only 2 discussion posts a week (100 word min) and a midterm and final paper (800-1000 words). Be able to look at a writing thru a feminist or egalitarian lens, and you'll be fine.",
        "course": "WGSST2215"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 1,
        "comment": "She's a nice person... but she's not a great prof. I'm pretty sure everyone in the class got a 100%, because even people who didn't participate in discussions got credit for them. Two discussions a week and one midterm and final paper.. everyone was graded super easily and I'm pretty sure she didn't read them. Terrible about responding to emails.",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Mahaliah",
    "id": "VGVhY2hlci0yMzMyMjMw",
    "lastName": "Little",
    "legacyId": 2332230,
    "numRatings": 4,
    "summary_comment": "Professor Little is highly regarded for her exceptional teaching quality and engaging lectures, which are described as eye-opening and interesting. Students appreciate her accessibility, care, and understanding, and many recommend her classes enthusiastically. The coursework is generally manageable, with assignments that focus on feedback and understanding rather than strict grading.",
    "summary_comment_short": "Professor Little is highly regarded for her engaging and insightful lectures, which are described as eye-opening and interesting. Students appreciate her accessibility, care, and understanding, though some find the second-half readings time-consuming.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "GS classes at UCI\nDr. Little is amazing I highly recommend taking one of her classes. Her lectures are very eye-opening and I am grateful for the opportunity to learn from her. ",
        "course": "WGSST1100"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "This is a very open class and assignments reflect this. Not graded on many things, so just follow the rubric and get feedback before assignments are due. Lectures are interesting. Sometimes the readings in the 2nd half of the semester were a bit time consuming but it was still very manageable. Good GE course, good and important class. Easy A.",
        "course": "WGSST236704"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "ur professor rlly wish they were Mahaliah Little. Seriously the most caring professor i've ever met, it brings me to tears. If all professors were like her, all students would graduate. She's very accessible. Lectures are so interesting. Skin glows. Very understand. 1 midterm paper, 4 assignment and a final +attendance. Not a harsh grade god bless",
        "course": "WGSST236704"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Best TA I ever had.",
        "course": "WGSST1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.4,
    "avgRating": 4.4,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Sujatha",
    "id": "VGVhY2hlci0yMzczMjEz",
    "lastName": "Subramanian",
    "legacyId": 2373213,
    "numRatings": 9,
    "summary_comment": "Professor Subramanian is highly regarded for her passion and dedication to her subject matter, making her courses engaging and valuable. Students appreciate her kindness and care for her students' well-being, though some note the heavy reading load. Her classes are generally easy to navigate with clear expectations, leading to manageable workloads and good grades with minimal effort beyond completing discussions and papers.",
    "summary_comment_short": "Professor Subramanian is highly regarded for her passion and dedication to her subject matter, making her courses accessible and engaging. Her approach emphasizes discussion and minimal required work, focusing on key readings and timely completion of assignments, which leads to favorable grades.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a great teacher that truly cares about her material. I would definitely recommend her for any course. ",
        "course": "2215"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Passionate, great professor. She did not post announcements, but if you go to her weekly class she will communicate. Only downfall is she did not respond to any of my emails, but is an easy grader. Just do the papers and discussion board and you will earn an A.",
        "course": "WGSS2306"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dr. Subramanian is a very kind and knowledgeable professor. All you have to do is the readings and a discussion post. And honestly, you don't have to read all of the papers, I usually just read the discussion question and skim the readings. There's three papers and one project, not too difficult. The weekly zoom isn't even a factor in your grade. ",
        "course": "WGSS2306"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "I love Sujatha so much, she is so sweet and kind and her course is mainly discussion lead. She really cares about her students and takes the time to make sure everyone feels heard. The only downside is the enormous amount of reading you are expected to do (30 or more pages of an academic journal between classes)  and two grades for the class",
        "course": "4520"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Subramanian has been an AMAZING professor. I'm in her online class and everything you need to know is clear cut. Post your weekly discussion posts and do what you need to do and you're fine. She responds to her emails quickly, you can easily set up an appointment in person or through skype if u have any questions. our final exam was a 3-page paper",
        "course": "WGSST1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "This is my second online class with Sujatha and I really enjoyed both of her classes. The subject matter is interesting and I enjoyed learning about it. You don't have to put in a lot of work for a good grade, as long as you answer the discussion questions and complete the papers on time you're pretty much guaranteed an A. Highly recommend!",
        "course": "WGSS2306"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I took this class online for the WGSS minor requirement and it was super easy. She seems like a really caring person and doesn't grade harshly. Every week we only had to respond to a couple discussion questions. The midterm was a few short essays and for the final it was a paper. I'd recommend this class to anyone.",
        "course": "WGSS1100"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "I enjoyed this class, it was lively and had many group discussions. The assignments were few and direct. Only suggestion for improvement is that sometimes the use of Carmen was not well-planned.",
        "course": "WGSST1110"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 1,
        "comment": "Sujatha is a super sweet and passionate teacher. You can tell she really cares about women's issues and I did learn a fair amount in this class. The class is only out of about 100 points but as long as you do the assignments, you will get an A. She does care about attendance but it never went into the final grade (at least it was never in Carmen).",
        "course": "WGSS1110"
      }
    ],
    "SEI": [
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "35414",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "2.85"
      },
      {
        "Subject": "WGSST",
        "Catalog": "3370",
        "Class Name": "Sexualities and Citizenship",
        "Class Number": "35429",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "3.25"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4520",
        "Class Name": "Women of Color and Social Activism",
        "Class Number": "35430",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "3.81"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "36348",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "3.39"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2305",
        "Class Name": "A World of Genders and Sexualities",
        "Class Number": "36349",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.08"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2306",
        "Class Name": "Girlhood",
        "Class Number": "36350",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.35"
      }
    ]
  },
  {
    "avgDifficulty": 1.3,
    "avgRating": 5,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "Madeleine",
    "id": "VGVhY2hlci0yNzY1MTM2",
    "lastName": "McClung",
    "legacyId": 2765136,
    "numRatings": 7,
    "summary_comment": "Professor McClung is known for her efficient grading and prompt feedback, making the class both easy and interesting. Assignments include weekly discussion posts, journals, and a few papers, with some flexibility in accessing required materials through streaming platforms. Despite the ease, the workload can vary, and the class requires active participation to succeed.",
    "summary_comment_short": "Professor McClung is known for her efficient grading and providing timely feedback on assignments, making her class both easy and interesting. Students appreciate her responsiveness to emails and the structured yet manageable workload with weekly discussion posts, journals, and a few papers.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "She grades very quickly and provides good feedback on almost every assignment. The class was very easy and interesting. There are weekly discussion posts and journals as well as a couple papers. Have access to many steaming platforms for the weekly shows/movies or access them in other ways. ",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "She answered emails very quickly, which was nice for the final (which is a presentation of sorts). There is a discussion post and \"journal\" (200ish words) due each week. Pretty easy, although I found some weeks to be heavier than others. Some assignments/final take some thought",
        "course": "WGSST2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is great. She grades fast and always provides feedback. She encourages questions and is quick to respond. The class on the other hand, I hated it. I'm not saying that I didn't learn anything, because I did. Don't take the class if the title does not sound appealing to you.",
        "course": "WGSST2230"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "class was super easy. every week you do a journal (200 words), discussion (150-200) and one response (150). you dont have to read all the required articles/watch the shows. this class does require you to have some streaming services. Just do the assignments and more than likely you will get a 100% on it. \n",
        "course": "WGSST2230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Madeleine cares about her students and wants them to succeed. Just follow directions and you will receive full credit on everything. Lectures are entertaining and coursework is engaging and thought-provoking. Not a lot of work but very interesting. ",
        "course": "WGSST2230"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is amazing! Her class is easy; it is just weekly reading articles and watching shows. Then you will make a journal entry and discussion post about the content. Just remember to actually do the assignments on time. She understands that things happen and takes in late-work if you notify her. She is passionate about this topic and us as students. ",
        "course": "WGSST2230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Madeleine cares about her students and wants them to succeed. There are weekly modules where you have to do a few readings and watch some shows. As long as you participate in the weekly discussions, weekly journals, and responding to a peer's discussion post you will be fine. There is a final project at the end but it is not too difficult. ",
        "course": "WGSST2230"
      }
    ],
    "SEI": [
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "28536",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.83"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "38050",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.88"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "38051",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.88"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "38176",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.88"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "28865",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.83"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "30140",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.63"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "30312",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.71"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "35149",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.68"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "37681",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.83"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "31475",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.81"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "36793",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.8"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Women's Gender amp Sexuality Studies",
    "firstName": "A.",
    "id": "VGVhY2hlci0yMzA3MTY5",
    "lastName": "Ranjbar",
    "legacyId": 2307169,
    "numRatings": 1,
    "summary_comment": "Professor Ranjbar excels in making complex global situations accessible and relatable, fostering a deep understanding among her students. She is highly respected for her intelligence, fairness, and genuine concern for her students' well-being, positioning herself as one of the top instructors at OSU.",
    "summary_comment_short": "Professor Ranjbar excels in making complex global situations accessible and relatable, and is renowned for her caring approach and deep understanding of students' lives. She is consistently praised for her intelligence, fairness, and effectiveness as an instructor, positioning her as one of the top professors at OSU.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Ranjbar has a way of making situations from around the globe feel familiar and understandable which makes learning about them that much easier. She truly cares about the lives of her students and is a deeply understanding person, all while being an extremely intelligent and fair instructor. Undoubtedly one of the best professors at OSU.",
        "course": "WGSS2305"
      }
    ],
    "SEI": []
  }
]