[
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Womens & Gender Studies",
    "firstName": "Varsha",
    "id": "VGVhY2hlci0xOTAzNzQ3",
    "lastName": "Chitnis",
    "legacyId": 1903747,
    "numRatings": 1,
    "summary_comment": "Professor Chitnis is diligent in her efforts to assist students, putting significant effort into her teaching. She does not use a textbook, relying instead on scanned readings that can be challenging to understand at times. While quiz questions can be somewhat confusing, the material is generally straightforward, and students who put in the effort tend to perform well.",
    "summary_comment_short": "Professor Chitnis is diligent in her efforts to assist students, putting significant effort into her teaching. While her lectures are effective, some students find the scanned readings challenging and occasionally experience confusion with quiz questions, though these are generally straightforward.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Can tell she is trying to help.Diligent. No textbook but a lot of scanned readings. Some readings are hard to understand and quiz questions sometimes a little bit confusing (they are relatively easy though)put effort in = good grade. So far OK.",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 1,
    "department": "Womens & Gender Studies",
    "firstName": "Katherine",
    "id": "VGVhY2hlci0zMDQzNzYw",
    "lastName": "Roos",
    "legacyId": 3043760,
    "numRatings": 1,
    "summary_comment": "Professor Roos graded assignments inconsistently, primarily using a complete/incomplete system with little feedback until near the semester's end. The course offered easy assignments and extra credit opportunities, but overall grading was perceived as lacking rigor and clarity.",
    "summary_comment_short": "Professor Roos graded assignments inconsistently, primarily using a complete/incomplete system, and did not begin grading until near the end of the semester. The course offered easy assignments and extra credit opportunities, but the overall grading approach was perceived as uneven.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Graded almost everything complete/incomplete. Didn't grade anything from the first couple weeks until towards the very end of the semester. Grading was inconsistent also. Extra credit made available. Easy assignments.",
        "course": "WGSST-1110"
      }
    ],
    "SEI": []
  }
]