[
  {
    "avgDifficulty": 2.5,
    "avgRating": 4,
    "department": "Women's Gender  Sexuality Studies",
    "firstName": "Juno",
    "id": "VGVhY2hlci0yMjU0Mzkz",
    "lastName": "Parreñas",
    "legacyId": 2254393,
    "numRatings": 2,
    "summary_comment": "Professor Parreñas excels at selecting relevant course material and fostering engaging discussions. While her lectures can be somewhat disorganized, she sets clear expectations and uses group projects effectively. Despite occasional issues with grading, the overall class atmosphere remains relaxed and enjoyable.",
    "summary_comment_short": "Professor Parreñas excels at selecting relevant course material and fostering engaging discussions, though she occasionally struggles with organization. Despite this, she sets clear expectations and incorporates enjoyable group projects into her final assessments, creating a generally positive and energetic classroom environment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Parre&ntilde;as really know how to pick material and create good class discussion. Dr. Parre&ntilde;as is a bit unorganized but has very clear expectations. She enjoys using group projects as part of the final project. Overall fun and good energy person.",
        "course": "WGSS3101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Juno is clearly very intelligent. However, she didn't put in any grades in Carmen for the entire semester, and it turns out that the take-home final was basically 100% of our grade, which freaked everyone out. I got an A, but Im hesitant to call it an easy A, because I'm a good writer and I don't know how others did. The class is super chill though",
        "course": "WGSST2296H"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4,
    "department": "Women's Gender  Sexuality Studies",
    "firstName": "Tess",
    "id": "VGVhY2hlci0yMjUyMTYz",
    "lastName": "Cumpstone",
    "legacyId": 2252163,
    "numRatings": 3,
    "summary_comment": "Professor Cumpstone is highly regarded by some students for her passion and creativity in teaching, as well as her ability to connect with students personally and foster a learning environment that encourages engagement and passion for the subject matter. However, other students find her challenging due to unclear exam prompts and overly stringent grading, feeling she may not fully understand how to effectively communicate complex concepts.",
    "summary_comment_short": "Professor Cumpstone is highly regarded by some students for her passion and creativity in teaching, as well as her approachability and humor. However, others find her difficult to follow due to unclear explanations and harsh grading, and believe she may not fully understand the general education context of her students' needs.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 2,
        "comment": "Tess seems like a chill person but she is just straight up not a good professor. She is clearly into the course material but has absolutely no idea how to explain it. Her exam prompts are unclear and she grades irrationally hard. She also does not seem to realize that literally, every person is taking this class as a GE credit.",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Tess is amazing! She always made sure you were well-prepared and answered questions quickly and well thought out. If you can take her, you should. She is sweet and funny and isn't afraid to curse in front of her students. She gave us a feminist sex ed lesson and it was great. She really wants you to learn and be passionate about the content.",
        "course": "WGSS2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Tess is amazing; she's funny and super smart. It's clear she's passionate about what she's teaching and she knows a lot about it in lectures. Her lectures were also super creative to facilitate learning. She connects with her students on a personal level and really nice. The class requires a lot of reading and writing, so be prepared.",
        "course": "WGSS1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Women's Gender  Sexuality Studies",
    "firstName": "Tatiana",
    "id": "VGVhY2hlci0yMjQ2ODcx",
    "lastName": "Faria",
    "legacyId": 2246871,
    "numRatings": 1,
    "summary_comment": "Professor Faria is highly regarded for her passion and care for her students, making the class both enjoyable and educational with interesting discussions. Students find her approachable and note that the course is relatively easy to excel in while gaining significant knowledge.",
    "summary_comment_short": "Professor Faria is highly regarded for her excellent teaching quality, characterized by her passion and genuine care for her students, which makes the learning experience both enjoyable and educational. Students find her classes engaging with interesting discussions, leading to significant learning outcomes.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "The teacher was very sweet and passionate. She clearly cares about her students. Easy A. Interesting discussions. Learned a lot",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  }
]