[
  {
    "avgDifficulty": 2.2,
    "avgRating": 3.1,
    "department": "Women's Studies",
    "firstName": "Nancy",
    "id": "VGVhY2hlci04MDE5MDM=",
    "lastName": "Jesser",
    "legacyId": 801903,
    "numRatings": 29,
    "summary_comment": "Dr. Jesser is dedicated to her students, providing detailed feedback and passionate about her subject matter, though her lectures can be dry. Her courses require significant reading and writing, with a focus on group discussions rather than traditional lectures. While some students appreciate the challenging workload and meaningful assignments, others find the class demanding and the grading process unclear, with some perceiving her as passive-aggressive or overly critical.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Jesser is great. She really cares about her students and always makes the effort to provide detailed feedback. Lectures can feel dry, but she takes care to assign interesting and thought-provoking material. There might be more work than than in a typical GE course, but in my experience, you get out of this course what you put into it. ",
        "course": "COMPSTD3645"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Dr. Jesser is a nice professor who's passionate about her work and is quick to respond to emails. She grades for content and idea development, not for your ability to write well which is appreciated. The course requires a very large amount of reading for a GE and quite a few 3-4 page papers, but class time consisted primarily of group discussions.",
        "course": "COMPSTD3645"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Classes is mainly group work. She talks a lot and its easy to get distracted. Shes kinda passive aggressive on the comments for assignments, and expects way to much for a shortened course. She also does not give out grades until the semester is over. Classes is heavy and its a lot of reading",
        "course": "COMPSTD236704"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful. This work load was unlike anything I could fathom a teacher would genuinely find reasonable. Once a week we had 2-3 page papers and we had 2 1800 word papers, 1 2600 word paper and a 40 minute presentation. On top of that, she doesn't give you your grades until the end of the semester. How messed up?????",
        "course": "COMPSTD236704"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 1,
        "comment": "I thought the class's content itself was pretty fun. I didn't like the way the discussions worked and felt it was forced when the content that was given to us was very straightforward in what it was trying to say. Most discussions felt dry and unengaging. There was a good bit of reading though she tells you what you're supposed to pick out of them.",
        "course": "COMP36702"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 1,
        "comment": "Took her for Comp Studies 3645. Nancy is a bit dry and boring as a lecturer. Think she means well but just socially a bit awkward. Sometimes gets lost while lecturing or talks in weird circles. Papers are graded very easily. Try's to facilitate group discussion but she's so monotone in her talking no one wants to participate. Take for an easy A.",
        "course": "COMP36702"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 2,
        "comment": "She cares about her work and class and is available for help. Sometimes it can be difficult to understand what she is meaning to say and the lectures can be a drag, but overall she teaches well and makes the topics intresting.",
        "course": "COMPSTD2341"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 3,
        "comment": "Makes literally everything more difficult than they need to be. Doesn't upload grades in an intuitive way (Carmen) so you're left wondering what your grade is for the entire semester. Takes &quot;playing devil's advocate&quot; to another level. It got to the point where she would just ask unnecessary questions. Unclear grading criteria. Avoid her if you can.",
        "course": "COMPSTD236704"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Nancys good at facilitating class discussions that make class engaging. Lots and lots of reading (if you actually do it...). Can get by by only reading the books you are writing your papers on tho. Did this and ended with an A. A good choice for a lit and global studies gen ed. I like easy classes and this wasnt too bad. Sometimes boring tho.",
        "course": "COMPSTD2104"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 2,
        "comment": "Dr. Jesser embodies the idea of &quot;speaking a lot without saying anything at all.&quot; She routinely cut off students to interject with her own point, she would forget her own deadlines then be surprised when no one turned anything in and send the whole class a scathing email, and her grading schemes were awful. Avoid her if you can",
        "course": "COMPSTD236704"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "I dreaded going to class every single day. Classes are boring and discussion-based, where she would play devil's advocate after every single point being made. She goes to the extreme in order to prove an irrational and irrelevant point. She is totally disorganized and the class does not have a set structure. Not a hard class but wouldn't take again",
        "course": "COMPSTD3645"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 2,
        "comment": "I really liked Dr. Jesser but I can see why other people found her boring. It took her a while to get comfortable with the class. She was good at pushing discussions further and making us question ourselves. With all of that said, I would not recommend her if you aren't genuinely interested in class material. She gives papers but grades easily.",
        "course": "CS4597"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 2,
        "comment": "She is very knowledgeable about the material and readings in class but very boring. She is a pretty easy grader on papers and group projects. Some of the material in class can be interesting but usually sitting through class is painfully boring, but you receive 2 points per class for attending and answering a question about the assigned reading.",
        "course": "COMPSTD4597"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 2,
        "comment": "Very nice teacher, a little bit boring. A lot of group project and 3 papers. Attendance is mandatory, she will pass an attendance sheet.",
        "course": "COMPSTD236704"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was not interesting for me at all. I read none of the readings. I simply attended every discussion and copied down the discussion points and regurgitated them on the 2 page papers due every week, receiving A's on every single one of them. I would recommend it as an easy A, but the discussions got old. Women are underprivileged. I get it.",
        "course": "CMPST535"
      },
      {
        "index": 16,
        "rating": 4,
        "difficulty": 1,
        "comment": "The class was a fair grade.  Since the midterms are take home, as long as you are a good writer, you shouldn't get anything lower than an A-.  Make sure during the group presentation you choose a topic that will get the class talking.  Overall a fair class and pretty easy to get an A.",
        "course": "CS272"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "Dry reading, but if you talk in class and do the reading you'll get a decent grade. She's really nice and will look over drafts/give feedback on ideas. Not a particularly hard grader. Attendance points! If you can stick it out through some dry reading and you're not a horrible writer, take this class for a fair A.",
        "course": "WS535"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 3,
        "comment": "Some of ya'll must be crazy or brain dead. I took Gender and Science with Dr. Jesser in Fall 2008 and class sessions were SO interesting that I was always disappointed when it was time to leave. YES, some of the reading material was dry, but it ALL pertained to important theoretical concepts! Jesser's class was the reason I pursued a WS minor!",
        "course": "WS535"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "She had a way of draining a subject dry...to the bone. When you thought there was nothing more possible to say about a topic she would find something. She purposely tried to take the opposite stance on a subject to &quot;challenge&quot; your thoughts. I understand what she was trying to do but it got old, quick. Nobody in my group ever wanted to talk to her.",
        "course": "CMSTD597"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 2,
        "comment": "Good teacher, smart and easy to talk to. Material she picked was BORING though. 3 papers, 1 group project and daily quizzes that you were guranteed 50% just for writing your name (seriously). The best advice for her class is definitely that you should pick the people you work with carefully, as you'll be working with them on everything all quarter.",
        "course": "COMP597"
      },
      {
        "index": 21,
        "rating": 2,
        "difficulty": 2,
        "comment": "like everyone on here said..very very boring class, but easy if you can make it through the lectures. pick your group wisely because you will work with them all quarter. 3 5 page papers and 1 group presentation. papers are easy. i got an a.",
        "course": "COMP597"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "The class is based on group discussions.  There are 3 papers to write throughout the quarter, and a group presentation.  The subject matter was interesting and she is a very smart teacher.",
        "course": "CMPST597"
      },
      {
        "index": 23,
        "rating": 2,
        "difficulty": 2,
        "comment": "completely unclear about what we needed to do for most of the quarter. very boring. she is smart, but she just isn't cut out for teaching.",
        "course": "COMP518"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class is merely discussion only, 3 pt quizzes offered to track attendance. Not open to students opinions, not impressed with her attitude.",
        "course": "COMP597"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 2,
        "comment": "Super boring, reminds me of a bad high school teacher. But her class is a breeze if you have any common sense.",
        "course": "COMP597"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 2,
        "comment": "Lectures are boring but the class only consisted of two papers and an in class led discussion. Very easy if you pay attention.",
        "course": "COMPS272"
      },
      {
        "index": 27,
        "rating": 4,
        "difficulty": 1,
        "comment": "Keep up with the readings, put some thought into the three short papers, and try to go to every class.  Lectures can be really long and boring, but the discussion is the meat of the course.  Also, there's a final project/paper.  Overall, decent class.",
        "course": "WSCS535"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Easy, Just go to class and 3 papers. Not very clear on what was needed.",
        "course": "COMP36702"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's just another liberal more concerned with promoting her personal views than teaching the class.",
        "course": "CS36702"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.7,
    "department": "Women's Studies",
    "firstName": "Jennifer",
    "id": "VGVhY2hlci0xMjY2OTk3",
    "lastName": "Suchland",
    "legacyId": 1266997,
    "numRatings": 7,
    "summary_comment": "Professor Suchland is highly regarded for her supportive and engaging teaching style, often checking in on students' well-being and encouraging their interest in the subject matter. However, the class is noted for its demanding workload, including extensive reading and challenging assignments, which some find overwhelming and poorly structured.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of my favorite professors at the university! She never knew I was struggling with my mental health but always checked in on me when I wasn't participating. She encouraged me to complete my work and made the class one I looked forward to reading up on. I'm really interested in Russian culture and I'm glad I got to take this class :)",
        "course": "RUSSIAN2335"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "media provided to read or watch was always very confusing and hard to understand, plus oddly worded discussion boards and quizzes",
        "course": "RUSSIAN2335"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Really chill and gives you opportunities to focus on what interests you. Very understanding if you are having issue with interesting lectures and not much homework.",
        "course": "RUSS3350"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Suchland is really easy-going and nice. Her lectures are interesting and keep you engaged. The assignments are difficult, but she will work with you and give extensions if needed. The readings are long, however; she will tell you if you can just skim it. Overall, she's great and the class is really informative.",
        "course": "SLAVIC5450"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor!  She is very well-informed and always knows what she is talking about.  Contents are super packed, thus, you will have to do a lot of reading outside of class.  And by a lot, I mean A LOT.  She is helpful and is glad to answer your questions.  Attendance and participations are required.   ",
        "course": "IS2250"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Cool lady, horrible class. Consists of an insane amount of reading every night, an impossible midterm, an irrelevant paper and a &quot;creative&quot; project that you supposedly have freedom to do whatever you want on, but she then criticizes you for not doing it in a way she would have preferred. So why doesn't she just make guidelines for it&#63; Who knows.",
        "course": "WS505"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "nice teacher, bad assignments. your grade is made up of 4 papers a group project and participation. i HATED the group wiki project. very difficult and annoying. there is a TON of reading and towards the end the reading is pointless b/c you arent tested on it and there are no more papers to use it for. attendance mandatory. papers were confusing.",
        "course": "WS505"
      }
    ],
    "SEI": [
      {
        "Subject": "RUSSIAN",
        "Catalog": "3350",
        "Class Name": "Russian Culture and Politics",
        "Class Number": "34331",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "2335.99",
        "Class Name": "Magnificence, Mayhem, and Mafia: Russian Culture",
        "Class Number": "24698",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.5"
      },
      {
        "Subject": "RUSSIAN",
        "Catalog": "2335.99",
        "Class Name": "Magnificence, Mayhem, and Mafia: Russian Culture",
        "Class Number": "29878",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Slavic/East European Eurasian",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "29",
        "Rating": "4.66"
      },
      {
        "Subject": "WGSST",
        "Catalog": "3575",
        "Class Name": "Feminist Methodology",
        "Class Number": "34719",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.57"
      },
      {
        "Subject": "WGSST",
        "Catalog": "5450",
        "Class Name": "Global Human Trafficking: Realities and Representations",
        "Class Number": "36582",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "7701",
        "Class Name": "Feminist Inquiry II",
        "Class Number": "22368",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "7701",
        "Class Name": "Feminist Inquiry II",
        "Class Number": "28055",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.56"
      }
    ]
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.8,
    "department": "Women's Studies",
    "firstName": "Lindsay",
    "id": "VGVhY2hlci0xMTAxMTMw",
    "lastName": "Bernhagen",
    "legacyId": 1101130,
    "numRatings": 6,
    "summary_comment": "Lindsay is highly regarded as an exceptional educator, known for her deep knowledge of the subject matter and her ability to build strong connections with students, making the learning experience both enjoyable and effective. She is praised for her fairness, helpfulness, and willingness to assist students, fostering a supportive and engaging classroom environment. Students consistently recommend her class, noting its accessibility and the significant learning gains achieved.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lindsay is so amazing! She is an incredible educator, really know her stuff. The best part about her as a professor is she makes a true relation/connection with her students, and very caring. Grading is great, and she has really taught me a lot. Assignments are pretty easy, and discussions in class are really interesting and educating.",
        "course": "EDUC205"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had this teacher for comparative studies just this last Autmun quarter and she was excellent. She is extremely helpful and laid back. She seems more like a fellow student who is really willing to help you rather than a strict professor. I learned a ton in her class and became a better writer as well. TAKE THIS CLASS IF YOU HAVE THE OPPORTUNITY!",
        "course": "COMPT367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Professor Bernhagen is one of the sweetest lecturers. Totally articulate, really fair grader, and always ready to help students with their grades. She's also a cutie with a killer figure, but that's just the icing on top of her academic greatness.",
        "course": "COMP240"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Lindsay is an awesome teacher. She is so nice, so fun, and very informative. I very much recommend her because going to her class and having a discussion is very similar to sitting around chatting with friends. She's great!",
        "course": "COMST367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very easy to do well in her class if you do the readings. You can email her at any time with questions or paper drafts and she will give you feedback. Keep an open mind and you will learn alot in this class.",
        "course": "WS367"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "WS367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.9,
    "avgRating": 4.7,
    "department": "Women's Studies",
    "firstName": "Linda",
    "id": "VGVhY2hlci01NTc1ODM=",
    "lastName": "Mizejewski",
    "legacyId": 557583,
    "numRatings": 28,
    "summary_comment": "Professor M is highly regarded for her engaging and supportive teaching style, though some students find her lectures and class format somewhat traditional. She emphasizes regular attendance, offering substantial points for participation and providing helpful feedback on assignments. Students appreciate her approachable nature and the enjoyable content, including films and discussions, although some find her class structure and attendance policies strict.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 2,
        "comment": "I was kinda surprised to see such high reviews. She seems like a nice person, but her class was very dull and taught just by lectures. Kind of felt like a high school class. And attendance was way too strict - you have 2 absences allowed for any reason, including being sick, if you miss any more your grade drops from an A to an A- or A- to B+, etc.",
        "course": "WGSS4527"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very friendly and easy to talk to, assignments and exams weren't too difficult. However, DO NOT MISS CLASS. She will take lots of points off for missed classes since a large portion of the grade is participation-based. Show up to class regularly and participate and you'll be fine.",
        "course": "WGSST2317"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "take the first year seminar with her! super caring professor who makes you think about love in different ways, very clear grading, and weekly readings, two movies, and a group project. very interesting and easy class taught by someone who is super sweet.",
        "course": "WGSS2326S"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mandatory attendance which is annoying, but if you pay attention in the lectures and watch the movies you can get an easy A. Offers to review your papers before submission which is a big plus. Definitely cares about student's success.",
        "course": "WGSST4527"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Easy as long as you attend lectures. She gives you 2 tries on the quizzes. I loved the films she picked they were all great. Overall a good Professor and an interesting class.",
        "course": "WGSST2317"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "I've taken three classes with Prof. M. and loved them all. She picks fun films to watch and the readings are helpful rather than boring. Her lectures are concise and facilitated discussions are always interesting and engaging. She's a professor that makes you want to participate and her exams, a midterm and a final, are easy if you take notes.",
        "course": "WGSS4527"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "I can't say enough good things about Dr. M and this class. Highly recommend for anyone considering a service learning class. Had a fair amount of readings, but only met once a week instead of 2 because of our SL. Dr. M is incredibly sweet and a great professor, I hope I can take another class with her!",
        "course": "WGSST2326S"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 1,
        "comment": "She was such a great professor! I loved this class so much. Sometimes we had a decent amount of reading, but everything we read was really informative and helpful. Her quizzes and papers were very reasonable. Prof M is really funny and made every class worth going to. If I get the chance to take another one of her classes, I will!",
        "course": "WGSS2326S"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 3,
        "comment": "A lot of reading and watching movies but all worth it",
        "course": "WGSS4527"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Mizejewski is hilarious, kind, interesting and wonderful. Her class is amazing and engaging and fun. TAKE IT.",
        "course": "WGSS4527"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loved this course! She is a great lecturer, very interesting and funny. Shows a lot of films in class. Easy quizzes/2 tests, attendance, and two short papers make up your overall grade. One reading quiz and one movie quiz are dropped. Just come to class, skim the readings, and watch the movies and you will not only get an A but have fun doing it.",
        "course": "WGSST317"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class is an easy A and yet you still learn a lot. Movie quizzes are v easy if you watched it, reading quizzes you're given a study guide with the potential questions. Midterms and exams also have a guide.",
        "course": "WGSST317"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 2,
        "comment": "Lots of quizzes but as long as you actually watch the movie/skim the material they're easy. She shows lots of film clips in class which I appreciate. She has a lot of energy and even in a larger class she still knew all of our names.",
        "course": "WGSS4527"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 1,
        "comment": "She's lively and brings excitement to the classroom. Movie quizzes are super easy, as long as you actually watch the film. Reading quizzes are relatively simple (provides a study guide). Readings hardly show up on exams. Provides a study guide for midterm and final. Must attend class (allowed 2 absences before half a letter grade is taken away).",
        "course": "WGSS4527"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class. You learn a surprising amount for the topic, bottom line is she's amazing and you'll pass if you try a little bit.",
        "course": "WGSS4527"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "Quizzes were very straightforward a easy if you readwatched the film. Tests are easy because she gives you a study guide. As long as you study that, you'll do fine. She's very sweet and enthusiastic. Never not smiling. I took this just for my visual arts credit but ended up learning way more than I anticipated. She's a wonderful prof. ",
        "course": "3317"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class was wonderful, as was Mizejewski. She is very passionate about the subject and does all she can to help you understand. She is very thorough. Plus her energy is fantastic.",
        "course": "WGSS4527"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Amazing professor! The class was really interesting and the material was manageable. Take it!",
        "course": "ENG4527"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took Women, Hollywood and Film in Fall 2011, and I enjoyed it very much! She was a great lecturer, even though I'm sure lecturing in the gateway with all her students' faces barely visible in the weird lighting must have been weird. Very helpful, very nice, and I always recommend this class to whoever is open minded :)",
        "course": "WGSST317"
      },
      {
        "index": 20,
        "rating": 5,
        "difficulty": 2,
        "comment": "Excellent professor, had her for Hollywood, Women and Film. Not only did she give detailed analysis of scenes in class, she also pointed out what she would be testing and even *gasp* eliminated a problem on a test because too many people had gotten it wrong. Be sure to show up for class, you won't regret it!",
        "course": "WGSST317"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 2,
        "comment": "I had her for Women in Film Noir, she's definitely one of the best profs in the WS department.  She's super-nice and really dedicated to teaching, her class is a lot of fun.",
        "course": "WS317"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "Professor Mizejewski is so excited about teaching, and her energy level in the class could make anyone interested in the topics she lectures on. I took her film class about women in film, and it was interesting and it challenged my thinking.",
        "course": "WOM317"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love this class! You don't really need to read for class, but you definitely have to for the quizzes and tests. She made the class really interesting and easy to understand. I LOVED this class.",
        "course": "WMST317"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 1,
        "comment": "This class is easy. She give you everything you need to know in her powerpoints. She only allows two absenses and it helps to go to class and listen. There's one paper and every other class is a film. She discusses what's important. Take it you won't regret it...",
        "course": "WS317"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. M is such a great professor. She really knows what she's talking about. She's really enthusiastic and makes it easy to stay engaged throughout the whole class. Class is not hard at all if you show up. I would definitely take another class with her and recommend this one to anyone.",
        "course": "WOMST317"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is extremely knowledgeable and enthusiastic.",
        "course": "527"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. M, as you could call her, is extremely well-organized,highly knowledgeable, and integrated technology rather well into her pedagogy. She encourages students to run their drafts by her and offers very helpful comments in the process. Her choice of films for WS527 struck a fine balance between breadth & depth. &quot;Gender and Horror&quot; was enjoyable!",
        "course": "WS527"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great lecturer.  Very excited about her topic.  She's one of those knows too much for her own good professors, but it comes across well in class.  I actually learned alot from this class.  You would think that women in horror film would be generic and basic at best, but mizejewski made it fun.",
        "course": "WS520SOMETHING"
      }
    ],
    "SEI": [
      {
        "Subject": "ARTSSCI",
        "Catalog": "1137.03",
        "Class Name": "First-Year Seminar",
        "Class Number": "26372",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "15",
        "Rating": "5"
      },
      {
        "Subject": "ARTSSCI",
        "Catalog": "1137.03",
        "Class Name": "First-Year Seminar",
        "Class Number": "28632",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4.8"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2326",
        "Class Name": "Feminist Perspectives on Addiction",
        "Class Number": "35835",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.76"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4527.01",
        "Class Name": "Studies in Gender and Cinema",
        "Class Number": "22477",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "22",
        "Rating": "4.73"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2317",
        "Class Name": "Introduction to Gender & Cinema",
        "Class Number": "27553",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "28",
        "Rating": "4.93"
      },
      {
        "Subject": "WGSST",
        "Catalog": "8800.03",
        "Class Name": "Topics in Feminist Studies",
        "Class Number": "28249",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "N/A",
        "Class Name": "Feminist Perspectives on Addiction, Service Learning",
        "Class Number": "23153",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4527",
        "Class Name": "Studies in Gender and Cinema",
        "Class Number": "20500",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "27",
        "Rating": "4.96"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2317",
        "Class Name": "Gender at the Movies: Hollywood and Beyond",
        "Class Number": "14181",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "31",
        "Rating": "4.81"
      },
      {
        "Subject": "WGSST",
        "Catalog": "7790",
        "Class Name": "Research and Writing Workshop",
        "Class Number": "22369",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4527.02",
        "Class Name": "Studies in Gender and Cinema: The British Horror Film in London",
        "Class Number": "23287",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "14",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2326S",
        "Class Name": "Feminist Perspectives on Addiction, Service Learning",
        "Class Number": "26377",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "WGSST",
        "Catalog": "8800.01",
        "Class Name": "Topics in Feminist Studies",
        "Class Number": "26247",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2317",
        "Class Name": "Gender at the Movies: Hollywood and Beyond",
        "Class Number": "35626",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "62",
        "Rating": "4.89"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2326S",
        "Class Name": "Feminist Perspectives on Addiction, Service Learning",
        "Class Number": "28637",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.89"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4527.01",
        "Class Name": "Studies in Gender and Cinema",
        "Class Number": "26558",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.79"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2317",
        "Class Name": "Gender at the Movies: Hollywood and Beyond",
        "Class Number": "30436",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "63",
        "Rating": "4.86"
      },
      {
        "Subject": "WGSST",
        "Catalog": "7701",
        "Class Name": "Feminist Inquiry II",
        "Class Number": "27800",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Melissa",
    "id": "VGVhY2hlci0xMTQwMjY1",
    "lastName": "Wiser",
    "legacyId": 1140265,
    "numRatings": 27,
    "summary_comment": "Professor Melissa Wiser is perceived as strict and demanding, with some students praising her for acknowledging hard work and valuing class participation, while others find her classes boring, irrelevant, and poorly graded. Her teaching style and expectations vary widely among students, with some appreciating her high standards and others finding her approach frustrating and unengaging.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": " She thinks that her class is the only thing going on in all of her students lives. The way that she interacts with people is rude and borderline insulting. If you don't show up to one of her classes expect an extremely rude and disgusted look. The classes are boring and there is no correlation to the course work with any of the lectures.",
        "course": "KNSISM5610"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Melissa Wiser was my favorite professor I've had at OSU. If you put in the effort to speak in class and go up to her after to ask for feedback, she will acknowledge your hard work. As long as you do your work and actually participate in class, you will do well in her classes!",
        "course": "KNSISM5614"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "Strict, assigned seating, can't use word &#8220;interesting&#8221; in papers. Boring classes.",
        "course": "KNSISM5610"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 2,
        "comment": "Terrible. Does not care about student and does not give anyone good grades. Get ready to read a crap ton and ONLY talk about what was in the readings for entire classes. ",
        "course": "KNSISM5614"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "It is clear she cares about her students, however extremely dull and most irrelevant information for this major. She also is a slow grader that will leave you to guess what grade you have just days before finals and graduation.",
        "course": "KNSISM4900"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wiser is a gem if you put in even an ounce of effort into her classes. As long as you respect the class and consult the readings beforehand, you will be perfectly fine. There are so many things that you can learn from this course (and Dr. Wiser) that are truly valuable beyond the classroom if you just take a moment to listen to her insight. ",
        "course": "KNSISM4900"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 2,
        "comment": "The content is not relevant to the class. There are things such as which fork is needed in fine dining and the class is about internships in sports. Takes forever to grade even though its an asynchronous class with minimal work. The modules are all copy and pasted with old information. She gives no effort and her questions are poorly worded. AVOID",
        "course": "KNSISM3189"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "I'm not sure why everyone doesn't like Prof. Wiser. She was honestly great. Yes tough, but put in the work and show up to class and you'll be great. She expects hard work and likes class participation (she will probably like you more if you participate). I would like to have her again, and she told me at the end of the semester I did a great job!",
        "course": "KNSISM4900"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Dr. Wiser's online class was well organized, and I understood her grading criteria. The content was all relatable and useful for the class even though it sometimes felt tedious.",
        "course": "KNSISM3189"
      },
      {
        "index": 10,
        "rating": 2,
        "difficulty": 4,
        "comment": "Don't take this class if you don't have to. Lectures are very vague and if you have questions, don't expect clear or any answers (especially to emails). The final is a ton of work and makes you want to rip out all your hair. She has the expectation that everyone wants to pursue research after graduating.",
        "course": "KNSISM4900"
      },
      {
        "index": 11,
        "rating": 3,
        "difficulty": 3,
        "comment": "Participation and being in class is so important, especially since she is the only professor I know that makes you turn in hard copies and on carmen. She genuinely cares about teaching so I would say if you take any class take this. Good discussion, just keep up on the readings or at least skim them.",
        "course": "KNSISM5614"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is the worst professor Ive ever had. She expects way too much, and thinks her class is the most important. I learned nothing from the class, because I was so focused on turning in all the assignments. She is a very tough grader, and takes months to grade things. Would avoid at all costs.",
        "course": "KNSISM5610"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrendously tough grader. I wish this class wasn't mandatory for my major or they'd get a new professor to teach it.",
        "course": "KNSISM4900"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 4,
        "comment": "I had Dr. Wiser for three classes during my undergrad and as much as they were a pain at times, I actually had to try. You can sleep walk through a lot of classes and still get a decent grade but not with her. Yes, she was tough and yes, she expects more out of you for an A in the class. Unless you're lazy, unmotivated or both, she is respectful.",
        "course": "KNSISM3189"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 2,
        "comment": "How she is employed at a major university is mind blowing. The cashiers at McDonalds have better communication &amp; people skills than her. Wouldn't doubt that they have a higher IQ than her too. Keep politics out of the classroom and stop crying that your candidate lost because you act like a kid crying at the grocery store for not getting candy",
        "course": "KNSISM3189"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Wiser is a tough professor but if you try hard enough and actually have some care for what she's teaching then her classes are incredibly valuable and engaging. You don't have to buy -in to everything she says, but if you make the effort to engage and participate with the material regardless she will be more amenable.",
        "course": "KNSISM5614"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Wiser is above the rest, she is very passionate about the class and she throughly cares for the subject. Even though her classes aren't a walk in the park, if you participate and engage in lectures then you can be one of her favorite students. Take advantage of learning from her.",
        "course": "KNSISM4900"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 4,
        "comment": "Her treatment of a class that is ludicrous and patronizing at its core is absolutely revolting. The class outlines how to act in the professional realm which in itself is a useless lesson as all students taking the class have successfully landed a job. She treats the class as if it is nuclear physics and grades way too tough. Avoid at all costs",
        "course": "KNSISM3189"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 4,
        "comment": "She is the worst. Seriously, the worst.",
        "course": "KNSISM5626"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is absolutely terrible. You can't ask her a question without her making you feel dumb. She doesn't explain much detail on her lectures and just overall is brutal. I wish I could have taken 20 classes this semester over her 1. She is not friendly and is rude. AVOID AT ALL COST, I repeat, AVOID AT ALL COST. This is here Sports Research class 4900",
        "course": "KNSISM4900"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 5,
        "comment": "Honestly, one of the worst teachers I have ever had. The class should be an online class and the material that she teaches barely has anything to do with what she tests you over. Would not take this class again if you paid me! Absolutely terrible!",
        "course": "KNSISM5610"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "This class is typically an 8am and should be online. The things we do in class are things that don't even relate to the sport industry. If you need to know how to eat in an interview and are super eager to answer every question in class take this course. If you just need it for your major, like most of us, take it online in the summer.",
        "course": "KNSISM3189"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 2,
        "comment": "Very power hungry. Takes the class much more serious than it needs to be. I would not recommend her to anyone. Feminist.",
        "course": "KNSISM3189"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 4,
        "comment": "Too much irrelevant work for a class that is supposed to basically expose you to the sport industry field as a career, not job hunting. Much better would be online with focus on your field experience observations, not resumes and pronouns. Hard grader.  If you are in any way not totally feminist or supportive, whatever you do, don't talk about it",
        "course": "KNSISM3189"
      },
      {
        "index": 25,
        "rating": 4,
        "difficulty": 2,
        "comment": "This MANDATORY IN-PERSON class should be online. It is completely unnecessary. I don't even know what else to say but be prepared to have to sit for over an hour one week, learning about pronouns and adjectives.. and no, that is not a typo. Also on the list, resume week, dinner etiquette, cover letters, how to dress for a interview, etc. Have fun!",
        "course": "KNSISM3189"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 5,
        "comment": "Too much. Unnecessarily, too much. That is all.",
        "course": "KNSISM3189"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very intriguing class with interesting topics and discussions.  Melissa is incredibly knowledgeable about the subjects she teaches and easily captures the student's attention.  Overall the class is easy as long as you do the weekly readings and take thorough notes.  I highly recommend taking it!",
        "course": "WSTDS101"
      }
    ],
    "SEI": [
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "30022",
        "Term": "AU 20",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "2"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "28508",
        "Term": "AU 20",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "3.73"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "5614",
        "Class Name": "Sport and Sexuality",
        "Class Number": "27840",
        "Term": "AU 20",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.33"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "9826",
        "Term": "SU 20",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.09"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "14665",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "12952",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.08"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "5610",
        "Class Name": "Women's Sport History",
        "Class Number": "12373",
        "Term": "SP 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.29"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "9809",
        "Term": "SU 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "4.5"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "21411",
        "Term": "SU 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "3.17"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "8746",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.15"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "8556",
        "Term": "AU 21",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "31431",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.62"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "31434",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "3.6"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "5610",
        "Class Name": "Women's Sport History",
        "Class Number": "31425",
        "Term": "SP 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "10022",
        "Term": "SU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "3.75"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "10107",
        "Term": "SU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.4"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "33926",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.3"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "32618",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.19"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "5614",
        "Class Name": "Sport and Sexuality",
        "Class Number": "13050",
        "Term": "AU 22",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.45"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "13494",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.42"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "13497",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.5"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "5610",
        "Class Name": "Women's Sport History",
        "Class Number": "13488",
        "Term": "SP 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.69"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "10091",
        "Term": "SU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.09"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "13665",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "3.43"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "14985",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "2",
        "Rating": "4.5"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "14875",
        "Term": "AU 23",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.33"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "13929",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "3.78"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "3189",
        "Class Name": "Field Experience: Sport Industry",
        "Class Number": "13953",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4"
      },
      {
        "Subject": "KNSISM",
        "Catalog": "4900",
        "Class Name": "Researching in Sports Industry",
        "Class Number": "13933",
        "Term": "SP 24",
        "College": "Education & Human Ecology",
        "Department": "Department of Human Sciences",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      }
    ]
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.8,
    "department": "Women's Studies",
    "firstName": "Henryatta",
    "id": "VGVhY2hlci03Njc3ODc=",
    "lastName": "Ballah",
    "legacyId": 767787,
    "numRatings": 14,
    "summary_comment": "Professor Ballah is highly regarded for her passion and knowledge in teaching African history, making her classes engaging and discussion-based. Students appreciate her availability as an academic advisor and her focus on understanding over grades. While some find her classes demanding and note-taking crucial, her clear communication and caring approach are widely praised.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Ballah was a great resource and she cares about all her students. There were a few short papers and a decent amount of reading in the class I took with her, but they were all manageable and clearly outlined in the syllabus before class began. I really enjoyed my time in this class and recommend it for history and non-history majors alike.",
        "course": "HIST175"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "HIST 175 @ W&L: Insane breath of content taught well. Readings aren't bad. There are \"pop-quizzes,\" but you can guess when they'll be. You do need to prepare; they aren't easy. Overall, she care more about understand the material than grades, so you'll get an a or a-. Prepare for three miserable papers. Speak up in class. Not life changing.",
        "course": "HIST175"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "HIST-175 @ W&L. Prof. Ballah is one of my favorite professors ever. Classes are discussion-based and questions are encouraged. She knows damn near anything you could ever ask her about Africa's History. You will succeed if you are intellectually curious and take good notes. Also my academic advisor, and she gives the best advice. A blessing.",
        "course": "HIST122"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Ballah is the best. Although she tends to ramble, her stories and her personal connection to her teachings is where she is the most brilliant. You get what you put into her classes. I absolutely recommend !",
        "course": "AFAM122"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 1,
        "comment": "Com'n, you guys just demand too much. When a class is too demanding, you got frustrated; when it's too easy and flexible, you got more complaints... She's really excellent. No surprise or tricky questions in exams. And she cares her students a lot. A big thumb up! - Solid Aer",
        "course": "HIST121"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "At first I thought she would be a really great teacher...but it didn't turn out that way. She rambles pointless stories about herself and christianity. If you are not catholic or christian I imagine you would have been uncomfortable in the class. Insulted the entire class in saying we didnt know how to write thesis statments. Didn't like her.",
        "course": "HIST121"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 4,
        "comment": "She wasnt very helpful- rambles on about herself majority of the class. Very tough grader for a GEC class...You have to go to class or she'll call you out.",
        "course": "HIST122"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Mrs. Ballah is an EXCEPTIONAL instructor.  The university is better for her being her.  I found her to be extremely knowledgeable and passionate about the material, and goes out of her way to make sure you understand it.  I would strongly recommend Mrs. Ballah to everyone.  She keeps the class interesting and entertaining as well.",
        "course": "AFAM122"
      },
      {
        "index": 9,
        "rating": 2,
        "difficulty": 1,
        "comment": "It was a boring class I ever had. A lot of un neccessary talking in the class which s irrilevant to the subject matter. Boring text and reading articles posted on carmen. I have got nothing out of this class but just the A- FOR WHICH i DON`T KNOW nOTHING.",
        "course": "AAAS122"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great TA, best I've ever had.  Willing to help you out if you have a health or family emergency.  She's a lot of fun in class.",
        "course": "HIS121"
      },
      {
        "index": 11,
        "rating": 4,
        "difficulty": 3,
        "comment": "I liked that class and ms. ballah alot.  she was fair and made it really easy to talk about sensitive topics.  don't be mad cuz you got a bad grade :-P",
        "course": "WS325"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 2,
        "comment": "Ballah blows. She's crazy. She flips out in class, looks you in the eye while you are talking, and then two seconds later doesn't remember that you were just talking. Doesn't care about students, is an idiot. However, super easy class if you show up and turn everything in.",
        "course": "WS325"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 1,
        "comment": "Most of your grade is based on 3 papers and attendance/participation.  I honestly did not learn much from this prof.  There was a lot of reading and lectures were pretty boring sometimes.  I expected a lot more out of this class, but it was decent.",
        "course": "WOMSTD325"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is very knowledgeable about women's health subjects. But there are too many topics in this course. It's about quanity not quality. However the the instructor's alright.",
        "course": "WS325"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.2,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Deborah",
    "id": "VGVhY2hlci01NzgzNDg=",
    "lastName": "Kuzawa",
    "legacyId": 578348,
    "numRatings": 30,
    "summary_comment": "Dr. Kuzawa is highly recommended by many students who find her caring and willing to help, despite the demanding workload. However, others warn of her condescending attitude, unclear instructions, and harsh grading, suggesting a mixed experience with significant variability in student perceptions.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I would highly recommend Dr. Kuzawa to anyone looking to take this class. While the class requires a lot of homework and effort, Dr K is incredibly caring and willing to help when necessary. If you are willing to put in the effort and engage in class you will be fine. I think the other reviews are incredibly harsh and not at all true. I loved her.",
        "course": "ENGR2301"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Honestly I was scared going into this class because of the reviews, but they couldn't have been more wrong. Dr. Kuzawa is extremely intelligent and truly cares about each student and each project, doing research for us outside class. She gives a lot of homework but that is expected with a 4 credit course. I'd seriously recommend her. ",
        "course": "ENGR2301"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "She treats a class that is a required gen-ed for engineering students like it's the most important graduate level course in the university. She doesn't grade super hard but is a stickler for citations and will actually read the sources you cite and give you lip if you don't interpret  sources right. She also gives way too many assignments. ",
        "course": "ENGR2301"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "This professor gives lot of homework and always talks about her grad students. Tries to run the Gen Ed class like a graduate level English class.",
        "course": "ENGR2301"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "AVOID THIS CLASS. Kuzawa is condescending, often has a bad attitude, and acts as if she's better than everyone else. Homework/lectures are often long, redundant, and disorganized. Grades are harsh even though she doesn't give good instructions. Save yourself.\n",
        "course": "ENGR2301"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Some instructions are not that clear but she's easy on the grading.",
        "course": "ENG367"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "my advisor suggested this class for me, which why I took it. This professor is probably the most condescending person I have ever met. Often is very moody and yells at students when they ask questions they should already know the answer. jumps to conclusions. high expectations and hardly ever gives anything higher than a B+. Avoid if u can.",
        "course": "ENG367"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Rude. Fake nice. Vague instructions and lectures are required but useless. Course organized horribly.",
        "course": "ENG367"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 5,
        "comment": "She assigned much homework that we had to write at least three papers every week. She often changed the due time so that we have to spend a really long time to write the paper crazily. Moreover, she was a tough grader. what she said in class was boring and complicated that most people wanted to live. I suggest that none of you take this bad course",
        "course": "ENG367"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "ENGR 2367 suppose to be an easy GE but not the case for this teacher. We have in total 50 assignments a semester and she is a tough grader. Her instructions for homework are also very unclear and she always changes the due date which is also very annoying.",
        "course": "ENG367"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 4,
        "comment": "Doesn't realize this is a gen ed that engineers have to take. Not only does she actively try not to give A's, the course load of this class is more than my actual major classes. Her class is boring and uninformative with most information already known. Prepare to have 4 assignments due in one week with little explanation. Worst class ever taken.",
        "course": "ENG367"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Her lecture is totally useless, but the attendance is required. There are tons of assignments. If you wanna get A for seconding writing class, avoid her. Also She always gives low grades. Literally, She should go to a community college.",
        "course": "ENG236"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class taught me real life things I should know, but the amount of work in this class is seriously over dramatic. Every class there multiple things due that are very pointless. Also, theres no explanation of anything. This class made my anxiety highten so much. Now, my anxiety is worse than before and carries into my non-school life. Good luck",
        "course": "ENG367"
      },
      {
        "index": 14,
        "rating": 3,
        "difficulty": 3,
        "comment": "If you are willing to do the assignments you'll be fine. She is a harsher grade but in the sense that she doesn't give A's. If you get a B+ on all big assignments and A on the smaller ones you'll land with an A.",
        "course": "ENGR2367"
      },
      {
        "index": 15,
        "rating": 2,
        "difficulty": 3,
        "comment": "Almost everything that was said, is true. Very unorganized, not very clear with instructions, way too much work, not enough time for the work. However, it isn't impossible to get full credit for an assignment. So if you have the enduration to do 50+ assignments in a semester, then it will be an easy A, but I recommend that you avoid her.",
        "course": "ENG367"
      },
      {
        "index": 16,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class was supposed to be an easy gen ed and she made it way too hard. So much work with not enough time or enough explanation. I would highly recommend taking this with someone else. ",
        "course": "ENGR2367"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "You want to avoid her class. While all the other classes had an easy time, Ms Kuzawa lectures forever while you should get time to work in class. She is a tough grader also",
        "course": "2367"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "Terrible I would say. Never clear on da assignments and when stuff is due. Very condescending. VERY HARSH GRADER",
        "course": "3"
      },
      {
        "index": 19,
        "rating": 4,
        "difficulty": 3,
        "comment": "I found Deborah to be a good teacher. She obviously cares about teaching and knows her stuff. Some of the stuff we talked about wasn't new to me, but the examples she provided were really helpful. I liked all the interaction with my classmates and with Deborah. People saying she is condescending is at odds wit my experience. She was always helpful.",
        "course": "ENG367"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 1,
        "comment": "I felt like I was wasting half a tank of gas every time I drove to campus for this course. She is incredibly condescending and doesn't seem to know what she's talking about. She didn't really teach anything, just gave a ton of examples and talked about them. Thought we were going to learn how to write, not formats for business letters and resumes.",
        "course": "ENG304"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 4,
        "comment": "Took it last year and have actually used some of the stuff I learned in the class for my other classes.  I liked that she was accessible, and that we actually spent time learning  how to write better instead of just reading a bunch of stories.",
        "course": "ENG110"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 2,
        "comment": "Deborah is my favorite English teacher that I have ever had. I would love to take her classes over and over again. She's very helpful and interested in teaching. I hated all my writing classes except her class. She grades fairly and she's an easy grader.",
        "course": "ENG110"
      },
      {
        "index": 23,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took English 110.03 with Deborah during Winter. As a international student, I thought she was very helpful with my English writing. I met with her often and she helped alot. She cares about teaching and her students. Sometimes she talked way to fast though.",
        "course": "ENG110"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "I am surprised by the negative comments here! Deborah was a helpful and dedicated instructor, although she does have a dry/sarcastic sense of humor.",
        "course": "ENG110"
      },
      {
        "index": 25,
        "rating": 3,
        "difficulty": 1,
        "comment": "Terrible teacher. Condescending and doesn't really have an idea what she's talking about. Didn't know a single person in my class that liked her, but still got an A.",
        "course": "ENG110"
      },
      {
        "index": 26,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very inefficient teacher. Disinterested, condescending and unfortunately took a composition class for me and made me less enthused about my own personal writing abilities.",
        "course": "ENG110"
      },
      {
        "index": 27,
        "rating": 2,
        "difficulty": 2,
        "comment": "Very intelligent teacher, did not receive much from the class. Seemed like she was too &quot;by the book&quot; rather than being innovative or interactive.",
        "course": "ENG110"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty good teacher, grades fair.  She gives you the opportunity to re-write your papers if you didn't do too well.  Don't take this class if you don't like to read.  Pretty interesting stuff, and this is coming from a guy",
        "course": "WOMSTD36701"
      },
      {
        "index": 29,
        "rating": 3,
        "difficulty": 3,
        "comment": "Can be aggressive at times, and is a critical grader.  Knows her material well- and expects you to know it just as well.  Not bad if you keep up with the reading and plan to re-write your papers a few times.  Don't not take this class because of her- she is fair.",
        "course": "WS36701"
      },
      {
        "index": 30,
        "rating": 2,
        "difficulty": 4,
        "comment": "I love English and I love women's studies, but this teacher is ridiculous. Some of the material is good, but her grading of papers is harsh. She claims to grade nicely on the final, so here's hoping. Avoid at all costs.",
        "course": "WS36701"
      }
    ],
    "SEI": [
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "6151",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "3.56"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "6152",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.33"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "6155",
        "Term": "AU 20",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.31"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "9748",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.09"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "9749",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.27"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "9788",
        "Term": "SP 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.08"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "28280",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "28281",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.61"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "28284",
        "Term": "AU 21",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.06"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "26547",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "3.9"
      },
      {
        "Subject": "ENGR",
        "Catalog": "7710",
        "Class Name": "Engineering Research Communications",
        "Class Number": "34113",
        "Term": "SP 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "6",
        "Rating": "3.67"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "6925",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "3.33"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "6926",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "3.77"
      },
      {
        "Subject": "ENGR",
        "Catalog": "7710",
        "Class Name": "Engineering Research Communications",
        "Class Number": "11876",
        "Term": "AU 22",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.67"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "8082",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "3.56"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2367",
        "Class Name": "American Attitudes About Technology",
        "Class Number": "8189",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.06"
      },
      {
        "Subject": "ENGR",
        "Catalog": "7710",
        "Class Name": "Engineering Research Communications",
        "Class Number": "11873",
        "Term": "SP 23",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4.78"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2301",
        "Class Name": "Exploring Diversity, Equity & Inclusion in Engineering Contexts: Integrative Designation",
        "Class Number": "37888",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "3.22"
      },
      {
        "Subject": "ENGR",
        "Catalog": "7710",
        "Class Name": "Engineering Research Communications",
        "Class Number": "11778",
        "Term": "AU 23",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "9",
        "Rating": "4"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2301",
        "Class Name": "Exploring Diversity, Equity & Inclusion in Engineering Contexts: Integrative Designation",
        "Class Number": "35266",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "3.19"
      },
      {
        "Subject": "ENGR",
        "Catalog": "2301",
        "Class Name": "Exploring Diversity, Equity & Inclusion in Engineering Contexts: Integrative Designation",
        "Class Number": "35267",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "3.85"
      },
      {
        "Subject": "ENGR",
        "Catalog": "7710",
        "Class Name": "Engineering Research Communications",
        "Class Number": "11719",
        "Term": "SP 24",
        "College": "Engineering",
        "Department": "Engineering Administration",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "8",
        "Rating": "4.88"
      }
    ]
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.3,
    "department": "Women's Studies",
    "firstName": "Sierra",
    "id": "VGVhY2hlci0yMzA5Mjky",
    "lastName": "Austin",
    "legacyId": 2309292,
    "numRatings": 6,
    "summary_comment": "Professor Sierra Austin is highly regarded for her engaging and supportive teaching style, particularly in her online courses. Students appreciate her responsiveness, passion for the subject matter, and willingness to help students understand course content and meet deadlines. Her classes are described as interesting, stress-free, and enjoyable, with a focus on discussion and opinion rather than strict grading on facts.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "A: the class was really interesting. B: this professor was very caring and took the time to respond with thoughtful comments on multiple assignments of mine even thought it was an online course. She seems very excited to engage with students and hear their thoughts. Even though I was unable to attend, she also invited students to meet once.",
        "course": "WGSST2317"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sierra was fantastic. I appreciate that she doesn't grade on facts, she mostly asks for out opinion. This class had weekly modules consisting of a show or a few readings, and occasionally a Google Form with questions about the reading, or more often a discussion post about our thoughts. This was my easiest class all semester and was stress-free.",
        "course": "WGSST2367"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "I really liked Professor Austin. The course material was super interesting and while the class formatting was a little hard to get used to at first (no lectures, a lot of independent work) I think it was overall a great course. It is really easy to get a good grade if you just participate. I feel like I learned a lot and had fun doing it.",
        "course": "WGSST2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is one of my favorites. I am taking my fourth class with her and every time she has been great. She is very pleasant and will work with deadlines. If you don't understand some thing just ask and she will explain clearly of what she is looking for. Her assignments were fun yet challenging. She is very warm and cares about her student",
        "course": "WGSS2230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class reworked my feminism for the better. She is passionate and willing to talk outside of the course even though it's online. If you do the work and comprehend it, easy A and she works w/ you on deadlines. First few weeks are reading heavy so you have a good fundamental grasp of the issues, but past week 4 or 5 the work load wayy gets easier",
        "course": "WGSS2367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 2,
        "comment": "Sierra Austin is a PhD candidate whose online Black Women Writers class couldnt have been more irritating. Long story short, dont enroll in one of her online classes. She: provides no feedback as to what is an adequate analysis; isnt a consistent or standardized grader; is kinda petty; and literally doesn't teach. You get links to read &amp; thats it",
        "course": "WGSST2367"
      }
    ],
    "SEI": [
      {
        "Subject": "AFAMAST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "19127",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2367",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "21884",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "16",
        "Rating": "4.88"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "23908",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.4"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2218",
        "Class Name": "Black Urban Experience",
        "Class Number": "36213",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "26",
        "Rating": "4.72"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "37276",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "4.9"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2218",
        "Class Name": "Black Urban Experience",
        "Class Number": "34227",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.23"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "29050",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "31256",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "20",
        "Rating": "4.25"
      },
      {
        "Subject": "AFAMAST",
        "Catalog": "4921",
        "Class Name": "Intersections: Approaches to Theorizing Difference",
        "Class Number": "36491",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "African-Amer & African Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "COMPSTD",
        "Catalog": "4921",
        "Class Name": "Intersections: Approaches to Theorizing Difference",
        "Class Number": "23158",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Comparative Studies",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "34392",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "20",
        "Rating": "4.7"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "34393",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.54"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "37631",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "19",
        "Rating": "4.79"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "20859",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.8"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "35248",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.72"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2230",
        "Class Name": "Gender, Sexuality and Race in Popular Culture",
        "Class Number": "14179",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.57"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "36563",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.43"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2317",
        "Class Name": "Gender at the Movies: Hollywood and Beyond",
        "Class Number": "21817",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "24",
        "Rating": "4.48"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "24439",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "5",
        "Rating": "4.8"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "30310",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2550",
        "Class Name": "History of Feminist Thought",
        "Class Number": "20444",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "15",
        "Rating": "4.93"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "26869",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "23",
        "Rating": "4.41"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.04",
        "Class Name": "Black Women Writers: Text and Context",
        "Class Number": "36794",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.7"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2550",
        "Class Name": "History of Feminist Thought",
        "Class Number": "20737",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "10",
        "Rating": "4"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4921",
        "Class Name": "Intersections: Approaches to Theorizing Difference",
        "Class Number": "28597",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "4.56"
      }
    ]
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 3.8,
    "department": "Women's Studies",
    "firstName": "Cynthia",
    "id": "VGVhY2hlci0zOTcyODA=",
    "lastName": "Burack",
    "legacyId": 397280,
    "numRatings": 36,
    "summary_comment": "Dr. Burack is highly knowledgeable and encourages open discussion in her classes, focusing on weekly readings and one-page papers. Students appreciate the manageable workload and relevant material, though some found the class to veer more towards history and politics than expected, leading to disappointment. Overall, opinions vary, with some students loving her teaching style and others finding the grading criteria unclear and the content not meeting their expectations.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Expected to read a number of pieces, but they are all interesting and manageable. The only assignments are weekly discussion posts, which are graded pretty fairly. Attendance isn't mandatory, but I enjoyed going to class. Burack is extremely knowledgable and really just wanted to have open discussion (not mandatory) with the class!",
        "course": "WGSST2215"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Burack provided very relevant material to read. This was the first time that I actually read every. single. book. for a literature class and loved them all. There are about 6 papers that are one page each (double spaced) and a weekly discussion post--not too much work. Truly enjoyed the material and loved both her teaching and the class. ",
        "course": "WGSST2215"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "Her grading is specific and feedback equally so. All the papers were exactly one page long (with the exception of the journal due at the end of the semester). The lectures go with the flow and are quite laidback.",
        "course": "WGSS236703"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Expected a lot more from a writing class than nitpicking grammar or points off without meaningful feedback as to why. Had high expectations, but ended up often disappointed as lectures went off-track and the class became more history/polisci than lesbian literature. I really wanted to like this class, but I just couldn't. Would not take again.",
        "course": "WGSS236703"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 4,
        "comment": "Read a WLW book list instead. It could have just been the online format but neither this class nor Prof. Burack were great. Online lecture slides were lackluster + time spent in class wasn't spent teaching us but rather making us ask questions, then giving non-answers or personal anecdotes. Grading was fairly tough and expectations were unclear.",
        "course": "WGSST2367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "She grades based on 6 papers only and does not provide adequate feedback for these papers. She also never provides a rubric for these papers and expects you to just be good at writing. She only draws on her own experience as a lesbian and does not actually share knowledge with the class, she only discusses history from her point of view. Awful.",
        "course": "WGSST2367"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "One of my favorite professors! Extremely smart and an expert in her field. No exams but does use group/class discussions in class. Lectures are not pre-prepared and instead flow with the conversation. Pushes students to think differently. Reading due each week with one-page responses. Also graded on quizzes and in-class work. Only met once a week.",
        "course": "WGSS4465"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 3,
        "comment": "I felt like the exams were super easy, I can only remember missing one or two questions on each. Shes pretty straightforward about exam prep, but if you dont literally take notes during lecture, youre not going to do very well in the class. Felt like I deserved an A, but the grading criteria was not clear at all! Did not use Carmen at all!",
        "course": "WGSS2300"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "Really great professor, incredibly knowledgeable and interested in her subject. I could listen to this woman talk about paint drying.",
        "course": "WGSS236703"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 2,
        "comment": "Six papers, but the max length for each one was 2 pages double spaced, and each had a different format (like one was a chart) so it was surprisingly easy for a writing II course, but she is a very tough grader! We read six books but they were all good, and overall the workload was very light. She is definitely cynical but has good things to say!",
        "course": "WGSS236703"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 3,
        "comment": "I really did not like Prof. Burack. Her lectures were incredibly boring, and although it was supposed to be a discussion-based class, she rarely let students get a word in. Her discussion questions were boring and not thought-provoking. Everything was graded very vaguely and she literally had no grades in Carmen, ever.",
        "course": "WGSS2300"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Awesome class. The reading assigned is really good. I am a male and never felt Professor Burack discriminating towards me. Professor Burack is the best professor Ive had at Ohio State!",
        "course": "WGSS2300"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Prof Burack is refreshingly down to earth and gives great anecdotes. She can be cynical but I would definitely like to hear to lecture about anything just for her specific view point on certain topics.",
        "course": "WGSST236703"
      },
      {
        "index": 14,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cynthia was a professor I actually enjoyed listening to. Class was always interesting and I learned something new everyday. My TA was an easy grader and the Midterms and Finals were no-brainers at all. I aced bothed. Definitely the easiest and most interesting class to take!",
        "course": "WGSST1110"
      },
      {
        "index": 15,
        "rating": 4,
        "difficulty": 3,
        "comment": "She's very knowledgeable and helpful. However, I've never received less than an A on papers prior to her class, but in this class I never received anything higher than a B. She is a stickler for writing rules that are completely asinine. But the class is really fun, especially when the class gets involved.",
        "course": "WGSS236703"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 2,
        "comment": "great professor!",
        "course": "WGSST1110"
      },
      {
        "index": 17,
        "rating": 4,
        "difficulty": 4,
        "comment": "I am a female and I took this class with my friend who is a male. We both wrote the papers together and did excessive amounts of reading. I got B+'s on my papers and he got C+'s consistently. He is a much better writer than me and its unfair how biased she is. Don't take the class unless your a girl who is good at sucking up.",
        "course": "WGSST2367"
      },
      {
        "index": 18,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Burack is one of the best professors I've had the privilege of learning from. She is an extremely articulate speaker and more than willing to go the extra mile to ensure that you understand the material. The class was one of my more difficult ones for the term, but if you put in the work required it really pays off. Would recommend to everyone!",
        "course": "WGSST367"
      },
      {
        "index": 19,
        "rating": 5,
        "difficulty": 1,
        "comment": "I had professor Burack for WOM STDS 367 and WOM STDs 110, 110 was very interesting and well organized. 367 covered material very quickly. Professor Burack often runs off on tangents and looses track of where she was in lectures. TAKE NOTES! slides are not available online and ALL information on her slides are helpful for the tests.",
        "course": "WOMST110"
      },
      {
        "index": 20,
        "rating": 4,
        "difficulty": 3,
        "comment": "Great professor. Clearly excited about the material. Fair to all students, both in opinion and grading. \r \r As a writing course, she didn't cover the art of composition in much detail, but she more than makes up for it in explaining and backing the reading material.\r \r I would definitely take her again - despite what a previous post says - I'm a gu",
        "course": "WMSTD367"
      },
      {
        "index": 21,
        "rating": 5,
        "difficulty": 1,
        "comment": "Prof. Burack is very clear -everything was repeated to the point where taking notes became a formality; tests are easy.  However, she was my least favorite teacher at OSU.  She was incredibly rude to all of the boys in our class and not at all friendly with the rest of us.  I would not repeat this class with her, despite my interest in the subject.",
        "course": "WS110"
      },
      {
        "index": 22,
        "rating": 5,
        "difficulty": 1,
        "comment": "Horrible professor.  Always wanders off topic, is horribly biased against men, and refuses to back the points she makes in class outside of it.  She is incredibly condescending, but easy.  If you want a guaranteed A, it's a great class, and if you want a radically one-sided view of women's studies, take it, but otherwise STAY AWAY.",
        "course": "WOMSTDS110"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 3,
        "comment": "Hands down the best professor I have ever had. Extremely intelligent and highly engaging. Cannot wait to take another of her classes.  Great lectures and fair grader.",
        "course": "WS520"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 2,
        "comment": "Very good professor. Study guides before tests were very helpful. I learned a lot in this class.",
        "course": "WS110"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "110"
      },
      {
        "index": 26,
        "rating": 4,
        "difficulty": 3,
        "comment": "Comes off a little bit intimidating in the beginning, but as the quarter went on I found myself liking her more and more. Lectures were organized and interesting, and study guides before the finals made the class so much better. Highly recomended!",
        "course": "WS110"
      },
      {
        "index": 27,
        "rating": 5,
        "difficulty": 5,
        "comment": "She's great. No ifs, ands, or buts.",
        "course": "WS"
      },
      {
        "index": 28,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is, hands down, the best professor I had in the women's studies department.  I learned so much in her class not only because if I hadn't, I could've failed, but because she inspired me to.  I ended up with one of the most satisfying &quot;A's&quot; in",
        "course": "575"
      },
      {
        "index": 29,
        "rating": 5,
        "difficulty": 4,
        "comment": "burack is the reason i decided to minor in women's studies.  she is straightforward and informative, but never dull.  she does have a great voice, and provides a great performance overall, and is in everyway the kind of professor i aspire to be.",
        "course": "WOMSTD110"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr Burack is one of those professors who is really smart and expects her students to keep up with her.  If you do the reading and work hard, it will be one of the most rewarding classes you will ever take.  If you don't, drop the class now.",
        "course": "WS575"
      },
      {
        "index": 31,
        "rating": 4,
        "difficulty": 4,
        "comment": "Her classes are tough and definitely *not* an easy A, but you get a lot out of it if you keep up.  Also, she's very willing to stay after class for a bit to talk theory or clear up a topic, but she's pretty inflexible in requirements for her class.",
        "course": "WS520"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 3,
        "comment": "I received an A- on the midterm, but I still dont' really like her. She gives off a vibe like she's totally unapproachable, and she's not very clear about what she's going to test you on. She also got rude w/ me when I told her I had to leave early once.",
        "course": "WS520"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 3,
        "comment": "Class was a small seminar, so students talked mostly.  Always very interesting, engaging, and friendly. Also, she has a beautiful, soothing voice that you just want to close your eyes and listen to.  She should get a radio job. :)",
        "course": "POLTHEORY"
      },
      {
        "index": 34,
        "rating": 2,
        "difficulty": 5,
        "comment": "No Comments",
        "course": "520"
      },
      {
        "index": 35,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is one of the best teachers I have ever had. You just need to be a little bit smart in order to keep up with her. She knows her stuff and I was priviledged to have her as a professor!!!!! A++++++",
        "course": "WST575"
      },
      {
        "index": 36,
        "rating": 2,
        "difficulty": 5,
        "comment": "She was one, if not the worst teacher that I have ever had.  I dropped the class solely because she was so utterly unhelpful.  She tells you flat out that she is not there to help you!!! Stay far far away from this prof.",
        "course": "WS520"
      }
    ],
    "SEI": [
      {
        "Subject": "POLITSC",
        "Catalog": "4597.03",
        "Class Name": "Gender and Democracy in the Contemporary World",
        "Class Number": "36693",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Political Science",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.63"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367.03",
        "Class Name": "U.S. Lesbian Writers: Text and Context",
        "Class Number": "27550",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "2.82"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4597",
        "Class Name": "Gender and Democracy in the Contemporary World",
        "Class Number": "33469",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2367",
        "Class Name": "U.S. Lesbian Writers: Text and Context",
        "Class Number": "20858",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "17",
        "Rating": "4.71"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4403",
        "Class Name": "Gender and Leadership",
        "Class Number": "34720",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.75"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "14177",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.68"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4597",
        "Class Name": "Gender and Democracy in the Contemporary World",
        "Class Number": "34477",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "4"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "35416",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "4.71"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4465",
        "Class Name": "Feminist Political Theory",
        "Class Number": "28539",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "11",
        "Rating": "4.82"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "20403",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "23",
        "Rating": "4.77"
      },
      {
        "Subject": "WGSST",
        "Catalog": "3320",
        "Class Name": "Topics in Women's, Gender and Sexuality Studies",
        "Class Number": "35738",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "5"
      }
    ]
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 4.6,
    "department": "Women's Studies",
    "firstName": "Victoria",
    "id": "VGVhY2hlci0xMTAzODk4",
    "lastName": "Genetin",
    "legacyId": 1103898,
    "numRatings": 5,
    "summary_comment": "Professor Victoria Genetin is highly regarded for her engaging and thought-provoking teaching style, particularly in courses like Women and Addiction. Students appreciate her passion for the subject matter, her non-judgmental approach, and her detailed, constructive feedback. Her classes are described as interesting, fun, and supportive, with many students recommending them and expressing a desire to take more courses with her.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "I took an online section of Women and Addiction. The course is really thought-provoking and interesting. It is quite a bit of reading and you have to be self-disciplined since it is online. She gives good detailed feedback on all of your responses, though. I don't feel like I know her very well, but I know what she thinks about my writing. ",
        "course": "WGSST2326"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "One of the best instructors I have had at Ohio State. I encourage everyone to take this course. Ms. Genetin is passionate about course materials and the learning environment in her class. She is non judgemental and very intelligent. You will learn a great deal from this professor. Honestly enjoyed going to class.",
        "course": "WS326"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is a great teacher, very open minded and easy to talk to. The class was really interesting and was a lot of fun. I really enjoyed using blogs instead of writing formal papers. Definitely take another class from her again.",
        "course": "WS326"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "This was a GREAT class! I know exactly who the student below is that rated Ms Genetin poorly & she is lying! Ms Genetin gives everyone a chance to talk and uses a uniformed 10 point rubric where she gives detailed feedback. The student complaining below was obnoxious in class & pretty much annoyed everyone. Ms. G. had lots of paitence w/ her.",
        "course": "WS326"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great class. Interesting readings, and pretty easy assignments. Easy to get an A if you pace yourself, and Victoria is a caring instructor who is incredibly helpful. She takes feedback seriously and works to make class a comfortable, nonjudgemental learning environment.",
        "course": "WSTDS326"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 1.6,
    "department": "Women's Studies",
    "firstName": "Anindita",
    "id": "VGVhY2hlci0xNjY0MDM3",
    "lastName": "Sengupta",
    "legacyId": 1664037,
    "numRatings": 4,
    "summary_comment": "The professor is widely regarded as ineffective, particularly for introductory courses, where students find the material overly advanced and the syllabus confusing. Reviews highlight issues with unclear communication, lack of clear guidelines and rubrics, and inconsistent grading practices. While some students appreciated her approachable nature and interesting material, the overall consensus is negative due to significant teaching and administrative shortcomings.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly, it is a intro class and she makes it seem like you are in a 4000 class. Don't take this class.",
        "course": "WGSST1110"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 2,
        "comment": "Anindita was extremely unclear and not helpful at all. Her English is pretty good but the way she words her questions makes them very difficult to answer. If you're into a class that has a constantly changing syllabus, no rubrics for the papers, and opinionated answers to questions then this class is for you.",
        "course": "WGSST1110"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "I loved her class...She was easy to relate to and nice. The assignments and quizzes were all really easy and the material was very interesting. She was pretty bad with computers, but everything else was great.",
        "course": "WGSST110"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 3,
        "comment": "Terrible. She had no clear guidelines/ rubrics for assignments and then took off points for things she never told us to do.  She didnt have half of our assignments graded til the day of the final and then gave the entire class the exact same grade for one assignment. Students taught the class and she never responded to a single e-mail I sent her.",
        "course": "WGSST110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 3.7,
    "department": "Women's Studies",
    "firstName": "Mary MacRorie",
    "id": "VGVhY2hlci0xODU1Nzkw",
    "lastName": "Dean",
    "legacyId": 1855790,
    "numRatings": 12,
    "summary_comment": "This professor is highly regarded for her passion and enthusiasm in teaching women's studies, which keeps students engaged and inspired. However, students consistently report issues with organization, including delayed grade returns and disorganized assignments, which can be frustrating. Despite these challenges, many find her lectures enjoyable and her passion contagious.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 1,
        "comment": "Unprofessional. Extremely opinionated so don't bring your own ideas to class because she will tell you that you are wrong. But overall, super easy. ",
        "course": "1101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "She's an amazing teacher who's fun to listen to and easy to learn from. She inspired me to learn more about women's studies. She is the worst grader I have ever had. I'm writing this review on the last day of the semester and ZERO grades have been posted!",
        "course": "2300"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 2,
        "comment": "I really, really like her as a person.  As a teacher, our class was so disorganized.   The lack of structure in assignments made it difficult to really know what was expected.  The grading of assignments also took forever. ",
        "course": "WGSS2230"
      },
      {
        "index": 4,
        "rating": 3,
        "difficulty": 1,
        "comment": "She's an awesome, fun and hilarious teacher and brings a lot of passion into the subject of women's studies that kept the class engaged. On the other hand, she's pretty disorganized and can't seem to get a grade back to you for the life of her.",
        "course": "WGSST1110"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Took a disrespectfully long time to return grades to students. Has had our assignments for weeks now, and still doesn't have grades in when they're due today. VERY small class of only 38, too. Hate to see how long her grading would take with a class any larger. She's cool, but this is very aggravating. Hopefully she's better for future students.",
        "course": "WGSST1110"
      },
      {
        "index": 6,
        "rating": 4,
        "difficulty": 2,
        "comment": "Interesting course, and she is very passionate about teaching it, but she was frequently promised grades returned in a timely fashion, but then would not bring them to class, or have them graded yet. Insultingly long time for grade return to students for things they worked hard on, and got done in a short time frame for her, which kinda sucks.",
        "course": "WGSST1110"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was awesome! Although she showed up late to class and was often unprepared, you could tell how much she cared about what she was teaching.",
        "course": "WGSS1110"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 3,
        "comment": "She was a great teacher. She is very passionate and knows what she is talking about. After taking this class I became more interested in Women's studies.",
        "course": "WGSS1110"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very passionate about what she is teaching, which makes it a great learning experience when it comes to class discussion. If you do all the work, and communicate with her, you will get a good grade in the course. Only downside is that she is pretty bad about grading assignments and returning them on time, so if this is big for you, beware.",
        "course": "WGSST1110"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "MacRorie was an awesome instructor! She definitely knew what she was talking about and cares a lot about her students and the things she teaches. Assignments are fun, engaging, and fairly easy. I definitely recommend taking this class!",
        "course": "WGSST1110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Definitely knows what she is talking about as far as class information. Easy to talk to, easy to get along with.",
        "course": "WGSS1100"
      },
      {
        "index": 12,
        "rating": 4,
        "difficulty": 3,
        "comment": "Helpful and nice. Class itself was a bit boring.",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.1,
    "avgRating": 4.3,
    "department": "Women's Studies",
    "firstName": "Amanda",
    "id": "VGVhY2hlci0xNTUwMDcy",
    "lastName": "Rossie",
    "legacyId": 1550072,
    "numRatings": 8,
    "summary_comment": "Dr. Rossie is highly regarded for her enthusiastic and engaging teaching style, particularly in Girlhood Studies at TCNJ. Students appreciate her open-minded approach, extensive knowledge, and ability to foster a respectful and inclusive classroom environment. However, her classes are known for being demanding, with heavy reading assignments and rigorous grading standards.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I also had Dr. Rossie for Girlhood Studies at TCNJ and she really sparked my love for the topic. She gives heavy readings due by each class that'll supplement your discussion, but for the most part these readings are very enjoyable. Rossie is absolutely kick-ass and has so much enthusiasm in what she does!",
        "course": "WGS270"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I had her from Girlhood studies at TCNJ. Dr. Rossie is the bomb, she is so engaging and very well spoken. The class is discussion based so you have to participate but that's half the fun of the class. Dr. Rossie knows how to have good discussions and she always incorporated clips or documentaries to make class more interesting. I'd take her again!",
        "course": "WGS270"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very energetic in class. Enjoys what she does. Can easily be reached after class. ",
        "course": "WGSST220"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "She was nice to me but didnt like others. Didn't teach; just read off slides. Assigned TOO much readings. Went to Georgia before the final, but didnt accommodate (had to turn in the final the friday before the weekend we were supposed to have) nor give us any notice. Couldn't control the class. Class was mandatory which was annoying & was curved.",
        "course": "WGGST2230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is an absolutely wonderful professor. Not only is she SUPER open-minded and creates a safe and open space for discussion, she is adorable and incredibly knowledgeable in her field. Even if you come in to the class with a lot of Women's Studies knowledge, you will leave it having learned SO MUCH from her.",
        "course": "WGSST2230"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "She's genuinely interested in both the coursework and her students. She adapted the syllabus to the class's liking and she's adamant about creating a respectful atmosphere. That being said, she is not an easy A, but do the work and you'll be fine. One of the best teachers I have ever had.",
        "course": "WGSS230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "If your looking for a easy class keep looking. You will have to do alot of reading. She is not the easiest grader in the world. No extra credit. Must be there every day!!! She nice but I will not be taking her class again.",
        "course": "WGSST230"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "For a writing class, reading 5 novels is a lot. Plus a total 8 papers. A pretty harsh grader..to get an A is a 95% (CRAZY). Don't take if you aren't interested in feminism you will want to die. She's incredibly nice and sweet! A good teacher. The class is a lot of work though for a gec",
        "course": "WS367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Lauren",
    "id": "VGVhY2hlci0xODcyMzUz",
    "lastName": "Strand",
    "legacyId": 1872353,
    "numRatings": 2,
    "summary_comment": "The professor is highly regarded for their compassionate and helpful nature, described as an \"amazing person overall and a great professor.\" They are also praised as an excellent instructor, deeply passionate about the subject matter, which enhances the learning experience and results in significant knowledge gain and enjoyment among students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Compassionate and helpful. Amazing person overall and a great prof.",
        "course": "WGSS2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great instructor! Lauren is very passionate about the subject & it shows in her teaching. I learned a great deal and enjoyed attending class every day!",
        "course": "WGSS2230"
      }
    ],
    "SEI": [
      {
        "Subject": "ARTSSCI",
        "Catalog": "1100.15",
        "Class Name": "Arts and Sciences Survey: Social and Behavioral Sciences BA/BS",
        "Class Number": "13045",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "ASC Administration",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "152",
        "Rating": "4.41"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "1100",
        "Class Name": "Neuroscience Survey Course",
        "Class Number": "33878",
        "Term": "AU 20",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "68",
        "Rating": "4.65"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "1100",
        "Class Name": "Neuroscience Survey Course",
        "Class Number": "33879",
        "Term": "AU 20",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "103",
        "Rating": "4.18"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "1100H",
        "Class Name": "Neuroscience Honors Survey Course",
        "Class Number": "2565",
        "Term": "AU 20",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "21",
        "Rating": "3.68"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "1100H",
        "Class Name": "Neuroscience Honors Survey Course",
        "Class Number": "2575",
        "Term": "SP 21",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "27",
        "Rating": "4.62"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "N/A",
        "Class Name": "Neuroscience Honors Survey Course",
        "Class Number": "2532",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "37",
        "Rating": "4.06"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "N/A",
        "Class Name": "Neuroscience Honors Survey Course",
        "Class Number": "2735",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Hybrid Delivery",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "59",
        "Rating": "4.02"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "N/A",
        "Class Name": "Neuroscience Honors Survey Course",
        "Class Number": "3109",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "L",
        "Responses": "46",
        "Rating": "3.74"
      },
      {
        "Subject": "NEUROSC",
        "Catalog": "N/A",
        "Class Name": "Neuroscience Honors Survey Course",
        "Class Number": "37196",
        "Term": "AU 21",
        "College": "The College of Medicine",
        "Department": "BMS-NEUROSCIENCE",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.63"
      }
    ]
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.5,
    "department": "Women's Studies",
    "firstName": "Wendy",
    "id": "VGVhY2hlci05Mjc1NDk=",
    "lastName": "Smooth",
    "legacyId": 927549,
    "numRatings": 20,
    "summary_comment": "Professor Smooth is highly knowledgeable and passionate about Women's Gender Studies, but her teaching style is largely ineffective, leading to confusion and disorganization among students. Lectures tend to be lengthy and often veer off-topic, and she can come across as authoritarian, making disagreement difficult. Despite some positive aspects noted by a few students, the overall experience is marked by poor communication and a lack of engagement, resulting in a generally negative perception of the class.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 3,
        "comment": "Professor Smooth is extremely disorganized. While it is evident that she is knowledgeable and enthusiastic about course content, she does not communicate clearly with students. She made this course very confusing.",
        "course": "WGSST3575"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "I took this class because I needed it for a GE and it was all that was open, had I known more about it I would have just taken less credits. Professor Smooth had her way or the high way, if you disagreed with her opinion then you were wrong. Her lectures were long and had nothing to do with what we were actually learning.",
        "course": "WGSST1110"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr. Smooth was a great lecturer and is really passionate about Women's Gender Studies but oftentimes she would just lecture off tangent on things that we (the class) weren't sure of the relevance to the test. If you are passionate about Women's Studies this class will be easy but attendance is mandatory and the TAs are tough paper graders.",
        "course": "WGSST1110"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Smooth is awesome! She is such a positive beginning to my mornings and her lectures are great! The TAs on the other hand...",
        "course": "WGS110"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 5,
        "comment": "While Smooth is a huge part of Ohio States WGGS program and is super intelligent, lectures stink. I can only recall a handful of times she wrote on the board. The readings are so extensive but you have to read them to actually understand lecture. brownie points: print the material and highlight she loves that! material is great; she ruins the fun",
        "course": "4403"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "She's very unprepared and the whole class is just her lecturing and talking about all the reading you have to do somehow. Her expectations are wildly too high. She never responds to emails. She takes this class too seriously. I would NEVER recommend anyone take this class. While the material is interesting, she ruins it.",
        "course": "4403"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 4,
        "comment": "women studies 110 isn't an easy A but it's def very possible. Smooth was pretty good, but I loved my TA, Jackie. She made the class so much more interesting because of discussion during recitation. I didn't expect to fall in love with this class but I did, it's one of those classes that have the potential to impact you for the rest of your life",
        "course": "WGSST110"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 4,
        "comment": "THIS CLASS WAS SOOOOOOOOO BORING TO ME! She seem happy to teach us but we never really got through anything because spent WAY too much time talking on and on and on and on and on about one topic. I did not learn nothing from this class. Also her &quot;helpers&quot; was NOT very &quot;helpful&quot; at ALLLLL. Overall I would not recommend any one to take this class!!!",
        "course": "WGSST110"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 2,
        "comment": "Too much work for a 100 level class! You have to write 5 papers, go to outside events, and tons of reading! However, the class material is pretty interesting and eye-opening.",
        "course": "WOSTD110"
      },
      {
        "index": 10,
        "rating": 4,
        "difficulty": 4,
        "comment": "I loved this class. I looked forward to it everyday I had it. Although you don't get lots of one on one time with Dr. Smooth she has such a passion that it is very enjoyable.",
        "course": "WGSST110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Smooth  really made me think. She is not easy, there's a lot of reading, but it is worth it. She made me think about so many things. I took the class last year and I am still thinking about it. She really made me get it that women's progress is ongoing and only gets better if we actually THINK about changing it. This class rocked!",
        "course": "WMST110"
      },
      {
        "index": 12,
        "rating": 3,
        "difficulty": 2,
        "comment": "The lectures were very interesting and always well prepared.She tried to have everyone participate in class! Too bad she never talk about the reading in class. The TA makes the class. I had a bad one, Meghan Kough who only cared about applying for her PhD program. The TA makes the meat out of the class, all the fun debates! Overall, good class!",
        "course": "WMSTD110"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very enthusiastic and passionate. I found the mandatory attendance annoying. But overall lessons were okay. 5 writing assignments a must. Midterms & Finals were not comprehensive. Always go for the pre-exam review sessions. Good class if you are interested in Women Studies or Gender studies.",
        "course": "WMSTD110"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class...lots of work for a 110 course, though.  Dr. Smooth is pretty funny and has entertaining lectures, she also enjoys pop quizzes. A ton of reading and 5 mandatory papers. Good class, so long as you have an interest in womens studies",
        "course": "WOMST110"
      },
      {
        "index": 15,
        "rating": 3,
        "difficulty": 3,
        "comment": "Lectures were very long and did not always stay on point.It helps to have a good TA because I found that my notes from lecture weren't all that helpful on the midterm.",
        "course": "WOMST110"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 3,
        "comment": "I had a horrible experience in this class. It was uncomfortable to speak in class and there was too much work for a 100 level class. She ignored any emails sent to her and so was not helpful at all. She also passed out an &quot;Etiquette Sheet&quot; saying we were not welcome to visit her in her office, and that we shouldn't ask questions about the tests.",
        "course": "WS110"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Smooth is an excellent and very professional instructor.  She knows her material very well. She backs up her statements with facts and interesting anecdotes.  She requires you to work hard, but it certainly pays.  This class brought out the best in me, writing skills, ability to analyse and she is extremely well organised.  Not for slackers!",
        "course": "WN513"
      },
      {
        "index": 18,
        "rating": 3,
        "difficulty": 4,
        "comment": "Not worth it to take as a 100 level teacher.  Enthusiastic about material, not in making work load appropriate for a 100 level class.  Too much outside reading required, mandatory attendance in lecture and recitation, 5 papers plus final and midterm.  Material v. interesting, it just took way too much work to get an A.",
        "course": "WMNST110"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "I agree with the other poster. This class was not enjoyable.  There were three books, the readings were long and boring. Lecture was the same - long, boring and mandatory.  Detailed questions about readings on tests. Going into the final we only knew 30% of our grade... which was the overly difficult mid-term. I would not recommend this Class.",
        "course": "PS513"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 4,
        "comment": "While it was obvious Dr. Smooth enjoyed what she was teaching and encouraged debates, she was the most unhelpful professor when it came to outside of the classroom.  I tried to contact her numerous times and she totally ignored me, along with her TA Stacia Kock.  She talked the ENTIRE class and the readings took forever! DONT TAKE HER CLASS!",
        "course": "WOMST513"
      }
    ],
    "SEI": [
      {
        "Subject": "WGSST",
        "Catalog": "3575",
        "Class Name": "Feminist Methodology",
        "Class Number": "34263",
        "Term": "AU 20",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "Distance Learning",
        "Campus": "COL",
        "Class Size": "M",
        "Responses": "21",
        "Rating": "3.38"
      },
      {
        "Subject": "WGSST",
        "Catalog": "4402",
        "Class Name": "Black Women:  Representations, Politics, and Power",
        "Class Number": "22850",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Women's, Gender&Sexuality Sts",
        "Medium": "In Person",
        "Campus": "COL",
        "Class Size": "S",
        "Responses": "4",
        "Rating": "4.5"
      }
    ]
  },
  {
    "avgDifficulty": 2.4,
    "avgRating": 2.4,
    "department": "Women's Studies",
    "firstName": "Cathy",
    "id": "VGVhY2hlci00Njg3MTk=",
    "lastName": "Rakowski",
    "legacyId": 468719,
    "numRatings": 9,
    "summary_comment": "The professor is highly experienced and known for her engaging anecdotes, making the course material interesting through various texts and films. However, her teaching style is largely lecture-based with minimal student interaction, and she presents her opinions as facts without encouraging critical thinking or discussion. Students find her condescending and disrespectful, and there is a lack of transparency regarding grades, as she does not use Carmen and does not post grades online.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 2,
        "comment": "Believes her opinions are fact, is disrespectful towards students, and does not care for you at all. Does not use Carmen and doesn't post grades so you don't know what your grade is ever. She is rude and lectures as if you are not respectable or educted. Disrespects your perspective. No class discussion on anything and does not tolerate feedback.",
        "course": "RSOC3580"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "She presents her opinions as fact so be prepared to regurgitate what she says and it will be an easy A.  No grades are posted online so you only have a vague idea of where your final grade comes from.  I had been excited for the class, but she made me feel like I was being lectured by a condescending parent.  Not enough room for class discussion.  ",
        "course": "29271"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 2,
        "comment": "Although she's brimming with life experience it's literally all she talks about. Her assigned readings also tend to be too dense for a single class period to your cover and her notes are terrible and often contradicting.",
        "course": "WGSS3302"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "extremely experienced in the field. great lecturer, lots of awesome anecdotes. more radical than most professors i've had. i highly recommend her. problems included lack of student discussion and seemingly disinterested in talking after class. most ag students openly disliked her for some reason.",
        "course": "RSOC378"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 2,
        "comment": "Spends majority of course lecturing. Not a lot of student discussion, which is nice if you don't like to speak in class. Great anecdotes that enrich the concepts used. Papers are very easy... some good texts/films used.",
        "course": "WS505"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 2,
        "comment": "The course material was very interesting - the readings and videos, especially. Classes tended to drag on, though.",
        "course": "505"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "made an interesting class very uninteresting.  horrible lecturer.",
        "course": "350"
      },
      {
        "index": 8,
        "rating": 2,
        "difficulty": 4,
        "comment": "I think that the reason this class sucks is because the instrutor is not very nice. She is condscending and bitter.",
        "course": "505"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 3,
        "comment": "I hated this class.  I don't know if it was the teaching style or not, but I dreaded it every day I had it.  I know it's a requirement, so my suggestion is to make the best of it.  It was pretty informative, a lot of reading and writing.  Easy A though.",
        "course": "505"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.3,
    "department": "Women's Studies",
    "firstName": "Sonnet",
    "id": "VGVhY2hlci0xODA4Njg4",
    "lastName": "Gabbard",
    "legacyId": 1808688,
    "numRatings": 12,
    "summary_comment": "The professor was generally accessible only through discussion posts, making the course easy to pass with minimal effort, though she provided little feedback. Some students found the class incredibly easy and praised the engaging topics and clear passion from the instructor, while others highlighted issues with module accessibility and delayed email responses. Overall, opinions varied widely, with some students finding it one of the best classes they had taken, while others considered it their least favorite due to communication difficulties.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 1,
        "comment": "This professor was not accessible, many times modules were not unlocked and email were not answered. Luckily the course is made up of discussion post mainly. Its an easy A if you like doing post. Doesnt give feedback either but hey what do you expect you read the top sentence. Easy course, you teach yourself mainly",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "Incredibly easy class. Gabbard doesn't unlock modules on time or answer emails quickly, but the assignments are incredibly easy. There's no textbook, she provides all readings, but sometimes you have to watch things on Netflix, YouTube, Hulu, etc. Would definitely take as an easy GE. Easy to get an A!",
        "course": "WGSST2230"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "Honestly my least favorite professor I've had in my entire college career. In an online class, she refuses to give you a syllabus that is accessible unless you're online to view it. When you contact her, she does not respond if an email is not up to her standards (without no example) and in an online class email is the only form of communication.",
        "course": "WGSST2230"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was amazing!! I learned so much from her class. The movies we watched were fun (Mean Girls, Easy A, etc.) and we would have discussions over them and the articles we had to read. There was a bit of work for this class and there are movie quizzes, but pretty much as long as you showed you were putting in effort, you would get an A.",
        "course": "WGSST3317"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best class I've taken at OSU so far! Sonnet is so passionate about the course and truly cares about her students. She makes lecture interesting and engaging. There limited outside graded work, but quite a bit of reading. It's so easy to participate in class because she covers super cool relevant topics. I (almost) wished the semester wouldn't end!",
        "course": "WGSST3370"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "LOVED this course with Sonnet. One of the best professors I have had. I enjoyed all topics discussed. This course helped me learn how to use proper terminology in relation to gender studies, which helped me tremendously in my profession. ",
        "course": "WGSST1110"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Sonnet was a good professor and very sweet. She was bubbly and passionate which made it easy to learn. She is a little strict with attendance though but if you show up and participate you should do pretty well. A lot of our grades were from weekly online posts in a forum.",
        "course": "WGSS3370"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very interesting class and great teacher. She's a very fair teacher overall. She does require attendance and doing the readings. She has pop quizzes based off of the readings but if you do them you will be fine. I would definitely recommend her!",
        "course": "WGSST1110"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 2,
        "comment": "Class can be rushed a times, needs to slow down and not cram so many activities in a single class session BUT one of the best classes and teachers I've had. HIGHLY recommend her. She will challenge you, engage your desire to learn and work with you every step of the way. Excellent, excellent instructor. Take her class, you won't regret it.",
        "course": "WGSS3370"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 3,
        "comment": "You are pretty much guaranteed an A if you show up and do the readings. Repeat - she is a stickler for attendance and encourages a ton of participation but the assignments are easy... she really just wants you to learn and participate and be engaged so grades aren't the most important thing. Great teacher, she'll like you if you come every day.",
        "course": "WGSS3370"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 2,
        "comment": "Flawless approach to teaching- best I've had in 4 years of college. She works through extremely hard readings with you and forces you to grow a lot as a human being but its relatively low stress otherwise. Super adorable and supportive and approachable.",
        "course": "WGSS3370"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is amazing. Probably the best teacher I have ever had in college. But you need to go to class and do the readings. She makes the class so that as long as you do the work and come to class you will do well. Definitely take her if you have the chance.",
        "course": "WGSST3370"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.1,
    "department": "Women's Studies",
    "firstName": "Raili",
    "id": "VGVhY2hlci0zOTcyNjU=",
    "lastName": "Roy",
    "legacyId": 397265,
    "numRatings": 9,
    "summary_comment": "The professor is highly regarded for her engaging lectures and interactive discussions, though some students find her grading criteria strict and her expectations for participation high. Her classes are generally well-organized, with clear lectures and comprehensive materials provided, making it easier to prepare for exams. However, some students note that she can be tough on those who are unprepared or unsure about course material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 3,
        "comment": "I handed in all my work passed all my assignments but couldn't do my final the day of bc my computer crashed and I was giving a C- with my average grade being 283 and her criteria grade was 310.. So confused",
        "course": "WS101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Amazing class. Very interesting. Have to do readings and study for tests, but she gives you everything you need to know. Unfortunately I was in the minority Fall 06 but I Loved loved loved it.",
        "course": "WS305"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Class in interesting, however she does shun you down if you don't know the answers, so be prepared.  Midterms are more than you would expect from a women's studies course.",
        "course": "WOMEN305"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Great class. Raili is a great lecturer and discussions/lectures are great. Does a great job of bringing concepts together. Smaller classroom so make sure you participate in discussions (do your readings)",
        "course": "WS305"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "If you want a great Women's Studies Class with a teacher that'll teach you something she is the lady. Go to class and do the reading you will be completely ready for anything she throws your way.",
        "course": "WS101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Guys if you are going to take a Women's Studies class take it with this woman. You are not going to get beat down daily for being male. Raili makes the class quite interesting and interactive, make sure to show up to lecture and you will have no surprises. Do the reading it's important!",
        "course": "WS101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "No Comments",
        "course": "WS101"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 2,
        "comment": "really easy class.  Organized lecture and notes.  There shouldn't be any surprises on the test but she took off for spelling on essay tests (which is crazy considering her english isn't always very clear.)",
        "course": "WS101"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "WS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.9,
    "avgRating": 4.3,
    "department": "Women's Studies",
    "firstName": "Malia",
    "id": "VGVhY2hlci0yMzIyMDI5",
    "lastName": "Womack",
    "legacyId": 2322029,
    "numRatings": 7,
    "summary_comment": "Professor Womack is highly regarded for her supportive and caring approach, providing timely feedback and creating a conducive environment for learning and discussion. Students appreciate her dedication to their success and find her classes insightful and engaging. However, some students have noted issues with unclear grading criteria and tough paper grading standards, which detracted from their overall experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I highly reccomend Professor Womack, she has went above and beyond to provide me with timely feedback I can use to successfully and confidently complete major writting assignments. She is very caring and supports students goals in learning.",
        "course": "WGSST2230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "This professor is very smart and really prioritizes the student before anything else. It would be really hard to fail this class if you showed up and participated. Don't fret over some of the harder readings! Just do your best and come with questions then you won't leave confused. Overall, love the teaching style of this professor!",
        "course": "WGSST2367"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class was a great expansion on a lot of gender studies concepts and Prof. Womack is a great resource on these topics!",
        "course": "WGSST2367"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "lots of class discussions, but she makes it very conducive to participation as well as an easy and fun experience!",
        "course": "WGSST236701"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really insightful and aspirational.",
        "course": "WGSST1100"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "You can tell she really cares about her students and wants them to succeed in the class and get something out of the material. Make sure to watch the weekly videos and follow the prompts for assignments and you shouldn't have any problems. She's also super responsive to email and will give feedback or guidance if you have questions!",
        "course": "WGSST2367"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 3,
        "comment": "I did not like this professor. She never used Canvas/Carmen for grades so you never know what your grade is for the class. She grades tough on papers, if you don't have a full page typed she will deduct points. Assignments were very vague and not all of them were on the syllabus. I enjoyed the class material, just not the professor.",
        "course": "WGSST1100"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 4.6,
    "department": "Women's Studies",
    "firstName": "Jonathan",
    "id": "VGVhY2hlci0yMDUwOTkx",
    "lastName": "Branfman",
    "legacyId": 2050991,
    "numRatings": 16,
    "summary_comment": "This professor is highly regarded for his insightful and organized teaching style, which creates an engaging and supportive learning environment. Students appreciate his clear communication, high standards, and personalized feedback, noting that his classes are both challenging and enjoyable. His dedication to helping students succeed is evident in his efforts to foster a positive community and improve their skills through interesting and relevant material.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really kind, insightful, and organized. Also really funny! I never found myself checking the clock during his class.",
        "course": "ENGL3707"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "He's very organized and clear, but also supportive. And he made the most supportive class environment that I've ever been in. He learned all our names the first day, and helped us all learn each other's names. It was really a good community environment for learning. ",
        "course": "ENGL3707"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "I learned something new in every class, and the readings always felt interesting/relevant. He has high expectations for essays, but also gives clear expectations and helpful feedback. In office hours, he really helped me improve my final essay. He also creates a really positive environment for class discussions.",
        "course": "ENGL3707"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "Would take again. Sometimes the workload got heavy, if we had a film + a long article due together. But everything we watched/read was interesting, and sometimes really funny! Professor Branfman also gives clear expectations and feedback for essays. He also brings lots of energy to every class, and you can tell he cares about everyone's success.",
        "course": "ENGL3707"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Great class, great professor. ",
        "course": "ENGL3707"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 4,
        "comment": "He's heading to Stanford next, and Cornell will miss him.",
        "course": "ENGL3707"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 4,
        "comment": "His first-year writing seminar was great! I thought I already wrote well before getting here, but he helped us all get much better at researching, outlining, writing, and proofreading. He has high standards, but he also really helps you meet them: he gives clear expectations and personalized feedback. Would take again!",
        "course": "ENGL3707"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 4,
        "comment": "Always looked forward to his class, and I'm trying to get a spot in his spring class. He's clear, funny, and fair, and the class topics always connect to real life. He has high expectations, but he makes a supportive environment for learning how to meet those expectations. If you take his class, you'll laugh a lot and learn a lot.",
        "course": "ENGL3707"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "He is not a great teacher. The class is discussion based, so you come to class just to talk about questions he poses. You have to speak at least 3 times which is frustrating because theres not always lots to say if you dont want to be repetitive (he will call u out for both). Directions are unclear and he waits till end of term to post grades..",
        "course": "FGSS4757"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 2,
        "comment": "Branfman is an incredibly captivating speaker and lecturer and is always very kind, open, and eager to help his students. His assignments were rather interesting and fun to do. He's funny, his enthusiasm is contagious, and whatever he has to say is guaranteed to be insightful.",
        "course": "FMST250"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely incredible professor. Gives great and informational lectures. Grades fairly and quickly. I learned an incredible amount from him and anyone would be lucky to take a class with him.",
        "course": "WGSST3317"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 2,
        "comment": "Took this class as a gen ed and didn't know much about women studies. Jon did an AMAZING job. I recommend him and this class to all my friends. He always sets clear expectations and returns grade SO fast. Fair amount of reading but it was interesting and I didn't mind. If you do reading and pay attention, tests/ papers are easy to ace.",
        "course": "WGSST2230"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "I recommend this prof to all my friends. Took his class for a GE and didn't expect much--but had an amazing time! I learned a ton that will really stick with me and applies to my everyday life. So glad I stumbled into this class and this prof. Jon was the best. Quick & fair grader, really engaging/fun teacher, and challenged us in the best way. ",
        "course": "WGSS 1110"
      },
      {
        "index": 14,
        "rating": 4,
        "difficulty": 4,
        "comment": "Very helpful and approachable, always happy to answer questions. Very well-organized (I mean the semester plan overall, the assignments, the layout of each class, everything). Always totally clear what's expected from students and why we're doing what we're doing.",
        "course": "WGSS 2230"
      },
      {
        "index": 15,
        "rating": 5,
        "difficulty": 3,
        "comment": "Excellent! Super genuine, creates a great positive classroom atmosphere, makes everyone feel valued when they participate. Passionate, smart, interesting, & knowledgable. Really great at respectfully challenging you to think critically about everything.",
        "course": "WGSS 2230"
      },
      {
        "index": 16,
        "rating": 5,
        "difficulty": 4,
        "comment": "Everything you could want: Passionate, energized, fast(!) grader,  totally clear explanations even on tough concepts, keeps your attention with funny lectures while still teaching you a ton. Plus Jon cares SO much about his students: If you seem down in class, or miss class, he'll always ask if you're okay.  You definitely have to read and show up.",
        "course": "WGSS 1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.9,
    "avgRating": 2.6,
    "department": "Women's Studies",
    "firstName": "Lin",
    "id": "VGVhY2hlci04MjQ3MjY=",
    "lastName": "Distel",
    "legacyId": 824726,
    "numRatings": 13,
    "summary_comment": "This professor is widely regarded as one of the toughest instructors, known for her demanding workload and strict grading criteria. Students consistently report that her classes are significantly more challenging than expected, often requiring extensive time and effort to succeed. Reviews are overwhelmingly negative, with many advising against taking her classes unless one is prepared for a significant challenge.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 4,
        "comment": "This was the worst class I have ever taken, I took it during the summer and it was 3 hour credit class, the work felt like I was taking a 5 hour credit class. She doesn't even follow MLA format, it seems like it is something she just made up. DO NOT TAKE!!!!",
        "course": "WGSST1110"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dude all I can say is, mistake of your life if you take this class. No one liked the class for a reason, you see the ratings. Dont do it to urself. Trust ",
        "course": "WGSST1110"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 5,
        "comment": "im an A/B student and i took one of her classes before this that wasnt hard at all. however, this class was THE hardest class i think i have ever taken for a class that is only filling a GE for me. if i couldve picked ANY other class, I WOULDVE. do not recommend her at. all. i received a C+ in her class, and how i even managed that i have no idea.",
        "course": "2215WGSST"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "Im sick of hearing dont drop this class everyone can do it shes by far one of the hardest and worst instructors Ive ever had. Shes very hard. If youre looking for hard work for a class that could be very simple, take her. I believe shes been doing this this for too long and needs to be done. She does the worst in explaining assignments.",
        "course": "WOMEN110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 3,
        "comment": "Absolutely loved this class and professor! Definitely take her class, you won't regret it!!",
        "course": "WOMEN110"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wish I would have researched this professor prior to taking her online class. I am an A student and this will be my first C ever. She does not explain things clearly, and even when you follower her ruberic, she will still tax you heavily &quot;grade wise&quot; if you are not specific enough to her standards. PLEASE AVOID HER AT ALL COST. VERY BAISED.",
        "course": "WOMEN110"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very difficult online class. Lin is a very tough grader and there are a lot of tests with super specific questions. There is a lot of work and a lot of readings every week. If you want an easy A dont take this class. You have to put in a lot of time and effort to pass.",
        "course": "WGSST1110"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "Lin Distel is a professor who makes you work for your grade. You will not pass if you dont review her syllabus and evaluative criteria. This is a session 1 online class and its very fast-paced. You have to read the assigned readings. You can get an A but you have to work for it, its too hard for a 1000 level GE.",
        "course": "WGSST1110"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 4,
        "comment": "Honestly stay away from at least her online classes very unclear on the instructions and frankly not a very good class to take online.",
        "course": "WMNSTUDS326"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 3,
        "comment": "I first liked this teacher...then one day after class she got in my face and yelled at me telling me i was disrespectful for talking in her class and that i was not aloud to sit next to my friend anymore..the funny thing is i never even said a word to my friend during the class period..all i did was laugh at something that was funny.",
        "course": "WOMEN110"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 1,
        "comment": "This teacher is absolutely amazing!  One of my favorites!  She keeps discussion interesting and listens to everyone's opinions.  Readings are easy and interesting because they apply to things that affect our daily lives.  I would definitely recommend taking this class for an easy grade that you actually enjoyed!",
        "course": "WS110"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best instruction I've had at OSU. very discussion based, very intellectually stimulating. Hard exams but very fair. Must participate in discussion for good grade. Loved going to her class. Brilliant woman.",
        "course": "WS324"
      },
      {
        "index": 13,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Distel is great. TAKE THIS CLASS.  Class is 100% discussion so be prepared to talk or it will seriously affect your grade. LOVED IT!",
        "course": "WMNSTUDS326"
      }
    ],
    "SEI": [
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "18315",
        "Term": "SU 24",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "6",
        "Rating": "3.5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "14581",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "S",
        "Responses": "5",
        "Rating": "4.6"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "18941",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.67"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "14582",
        "Term": "SU 20",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "S",
        "Responses": "7",
        "Rating": "4.86"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "16234",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.71"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "34634",
        "Term": "SP 21",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.36"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "14563",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "S",
        "Responses": "3",
        "Rating": "4.67"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "14564",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "18909",
        "Term": "SU 21",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "12",
        "Rating": "4.58"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "10185",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.4"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "10445",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "4.3"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "23916",
        "Term": "AU 21",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "18",
        "Rating": "4.33"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "10193",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "4",
        "Rating": "3"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "10375",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.07"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "14201",
        "Term": "SP 22",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "10",
        "Rating": "2.9"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "14980",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "S",
        "Responses": "1",
        "Rating": "5"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "18980",
        "Term": "SU 22",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "8",
        "Rating": "4.13"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "14374",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "3.43"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "14599",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "4.54"
      },
      {
        "Subject": "WGSST",
        "Catalog": "2215",
        "Class Name": "Reading Women Writers",
        "Class Number": "26886",
        "Term": "AU 22",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "3.22"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "16788",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Mansfield Campus",
        "Medium": "Distance Learning",
        "Campus": "MNS",
        "Class Size": "M",
        "Responses": "11",
        "Rating": "3.82"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "16942",
        "Term": "SP 23",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "13",
        "Rating": "3.85"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "18900",
        "Term": "SU 23",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "7",
        "Rating": "4.57"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "17548",
        "Term": "AU 23",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "14",
        "Rating": "4.07"
      },
      {
        "Subject": "WGSST",
        "Catalog": "1110",
        "Class Name": "Gender, Sex and Power",
        "Class Number": "17402",
        "Term": "SP 24",
        "College": "Arts and Sciences",
        "Department": "Newark Campus",
        "Medium": "Distance Learning",
        "Campus": "NWK",
        "Class Size": "M",
        "Responses": "9",
        "Rating": "3.22"
      }
    ]
  },
  {
    "avgDifficulty": 3,
    "avgRating": 2.3,
    "department": "Women's Studies",
    "firstName": "Elizabeth",
    "id": "VGVhY2hlci0xMjc5NTkx",
    "lastName": "Simoneau",
    "legacyId": 1279591,
    "numRatings": 2,
    "summary_comment": "The professor conducts a highly discussion-based class with lenient grading on quizzes and projects, allowing up to three absences without penalty. However, students find it challenging to participate effectively due to infrequent reading assignments, and some complain about the professor picking favorites and being overly strict with grading.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 1,
        "comment": "The class is very discussion based. There aren't many reading quizzes, but there are randomly some. It's difficult to participate in the discussion if you haven't read. She is a very easy grader on quizzes and projects. We had a couple of extra credit opportunities this semester. She allows you to be absent 3 times before being docked. ",
        "course": "WGSST1100"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 5,
        "comment": "how can english majors get A's in their english classes, but not even get near that in a ws writing class&#63; picks favorites, ridiculous grader.",
        "course": "WS3671"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4,
    "department": "Women's Studies",
    "firstName": "Dong Li",
    "id": "VGVhY2hlci0xMjEwMjAx",
    "lastName": "Isbister",
    "legacyId": 1210201,
    "numRatings": 4,
    "summary_comment": "This professor is generally well-regarded for her engaging and sweet demeanor, effective teaching methods, and clear communication in English. However, opinions vary: some find her classes easy and enjoyable, while others criticize her for excessive reading requirements and lack of substantive discussion, deeming her class unengaging and a waste of time.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "A lot of readings, but if you read most of them then you'll be fine. She loves what she teaches and it shows. Have respectful discussions and listen to others and the class will be really easy.",
        "course": "WOMGENDR1130"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "she's very sweet and nice. speaks fantastic english. teaches the material well. told great stories. all around good professor",
        "course": "WOMGENDR1130"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 1,
        "comment": "Dong is a sweet person, but a terrible teacher.  You have to read 6 books, but you never get to discuss any of them; it's a total waste of time.  The class is super easy, but it's so boring that you'll never want to go to class (and it's required).  Absolutely the worst class I have taken at OSU.",
        "course": "WS215"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Not a hard teacher at all. If you are not WS major or never taken one before she would be good for you. Not very exciting though if you already know your stuff.",
        "course": "WS215"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.7,
    "avgRating": 4.8,
    "department": "Women's Studies",
    "firstName": "Sara",
    "id": "VGVhY2hlci03MzMzNzY=",
    "lastName": "Finch",
    "legacyId": 733376,
    "numRatings": 7,
    "summary_comment": "This professor is highly regarded for her effective teaching methods and ability to facilitate thoughtful discussions on controversial topics. Students find her classes both engaging and respectful, with many noting her ease in guiding difficult conversations while ensuring all viewpoints are considered. Her approachable nature and clear study guides contribute to a positive learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "I still remember this professor and class sometimes. I learned about gender and it made me think.",
        "course": "WS101"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 1,
        "comment": "she's an easy teacher if you read all the readings and participate in class. very interesting class!!!!!!",
        "course": "WOMSTDS101"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Sara is awesome",
        "course": "WOMENSTS101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was a great teacher...some of the issues we discussed were very controversial, and I thought she did an awesome job of making sure that everyone's views were respected. The class was very interesting!",
        "course": "WS101"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Very easy class.  Assignments are easy and she gives study guides for the exams.  Great GEC.",
        "course": "WS101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome",
        "course": "WMSTD101"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "No Comments",
        "course": "WS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Yuchen",
    "id": "VGVhY2hlci0yMjQ0OTQy",
    "lastName": "Dong",
    "legacyId": 2244942,
    "numRatings": 1,
    "summary_comment": "The professor is highly regarded for their engaging and enjoyable teaching style, characterized by a mix of humor and interesting content that makes the class exceptionally appealing.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Very nice professor! Humor and fun! Very interesting content in the class. Loved it!",
        "course": "BIO2221"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.3,
    "avgRating": 4.5,
    "department": "Women's Studies",
    "firstName": "John Brenden",
    "id": "VGVhY2hlci0xNDEyMTky",
    "lastName": "Shaw",
    "legacyId": 1412192,
    "numRatings": 8,
    "summary_comment": "This professor is highly regarded for making the English class engaging and enjoyable, with a focus on interactive group work and interesting discussions. Students appreciate his understanding and caring nature, especially during stressful times. While the course involves significant reading, particularly challenging at times, the exams are relatively easy, and the overall experience is described as entertaining and fun.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Very interesting person(in a good way). Helpful and caring. Actually makes English class somewhat fun and hobby quickly. I love the interaction the group work in class it enable students to practice what is learnt under supervision and consolidates the knowledge",
        "course": "ENG1101"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 4,
        "comment": "His class was interesting in its own right, and he did a good job of picking and presenting the material. Lots of interesting class discussions. He was also one of the most understanding professors I've had, especially after the violent incident mid-semester. He seemed really stressed out all the time but he really seems to care about his students.",
        "course": "COMPSTD2264"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great professor, super easy course and absolutely hilarious. Cares about \"participation,\" but that means attend class and answer a question every few days. Incredibly easy tests, as subjects and questions are very broad and easy to apply. Reading most nights, but it is usually short articles online.  Very interesting course, and Shaw is a great guy",
        "course": "ENG2264"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Brendan always kept the class entertaining; probably my favorite lecturer thus far! you will have to read a lot and some of them can be challenging to understand the first time through but he does an amazing job helping you decipher them! The tests a really easy and the papers we not bad at all!",
        "course": "AFAMAST2281"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 2,
        "comment": "Tons of readings that were clearly written for a much more advanced audience. Definitely not an intro class, and not what you'd expect after reading the course description.",
        "course": "WGSS2282"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 2,
        "comment": "Brendan is AWESOME the readings are pretty tough and a lot of theory to understand but the midterm and final are a piece of cake. You can tell he's passionate about what he teaches, such a fun class! More like hanging out with friends!",
        "course": "QUEERSTUDIES"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "LOVE Brendan! (He goes by Brendan, not John.) Always makes class entertaining, overall just funny nice guy. Knows the subject and clearly loves it, chooses decent movies for the class. Readings suck but you aren't tested on them so they aren't a big deal. Go to class!! Definitely recommend this class with Brendan.",
        "course": "WGSS3317"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 2,
        "comment": "Brendan is HILARIOUS! he keeps the class really interesting and is very helpful in answering any questions you have. You watch great movies too! HIGHLY RECOMMEND this class",
        "course": "WS317"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.3,
    "department": "Women's Studies",
    "firstName": "Skylar",
    "id": "VGVhY2hlci0xMjYwMTg2",
    "lastName": "Bre'Z",
    "legacyId": 1260186,
    "numRatings": 5,
    "summary_comment": "The professor is perceived as inconsistent among students; some find her helpful and effective, particularly in encouraging class participation and providing support for writing and presentations, while others describe her class as repetitive and biased, leading to disappointment and minimal learning. Overall, opinions vary widely, with some students finding the class easy and enjoyable, while others regret their choice due to the repetitive nature and the professor's strong ideological stance.",
    "Ratings": [
      {
        "index": 1,
        "rating": 1,
        "difficulty": 5,
        "comment": "Awful.",
        "course": "WGS200"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "Pretty easy class. Nice prof.",
        "course": "GWS1000"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "I was really excited to be taking Gender Womens Studies but after taking it I regret it. The class isn't hard. Just show up but in class you repeat and talk about the same things every single day. She is a hard core feminist and if you don't agree with her then she will give you a strange look. I didn't learn much.",
        "course": "GWS2000"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is very helpful, and she teaches very well. her class participation is very essential. you have 3 papers(she grades tough on ) and 2 presenattions(easy).. dont get scared, because she is still very helpful, im not a strong writer but with her help she has taught me a lot and made me better. she likes you to talk professional in papers.",
        "course": "WMNST367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Skylar is a really good teacher.  She creates an atmosphere that makes her students comfortable and want to talk in class.  She's a fair grader and attendance isn't required, but it is strongly recommended.  READ THE BOOKS.  Only 3 papers and 2 presentations, but they're not bad.  Highly recommended this class and this teacher.",
        "course": "WS367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4.8,
    "department": "Women's Studies",
    "firstName": "Andrea",
    "id": "VGVhY2hlci0xNDQ5MDM0",
    "lastName": "Breau",
    "legacyId": 1449034,
    "numRatings": 5,
    "summary_comment": "This professor is highly regarded for her impactful teaching, particularly in transforming students' perspectives on feminist issues through comprehensive and thought-provoking material. While her classes involve substantial reading, students find the content valuable and engaging. Her dedication and willingness to assist students are consistently praised, making her both an effective instructor and a supportive presence in the classroom.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "This class completely changed my perspectives on the feminist movement, and made me SO much more aware of the problems that racial, class, gender, etc. biases can present for women. Readings sometimes took a while, but were well-worth it. Assignments were easy, as long as you read the learning objectives for each unit!!!",
        "course": "WGSST2367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great experience in my first womens gender class. Very prompt and specific for all class details. ",
        "course": "WG236701"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Andrea is an amazing instructor. She helps students when necessary but allows them to think for themselves. Class is a safe space where you can freely talk about sex and sexuality. Lots of reading, but interesting material. Highly recommended course and instructor.",
        "course": "CS214"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 2,
        "comment": "She loves what she does and what she teaches, and she's smoking hot. So you'll want to go to class.",
        "course": "WS110"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Loves what she does and is always willing to help. Lot of reading and writing assignments, but none are too challenging. Love to have her again.",
        "course": "WSTD110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 3.3,
    "department": "Women's Studies",
    "firstName": "(brena) Yu-Chen",
    "id": "VGVhY2hlci0xNDgyMzc2",
    "lastName": "Tai",
    "legacyId": 1482376,
    "numRatings": 3,
    "summary_comment": "The professor is highly organized and effective in explaining course material, leading to student success; however, some students note that she grades on the harsh side, particularly for writing assignments. Overall, she provides valuable learning experiences and is recommended by many students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took her in an online class. She was very organized and explained what she wanted well. I got an A. It wasn't an easy A, I worked hard, but I did feel like I actually learned a lot when I just took this class for GE credit. I would recommend her.",
        "course": "2215"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Brena is a fantastic, well organized and informed professor. She does tend to grade a little harshly, but let's be real: this is a 2nd level writing course.",
        "course": "WGSS236702"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 4,
        "comment": "She taught a good class with interesting readings. But she graded too hard on the writing and could only read printed writing.",
        "course": "LITER210"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.4,
    "avgRating": 2.1,
    "department": "Women's Studies",
    "firstName": "Adrienne",
    "id": "VGVhY2hlci0zNDc5ODI=",
    "lastName": "Livingston",
    "legacyId": 347982,
    "numRatings": 30,
    "summary_comment": "Professor Livingston is highly regarded for her rigorous approach to teaching, emphasizing deep analysis and argumentative writing over mere summary. However, her classes are also criticized for being unstructured and disorganized, with some students finding them confusing and frustrating due to her lack of preparedness and inconsistent communication. Overall, while some find her challenging and rewarding, others warn of significant organizational issues and unreliable grading practices.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Prof Livingston is a very wise person. some say that her class is hard simply because she requires that we take the readings seriously and learn how to interpret and write about the passages in a argumentative way, instead of simply writing summaries of the readings. You will learn a lot from her, trust me.",
        "course": "WGSST236704"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 2,
        "comment": "I understood that her expectations of the students were to think beyond the material spoken in class and make your own conclusions. I think many of us are not push to think beyond a set box frame and that could possible make it difficult class for some individuals. I am proud of the learning experience I gained from the class.",
        "course": "AFAMST36703"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "This is the worst professor I have ever had. Her lectures are completely unguided ramblings about her politics. Her tests are easy, but only if you copy word for word her answer, which isn't always correct. She actually did not show up for our final exam and have not received a final grade for the course 2 months later. Avoid at all costs.",
        "course": "AFAMAST2281"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Oh man. This woman is for sure the worst teacher that I have ever had. She doesn't use notes or slides, she just sits at the front of the room and talks. Her answers are the only right answers. She didn't give a rubric for an 8-10 page paper. Please believe me when i suggest that you do not ever ever ever take her class! Seriously don't do it.",
        "course": "AFAMAST2281"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Don't take this class. She doesn't follow the syllabus, and no one knew what book we were supposed to be reading at any given time. She shows up late to class, doesn' come, or does come then says class is canceled. My final grade will be a huge surprise because I have only received one grade so far and there's  1 more week in the semester. AVOID.",
        "course": "AFAMAST236704"
      },
      {
        "index": 6,
        "rating": 2,
        "difficulty": 4,
        "comment": "Probably the worst professor/teacher I've had so far in my life. Very unorganized and didn't have a structure. She sometimes would go off topic and ramble. The tests ask a lot of ambiguous questions that could really effect your grade. I wish I would of avoided her class.",
        "course": "AFAM2281"
      },
      {
        "index": 7,
        "rating": 1,
        "difficulty": 4,
        "comment": "She has a weird laugh and can be very disorganized when it comes to telling you what's required for papers & exams. The trick to pass her class and do very well in the class is GO to her office hours. She will definitely explain what she is looking for in more simple details. Please go to office hours",
        "course": "AFAM121"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 3,
        "comment": "Don't even go there! If she's your teacher just drop the class while you can. I still haven't recieved a grade, school ended a week ago, her final was 2 weeks ago. She's disorganized, gives the wrong readers, says she'll do things but never does. It was a bad experience.",
        "course": "AFAMAST2281"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 3,
        "comment": "Horrible teacher!!! One of the worst I've ever had. NO office hours ever. No syllabus up-to-date for our class. NEVER answered any emails I sent. NO CLARITY at all in direction she wants for papers and offers NO useful feedback at all. TRUE- GRADES ON A WHIM! AVOID at all costs!!! I didn't listen to these reviews and I truly suffered. Save yourself",
        "course": "WGSS2367"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 4,
        "comment": "She was the worst professor I have had at OSU. She never answered emails, would not show up to class without telling us, and obviously didn't want to teach. She grades arbitrarily and penalizes you for independent thinking. Avoid this professor.",
        "course": "WGGST2367"
      },
      {
        "index": 11,
        "rating": 1,
        "difficulty": 2,
        "comment": "Avoid her. Easy class yes, but she grades on a whim even if you write an A paper she'll give you a B and offer no good reason for it. Horrible at clarity for papers and seems full of her own opinion. Disorganized all the time and didn't even show up to our final, we had to go give her our papers personally since she didn't trust the internet.",
        "course": "WGSS2367"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 3,
        "comment": "Awful at answering questions, shows very little interest in student input. Extremely disorganized, puts next to nothing on carmen, does not follow syllabus, & you will not know when things are due unless you go to class because that is the only time she will tell you. She will briefly mention it at the end of class...if you don't hear, you're sol.",
        "course": "WGSS2367"
      },
      {
        "index": 13,
        "rating": 1,
        "difficulty": 4,
        "comment": "I felt like I learned absolutely nothing from this class.  If you tried to voice an opinion or discuss a topic she did not want to discuss, she would gloss over it and give it no consideration.  She was constantly late to class, disorganized and generally not very knowledgeable.  The reading choices were good but quite frankly, wasted on her.",
        "course": "LIT367"
      },
      {
        "index": 14,
        "rating": 2,
        "difficulty": 3,
        "comment": "She is by far the worst teacher I have ever had. She is never prepared for class, so rambles about useless topics and she gives the worst essay prompts. She grades ridiculously and is really just a horrible teacher. AVOID HER!!!!",
        "course": "AMAF367"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is a wholly bith",
        "course": "AM367"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "Horrible teacher! All you do is read books and then she rambles about the books. Receive vague prompts for papers and do not get much guidance. She is very opinionated about topics, lazy teacher, and does not seem to prepare much for class. Also, have a vague syllabus without a distinct timeline. I would recommend not taking a class with her!",
        "course": "AFRAM367"
      },
      {
        "index": 17,
        "rating": 1,
        "difficulty": 5,
        "comment": "she sucks",
        "course": "FFFFZFZ"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 3,
        "comment": "This is the WORST prof I have had during my time at OSU.I have taken many courses and been very happy with every professor in the department. However, this woman offers no feedback, is lazy, unorganized, and really unhelpful. DO NOT TAKE THIS COURSE WITH LIVINGSTON!",
        "course": "WS367"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hands down, worst prof I've ever had!  She does nothing to try to help students and you get no grades/feedback until week 8.",
        "course": "WS367"
      },
      {
        "index": 20,
        "rating": 2,
        "difficulty": 3,
        "comment": "Prof Livingston is a good story teller but she is rather disorganized and vague. No grades were given at all in the class we weren't even given the chance to dicuss or grades before she sent them to the registrar. She graded things according to the way she felt and really didn't have a grading rubric. I avoid her classes. never again.",
        "course": "AAAS201"
      },
      {
        "index": 21,
        "rating": 1,
        "difficulty": 4,
        "comment": "very disorganized, she missed class with no notice  when papers were due ..leaving students confused.  she forgot to post one of our righting assignments so she droped it...she didnt seem to prepare anything for class she just seemd to ramble",
        "course": "WMS306"
      },
      {
        "index": 22,
        "rating": 3,
        "difficulty": 2,
        "comment": "She is a wonderful storyteller; great at reading aloud. The class was easy. Somehow, I got a B despite bombing the  only (I think...) test and turning in two papers extremely late.",
        "course": "WS267"
      },
      {
        "index": 23,
        "rating": 1,
        "difficulty": 4,
        "comment": "Worst professor EVER!The syllabus means nothing to her.Requirements for writing papers were not discussed until AFTER the papers were due.Her grading is arbitrary and random, plus no grades until week 9.I have no respect for her as a professor.",
        "course": "AAAS36704"
      },
      {
        "index": 24,
        "rating": 3,
        "difficulty": 2,
        "comment": "Her classes are mostly just discussions among students.  Was fairly easy going with papers (she extended due dates on several) Loves an independent thinker, and throw in some feminism (it's a women's studies class for pete's sake!)",
        "course": "WS36704"
      },
      {
        "index": 25,
        "rating": 2,
        "difficulty": 3,
        "comment": "She didnt seem very interested in teaching. Spent most of the class talking about things not relevant and never had papers graded on time. I took the class last quarter and only knew the grade of one of my 4 papers!",
        "course": "WS36704"
      },
      {
        "index": 26,
        "rating": 3,
        "difficulty": 1,
        "comment": "I had a very very easy time in this course. Just do the readings and &quot;by the book&quot; essays and you will sail to an A.",
        "course": "WS36704"
      },
      {
        "index": 27,
        "rating": 3,
        "difficulty": 4,
        "comment": "No Comments",
        "course": "WS36704"
      },
      {
        "index": 28,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very good prof.  Papers are tough, and you MUST do the readings.  She has a few pop quizzes so you have to be on top of your reading and notes. I enjoyed knowing that any good grades that I got were well deserved.",
        "course": "WS36704"
      },
      {
        "index": 29,
        "rating": 4,
        "difficulty": 5,
        "comment": "I really like Prof. Livingston because she knows what she's talking about, and she makes you think during discussions. I would warn anyone considering taking her class, however, that there's no b.s.-ing her papers. She's very strict about what she wants.",
        "course": "WOMST367"
      },
      {
        "index": 30,
        "rating": 5,
        "difficulty": 5,
        "comment": "Very interesting class, I learned a lot.  She makes you think for yourself, but she's really tough on your papers..she likes them very structured.  Most challenging writing class I ever took -- went to office hours often, and the writing center weekly!!",
        "course": "WS367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.6,
    "avgRating": 3.2,
    "department": "Women's Studies",
    "firstName": "Sharon",
    "id": "VGVhY2hlci02MDI3MzI=",
    "lastName": "Collingwood",
    "legacyId": 602732,
    "numRatings": 9,
    "summary_comment": "Professor Collingwood is known for her demanding and time-intensive classes, requiring significant effort and multiple assignments per week. Her teaching style is described as biased, making it challenging to perform well without aligning with her views, though some students find her lectures interesting. The class structure, particularly the reliance on technology, varies among students' experiences, with some finding it overwhelming while others appreciate the challenge.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class was hard for a GEC. Lots of work each week. Lots of readings, quizzes, papers, etc. Very little time to do so. This class requires a lot of time and effort. Harder than my nursing courses. Have to attend virtual online classroom, which we didn't know before we signed up for the class, or you have to write two papers a week.",
        "course": "WGSST1100"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 4,
        "comment": "Interesting material, biased teaching.  You basically have two options to do well. 1)  Agree with EVERY word she says (or at least keep your mouth shut if you don't).  2) Work your butt off to make up for your opposing position.  I chose the latter and got an A, but it was miserable.  Also, don't count on her grading papers in a timely manner.",
        "course": "WGSST110D"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 4,
        "comment": "I had Prof. Collinwood for Eng 592, which was Women's Science Fiction. Although the lectures were interesting and she obviously had done her research, her instructions were vague, the reading schedule was chaotic, and her writing assignments were due on a SATURDAY night!! Crazy! She is also a subjective grader; her grading often makes no sense.",
        "course": "ENG592"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Collingwood is an interesting character! Her online Women's Studies course is taught on Second Life. If you do the work and keep up w/ the readings you can easily get an A. Attendence is important, so if you don't like computers don't take this class -- lot's of work but not hard! I recommend it.",
        "course": "WMSTD110D"
      },
      {
        "index": 5,
        "rating": 3,
        "difficulty": 3,
        "comment": "When it comes to French, she's an average professor--not too easy, not too difficult. She makes up games that are sometimes difficult to see the relevence to the text. Considering the material, she does a pretty decent job with what she's given. Be prepared for MANY red marks on exams, but the grades don't seem to reflect the amount of marks.",
        "course": "FRENC104"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "I agree...it is near impossible to get an A in her class...I recieved one 88% in her class and all my other grades were an 92% or better, with even a 98% on her midterm and I recieved a B+.  Trust me...its impossible to get an A.",
        "course": "WOMEN110"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 2,
        "comment": "I was deeply inspired and fascinated by Professor Collingwood. As an honors student, as well as a hard worker, I found the class to actually be quite easy-minimal memorization, easy papers and projects, and a clear note taking style. she wasn't great with a computer but she compensated by KNOWING her notes inside and out, unlike msot of my professo",
        "course": "WS110"
      },
      {
        "index": 8,
        "rating": 3,
        "difficulty": 4,
        "comment": "I agree with the other review that the computer aspect makes things way more difficult than they'd need to be.. I hated the class when I was in it (only took it because I needed an honors course) because I did not agree with anything she taught.. Looking back though it's one of my favorite classes ever.  And yes, tons of work.",
        "course": "WOMSTDH101"
      },
      {
        "index": 9,
        "rating": 4,
        "difficulty": 5,
        "comment": "She is an interesting lady who deeply understands what she is teaching and the class lectures are always interesting and stimulating. However, if you take this class be prepared for a huge workload and a guaranteed B because no matter how hard you try on the assignments it's impossible to get higher than a 90.",
        "course": "WSH101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.7,
    "department": "Women's Studies",
    "firstName": "Stacia",
    "id": "VGVhY2hlci0xMDMwNzY5",
    "lastName": "Kock",
    "legacyId": 1030769,
    "numRatings": 6,
    "summary_comment": "Stacia is an excellent professor known for her clear expectations and challenging yet engaging teaching style, which ranges from introductory to advanced levels. Students appreciate her thorough explanations and ability to make complex material accessible, though her upper-level classes can be demanding. Overall, she is highly recommended for her fairness, dedication, and ability to maintain high academic standards while fostering an interesting learning environment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "I have had Stacia for classes from intro-level to advanced seminars and she is GREAT. She is very clear on what she expects you to know and challenges you to apply it critically. Her intro is a cinch, but don't let that fool you- her upper level classes kicked my butt. She loves to assign long readings as the level increases. Def take her, though.",
        "course": "WGSS320"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Really hot. Really nice. Good prof to have.",
        "course": "FYSADC"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "She is a great teacher, it was her first time teaching the course and we had a lot of work. But other than that the class was interesting and engaging. I would take another class from her again!!!!",
        "course": "WS320"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "She is a great professor, she grades fair and wants her students to do well. There was a lot of material in the class but prudential that she is a great teacher, I would take another class she taught hands down!!!!",
        "course": "WS320"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 5,
        "comment": "Hottest prof I've ever had.  Explained everything wonderfully well.  Kept the class difficult, but made the information easy to understand!  Oh, how I wish she were single!",
        "course": "WMSTU101"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Awesome teacher! Loved the class, nothing overly hard, but very interesting. Opportunity every class for extra credit.",
        "course": "WMST101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 4.4,
    "department": "Women's Studies",
    "firstName": "Ruby C.",
    "id": "VGVhY2hlci0zOTE0MjI=",
    "lastName": "Tapia",
    "legacyId": 391422,
    "numRatings": 13,
    "summary_comment": "Professor Tapia is highly regarded for her clarity and ability to maintain engaging discussions, making her courses both challenging and rewarding. Students appreciate her fairness, availability, and willingness to help, though some note that she expects significant effort, particularly in terms of reading and writing. Overall, she is seen as an excellent educator who fosters active participation and intellectual engagement.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "This professor is really clear and keeps the topics interesting. If you can get her as your discussion leader too.",
        "course": "WMSTD240"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 3,
        "comment": "Professor Tapia engages her students at a high level, even though her course listings say otherwise. If you are looking for a challenging class, she is your lady. You will read a lot. You will write a lot. If you aren't willing to work, then don't waste your time. She is a very fair grader, availible and willing to help, and very easy on the eyes!",
        "course": "CPSTD205"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Tapia is a fair and excellent teacher. She seems to be brilliant and is very knowledgeable in regards to the literature that is discussed. Participating in discussions is required, but as long as you engage somewhat, you will do fine (I got an A). Definitely an educational teacher and course.",
        "course": "CSH100"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 4,
        "comment": "Professor Tapia HAD PNEUMONIA and stayed in communication with students about all UNAVOIDABLE cancellations. this previous comment is entirely misleading.",
        "course": "CS358"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Her class was very engaging and sometimes the class discussions were heated.  She did well to keep me interested even though I came into the class dreading every last second.",
        "course": "CS205"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great topic. Lots of reading! Not too good with responding to emails and other requests. Says she gives 100% effort on her behalf, it seemed more like 75% effort. Just a lot of reading and two good size papers. Very easy on the eyes.",
        "course": "CS205"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Tapia is a cool teacher. She's very intelligent and knows her stuff. She has great discussions and doesn't knock you for openly speaking your mind. She seems down to earth and isn't stuck up or stuck on herself like these other professors.",
        "course": "COMPS205"
      },
      {
        "index": 8,
        "rating": 5,
        "difficulty": 3,
        "comment": "GREAT FOR DISCUSION",
        "course": "COMP205"
      },
      {
        "index": 9,
        "rating": 1,
        "difficulty": 1,
        "comment": "Class was cancelled 8 times in one quarter. N objectves of class were meet. Ten page paper due at end not relating to class at all.",
        "course": "WS576"
      },
      {
        "index": 10,
        "rating": 5,
        "difficulty": 1,
        "comment": "Enjoyed her class very much.  Class load is very light.  Discussions were very interesting and she is an easy grader.  I would definitely recommend this professor.",
        "course": "FRESHSEMINAR"
      },
      {
        "index": 11,
        "rating": 5,
        "difficulty": 3,
        "comment": "best prof. i've had yet. she's awesome.",
        "course": "WOMSTDS101"
      },
      {
        "index": 12,
        "rating": 5,
        "difficulty": 3,
        "comment": "What an awesome teacher.  She actually made me love this class so much that I am doubling in Women Studies now.  Very clear lectures.  Always welcome to answer questions. Awesome prof",
        "course": "WS101"
      },
      {
        "index": 13,
        "rating": 4,
        "difficulty": 3,
        "comment": "No question this woman is on her game.amazing lectures-lots of class discussion-totally flexible with students",
        "course": "LATINA"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 4,
    "department": "Women's Studies",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0xMjA4MTEz",
    "lastName": "Dudley",
    "legacyId": 1208113,
    "numRatings": 4,
    "summary_comment": "Professor Dudley is highly knowledgeable and passionate about her subject, fostering engaging discussions and fair grading. However, she can be strict regarding attendance and communication, and her teaching style may not suit all students, particularly those who prefer less discussion and more traditional lectures. Overall, her classes are recommended for their depth and relevance, though students should be prepared for a rigorous and sometimes demanding environment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 3,
        "comment": "Great prof. Taking her WGS 200 class at GVSU now. She knows what she is talking about. Although, she isn't very empathetic and takes a long time to respond to emails -- if she even gets to it. Other than that she is very strict at the beginning, but warms up as the class continues. She does take off 1/3 of a grade for every class missed. ",
        "course": "WGS200"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "Instructor Dudley is a funny, friendly teacher. The class is a lot of discussion, and she will make you talk if you are quiet. She grades fairly on the quizzes and assignments.  I enjoyed this class, and definitely her teaching method. I recommend taking this class.",
        "course": "WS110"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "Professor Dudley is very passionate about teaching and allows students to have a conversation that lasts a long time. It's not a hard class if you do the reading. There are 6 quizzes, two papers, and a midterm and a final. She grades fairly on everything, and definitely negotiates on almost everything. Take this class it's amazing!!!!",
        "course": "WS110"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "A good class to take. Instructor Dudley loves teaching women's studies!! She assigns a lot of reading BUT picks really interesting pieces so it's not bad. If you are a conservative (politically) you might reconsider unless you have a strong stomach. However, she does not push her opinions on you. No reason anyone cannot get an A with a little effor",
        "course": "WS110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.6,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Haley",
    "id": "VGVhY2hlci0xNjk0MjU2",
    "lastName": "Swenson",
    "legacyId": 1694256,
    "numRatings": 5,
    "summary_comment": "Dr. Swenson is an excellent instructor known for her clear expectations and supportive approach. Students appreciate her fairness, friendliness, and the abundance of resources she provides. Her classes are generally easy with minimal required work, focusing on discussions, a few papers, and presentations. Overall, she is highly recommended for those seeking an accessible and engaging learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Swenson is a good instructor. She is very clear on what she wants out of her students from the beginning of the semester. She is a fair grader, but you have to read the material to do well. She doesn't make you buy any books, but she posts a lot of readings online for the class. Easy A if you try, and read the majority of what she gives you.",
        "course": "WGGST230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Dr. Swenson is fantastic. This class counts as a VPA GE and is super easy. One discussion board post a week doing a one paragraph analysis of a quote you pick from the reading, 2 exams (no time limits) and 2 projects. She is so friendly, communicative and helpful. She posts mini-lectures and tons of additional info on each weekly topic.",
        "course": "WGGST2230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "Haley is one of the best professors I've had at Ohio State! Her lectures are always well prepared and informative and she's just a fun professor in general. I definitely recommend!",
        "course": "WGSS4524"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really easy class if you read the books. The class is just discussing what you read, writing a couple papers, and giving a presentation. Haley is really nice and an easy grader. Definitely recommend this class.",
        "course": "WGSST2367"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really great class and a really great instructor. We watched pop culture media such as Futurama and Super Bad. Class discussions were really laid back and everyone was free to say anything they wanted. Midterm involved an essay and a test. Final involved a multimedia analysis of advertising and a test. Highly recommended course.",
        "course": "WGGST230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Shannon",
    "id": "VGVhY2hlci05NjM0OTA=",
    "lastName": "Cochran",
    "legacyId": 963490,
    "numRatings": 1,
    "summary_comment": "This professor excels in teaching, consistently engaging students in lively and enjoyable class discussions that enhance the learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "She truly loves teaching and makes class discussions interesting, as well as fun.",
        "course": "LIT367"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.3,
    "avgRating": 3.5,
    "department": "Women's Studies",
    "firstName": "Ally",
    "id": "VGVhY2hlci0xNDUyMTUz",
    "lastName": "Day",
    "legacyId": 1452153,
    "numRatings": 9,
    "summary_comment": "Ally is an exceptionally knowledgeable and passionate professor who significantly enhances students' understanding of the subject matter, particularly in Women's Health. Her classes are rigorous and demanding, requiring extensive reading and critical engagement, but students find them rewarding and often highly recommend them. While her grading can be challenging, especially for papers, she is supportive and encourages active participation.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "I really enjoyed the material in this class, but it is a ton of work! I put more work and effort into this class than all my other classes combined. She is a tough grader on papers, and I never had a problem writing papers before until this class. The class is demanding; I suggest taking it when you have a lighter load.",
        "course": "WS2325"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 4,
        "comment": "Love the material, but there is a lot of it! I put more work and effort into this class than any of my others, but yet my grades are better in my other courses. She is a very tough grader on papers and I've never had any real issues paper writing until I took this class. I've learned a lot but this class is an enter at your own risk!",
        "course": "WS2325"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 3,
        "comment": "I learned more in Ally's Women's Health class than I probably have in 4 years of college. Not only does she explain things clearly, but she does so in a manner that is unbiased and extremely educated. I highly recommend this class to ALL students!!!!",
        "course": "WGGS2325"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "Ally is awesome! She is so helpful with the papers, and the reading is very interesting. I loved her class, and I wasn't even interested in Women's Studies before!",
        "course": "WGSST367"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 3,
        "comment": "Ally was a great prof very interested in helping students understand and grasp the material. She's awesome :)",
        "course": "WSSGT325"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 4,
        "comment": "First of all, make sure you READ everything, it will help you on your papers. She grades kind of rough on the papers so make sure you meet with her to come up with an outline. Make sure you come to class because she has Critical Responses and you never know when those will be.  Take this class if you like reading, because there is A LOT involved.",
        "course": "WGSST367"
      },
      {
        "index": 7,
        "rating": 3,
        "difficulty": 3,
        "comment": "Pretty alright, passionate, humorous. Negative: Looking for a very SPECIFIC writing style/approach to the paper prompts. Not much room on the grading scale, but I suppose it's good 'training'. Didn't explain thoroughly 'feminist analysis' until 4 weeks left in AU quarter [required in all papers] Be weary, read & go to office hours to bother her.",
        "course": "WGGST367"
      },
      {
        "index": 8,
        "rating": 4,
        "difficulty": 4,
        "comment": "I can't remember the section number, but it was a Lit class.  She is wonderful to work with and always encourages participation and thinking outside the box.  Super helpful and wants people to voice their opinions.  I highly recommend her!",
        "course": "WMSTD367"
      },
      {
        "index": 9,
        "rating": 3,
        "difficulty": 3,
        "comment": "Very nice professor but often times demanding. Take at your own risk. Fair grader but have somethings to improve on.",
        "course": "WSTD325"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.5,
    "avgRating": 4.5,
    "department": "Women's Studies",
    "firstName": "Adriane",
    "id": "VGVhY2hlci0xNTkyNTQz",
    "lastName": "Brown",
    "legacyId": 1592543,
    "numRatings": 2,
    "summary_comment": "The professor is highly regarded for her effective teaching methods and engaging content, making the class both accessible and enjoyable. She provides all necessary materials online, ensuring students are well-prepared for exams, and offers a mix of multimedia resources to enhance learning. While the class is manageable, regular attendance is crucial due to occasional pop quizzes.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "WGSST 230-Race, Gender and Sexuality in Popular Culture for a visual arts credit. No textbook, but she gives you readings through Carmen. Read them, understad them, show up to class, and youll be fine. There are 2 blog assignments, a midterm, a final, and 5 quizzes. Shes nice, and the class is interesting! Take this if you have no artistic talent.",
        "course": "WGSST230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "This class was very easy. She post the notes and whatevers on them is on the exam. Lots of great videos, songs and movies to complement the course topics. She has pop quizzes though so go to class. she drops the lowest one.... Very recommended!",
        "course": "WOMS110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.2,
    "department": "Women's Studies",
    "firstName": "Andrea",
    "id": "VGVhY2hlci0xNDA5MDUw",
    "lastName": "Gulino",
    "legacyId": 1409050,
    "numRatings": 3,
    "summary_comment": "The professor effectively engages students with interesting discussions, albeit from a feminist perspective, and is known for being approachable and easy to work with. Her lectures are pertinent, and she does not require a textbook, instead providing relevant assignments and exams. The class is generally considered easy, though some find the material challenging due to the required viewings.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "For a grad student, she did a pretty good job. Discussions were interesting, if perhaps from a slightly biased feminist perspective. She was approachable and easy to work with. Gave pertinent lectures, did not require a textbook, and had pertinent assignments and exams.",
        "course": "WGSST317"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "This class is insanely easy, but the syllabus doesn't tell you it's a really hard class. its women in film in hollywood, it shouldnt be hard.  The hardest thing about this class is watching imitation of life",
        "course": "WMNS317"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 1,
        "comment": "I took this class for my film GEC, and if you still need to fulfill that, I defintley recommend taking this course. It's super easy, and we watched good movies like Silence of the Lambs and Clueless.",
        "course": "WS317"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 3.6,
    "department": "Women's Studies",
    "firstName": "Christy",
    "id": "VGVhY2hlci05MTI2ODc=",
    "lastName": "Holmes",
    "legacyId": 912687,
    "numRatings": 7,
    "summary_comment": "The professor is generally regarded as effective and supportive, known for being flexible with due dates and clear in her lectures, which can lead to good grades with minimal effort. However, some students find her lectures dense and biased, with a perceived favoritism towards majors and a strong feminist perspective that some find off-putting. Overall, while many appreciate her help and desire for student success, there are concerns about the relevance of the material and the teaching style.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Great Teacher, flexible due dates, extremely helpful, just wants to see everyone learn and pass...",
        "course": "WGSST110"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "A book a week is ridiculous. She didn't like having opinions that did not concur with hers. She's biased towards students who are majors in the WS dept. Lots of unhappy students when it was time for evaluations.",
        "course": "WS215"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 2,
        "comment": "good teacher. clear lectures. easy to get a good grade if you do a little bit of work. flexible with due dates.",
        "course": "WSTDS110"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Very engaging professor. Tests hard, but she tries to prepare you for them. Definitely more of a feminist than a professor though.",
        "course": "WS305"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 3,
        "comment": "is more of a feminist than a teacher.  lecture slides were a little wordy, and discussions surrounding the readings were not helpful in aiding students to grasp concepts.  only twice did we sit in a circle in class and discuss the readings, which were the two readings that i ended up retaining the most from.",
        "course": "WOM110"
      },
      {
        "index": 6,
        "rating": 3,
        "difficulty": 3,
        "comment": "Covered a lot of information that seemed unnecessary considering this was everyone's first women's studies course.",
        "course": "WS110"
      },
      {
        "index": 7,
        "rating": 4,
        "difficulty": 3,
        "comment": "Christy is really very helpful, and wants students to do well. She is concise and willing to explain ideas, or discuss things not necessarily covered in class. Reading is important for this class, but she doesn't get too angry if you don't do it. I definitely recommend her as a teacher.",
        "course": "WMSTD110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.6,
    "avgRating": 3.7,
    "department": "Women's Studies",
    "firstName": "Linda",
    "id": "VGVhY2hlci05NDM4MzI=",
    "lastName": "Bernhard",
    "legacyId": 943832,
    "numRatings": 5,
    "summary_comment": "The professor is generally well-regarded for her insightfulness and ability to encourage deeper exploration of the subject matter, particularly in nursing. However, her lectures often fall short in engaging students and facilitating class discussions, and she tends to rely heavily on readings without incorporating other media. Students appreciate her helpfulness and approachability but also note issues with excessive reading and unclear grading.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was a nice professor, but I was usually disappointed in the lectures. I don't doubt her knowledge, but shes needs to find a way to lead better class discussions and help students engage with the material. Almost all the class material was taught exclusively through readings, I wish she had tried to incorporate other types of media to analyze.",
        "course": "WS300"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I love Dr. Bernhard. She is so helpful and approachable. She generates great discussions and is open to many different points of view. The way she taught 300 was not difficult. Do the readings and assignments and participate in the class and you'll do fine! Take her class!",
        "course": "WS300"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "Way too much reading and unclear grading. Nice lady though.",
        "course": "WS300"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was insightful and encouraged students to explore deeper aspects of nursing than most classes.",
        "course": "NURSIH320"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 4,
        "comment": "Only a 3 hour credit class had too much work involved. She thought she knew all about the subject when she was actually clueless. Class could have been taught in 1 hr but she would stretch it on to 3 hrs. So boring and she would never take any of our comments from past classes to improve her teaching style.",
        "course": "NUR440"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Lindsay",
    "id": "VGVhY2hlci0xMTk0Njk3",
    "lastName": "Robertson",
    "legacyId": 1194697,
    "numRatings": 1,
    "summary_comment": "Lindsay is highly regarded for her exceptional teaching quality, noted for her availability and willingness to assist students, making her classes highly recommended. Her approach has particularly transformed students' perceptions, with many finding value in what was initially perceived as a niche subject.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Though I've only been in the class for a few weeks, I highly recommend taking 101 with Lindsay.  She's extremely helpful and willing to make time for us to meet with her.  I was hesitant to take a woman's studies course, but I am loving this one.",
        "course": "WSTD101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Tracey",
    "id": "VGVhY2hlci0xNDExODcy",
    "lastName": "Fox",
    "legacyId": 1411872,
    "numRatings": 1,
    "summary_comment": "Tracey is highly regarded for her effective teaching and supportive demeanor. While her class is considered easy due to its 100-level status, students appreciate the quality of learning and her openness to diverse ideas. She is praised for her kindness and willingness to assist, making her a strong recommendation for students.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Loved Tracey! Class was easy, but rightfully so, since it was 100-level. Learned a lot too. Tracey isn't the dtereotypical &quot;feminist&quot; and is open to other people's ideas, and doesn't judge. She is so nice and willing to help anyone who needs it. Highly recommend taking her!",
        "course": "WS101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.7,
    "avgRating": 2.9,
    "department": "Women's Studies",
    "firstName": "Wendy",
    "id": "VGVhY2hlci0zMjExNjI=",
    "lastName": "Wolters",
    "legacyId": 321162,
    "numRatings": 7,
    "summary_comment": "The professor is knowledgeable in writing skills and techniques but struggles with clear instructions and fairness, often playing favorites. Students found her generally friendly and helpful, with mixed opinions on the relevance and clarity of assignments, though many noted improvements in their writing. However, several students criticized her vagueness, unprofessionalism, and heavy reliance on subjective grading.",
    "Ratings": [
      {
        "index": 1,
        "rating": 2,
        "difficulty": 4,
        "comment": "She is not very clear on her instructions and does play favorites. Very knowledgeable in writing skills and techniques.",
        "course": "ENG111"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 2,
        "comment": "While, admittedly, some of her assignments were quite vague, she was more than willing to help with any problems or confusion.   I thought her grading was fair and she would always provide adequate feedback on what we wrote.  I thought she was quite friendly and a rather decent teacher.",
        "course": "ENG110C01"
      },
      {
        "index": 3,
        "rating": 1,
        "difficulty": 3,
        "comment": "First of all, our class was supposed to be a computer oriented English class. Other people I know in English 110C01 were making Photoshop images, mixed audio files, iMovies, etc. We on the otherhand only got to use those fun programs for our final project which was just about the most confusing prompt for an assignment that I have ever seen.",
        "course": "ENGLISH110C01"
      },
      {
        "index": 4,
        "rating": 1,
        "difficulty": 3,
        "comment": "Quite possibly the most vague, confusing, and unprofessional teacher I have ever had.  I was under the impression that this was a college course, but the elementary assignments (busy work:  not only have I not learned anything, but I'm confident that my intelligence level has been jeopardized being in this class) that we had to do were rediculous.",
        "course": "ENGLISH110"
      },
      {
        "index": 5,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class started out kind of wierd but I ended up really liking it though.  My writing got a lot better and the readings were mostly pretty interesting but she really spent a lot of time on class stuff.  She talks a lot but she knows what she's talking about.  And she's hot.",
        "course": "ENG367"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "She plays favorites big time, so DO NOT take her, there is no way to get an A if you are a good writer alone, you have to be liked by her.  She also makes you research everything that will help her with her graduate degree and its really annoying.  Don't do it.",
        "course": "ENGLISH36701"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 5,
        "comment": "Wendy is actually a TA. She's a really nice woman and very hot but she is a HORRIBLE teacher.  She's a very hard grader and definitely plays favorites.  The homework is a bit too much but you will read some excellent literature.",
        "course": "36701"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.5,
    "department": "Women's Studies",
    "firstName": "Anne",
    "id": "VGVhY2hlci05NjczMzE=",
    "lastName": "Mitchell",
    "legacyId": 967331,
    "numRatings": 4,
    "summary_comment": "Anne Mitchell's class is generally considered easy with a focus on reading and frequent, easy quizzes. However, the amount of reading required can be substantial and often boring, and students must thoroughly understand the material to perform well. Overall, while some find the class engaging and enjoyable, others find it demanding and pointlessly busy.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Easy class. Ready level is kind of high, but its easy stuff to read. She gives random quizzes that are extremely easy if you read. No exams, just papers. Class was okay, kind of pointless but attendance is part of your grade",
        "course": "WST215"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 2,
        "comment": "I loved this class.  Anne Mitchell kept me interested in learning more about the topics we discussed.  She is a fun and exciting teacher and has a sense of humor which is always fun. You do A LOT of reading, however the readings are somewhat interesting. Be prepared for pop quizes too! Other than that I love her teaching and her class was easy!",
        "course": "GWS215"
      },
      {
        "index": 3,
        "rating": 3,
        "difficulty": 3,
        "comment": "I didn't like this course at all.  It wasn't extremely hard, it's just that you had to do so much reading and the quizzes where pretty hard if you didn't read and understand the assigned readings. I failed 3 out of 4 quizzes and still got a B, but that's because she assigns papers and they are worth 40 and 50 pts. Read and study for pop quizzes.",
        "course": "WM101"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "You have to read a lot!! No time for anything else and you have to know every detail of the reading to pass the quizzes. Readings are very boring and movies are the same. I got an A- because I read everything and studied hard for exams. I even failed two quizzes. She does not compromise",
        "course": "WMSTD101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.7,
    "avgRating": 4.8,
    "department": "Women's Studies",
    "firstName": "Cricket",
    "id": "VGVhY2hlci0xMDMyNjM5",
    "lastName": "Keating",
    "legacyId": 1032639,
    "numRatings": 3,
    "summary_comment": "Cricket is an exceptional professor who consistently inspires class discussions and engagement with the material. She caters to individual student interests and fosters a democratic classroom environment where students have significant input. Her teaching style, which includes circle discussions, role-plays, and other interactive methods, creates a close-knit and dynamic learning atmosphere.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cricket is one of my favorite prof's ever (I'm graduating this quarter so I've had a lot). She inspires class discussion and participation, engages students  well with the material and is always willing to cater to individual interests and provide assistance. Take her class!!",
        "course": "WS523"
      },
      {
        "index": 2,
        "rating": 4,
        "difficulty": 4,
        "comment": "Amazing professor, probably one of the best in the Women's Studies dept. She makes the classroom a democracy, so students tell her how much time they want to write papers or how they want to conduct class. Course material is challenging (in a good way).",
        "course": "WS513"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cricket is very friendly, and extremely engaging. She's a big fan of 'circle' discussion, and does more leading of a discussion than actually lecturing, which is awesome. She also does role-play and things like that to help students understand, and to foster a closeness within the classroom.",
        "course": "WS300"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.5,
    "avgRating": 3.5,
    "department": "Women's Studies",
    "firstName": "Tahirah",
    "id": "VGVhY2hlci0xMTIwMDU0",
    "lastName": "Akbar-Williams",
    "legacyId": 1120054,
    "numRatings": 2,
    "summary_comment": "The professor is highly regarded for her engaging and humorous teaching style, which facilitated significant learning among students. However, some students felt that the material was straightforward and easily mastered through reading, perceiving the instructor as occasionally incorrect and the exams as overly simplistic. Overall, the course appears to offer an easy path to a good grade.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 2,
        "comment": "She was cool, nice, funny and I learned a lot!",
        "course": "WST101"
      },
      {
        "index": 2,
        "rating": 3,
        "difficulty": 3,
        "comment": "I often felt like I knew more than her about the nuances of her subject. A few times during the quarter I thought she was just plain wrong. The tests are really easy as long as you do the reading. It's a pretty easy A.",
        "course": "WS110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.9,
    "department": "Women's Studies",
    "firstName": "Melanie",
    "id": "VGVhY2hlci0xMTQ1MTk1",
    "lastName": "Beaudette",
    "legacyId": 1145195,
    "numRatings": 7,
    "summary_comment": "Melanie is widely regarded as one of the best professors at OSU, known for her engaging and fun lectures that cover interesting topics and include enjoyable readings. While some students found the class to be more accessible than a typical college-level course, many praised her approachability, knowledge, and ability to make the material engaging. Overall, her classes are highly recommended for those looking for a GEC credit or simply an enjoyable learning experience.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Her friends definitely put all those super great comments. I actually took the class because of them and was awfully disappointed. She's nice but the class should hardly be considered a college level class.",
        "course": "WS230"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Easy but boring and not interesting. Talked about celebs, looked at pictures, watched tv clips. Useless but a definitely a GPA upper.",
        "course": "WS230"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 1,
        "comment": "She is a terrific teacher, it is obvious she loves pop culture and women studies. If you need a GEC course this is the best I have taken at OSU, very easy but you learn a lot in the process.",
        "course": "WS230"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 1,
        "comment": "Melanie is awesome and so is this class. She's open-minded, approachable, helpful, and makes class and assignments fun. You can tell she really enjoys teaching her subject. And I agree, she is cute! Take this class- you'll be glad you did!",
        "course": "WOMST230"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 1,
        "comment": "Melanie is actually one of the best professors at OSU... her lectures are interesting and attending class was fun. Topics are awesome and the readings are enjoyable. TAKE HER CLASS.",
        "course": "WS230"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "What a fantastic class. One of the gems of the OSU GEC course list. Melanie is awesome and knowledgable. Always willing to help. And she's TOTALLY gorgeous so...you will have motivation to go to an already fascinating class.",
        "course": "WS230"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 1,
        "comment": "Melanie is awesome - lecture is mandatory but its always interesting and fun.  Tests aren't difficult if you pay attention - I didn't read but I imagine most would find it beneficial.",
        "course": "WS230"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4,
    "department": "Women's Studies",
    "firstName": "Tracey",
    "id": "VGVhY2hlci0xMjc1OTg4",
    "lastName": "Hurt",
    "legacyId": 1275988,
    "numRatings": 1,
    "summary_comment": "This professor offers an easy class with minimal assignments that are graded leniently. Students must read from the text and participate in discussions, though the latter can be loosely related to the material. Exams are straightforward, with provided study guides, making the course accessible overall.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "Her class is pretty easy. There's about 5 easy papers you have to do, but she grades easy. You do have to read a lot from the text, because you discuss what you read, and participation is a big part of your grade. But the discussion goes so off track you can bs a lot of what you say.  Exams are simple and she gives you study guides. Take the class.",
        "course": "WOMST101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3.5,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Katie",
    "id": "VGVhY2hlci0xMjU2NTE0",
    "lastName": "Linder",
    "legacyId": 1256514,
    "numRatings": 2,
    "summary_comment": "Katie is widely regarded as the top English instructor at OSU, known for her dedication to student success and engaging teaching style. Students appreciate her willingness to go above and beyond to help them understand and enjoy the material, finding her assignments both challenging and rewarding. Her class, 367.01, is highly recommended.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 4,
        "comment": "Best English teacher I have ever had. PERIOD.",
        "course": "WOMST367"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Katie is by far the best teacher I have had at OSU. She is willing to do whatever it takes to help her students succeed. Class was always entertaining and the novels she assigned were actually enjoyable to read. Her assignments are a tad challenging, but if you go to class and read the novels, you will be fine. Definitely take this class, 367.01!",
        "course": "WOMSTD"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 3,
    "avgRating": 5,
    "department": "Women's Studies",
    "firstName": "Katie",
    "id": "VGVhY2hlci0yMzQ5NTAy",
    "lastName": "Swindler",
    "legacyId": 2349502,
    "numRatings": 1,
    "summary_comment": "Katie is widely regarded as one of the top teachers due to her deep passion for her subject and her commitment to student success. She effectively engages students in dynamic discussions, making the ever-changing field of WGSS accessible and intriguing. Her comprehensive knowledge allows her to address any question students might have, fostering a supportive and enriching learning environment.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 3,
        "comment": "Katie is probably the best teacher I've had so far here. She really cares about what she's teaching and she wants her students to be successful. Because WGSS is an ever-changing subject, she makes everything discussion based and she can answer literally any question you have. I was skeptical to take this class, but she made me love it.",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 2.2,
    "avgRating": 4.8,
    "department": "Women's Studies",
    "firstName": "Rachel",
    "id": "VGVhY2hlci0xNTAzMzkz",
    "lastName": "Stonebrook",
    "legacyId": 1503393,
    "numRatings": 4,
    "summary_comment": "The professor is highly regarded for her effective and engaging teaching methods, making the class interactive and accessible even in an online format. Students praise her passion for the subject matter and her dedication to fostering a supportive learning environment. Her approachable nature and willingness to connect personal experiences with course content have significantly enhanced students' interest and understanding of women's studies.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She was amazing! Even as an online class, I felt like she really tried to get to know us. I learned a lot. There was a lot of reading each week and then everyone would participate in an online discussion. As long as you gave your responses before the due date, you would get 100%. She was an easy grader for the midterm paper and final paper.",
        "course": "WGSST1110"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 3,
        "comment": "Professor Stonebrook made the class very interactive. Her teaching style was great and she is very considerate to students. Even though the class says \"women studies\" she broke the shyness in class by her great teaching skills. I highly recommend taking her class, especially for men. This class will make you learn great things!",
        "course": "WGSS2350"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "Rachel was by far the best instructor I've encountered in my 4 years.  She is extremely passionate about her work and really cares about sparking the students' minds. She's the very reason I'm so interested in many of the topics that are now dear to me. She's very open about her personal life and makes great connections to outside of the class.",
        "course": "WGSS11002367"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 1,
        "comment": "Very helpful and passionate about the class. She has a fun personality and provides a good foundation of basic concerns of Women's Studies.",
        "course": "WGSST1110"
      }
    ],
    "SEI": []
  }
]