[
  {
    "avgDifficulty": 1.8,
    "avgRating": 4.4,
    "department": "World Languages & Cultures",
    "firstName": "Ulrike",
    "id": "VGVhY2hlci04MzYyMDI=",
    "lastName": "Stoll",
    "legacyId": 836202,
    "numRatings": 6,
    "summary_comment": "This professor is highly regarded for her kindness and engaging presence in the classroom, though she tends to be quite timid and sometimes moves too slowly. Despite this, she is an effective instructor who makes even challenging material accessible and is particularly praised for her supportiveness outside of class. Students consistently recommend taking her courses.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "She is the nicest person alive. Other comments are correct: she can be quite timid.  But, she is a great professor. Do anything in your power to take her class.",
        "course": "GER201"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Nicest person ever.",
        "course": "GERM104"
      },
      {
        "index": 3,
        "rating": 4,
        "difficulty": 3,
        "comment": "She is very nice but usually too timid. She'll ask if you understand and wait a while for people to answer, she should just keep the class moving instead. Above average at teaching the material, should probably use the book less to be better",
        "course": "GERM1036"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 3,
        "comment": "Ulrike is an amazing person and instructor.  You cannot help but want to give her a hug in class because she is so nice.  Her classes was the only one I learned anything in this quarter - you would be lucky to have her for any German class!  Don't be intimidated because she is a native speaker of German, she is easy to understand in both languages.",
        "course": "GERM201"
      },
      {
        "index": 5,
        "rating": 2,
        "difficulty": 1,
        "comment": "eh.  The class itself isn't difficult but her way of teaching takes some getting used to.",
        "course": "GERMAN10301"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "I think she made a potentially strenuous class engaging (despite a few off-setting students).  She can be a little overly apologetic sometimes, but she has great stories about Germany, and she is very helpful with questions on homework, essays, etc.  I love her class!",
        "course": "GERMAN10301"
      }
    ],
    "SEI": []
  }
]