[
  {
    "avgDifficulty": 4.2,
    "avgRating": 3,
    "department": "Yiddish",
    "firstName": "Mike",
    "id": "VGVhY2hlci0yMjUxNzkx",
    "lastName": "Hawk",
    "legacyId": 2251791,
    "numRatings": 5,
    "summary_comment": "Mike Hawk is a challenging yet highly respected professor known for his rigorous teaching methods and demanding quizzes and tests. Students find his lectures dry but appreciate his expertise and the solid foundation he provides, though some note the class is best suited for those prepared for intense workloads. Despite his tough grading and late-night class schedule, many consider him the best professor they've had.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 5,
        "comment": "Mike Hawk was an amazing Professor! I have taken his class three times so I am en expert in this subject now. The grader Mike Hootchie and TA Mike Hunt were the best! My classmate Mike Oxhard and I studied very long and very hard for this course. After taking this course, I have learned the fundamentals that FLG234 was supposed to teach. Have fun!",
        "course": "FLG234"
      },
      {
        "index": 2,
        "rating": 2,
        "difficulty": 3,
        "comment": "This professor is hard. I would not take him unless you're ready to be railed hard on quizzes and tests. He is one of the most prominent profs at the university, from any angle. I hear a statue will be erected of his likeness made of hard wood. Lectures are a little dry, so they can be rough sometimes.",
        "course": "FLG234"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 4,
        "comment": "very long and hard",
        "course": "FLG234"
      },
      {
        "index": 4,
        "rating": 2,
        "difficulty": 4,
        "comment": "very hard grader, would not recommend",
        "course": "FLG234"
      },
      {
        "index": 5,
        "rating": 1,
        "difficulty": 5,
        "comment": "Mike Hawk was the biggest, hardest professor I've ever had here at university. He taught the Gurgling 101 class and was an inspiration to all with his complete control of the language--also a master of rhino mating calls. Generally needs to improve hygiene and English language skills. Best professor I've ever had. Downside is class is at midnight.",
        "course": "GRG1101"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1.8,
    "avgRating": 5,
    "department": "Yiddish",
    "firstName": "Monica",
    "id": "VGVhY2hlci0xODQzNzcy",
    "lastName": "Hamblet",
    "legacyId": 1843772,
    "numRatings": 6,
    "summary_comment": "This professor is highly regarded for her engaging and informative lectures, making the course both enjoyable and educational. She emphasizes consistent attendance and preparation but offers ample opportunities for extra credit. Students find her approachable, fair, and knowledgeable, often noting that her classes are low-stress paths to earning high grades.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 2,
        "comment": "If you go to every class, and do the readings and extra credits, you will probably get an A. Class is cool and very interesting, I learned a lot and it is low stress. Readings can maybe be a little long, just stay on top of them and pay attention to the in class movies. Two papers, in class midterm, out of class final. Graded gently. Ale dos guts",
        "course": "YIDDISH3399"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Really good teacher who genuinely enjoys her lectures and is extremely informative on the topics. Very easy A!",
        "course": "YIDDISH3399"
      },
      {
        "index": 3,
        "rating": 5,
        "difficulty": 2,
        "comment": "By far my favorite GE I have taken at OSU. She is super chill, easily approachable and her lectures are interesting. Even if you don't have much interest in the Holocaust, you're bound to like it a whole lot more after taking her class! Her tests are extremely fair and easy as long as you read a little bit and pay attention to the movies in class.",
        "course": "YIDDISH3399"
      },
      {
        "index": 4,
        "rating": 5,
        "difficulty": 3,
        "comment": "Pay attention in lectures because each one is a mini-review for the quizzes and tests.  She obviously cares a lot about what she teaches and knows almost everything there is to know about the Holocaust.  She will answer any question you have.  Don't take anyone else for your literature GEC!",
        "course": "YIDDISH3399"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 2,
        "comment": "Best instructor in the Germanic Languages Dept. Blends in culture to give greater importance to the lecture and material. Has a great sense of humor and treats students with respect. Truly a gifted professor.",
        "course": "YIDDISH399"
      },
      {
        "index": 6,
        "rating": 5,
        "difficulty": 1,
        "comment": "Monica really has a lot of knowledge about the Holocaust and does a great job discussing readings and film. Many opportunities for extra credit!",
        "course": "YIDDISH3399"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 5,
    "department": "Yiddish",
    "firstName": "Damon",
    "id": "VGVhY2hlci0xNzc1ODUx",
    "lastName": "Berry",
    "legacyId": 1775851,
    "numRatings": 2,
    "summary_comment": "Damon is highly regarded as an excellent professor, known for his fairness, laid-back demeanor, and engaging teaching style, which includes watching many films in his Yiddish course. He encourages attendance and success through participation and accessible open-book quizzes, making him a standout teacher at OSU.",
    "Ratings": [
      {
        "index": 1,
        "rating": 5,
        "difficulty": 1,
        "comment": "Damon is seriously the best! He is super sweet, laid back, and extremely fair. You watch a lot of movies in his Yiddish course but they all are good. Lots of readings but he is very lien-ant on completing them. He honestly makes you want to come to class. He is the best professor that I have had at OSU and will rave about him forever! :)",
        "course": "YIDDISH3399"
      },
      {
        "index": 2,
        "rating": 5,
        "difficulty": 1,
        "comment": "Great Teacher! Go to class and participate and you will be fine! Very helpful and wants students to succeed. Need the books for the quizzes which are open book!Best GEC I've taken.",
        "course": "YIDD3399"
      }
    ],
    "SEI": []
  },
  {
    "avgDifficulty": 1,
    "avgRating": 4.5,
    "department": "Yiddish",
    "firstName": "Kevin",
    "id": "VGVhY2hlci0xMjY2Mzk1",
    "lastName": "Herzner",
    "legacyId": 1266395,
    "numRatings": 1,
    "summary_comment": "Based on available student comments, the professor demonstrates a high level of teaching quality, effectively conveying complex concepts and engaging students in the learning process.",
    "Ratings": [
      {
        "index": 1,
        "rating": 4,
        "difficulty": 1,
        "comment": "No Comments",
        "course": "YIDDI367"
      }
    ],
    "SEI": []
  }
]