[
  {
    "avgDifficulty": 4.3,
    "avgRating": 3.5,
    "department": "Zoology",
    "firstName": "Cindy",
    "id": "VGVhY2hlci04MjAyODA=",
    "lastName": "Bronson",
    "legacyId": 820280,
    "numRatings": 218,
    "Ratings": [
      {
        "index": 1,
        "rating": 3,
        "difficulty": 4,
        "comment": "need to go to class and party room if u want to do well! For the midterm and final I would correct each quiz to all the correct versions- they will tell you this in party room and help oragnize the right answers! I then memorized the right answers and got an A on both the final and the midterm! This class is alot of work but you can do it! ",
        "course": "EEOB2520"
      },
      {
        "index": 2,
        "rating": 1,
        "difficulty": 5,
        "comment": "If you just try you will get the grade that you want. But she really is not a good professor. She is so inflexible and stubborn. This class is possible, but you need to put in a lot of work to do well. Weekly exams and preps, lectures at 6:50 am. Take it online if you can since the lectures will be recorded there.",
        "course": "EEOB2520"
      },
      {
        "index": 3,
        "rating": 2,
        "difficulty": 3,
        "comment": "The material is very interesting but the professor makes the class terrible. I took all her advice about doing well in the class and threw out the window. I studied the way I do for this type of material and ended up with over 100% (there's a lot of extra credit). The class is easy if you take it seriously and study constantly.",
        "course": "EEOB2520"
      },
      {
        "index": 4,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class was a major adjustment. Her phrasing on tests takes getting used to and is sometimes harder than the material itself. There are weekly exams that test over previous week's knowledge. It really reinforced everything we were learning. A lot of extra credit opportunities, just make use of review sessions and the online discussion board.",
        "course": "EEOB2520"
      },
      {
        "index": 5,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bronson is easily one of the most intelligent professors Ive ever had. She has amazing knowledge on the subject matter. This ended up being my best grade (I had over 100% in the class) of the semester. Take thorough notes. Rewatch lectures. Its not that bad once you get a feel for her test layout and question format!",
        "course": "EEOB2520"
      },
      {
        "index": 6,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class I've ever taken! Exams are hard for no reason at all the TA are more helpful than her",
        "course": "EEOB2520"
      },
      {
        "index": 7,
        "rating": 5,
        "difficulty": 3,
        "comment": "She is always willing to help students who want to be helped",
        "course": "EEOB232"
      },
      {
        "index": 8,
        "rating": 1,
        "difficulty": 5,
        "comment": "By far the worst class ive ever taken. the learning is absolutely impossible. no textbook no outlines/powerpoints posted its just her voice. cant understand a word she says w/ the recorded lectures. i had to take this class 4 my major &amp; my best advice is to take it at a different college. ive studied hours &amp; YouTubed &amp; still failed every exam.",
        "course": "EEOB2520"
      },
      {
        "index": 9,
        "rating": 5,
        "difficulty": 4,
        "comment": "To put it short, I LOVED Dr. Bronson-- I'm a C+/B average student and recieved an A in her course spring of 2020. I definitely had to work toward that grade, but I learned so much and it served me well studying for the DAT. I recorded every lecture and literally retyped every word verbatim for the exams. She's tough but she is the real deal",
        "course": "EEOB2520"
      },
      {
        "index": 10,
        "rating": 1,
        "difficulty": 5,
        "comment": "Lecture is this class is literally an absolute joke. You can attend every lecture and even if you had the ability to listen to her rap out the lectures like she's eminem in rap god and write down what she's saying you will still most likely struggle. Most of what she says in lecture doesn't appear on the test, it's honestly just abuse. AVOID!!",
        "course": "EEOB2520"
      },
      {
        "index": 11,
        "rating": 2,
        "difficulty": 4,
        "comment": "Exams are ridiculous, the questions are literally designed to make you misread/fail. She was extremely difficult to work with during the COVID pandemic- offering bonus points to students who showed up at 6:45 am for the 6:50 online lecture, even though much of the class was in a different time zone and couldn't attend lecture at 3 IN THE MORNING.",
        "course": "EEOB2520"
      },
      {
        "index": 12,
        "rating": 1,
        "difficulty": 5,
        "comment": "I did fine but it was a crazy amount of work, and also pretty disorganized. Would not recommend.",
        "course": "EEOB2520"
      },
      {
        "index": 13,
        "rating": 2,
        "difficulty": 4,
        "comment": "This was the hardest class I have taken to date. There are weekly exams, and she uses the questions to trick you. Also class was at 8 am or 6:50am and it is important to attend lectures to receive notes. Gave extra credit because everything was so hard. I ended up doing well in the class, but it was horrible. Best of luck to the next students!",
        "course": "EEOB2520"
      },
      {
        "index": 14,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is by far one of the hardest classes i have very taken. No one should ever take a class like this ever in their entire life if they are going to spend 1300 on a class. WEEKLY exams, which are DESIGNED to trick you. I spent countless hours studying, and even paid 30 bucks for a tutor and my exam averages still did not go up. DO NOT TAKE.",
        "course": "EEOB2520"
      },
      {
        "index": 15,
        "rating": 1,
        "difficulty": 5,
        "comment": "Literally the most exhausting class, I had no time to myself bc all I would do is study for this class. Material isnt hard to understand, its the WEEKLY exams that are meant to trick you. Uses horrible examples and questions are very conceptual scenario based. Shes not funny &amp; rude. Do not take this horrible class you will feel burned out.",
        "course": "EEOB2520"
      },
      {
        "index": 16,
        "rating": 2,
        "difficulty": 4,
        "comment": "Although I learned a lot from her class, it induced more anxiety than any class I have had. I spent more time learning irrelevant mnemonics she made up that were quizzed. The quizzes are stressful and make you feel like you are in boot camp. Take the harder version and actually learn the information instead of dealing with 6:50 am class.",
        "course": "EEOB2520"
      },
      {
        "index": 17,
        "rating": 5,
        "difficulty": 4,
        "comment": "If you plan on taking the MCAT or DAT in the future. Just take EEOB2520. Yes the class requires more studying hours than other classes but it's worth it. You will only have to review physio topics for DAT/MCAT (better understanding-&gt;higherscor. Also, about other comments about her tests being tricky-yes it is but only when you didn't study enough.",
        "course": "EEOB2520"
      },
      {
        "index": 18,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Bronson is an awful professor. She has horrible class times; 6:50am (not kidding) and if you do not attend class then you are going to fail. There's weekly exams and I would argue that they are harder than any gen chem exam I have ever taken, the only reason I was able to pull of a B was due to the extreme amounts of extra credit. Avoid this",
        "course": "EEOB2520"
      },
      {
        "index": 19,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bronson is horrible. This is a 3 credit hour course, she treats it like it is at least 6. I spent days and days studying for this class and each test, I would still not receive above a 50%. Do not take this course at Ohio State. It is impossible to do well. I would e-mail her for help, for example, a family member passed away and she didn't reply.",
        "course": "EEOB2520"
      },
      {
        "index": 20,
        "rating": 1,
        "difficulty": 5,
        "comment": "The way she presents information is effective, however that doesn't matter when her exams are designed to trick the students instead of test knowledge. Especially with the midterm/final. She says it is the most missed questions from other exams, but then changes answer choice wording the slightest bit to trick the student.",
        "course": "EEOB2520"
      },
      {
        "index": 21,
        "rating": 4,
        "difficulty": 5,
        "comment": "Her class is hard, she is great at teaching though. Occasionally things got a little confusing and she missed the mark, but that was infrequent. Yeah, tests are hard, but you have plenty of time to get better. I never went to the party room, never went to offie hours, but did online discussions. I never felt doomed by not going to them.",
        "course": "EEOB2520"
      },
      {
        "index": 22,
        "rating": 4,
        "difficulty": 5,
        "comment": "Currently taking H. Physiology with Dr. B & although the class is hard & exams are tricky i think shes a great professor. I would recommend that you record lectures and write down all the examples she gives (that are not on the slides). The party room is a MUST! Its very helpful & also checking piazza is important. She also does x cred on exams",
        "course": "EEOB2520"
      },
      {
        "index": 23,
        "rating": 5,
        "difficulty": 5,
        "comment": "Class is a lot of work but she is a great professor. Everyone complains that its a hard class as there is a lot of information for a 3 credit hour class. Lot of useful information for the MCAT. Very helpful office hours and I found those to be somewhat mandatory.",
        "course": "EEOB3510"
      },
      {
        "index": 24,
        "rating": 4,
        "difficulty": 4,
        "comment": "The class was heavily focused on memorization, the slides presented don't contain all the information you need for testing so you also need to follow what she is saying make sure to record lectures. Don't take the class if you have a heavy semester.",
        "course": "EEOB3510"
      },
      {
        "index": 25,
        "rating": 5,
        "difficulty": 3,
        "comment": "Class is structured in building manner. Requires time and effort to get comfortable with material/her teaching style, but not unusually hard. Help is very accessible through Piazza question forum and study room w/ TAs. Gives lots of extra credit opportunities. Best biological science class I've taken thus far.",
        "course": "EEOB2520"
      },
      {
        "index": 26,
        "rating": 5,
        "difficulty": 4,
        "comment": "There is definitely a learning curve involved, but once you get used to her testing style, her exams aren't as hard. Class requires consistent review of material but help is very accessible via everyday Party Room (study room with Phys Phabs/TAs) and Piazza question forum. Best class I've taken thus far. Learned the material extremely well.",
        "course": "EEOB2520"
      },
      {
        "index": 27,
        "rating": 1,
        "difficulty": 4,
        "comment": "I took this vs other options bc I thought it would be helpful for med school. The convoluted manner this class was taught has NOT prepared me better than any of my current classmates. Also, I asked a TA for advice bc I was scoring the same on quizzes no matter how long I studied, and his advice was to get more bonus q's right.",
        "course": "EEOB2520"
      },
      {
        "index": 28,
        "rating": 1,
        "difficulty": 5,
        "comment": "Do your self a favor and take this class at Columbus State. Dr. B makes her weekly quizzes impossible and will try her best to trick you. She hides extra credit in the directions and has tricky ec questions that you only get if you go to class. If you are a pre-PA student you need H. Physiology with a lab. Take it at Columbus State!!!",
        "course": "EEOB2520"
      },
      {
        "index": 29,
        "rating": 1,
        "difficulty": 3,
        "comment": "I have never had a professor that I didn't like.. until I met Cynthia Bronson. She really tries to trick her students in a class that she is already over complicating. The party room is useless, and the TAs know just about as much as the current students do. I would avoid this class at all costs unless you're ready to hate your life for a semester.",
        "course": "EEOB2520"
      },
      {
        "index": 30,
        "rating": 4,
        "difficulty": 5,
        "comment": "Go to party room, review sessions, kahoots, and use the UGTA phys phabs as much as possible. Don't be too hard on yourself about a low exam grade for the weekly exams, four of them are dropped. Get any and every bonus point you can. Material really sticks because of the odd way it is taught. Talking through material is important in understanding",
        "course": "EEOB2520"
      },
      {
        "index": 31,
        "rating": 5,
        "difficulty": 4,
        "comment": "After my first year coming to an end, I can say that Dr. Bronson has been my favorite professor at OSU. She cares about her students because she offers resources for you to do well in the class. Her lectures are also interesting! Weekly exams are tough (EC on them) . What I recommend doing for this class is record lecture, and use all resources.",
        "course": "EEOB2520"
      },
      {
        "index": 32,
        "rating": 3,
        "difficulty": 4,
        "comment": "I am a past TA for Bronson and took her class as a freshman at OSU. You have to go to lecture to pass, no questions asked. I would record her lectures and write down anything that is not on the slides, because the slides can be accessed after class in the party room if you need them. Her tests are very tricky; make sure you know your stuff.",
        "course": "EEOB2520"
      },
      {
        "index": 33,
        "rating": 2,
        "difficulty": 5,
        "comment": "This is definitely the hardest class I have had. Only take this class if you HAVE to. I missed out on being able to enjoy an entire semester at OSU because I had to worry about the weekly exams. She never takes the blame when students fail her exams every week and has tried to diagnose people with anxiety, which is inappropriate. Only plus is bonus",
        "course": "EEOB2520"
      },
      {
        "index": 34,
        "rating": 1,
        "difficulty": 4,
        "comment": "Easily the hardest class I've ever taken. Not because of the amount or the difficulty of the work, but because she does not make things clear. Her questions are very strange, you can still end up with an F in this class even if you have a good understanding of the body. This woman is very quirky in a bad way. Take this class at Columbus State",
        "course": "EEOB2520"
      },
      {
        "index": 35,
        "rating": 1,
        "difficulty": 5,
        "comment": "Horrible, Weekly quizzes are impossible, two exams are impossible too. Read very carefully because she loves to trick you. If you can, take this class at Columbus State 100x better than taking it with her. There is a quiz on the same day as the midterm. why? idk.... its a horrible class.",
        "course": "EEOB2520"
      },
      {
        "index": 36,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bronson is tough teacher with tough tests and grading system. She has 13 weekly exams with midterm and final. U can drop 3 of the weekly exams but cannot drop the exams that occurs with the midterm and final. U only have 15 minutes to do 20 questions on weekly exam. On midterm u have to do an exam and midterm in the same day. Each question is story",
        "course": "EEOB2520"
      },
      {
        "index": 37,
        "rating": 2,
        "difficulty": 5,
        "comment": "I spent majority of my time on this class. I studied constantly but still couldn't seem to achieve the grades I wanted on all of the weekly exams due to the nature of her exams. She does offer a lot of extra credit on each exam though. Record lectures- she will test you on many things not in her vague notes.",
        "course": "EEOB2520"
      },
      {
        "index": 38,
        "rating": 4,
        "difficulty": 5,
        "comment": "She expects you to put in a LOT of work outside of class to do well. Go to kahoot, party room, and the review every week to get all the extra credit points. Only read the phys cafe on the discussion board, that's where most extra credit ?'s come from and the other boards are unhelpful and take up too much time. Put in the work and you'll succeed.",
        "course": "EEOB2520"
      },
      {
        "index": 39,
        "rating": 5,
        "difficulty": 4,
        "comment": "Weekly tests are hard to interpret especially since they're only 20 minutes long. The class itself sucks, but what you learn and the level you have to study to get a decent grade is beneficial. Definitely good for pre med/dental students.",
        "course": "EEOB2520"
      },
      {
        "index": 40,
        "rating": 3,
        "difficulty": 4,
        "comment": "Good teacher and passionate about what she does, but makes the tests way harder than they should be. If you study the material, and really take your time to read everything on the exams, then you'll do fine. I did just fine in the maymester but it was 4 weeks of hell. Just keep with it!",
        "course": "EEOB2520"
      },
      {
        "index": 41,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you are premed or dentistry, this class will definitely help you prepare for grad school. If you are pre-nursing or other, I think you better take a different class. It's an intro level weed-out course designed to deconstruct and rebuild how you learn and retain info, then apply to tricky situations. With a little physiology added in.",
        "course": "EEOB2520"
      },
      {
        "index": 42,
        "rating": 2,
        "difficulty": 5,
        "comment": "\"I highly do NOT recommend this class. There is a hard exam every week that is 36 points. No to mention you only get 20 minutes to do it so guess fast. The material is unclear and there are often mistakes that will show up in the lecture slides and on the test. The TAs & phys phabs have absolutely no idea what is going on either & give wrong info\"",
        "course": "EEOB2520"
      },
      {
        "index": 43,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Bronson is an amazing person. However, due to her passion for Human Physiology, she forgets the class is introductory and tests students very harshly. Her questions contain metaphors and analogies that sometimes take too long to figure out. Students spend more time writing notes than listening. Exam questions apply to imaginary worlds/scenarios",
        "course": "EEOB2520"
      },
      {
        "index": 44,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. B was my favorite teacher! -WEEKLY EXAMS  How I did it: -TYPE your notes quickly -Study how YOU study... change it if needed! - Study A LOT! -Record Lecture to brush up (Audacity) -Go to the Party Room (office hours) IF you are struggling that week -Night Before / Morning of Exam: Review everything! KEY- Have ONE study partner... meet WEEKLY",
        "course": "EEOB2520"
      },
      {
        "index": 45,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Bronson is a great lecturer, but her tests are tricky and often times unfair. I struggled with her awful weekly exams even after relistening to lectures multiple times. Every time I went to talk to her or asked her a question she was extremely unpersonable.",
        "course": "EEOB2520"
      },
      {
        "index": 46,
        "rating": 4,
        "difficulty": 4,
        "comment": "Also to add, don't dwell so much on the discussion posts! I only browse through them the night before each Quiz to catch her posts and take a quick look at the Phys Cafe contents for sneaky Extra Credit stuffs. Apart from that, pay attention to Bron bron's very funny jokes/facts in lectures cuz she turns those into EC questions for quizzes!",
        "course": "EEOB2520"
      },
      {
        "index": 47,
        "rating": 5,
        "difficulty": 4,
        "comment": "Ok enough has been said about how tough this course is (it is I don't deny that!!) but having scored an A for this here's my breakdown on how to survive (and ace) this class: Record lectures, and revise your notes while listening to them, go to the party rooms (like twice a week) to clarify doubts and concepts you're unsure of, and go for Kahoot!!",
        "course": "EEOB2520"
      },
      {
        "index": 48,
        "rating": 1,
        "difficulty": 5,
        "comment": "She is clearly educated as she has at doctorate, but I think she forgets she is teaching an introductory class. She lectures the basic facts and expects you to make connections that are beyond the scope of the course. She also often tests you on ambiguous content found on her discussion board and purposely tricks students on exams based on that.",
        "course": "EEOB2520"
      },
      {
        "index": 49,
        "rating": 1,
        "difficulty": 5,
        "comment": "Her powerpoint is unclear. She makes tricky questions on exam.",
        "course": "EEOB2520"
      },
      {
        "index": 50,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class was definitely tough. Don't skip class and definitely record the lectures. Exams every week that are very specific. However, Dr. Bronson wants you to succeed and has so many resources available to help you. Including virtually 24/7 help on the class discussion boards.  She's very sneaky about extra credit, pay attention to everything.",
        "course": "EEOB2520"
      },
      {
        "index": 51,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bronson is very passionate about physiology and I loved learning from her in class. Great person, but weekly exams are tough and should be studied for. Record lectures and don't skip! If you pay attention the information is very interesting and she always makes it so that the lecture is participating by asking questions. Highly recommend her.",
        "course": "EEOB2520"
      },
      {
        "index": 52,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bronson teaches an extremely difficult class, but she is able to convey nearly every single concept in class very clearly.  She always uses analogies, and different ways of remembering things.  Write down literally everything she says including analogies (she uses them for extra credit), and at least start memorizing 4 days before each quiz.",
        "course": "EEOB2520"
      },
      {
        "index": 53,
        "rating": 1,
        "difficulty": 3,
        "comment": "Terrible. Just terrible. She doesn't care about her students at all. And this is coming from someone who easily aced her class. I did well because of Quizlet, not because of her.",
        "course": "EEOB2520"
      },
      {
        "index": 54,
        "rating": 3,
        "difficulty": 5,
        "comment": "This class is very difficult, & seems almost impossible to pass. I only received the minimum grade needed for my major and that was because I focused all my time on this one class. Prepare to have no time for anything else if you take this class on top of others because you will study for the exams that are every week like they're a midterm/final.",
        "course": "EEOB2520"
      },
      {
        "index": 55,
        "rating": 5,
        "difficulty": 4,
        "comment": "You can tell Dr. Bronson REALLY cares about her students learning the material. Read the carmen discussion boards and go to the party room!!! The exams are pretty challenging and not only test your knowledge of the material, but also your ability to put together pieces of material in a way that may not have been explicitly said in lecture.",
        "course": "EEOB2520"
      },
      {
        "index": 56,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. B really has your best interest at heart with this class. She gives you plenty of opportunities to get your questions answered with the outside resources and really wants you to do well. This class has awesome TAs, too. Record lectures and try to be able to recite your notes. Make this class a priority and you will be fine.",
        "course": "EEOB2520"
      },
      {
        "index": 57,
        "rating": 4,
        "difficulty": 4,
        "comment": "Physiology is NOT easy, but Dr. Bronson makes it all possible. She gives you all the resources to succeed in her class and she does care about her students. Her weekly exams aren't set up for you to fail her class. Her goal is to make sure you know the basic and can apply it. If you put in the time & effort, you shouldn't have anything to complain",
        "course": "EEOB2520"
      },
      {
        "index": 58,
        "rating": 3,
        "difficulty": 4,
        "comment": "take advantage of the party room, record lectures, use the discussion boards. definitely the most work i've ever put in for a 3 credit hour class. her tests are games trying to trick you and even if you think you know the information you probably don't. may the odds be in your favor if you have to take phys with bronson.",
        "course": "EEOB2520"
      },
      {
        "index": 59,
        "rating": 5,
        "difficulty": 5,
        "comment": "If Bronson needed a leg, I would cut off my leg in a heartbeat.",
        "course": "EEOB2520"
      },
      {
        "index": 60,
        "rating": 3,
        "difficulty": 4,
        "comment": "Get ready to work for your grade! There are weekly exams, each worth 36 points, that require multiple hours of studying to prepare for them. With a lot of hard work, devotion to studying for this class, somewhere between ten and fifteen hours a week,  and utilizing the resources given to you, you can pass this class.",
        "course": "EEOB2520"
      },
      {
        "index": 61,
        "rating": 1,
        "difficulty": 5,
        "comment": "I highly do NOT recommend this class. There is a hard exam every week that is 36 points. No to mention you only get 20 minutes to do it so guess fast. The material is unclear and there are often mistakes that will show up in the lecture slides and on the test. The TAs & phys phabs have absolutely no idea what is going on either & give wrong info",
        "course": "EEOB2520"
      },
      {
        "index": 62,
        "rating": 1,
        "difficulty": 5,
        "comment": "Worst class ever could not pass an exam to save my life. Got E's and D's on my quizzes i did everything possible and could not wrap my brain around her quizzes. Stay away from this class unless you need it for med school!!!",
        "course": "EEOB2520"
      },
      {
        "index": 63,
        "rating": 3,
        "difficulty": 4,
        "comment": "The class is definitely challenging, but not impossible. You must go to lectures, and recording and listening to them helps tremendously. There's a test every week, and they're pretty difficult, but you get 3 exam drops, and the midterm and final are old questions from previous tests. It's a great class, but you have to work for your grade tbh.",
        "course": "EEOB2520"
      },
      {
        "index": 64,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is tough, and it is said to be a weed out for pre-med, pre-vet, and pre-dent. Now, let's face it, those classes in professional school will be tougher than this. If you cannot handle this class, med school might not suit you. RECORD the lectures and write every SINGLE DETAIL she said. It will be on the exam! Exams on every Friday!",
        "course": "EEOB2520"
      },
      {
        "index": 65,
        "rating": 3,
        "difficulty": 4,
        "comment": "One of the best professors I have had at OSU. Her explanations make physiology more simple. Her tests are difficult, I studied a minimum of 5 hours for each. If you attend lecture and pay attention you can do well. The midterm and final boost your grade along with weekly extra credit.",
        "course": "EEOB2520"
      },
      {
        "index": 66,
        "rating": 3,
        "difficulty": 4,
        "comment": "There is a quiz every week and they are HARD. However, there is a ton of extra credit. I got Mostly B's and C's and some D's on the quizzes, but with the pop quizzes (check carmen everyday), and all the extra credit she gives out (read every discussion and directions), I walked out with a B. Record lectures, go over it with notes, attend reviews.",
        "course": "EEOB2520"
      },
      {
        "index": 67,
        "rating": 3,
        "difficulty": 5,
        "comment": "Bronson is a good lecturer she has ppt slides that you must copy word-for-word bc she doesnt post slides on carmen so if you miss a day make sure u get notes from someone. Tests are tough, theres so much material that is PURE memorization, you need to memorize every bullet pt to get an A. Gives extra credit alot which is only thing saving ur grade.",
        "course": "EEOB3510"
      },
      {
        "index": 68,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Bronson was my favorite professor. She offers a lot of resources and really cares about the material she's teaching. The weekly exams are a test of knowledge and application. Learn how to read the questions and answers THOROUGHLY or you'll fail all of them. Definitely utilize the party room and discussion boards if you want a decent grade.",
        "course": "EEOB2520"
      },
      {
        "index": 69,
        "rating": 4,
        "difficulty": 3,
        "comment": "Wanted to give a clearer description- Dr. B was one of my favorite professors. The weekly exams aren't \"easy,\" but if you truly utilize the resources (i.e Party Room, exam reviews, etc) and can keep up with the material, the class is amazing. Dr. B is always willing to help and offers a TON of extra credit. Don't be frightened by old posts on here!",
        "course": "EEOB2520"
      },
      {
        "index": 70,
        "rating": 3,
        "difficulty": 5,
        "comment": "Loved her as a professor, but the class was full of A TON  of information (like 8 pages of notes for a quiz) that made it difficult to learn and understand everything before tests. Interesting class with lots of extra credit to help, but expect to put most of your efforts into this class. Notes were not posted online so recorder might help.",
        "course": "EEOB3510"
      },
      {
        "index": 71,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class is definitely one of the hardest I've taken at Ohio state. It's definitely doable if you put your mind to it but be prepared to spend a LOT of time studying for weekly exams. She gives extra credit but there is no curve. Exams are extremely tricky though ",
        "course": "EEOB2520"
      },
      {
        "index": 72,
        "rating": 3,
        "difficulty": 5,
        "comment": "Hardest class I have taken to date at OSU. You have an exam every week that is full of analogies and trick questions that sometimes just seems to test if you can guess what the correct answer is. My advice: do not skip lecture and record it. Study early because to do well you have to know everything inside-out",
        "course": "EEOB2520"
      },
      {
        "index": 73,
        "rating": 4,
        "difficulty": 4,
        "comment": "This is the best and most interesting class i have taken at OSU so far. Dr. B really cares about her students and gives them plenty of resources to succeed if they're willing to put in the effort. There are many opportunities for extra credit and easy points. There is a lot of material but she is an excellent professor. ",
        "course": "EEOB2520"
      },
      {
        "index": 74,
        "rating": 5,
        "difficulty": 5,
        "comment": "Dr. Bronson is a great lecturer. Currently enrolled in her class and I love the class. Her exams are difficult, you need to not just memorize the material, but be able to complete synthesis questions regarding them. She provides extra credit, she's entertaining to lecture to, always willing to help. Would take her again. You will need to study alot",
        "course": "EEOB2520"
      },
      {
        "index": 75,
        "rating": 4,
        "difficulty": 5,
        "comment": "This course does not test knowledge, but instead it tests your ability to answer trick questions. Do your best to take Physiology with a different professor, as the course is honestly not worth the stress. Just came here to verify what other posters said about the course.",
        "course": "EEOB2520"
      },
      {
        "index": 76,
        "rating": 1,
        "difficulty": 5,
        "comment": "This class is where med. school hopes and dreams go to die. Her lectures aren't bad, but her exams will be the death of you. She words her exams so that you get every question wrong even if you know your stuff. This class won't test your knowledge of physiology, it just teaches you how to take a test with a bunch of trick questions. ",
        "course": "EEOB 2520"
      },
      {
        "index": 77,
        "rating": 2,
        "difficulty": 5,
        "comment": "The lectures aren't bad, discussion boards and TAs are helpful, but the exams are god awful.  Tons of analogy questions, overly complicated scantron setup (and you lose points if you mess that up).  And your midterm is at 6:40 in the morning.  This class can be manageable if you put in the time, but I would avoid it altogether.",
        "course": "EEOB2520"
      },
      {
        "index": 78,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is very particular. Never be late to class! You have to fill out extensive identification info at the beginning of tests & you only get 10 mins. Get there early to fill it out before you start so you have time to take the quizzes! Lose points for things like a staple not neatly removed. She stressed me out too much. Would not take w/ her again.",
        "course": "EEOB3510"
      },
      {
        "index": 79,
        "rating": 5,
        "difficulty": 4,
        "comment": "This class is tough, and she knows it. She is very specific with her test questions. However, I have never had a professor at OSU who tries this hard to help her students. There are countless help hours available, online discussion boards, and lots of extra credit. Record the lectures and put the time in, and you'll do well. ",
        "course": "EEOB2520"
      },
      {
        "index": 80,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class is exactly what the syllabus says it is- definitely read the syllabus thoroughly! Dr. B. makes class enjoyable, the party room (office hours) and online discussion boards work very well, so if you utilize your resources you can do well. Definitely take this class only whenif you have time to prioritize it over everything else.",
        "course": "EEOB2520"
      },
      {
        "index": 81,
        "rating": 4,
        "difficulty": 5,
        "comment": "This class is extremely difficult! I still managed to get a B without ever attending lecture however, I would not recommend that approach for anyone else. She is extremely generous with the extra credit. She give you 60 free points for just filling out the scantron right. Good teacher, hardest class you will ever take.",
        "course": "EEOB2520"
      },
      {
        "index": 82,
        "rating": 4,
        "difficulty": 5,
        "comment": "I took this during May (worst decision EVER). I spent 8 hours every single day & ended up with a D. I went to the party rooms & everything. Her tests are impossible even though you know the material like the back of your hand. TAKE THIS CLASS WITH ANYONE BUT HER.",
        "course": "EEOB2520"
      },
      {
        "index": 83,
        "rating": 5,
        "difficulty": 4,
        "comment": "Dr. Bronson was the best professor I have had at OSU so far. Her class is tough but if you record the lectures, go to every class (even though they are early), go to party room, and review sessions you will be successful. She knows her class is hard so she gives plenty of extra credit and resources outside of class. Lectures are engaging and funny.",
        "course": "EEOB2520"
      },
      {
        "index": 84,
        "rating": 5,
        "difficulty": 4,
        "comment": "The class itself is very difficult but also incredibly interesting.  Anyone taking this class is definitely doing so because it is required, so if you put in hard work you can do fine.  Record the lectures, go to review sessions, and keep up with material.  The tests are VERY different and tough, no matter what they will not be easy. Great teacher.",
        "course": "EEOB2520"
      },
      {
        "index": 85,
        "rating": 3,
        "difficulty": 5,
        "comment": "Everyone is bagging on Dr. Bronson but she's honestly one of the nicest professors I've had. Yes her class is hard, but this is a weed-out class for many majors and she can't just give out free grades. Definitely take advantage of the party room, reviews, and discussion boards and you'll do fine. A lot of studying but it pays off! Good luck!",
        "course": "EEOB2520"
      },
      {
        "index": 86,
        "rating": 2,
        "difficulty": 5,
        "comment": "definitely one of the hardest classes I've ever taken in my life. The material was not that difficult but tests were worded in such a way that you are basically going to fail even if you study the material for days. Dr. Bronson gives opportunity for extra credit and you get to drop your 3 lowest weekly exams, which are every fri morning at 8 am :-)",
        "course": "2520"
      },
      {
        "index": 87,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wouldn't wish Bronson's nonsense on anyone. Her tests every Friday morning are the most irrelevant things I have ever been subjected to. Nearly all 20 questions are told in some form of analogy or trick question. The sum of her weekly tests outweighs the midterm and final combined, yet many fail these tests despite their interest in the material.",
        "course": "EEOB2520"
      },
      {
        "index": 88,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. Bronson is an awful professor who likes to make her students lives a living hell. The wording of her questions are super confusing and even if you know the information you will not do well on the weekly exams. This is a very stressful class and would not recommend it to anyone. Take this class elsewhere if possible!!",
        "course": "2520"
      },
      {
        "index": 89,
        "rating": 2,
        "difficulty": 5,
        "comment": "She's passionate about physiology and gives you a lot of resources (discussion board, Party room). That being said, the weekly exams and wording of the questions are borderline ridiculous. Knowing the material isn't enough. You have to basically memorize your notes back to back & get used to taking an 18 Q exam in 20 minutes every Fri morning :)",
        "course": "2520"
      },
      {
        "index": 90,
        "rating": 4,
        "difficulty": 4,
        "comment": "Lectures are very clear, but be sure to write down every single thing from the slides as well as every thing she says. Weekly exams are super specific and tricky which is why you need to memorize your notes almost verbatim. Luckily there are tons of chances for extra credit. Definitely read the syllabus and ANYTHING on Carmen. ",
        "course": "2520"
      },
      {
        "index": 91,
        "rating": 2,
        "difficulty": 5,
        "comment": "I'm graduating next semester and I still say this was one of the hardest classes I've had. The material itself isn't difficult, it's the way she asks questions. I disagree with the whoever says \"if someone doesn't do well its bc they didnt study.\" I studied really hard for this class and barely got a B-. ",
        "course": "2520"
      },
      {
        "index": 92,
        "rating": 3,
        "difficulty": 5,
        "comment": "If you want to do well you are going to have to pay attention to every single little detail.  \"it is the state at which the body is held at a specific VALUE point\" was an incorrect answer because it should have said \"SET point\" ... every question on every WEEKLY exam has answers like this. good luck. you'll learn a lot if you try",
        "course": "2520"
      },
      {
        "index": 93,
        "rating": 2,
        "difficulty": 5,
        "comment": "To do well in this class you better be prepared to work your behind off. This is one of the toughest class ever, although there is plenty of opportunity for extra credit and you can drop 3 of your worst quiz scores it's still painful to see quiz scores of D and F.  I did Manage a B+ but I really never felt  so stressed out. test are ridiculous  ",
        "course": "2520"
      },
      {
        "index": 94,
        "rating": 4,
        "difficulty": 5,
        "comment": "This class was a huge wake-up call to me in terms of studying. Get ready to put many hours into this course. Much of the time the questions on the weekly tests have secret \"nots\" and purposefully misspelledsimilar words to throw you off. This class will make you an expert (and paranoid) test taker. Dr. Bronson is helpful and funny, though.",
        "course": "2520"
      },
      {
        "index": 95,
        "rating": 3,
        "difficulty": 5,
        "comment": "I saw a lot of people bash her for being hard.  I guarantee those people didn't study enough.  The party room was helpful, though I didn't go very often because of other classeswork.  You will always get the grade you deserve with her.  She also figured out how to give partial credit on multiple choice exams.  One exam a week so get ready for that",
        "course": "EEOB2520"
      },
      {
        "index": 96,
        "rating": 3,
        "difficulty": 4,
        "comment": "Second time taking the course (thankful for frosh. forgiveness) and I found it easier the second time WITH THE RIGHT MINDSET.  You must attend every lecture and make time to understand her style or testing.  Very difficult to pass without attending lecture or using resources.  Weekly Exams are HARD  Midterm and Final are moderate.",
        "course": "2520"
      },
      {
        "index": 97,
        "rating": 2,
        "difficulty": 5,
        "comment": "OMG!!!! this is one of the hardest 3 hour class you will ever experience. Weekly quizzes that are so difficult to decipher. which are suppose to become easier as each wk passes . Say what every single quiz is as hard as the first one. Be prepare to study like you have never studied before and good luck because you will need it.",
        "course": "EEOB2520"
      },
      {
        "index": 98,
        "rating": 2,
        "difficulty": 5,
        "comment": "Graduating senior with a science degree. I'm used to taking tough classes but this one takes the cake. The material is not inherently harder than any other class but she makes it as difficult as she possibly can to do well. Simply learning and comprehending the material will get you nowhere because she sets her students up for failure.",
        "course": "EEOB"
      },
      {
        "index": 99,
        "rating": 3,
        "difficulty": 5,
        "comment": "She offers many opportunities to get help on the subject as well as extra credit to fluff your grade after receiving blows on tests. Read. the questions. carefully. At first glance the answers can seem obvious, but more often than not, there's a catch or a secret \"not\" hidden somewhere in there. Practice reading and attend \"Party hours\".",
        "course": "PHYSIOLOGY"
      },
      {
        "index": 100,
        "rating": 3,
        "difficulty": 4,
        "comment": "She's an awesome professor with a great personality and a love for teaching. I recommend that you record the lectures and listen to them with your notes out to study for this class. Reading the book is a nice supplement, but everything on her exams comes from the lectures. Also keep up with the discussion posts on Carmen. ",
        "course": "EEOB2520"
      },
      {
        "index": 101,
        "rating": 4,
        "difficulty": 3,
        "comment": "I took her in May which i've heard was even harder than regular semester. She is a great professor and although her tests are difficult she is preparing you for how they test in medical schoolgrad school. Attend every lecture, party room especially when Natasha is there and form STUDY GROUPS - cannot stress that enough. Don't be discouraged",
        "course": "EEOB2520"
      },
      {
        "index": 102,
        "rating": 1,
        "difficulty": 5,
        "comment": "Class is a weed-out course for many of the health sciences. It isn't about learning, its all about making things more difficult then they are. Even if you completely understand the information there is no guarantee you will succeed. Good luck! She is satan.",
        "course": "EEOB2520"
      },
      {
        "index": 103,
        "rating": 2,
        "difficulty": 4,
        "comment": "Great Great lecturer! Very thorough and has great demonstrations/examples. Answers any & all questions. Missing 1 lecture could cost you your grade... definitely recommend going to the \"party room.\" They have exam answers and TA's/Phys Phabs in there to help. Exams are THE worst. She tries to to trick you but offers extra credit. Must put in hours",
        "course": "EEOB2520"
      },
      {
        "index": 104,
        "rating": 1,
        "difficulty": 5,
        "comment": "I tried so so hard in the class and ended up doing really really bad..i went to every lecture, attended the party room and even met with her a couple of times..tests are impossible esp with double neg..other than that, shes a decent prof but avoid if u can",
        "course": "2520"
      },
      {
        "index": 105,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bronson is an AWESOME lecturer. She keeps the material interesting, provides good demonstrations, and is good at answering in class questions. Her tests, however, are definitely tricky and can be difficult. Once you get used to her tests, the class isn't too hard to pull off an A.",
        "course": "EEOB2520"
      },
      {
        "index": 106,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class is extremely difficult. At the beginning of the semester I was practically failing every weekly test. Make sure you go to the party room every week to review and also make an appointment with her if you are really struggling. There are bonus points from the online quizzes every week that definitely saved my grade!Good luck you can do it!",
        "course": "EEOB2520"
      },
      {
        "index": 107,
        "rating": 1,
        "difficulty": 5,
        "comment": "Test are HORRIBLE!!!!!!!!!!!!!! Questions are super confusing and she uses a lot of double neagtives. Avoid this class at all costs!!!!!  I sure wish I did....",
        "course": "EEOB2520"
      },
      {
        "index": 108,
        "rating": 3,
        "difficulty": 4,
        "comment": "I debated dropping this class at the beginning, but I realized that this class is definitely do-able if you put in the effort.  You MUST attend every lecture and I HIGHLY recommend attending the \"party room\" if you can!  Also record her lectures!  She says LOTS of important info that is not written in her PPTs.  She's also offers lots of extra cred",
        "course": "2250"
      },
      {
        "index": 109,
        "rating": 1,
        "difficulty": 5,
        "comment": "I tried so hard to like her, but in the end, I didn't. Made potentially interesting info downright boring and confusing...I learned more from youtube videos in 10 min than her lectures. The \"trickiness\" of her weekly exams is based on if you can guess what she thinks the correct answer should be (not on content). AVOID this professor if you can.",
        "course": "EEOB2520"
      },
      {
        "index": 110,
        "rating": 4,
        "difficulty": 4,
        "comment": "Her tests were very tricky. But you can get extra credit on the quizzesand exams, which helped me a lot. Yes, this class requires studying, but after Ochem and GenChem at OSU, it was a breeze.",
        "course": "EEOB2520"
      },
      {
        "index": 111,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is a tough course but not as bad as others are saying. You have to study daily for the weekly exams. You are awarded a ton of extra credit in this course on exams and weekly quizzes. Do not buy the textbook. Read the questions on the exams carefully, and if you know the information well you won't slip up on the wording of her questions.",
        "course": "EEOB2520"
      },
      {
        "index": 112,
        "rating": 5,
        "difficulty": 4,
        "comment": "This is a tough class which requires a lot of studying. Dr. Bronson supplies you with all information needed for the tests. Don't purchase the textbook. You MUST review your notes daily. There is a lot of extra credit in the class. Read the questions carefully and you will be fine. A hard class but not as hard as some people make it out to be.",
        "course": "EEOB2520"
      },
      {
        "index": 113,
        "rating": 2,
        "difficulty": 5,
        "comment": "By far the worst class I have ever taken(for the second time). Tricks you on exams. The  only easy part is the midterm and the final because you already have the questions(after you have failed at everything else). DO NOT TAKE THIS CLASS. You will be striving to just earn an average grade.",
        "course": "EEOB2520"
      },
      {
        "index": 114,
        "rating": 2,
        "difficulty": 4,
        "comment": "interesting subject matter and she does a good job presenting the material clearly. however, she is obsessed with tricky and ambiguous wording on her tests and only gives 20-25 mins to take them. totally agree that the tests are \"linguistic hair splitting exercises\". extra credit is the only thing saving me in this class",
        "course": "EEOB2520"
      },
      {
        "index": 115,
        "rating": 2,
        "difficulty": 5,
        "comment": "Mondieu!!! I don't care about the fact that it is a tough subject, but her crazy tricky tests really don't let you show her what you know. I wouldn't wish her and this class on anyone",
        "course": "2520"
      },
      {
        "index": 116,
        "rating": 2,
        "difficulty": 5,
        "comment": "Never worked harder in a class to get such a bad grade (no way of avoiding a C). Did everything she asked...party room...discussion groups...study group. Nothing mattered because of these screwy tests she makes up. One question was about covering an O ring with teflon tape and making it stick to itself. Dude, teflon doesnt stick to anything",
        "course": "EEOB2520"
      },
      {
        "index": 117,
        "rating": 3,
        "difficulty": 5,
        "comment": "I wanted to love this class but ended up hating it. Dr. B's obsession with trick questions, a near useless \"party room\" with her TAs, and a ridiculous number of quizzes, weekly tests and exams...sometimes a test and an exam on the same day made the class awful. I didn't get tested on what I knew, only on my ability to guess at what mattered to her",
        "course": "EEOB2520"
      },
      {
        "index": 118,
        "rating": 1,
        "difficulty": 5,
        "comment": "Bronson has in-class quizzes, weekly tests and exams. I have a 92 on the quizzes. Her weekly tests are linguistic hair splitting exercises in determining which answer is more right, even when all of the choices are literally correct. Office hours are a waste...\"maybe you should change your major\" when she didn't even know what my major was. AVOID",
        "course": "EEOB2520"
      },
      {
        "index": 119,
        "rating": 3,
        "difficulty": 5,
        "comment": "Very interesting class. Dr. B gives a lot of resources to help you study and those are great, but unfortunately, her tests have such tricky wording that it is near impossible to ace. It is a shame though, because the material is very interesting and I feel that I learned quite a bit, but my grade did not reflect that.",
        "course": "2520"
      },
      {
        "index": 120,
        "rating": 5,
        "difficulty": 3,
        "comment": "Honestly, this class isn't too bad. While I will say that the amount of studying that I have put into this class is more than all of my other classes combined, I still find the class is very interesting. I have learned A LOT from this class. Her weekly exams are a bit tough, but you can't expect to get a good score without studying seriously.",
        "course": "EEOB2520"
      },
      {
        "index": 121,
        "rating": 4,
        "difficulty": 4,
        "comment": "Learn a lot of information with little time to internalize it, at least to the degree of doing well on exams. Offers many \"resources\" but ultimately comes down to not missing online quizzes (set a calendar reminder, Carmen notifications aren't trustable) and somehow not falling for trick questions which make up about 1/2 of every exam.",
        "course": "EEOB2520"
      },
      {
        "index": 122,
        "rating": 2,
        "difficulty": 5,
        "comment": "Intentionally tries to trick you on exams. Hours of studying does not mean that you will even receive an average grade. Do not take her if this class is not necessary.",
        "course": "EEOB2520"
      },
      {
        "index": 123,
        "rating": 2,
        "difficulty": 5,
        "comment": "Took 2 other classes in addition to physio. The other two classes were 5 credit hours and I studied the most for physio. She's testing your ability to take tests.. not the information thats given. I wouldn't recommend her.",
        "course": "EEOB2520"
      },
      {
        "index": 124,
        "rating": 4,
        "difficulty": 5,
        "comment": "For a 3 credit hour class the amount of studying one has to devote is unreasonable. Many students including myself put 15+ hours a week and still only did average. If this class is not required for you then I suggest skipping it. Harder than Ochem and Anatomy put together. The exams don't even quiz you on your knowledge of material.",
        "course": "EEOB2520"
      },
      {
        "index": 125,
        "rating": 3,
        "difficulty": 5,
        "comment": "Definitely would not recommend. Her weekly exams are designed to trick you. She words them in a way that is unnecessary and distracts from the question being asked. You can study for hours and be able to explain the concepts in detail, and still fail. You also only get 20 minutes and she yells at you when the time is up.",
        "course": "EEOB2520"
      },
      {
        "index": 126,
        "rating": 5,
        "difficulty": 2,
        "comment": "Cindy is one of the best professor's at OSU...she is an amazing lecturer who keeps the class entertained and offers many ways to succeed in this class. She has a discussion board for questions, a party room, and review sessions weekly! Her test might be a bit difficult but if you know your material the class is a breeze",
        "course": "EEOB2520"
      },
      {
        "index": 127,
        "rating": 4,
        "difficulty": 5,
        "comment": "She is a great lecturer, but her tests take quite some time getting used to. Go to the Party Room, read discussion boards and RECORD LECTURES. Nearly everything she says is vital to successful tests. Many people work hard and still do only average.",
        "course": "EEOB2520"
      },
      {
        "index": 128,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class was tough but doable. The book is NOT necessary and she tests off of the notes. She gives plenty of bonus in the class if you go to the party room, read the discussion board regularly, and come to class (gives bonus Q about these on exams). The exams are weekly and the midterm/final are mostly previously asked Q.",
        "course": "EEOB2520"
      },
      {
        "index": 129,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class requires a ridiculous amount of time studying.  I consistently study about 10-15 hours outside of class a week and am still earning a low B. She is a brilliant lecturer and offers quite a bit of help, but unfortunately the wording of her exams makes complete success nearly impossible. Re-read the questions as many times as you can.",
        "course": "EEOB2520"
      },
      {
        "index": 130,
        "rating": 3,
        "difficulty": 5,
        "comment": "AVOID THIS CLASS!!! you learn absolutely nothing. you spend hours studying and it doesn't pay off. she expects you to write down her notes verbatim on short answer. You might as well just memorize her notes. What kind of education is this??",
        "course": "EEOB3510"
      },
      {
        "index": 131,
        "rating": 4,
        "difficulty": 4,
        "comment": "I am currently taking physiology with her. Her weekly tests are VERY tricky, and the amount of information that needs to be memorized is INSANE. However, she is nice as a person and sometimes will make funny jokes during her lectures. However, this is a hard hard with a LOT of memorization required.. You also have to avoid getting tricked.",
        "course": "EEOB2520"
      },
      {
        "index": 132,
        "rating": 1,
        "difficulty": 3,
        "comment": "She's nice enough, but is also the embodiment of what is wrong with our education system. The nature of the course material requires some memorization, but she takes it over the top, emphasizing the reiteration of her notes verbatim instead of the understanding of important concepts. Exams are designed to trick students and are graded unfairly.",
        "course": "EEOB3510"
      },
      {
        "index": 133,
        "rating": 3,
        "difficulty": 5,
        "comment": "Bronson is extremely difficult and her questions are insane. The short answer questions are more of guessing what she is thinking rather than actually knowing anything about cell bio. She's pretty cool as a person though",
        "course": "EEOB3510"
      },
      {
        "index": 134,
        "rating": 3,
        "difficulty": 5,
        "comment": "It was a very challenging class. Be prepared to work hard and still fail",
        "course": "EEOB2520"
      },
      {
        "index": 135,
        "rating": 5,
        "difficulty": 4,
        "comment": "CLB is an awesome lecturer. Just by listening to the lecture you can learn a lot of material. Take full advantage of the discussion board and party room.",
        "course": "EEOB2520"
      },
      {
        "index": 136,
        "rating": 4,
        "difficulty": 5,
        "comment": "Dr. Bronson is a superb lecturer, and has an excellent sense of humor. MAKE SURE to take note of the type of clothes she wears and keep up to date with the discussion board as they will show up as extra credit questions on exams! Study until your brain explodes and you will survive. Disclaimer: her exams are VERY tricky, read everything CAREFULLY.",
        "course": "EEOB2520"
      },
      {
        "index": 137,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cindy is an awesome professor! While I will agree the wording is very tricky on her exams, she definitely wants her students to succeed. Took this semester course in one month, and it is still doable. Loved Cindy and her humor keeps the class interested. As long as you invest the time for this class, you will be able to attain A/B just fine.",
        "course": "EEOB2520"
      },
      {
        "index": 138,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class is not nearly as hard as students on here make it sound. Pay attention and lecture and study for an hour or two before the exams and you're golden. Don't buy the textbook, just make sure you go to each lecture.",
        "course": "EEOB2520"
      },
      {
        "index": 139,
        "rating": 5,
        "difficulty": 4,
        "comment": "I love Dr. Bronson. She's extremely helpful, engaging, and tries to connect everything we learn to real life situations. This class is tough, lots of things to know. Her tests are fair (wording can be tricky). Took it in may: 9 tests (30 questions/each)/ drop one + one big final (90 questions, 55 from previous tests 1-8).",
        "course": "EEOB2520"
      },
      {
        "index": 140,
        "rating": 4,
        "difficulty": 5,
        "comment": "Very fair professor. She wants you to suceed and gives you all the material to do so. It's a very difficult class but there's no reason you can't do it. She presents the material in a way that makes sense and sticks. Study hard and you'll do fine.",
        "course": "EEOB2520"
      },
      {
        "index": 141,
        "rating": 2,
        "difficulty": 5,
        "comment": "She makes the class unnecessarily difficult, while telling you she \"wants you to succeed.\" Weekly exams are pure trick questions, a lot of the time based on things she mentioned as a \"fun fact\" in class. I did well overall but I had to put more work into it than I did for a 5 credit hour class. Avoid her.",
        "course": "EEOB2520"
      },
      {
        "index": 142,
        "rating": 2,
        "difficulty": 5,
        "comment": "Class systematically prevents you from getting an A. Expect a C, a B if you are taking no other sciences and/or have a light courseload. Bronson uses trickery on her weekly exams. The notes aren't really notes but more guidelines and you have to infer things on your own by going to the supplemental class or reading the online class discussions.",
        "course": "EEOB2520"
      },
      {
        "index": 143,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hardest teacher I have ever had in my life. Spent countless hours studying and still only got a C in the class.",
        "course": "EEOB2520"
      },
      {
        "index": 144,
        "rating": 1,
        "difficulty": 4,
        "comment": "She presents the material in a non scientific and unintelligent way. The tests are not about knowledge but how well you memorize her notes.  The notes don't actually teach you anything.  Extra credit points are given out on tests for students who listen to random things and jokes she says as if it were a junior high class.",
        "course": "EEOB3510"
      },
      {
        "index": 145,
        "rating": 5,
        "difficulty": 4,
        "comment": "She's really smart, goofy, kinda strange, but decent teacher.  Go to class, get the clicker app on your phone, and study twice as much as you think you need to and be able to apply the material",
        "course": "EEOB2520"
      },
      {
        "index": 146,
        "rating": 5,
        "difficulty": 3,
        "comment": "This class take a lot of studying but the results will show if you put in the work. For being an early class she does a good job making the material interesting. Go to class she gives clicker points everyday hat help your grade a lot",
        "course": "EEOB2520"
      },
      {
        "index": 147,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class is really frustrating because you study a ton and feel like you know the information but the quizzes are really hard! Be ready to study several hours a week. She has lots of bonus points throughout that help. Also always go to class because you get participation points.",
        "course": "EEOB2520"
      },
      {
        "index": 148,
        "rating": 1,
        "difficulty": 5,
        "comment": "Don't ever take her class! Hardest thing I've ever done in my life. Also, classes are at 7 and 8 am... NOT COOL!",
        "course": "EEOB2520"
      },
      {
        "index": 149,
        "rating": 3,
        "difficulty": 5,
        "comment": "I've taken her three times now, and her exams are very hard and detailed. She expects you to remember insignificant details. I do not suggest anyone takes her for any class, ever.",
        "course": "EEOB415"
      },
      {
        "index": 150,
        "rating": 5,
        "difficulty": 4,
        "comment": "There is no attendance taken, but you will have the opportunity to catch little details that end up being bonus questions on the exams. No mandatory recitation, so I suggest choosing a time (or more) weekly to attend the party room. Office hours helped me tremendously. Textbook is in the party room so don't buy. She tests off of her lectures only.",
        "course": "EEOB232"
      },
      {
        "index": 151,
        "rating": 5,
        "difficulty": 3,
        "comment": "I took EEOB 415 last year to help me in veterinary school. I am so glad I took it! The topics discussed are extremely practical (yes, anyone going into medicine of any sort, you will see this stuff again!) and Cindy is a caring and helpful instructor. I would recommend taking this class to anyone going into grad school for med or vet school!",
        "course": "EEOB415"
      },
      {
        "index": 152,
        "rating": 4,
        "difficulty": 5,
        "comment": "Amazing class and awesome professor!  There was so much to learn. It is a lot to take in at once but it was amazing.",
        "course": "EEOB232"
      },
      {
        "index": 153,
        "rating": 5,
        "difficulty": 4,
        "comment": "The material is definitely not easy, but she provides all the resources that are required to succeed in the class. I highly recommend you attend every lecture, utilize the party room and study constantly! Stay focused, it will be worth it when you are finished!",
        "course": "EEOB232"
      },
      {
        "index": 154,
        "rating": 4,
        "difficulty": 4,
        "comment": "Cindy will drive you crazy, but you'll learn a lot.  You have to study. Record her lectures, even the smallest thing could be on them. Tests every week. Read the syllabus. All of it. Learn how to take her tests - read every letter- and you'll be fine. It's interesting material and she's really organized.",
        "course": "EEOB232"
      },
      {
        "index": 155,
        "rating": 4,
        "difficulty": 3,
        "comment": "The class is difficult, but I managed to do last minute crams each night of a quiz/exam and did fine.  Go to class and take notes and you'll be fine.  She expects you to keep up with carmen discussion boards but when there were over 2000 it gets old.",
        "course": "EEOB232"
      },
      {
        "index": 156,
        "rating": 3,
        "difficulty": 4,
        "comment": "Dr Bronson is the best professor I have had at the OSU so far! The class is tough, but so is Human Physiology. She makes the material very organized, there are many resources to use and succeed 24/7 Carmen, party room! The class is not for lazy students, but you'll learn a lot. I started bad at first and then adjusted to the necessary effort level.",
        "course": "EEOB232"
      },
      {
        "index": 157,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class is extremely difficult. You have to go to every lecture (extra credit questions on tests comes from in class examples/actions), take very good notes (she doesn't put the powerpoints online, ever), there is a test every week (only 20 minutes for it) and she yells instead of using a microphone in a large lecutre hall. GOOD LUCK.",
        "course": "EEOB232"
      },
      {
        "index": 158,
        "rating": 4,
        "difficulty": 5,
        "comment": "Very difficult class that requires you to learn the most minute details.  Bronson iws incredibly helpful, and obviously knows very well what she is talking about.",
        "course": "EEOB415"
      },
      {
        "index": 159,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class is easy once you get the hang of it. You must be an excellent note-taker for this class and a good studier. Strongly recommend going to the party room at least once a week. Go in when Amanda is there and ask her to make a flow chart every week. My quizzes went from C's to A's immediately after learning how to study for this class. ",
        "course": "EEOB232"
      },
      {
        "index": 160,
        "rating": 2,
        "difficulty": 5,
        "comment": "Very difficult class. Bronson is very nice and provides a lot of opportunities for help. Weekly quizzes that are kind of difficult, but overall an interesting class.",
        "course": "EEOB232"
      },
      {
        "index": 161,
        "rating": 4,
        "difficulty": 4,
        "comment": "Bronson was very helpful. She gave the students plenty of resources to be successful in her class. The weekly quizzes are very tough, but if you  if use her resources you will be fine. You don't need to buy the book, unless you like to go into further detail/understanding of the material.  Very good Professor",
        "course": "EEOB232"
      },
      {
        "index": 162,
        "rating": 3,
        "difficulty": 5,
        "comment": "Cindy is very nice, helpful, and excellent at replying to email. Her weekly quizzes are ridiculously hard though! Class average was a D. I ended up dropping and taking it at CSCC because I need a good GPA for my program at OSU. However she  still let me sit in on lectures after dropping. She's very nice, just very tough. Read your book in detail!!!",
        "course": "EEOB232"
      },
      {
        "index": 163,
        "rating": 5,
        "difficulty": 3,
        "comment": "If you show up to class on time everyday, take good notes, and study every week you will get an A. Dr. Bronson is the nicest professor you will have. She wants her students to do well!",
        "course": "EEOB232"
      },
      {
        "index": 164,
        "rating": 5,
        "difficulty": 5,
        "comment": "Amazing. She is the most understanding teacher of all times. The best at osu for helping students out and making special arrangements for them if need be under any circumstance. She is the definition of what a teacher and professor should be.  she is truly an angel from heaven .",
        "course": "EEOB232"
      },
      {
        "index": 165,
        "rating": 2,
        "difficulty": 5,
        "comment": "Dr. Bronson tries really hard to make class fun at 7:18 am, but her analogies are not scientific and her exams are extremely tricky.  The class averages for the quizzes are in the D range.  She asks detailed questions about topics she barely skimmed the surface of.  She doesn't make slides or extra info that may help you available online. Avoid her",
        "course": "EEOB232"
      },
      {
        "index": 166,
        "rating": 3,
        "difficulty": 5,
        "comment": "Dr. Bronson is very clear in her lectures and keeps the class interesting, even at 7:18 in the morning. However, her weekly exams are impossible! Our class average was a D. If you aren't required to, DON'T take this class. It will not help your GPA.",
        "course": "EEOB232"
      },
      {
        "index": 167,
        "rating": 2,
        "difficulty": 5,
        "comment": "She knows her stuff, but her way of trying to test people is ridiculous. Her weekly tests try to trick you more than test you. The class is only about 400 points with about 50-60 bonus points with most people getting a C or B. The only people that go A's attended out of class meetings which turned the 5 credit class into a 10 credit one. Outrageous",
        "course": "EEOB232"
      },
      {
        "index": 168,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is an amazing teacher. She explains everything very well, but the EEOB course is very difficult. My only complaint is that her quizzes are very difficult and often unclear, so study hard.",
        "course": "EEOB232"
      },
      {
        "index": 169,
        "rating": 4,
        "difficulty": 4,
        "comment": "This is easily the best class that I have taken at Ohio State.  Yeah, the time was awful, the class is pretty hard and you have to study a lot for the weekly quizzes, but she makes the material really interesting and there are soooo many resources to help you. If you go to office hours and study you'll do just fine.",
        "course": "EEOB232"
      },
      {
        "index": 170,
        "rating": 5,
        "difficulty": 2,
        "comment": "Dr. Bronson does a great job of explaining the material",
        "course": "EEOB232"
      },
      {
        "index": 171,
        "rating": 1,
        "difficulty": 5,
        "comment": "Hate this class so much. I took a physiology course the quarter before I took this class and got an A, I was very discouraged in this class. Her weekly quizzes are very unclear and some questions just dont even make sense.",
        "course": "EEOB232"
      },
      {
        "index": 172,
        "rating": 4,
        "difficulty": 5,
        "comment": "Good Professor, hard class. Gives quizzes every week, even the same day as midterm and final",
        "course": "EEOB232"
      },
      {
        "index": 173,
        "rating": 4,
        "difficulty": 5,
        "comment": "Most difficult class at a 200 level, but completely worth it. You will learn more about how you think you study than you ever wanted.  She is also the MOST helpful professor you will ever have. This class is demanding, challenging, but if you go to class, take excellent notes, and have good analytical skills, you will do great!",
        "course": "EEOB232"
      },
      {
        "index": 174,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great prof! The class has hard material and she explains everything very well. Make sure to get all of the notes if classes are missed because all of the tests are made directly from the notes.",
        "course": "EEOB232"
      },
      {
        "index": 175,
        "rating": 4,
        "difficulty": 5,
        "comment": "She's  a great teacher.  A lot of material. You better attend every class because otherwise you will fail her exams. if you study you will do well.  A ton of notes need to be taken as well.",
        "course": "EEOB232"
      },
      {
        "index": 176,
        "rating": 2,
        "difficulty": 5,
        "comment": "She is great! YOU MUST ATTEND ALL LECTURES. if you don't, say hello to a horrible grade. Tests are multiple choice, and either record her lectures and take notes or copy down EVERYTHING she says in order to be able to get all the material in and understood.  Flow charts work best for the material in the class. She offers a ton of bonus. go to class",
        "course": "EEOB232"
      },
      {
        "index": 177,
        "rating": 5,
        "difficulty": 4,
        "comment": "Always willing to help and answer your questions! Attendance is not mandatory, but you should attend EVERY lecture because she puts bonus questions on the exams that only people who attend will know the answers too. Studying is a must for this class! Her exams can be very tricky if you do not study! Overall, great class and lots of work!",
        "course": "EEOB232"
      },
      {
        "index": 178,
        "rating": 4,
        "difficulty": 2,
        "comment": "Cindy is an excellent professor; really knows her material. You definitely HAVE TO STUDY for the weekly exams, or else you will fail. It's an early class, but her jokes are very enjoyable and will keep you awake! Very passionate about her class, and very high energy. Don't slack on the studying, study every day b/t the weekly exams.",
        "course": "EEOB232"
      },
      {
        "index": 179,
        "rating": 3,
        "difficulty": 4,
        "comment": "I can't believe Bronson is getting such good ratings. This was probably the worst class I've taken at Ohio State. I studied for hours and still could not get an A on some of those WEEKLY exams. Her jokes aren't funny at 718am, which is the only time the class is ever offered. Don't take this class unless it is required, it's a tough one.",
        "course": "EEOB232"
      },
      {
        "index": 180,
        "rating": 5,
        "difficulty": 3,
        "comment": "Cindy was the best prof at 7:18 in the morning and well worth getting out of bed. Her exams are straight forward and she offers extra credit for those that come to class and pay attention. She rocks my socks",
        "course": "EEOB232"
      },
      {
        "index": 181,
        "rating": 5,
        "difficulty": 3,
        "comment": "Great professor. She is very intelligent and helpful. Just go to her office hours if you have any problems at all.",
        "course": "EEOB440"
      },
      {
        "index": 182,
        "rating": 5,
        "difficulty": 1,
        "comment": "One of the nicest people you will meet. Study her notes mad and you'll do well. It says alot when 40% of the class gets A's Can't wait to have here again for 415.",
        "course": "EEOB232"
      },
      {
        "index": 183,
        "rating": 5,
        "difficulty": 5,
        "comment": "This professor ROCKS!  She is the best professor I've ever had.  Intelligent, makes class fun, and just all around wonderful.  She stretches your mind but gives you plenty of opportunities to succeed if you're not doing well.  Attend every class, and read the discussion boards.Tests are REALLY hard, but there's extra credit around every corner.",
        "course": "EEOB232"
      },
      {
        "index": 184,
        "rating": 5,
        "difficulty": 5,
        "comment": "Professor Bronson is one of the best professors I've ever had! She is always willing to help you in any situation. Yes,the class is difficult so be prepared for that and attend class every single day and try not to miss even a min,because everything covered in class is extremely important. I recommend using recording devices! Good Luck:)",
        "course": "EEOB232"
      },
      {
        "index": 185,
        "rating": 2,
        "difficulty": 4,
        "comment": "This class is pretty difficult. You need to attend class if you want to do well on the WEEKLY exams. I also HIGHLY suggest the book--the material is very confusing and difficult so the book helps. Cindy and the TA's are helpful--there is alot of after hour help and she is constantly on Carmen to help. 7am sucks--but go to class! Good Luck!",
        "course": "EEOB232"
      },
      {
        "index": 186,
        "rating": 5,
        "difficulty": 4,
        "comment": "Cindy Bronson is a very good professor. Her class is not easy at all though if you do not put any effort into learning. The TA's are very helpful and so is Cindy. Even though the class is very early, make sure you go to class! If you miss a lecture, you will miss very valuable information. OH...and study, study, study.",
        "course": "EEOB232"
      },
      {
        "index": 187,
        "rating": 4,
        "difficulty": 5,
        "comment": "She really knows her science & has lousy grammar. She & her TAs provide lots out of classroom study/review opportunities, class examples are fun but clinically irrelevant. You do learn your stuff though. If you want to have solid clinical application, take the class at OSU-N w/Dr. St. John.",
        "course": "EEOB232"
      },
      {
        "index": 188,
        "rating": 5,
        "difficulty": 4,
        "comment": "Easily the best professor I have had so far at Ohio State.  She is SO willing to help students and go the extra mile.  This class is definitely challenging but she has such a passion and talent for teaching that she really is a huge help.  I love her! TAKE HER IF YOU CAN.",
        "course": "EEOB232"
      },
      {
        "index": 189,
        "rating": 4,
        "difficulty": 3,
        "comment": "This class is not easy, but Cindy and her TAs are very helpful. Lots of bonus questions! She also has some funny jokes.",
        "course": "EEOB232"
      },
      {
        "index": 190,
        "rating": 5,
        "difficulty": 4,
        "comment": "Cindy is an excellent instructor.  She knows her stuff and does an amazing job at transferring that knowledge to any student who has the desire and work ethic needed to ace her class.  The course is challenging for an intro class but Cindy and her TAs go the extra mile to help.  Attend class and visit the 'Party Room' and you will do well.",
        "course": "EEOB232"
      },
      {
        "index": 191,
        "rating": 5,
        "difficulty": 4,
        "comment": "She is hilarious with some of her comments. Its at 718 but she makes it bearable. Detailed slides & fantastic analogies- attendance isn't mandatory but it's highly recommended. If you miss a lecture it's not easy to get back on track. Test every tuesday- a lot of grades, but they should be taken seriously.",
        "course": "EEOB232"
      },
      {
        "index": 192,
        "rating": 5,
        "difficulty": 3,
        "comment": "This has been one of my favorite classes at OSU.  She is a great teacher and genuinly cares about the students.  She has gone above and beyond to help this quarter.",
        "course": "EEOB232"
      },
      {
        "index": 193,
        "rating": 5,
        "difficulty": 3,
        "comment": "Just a fantastic teacher... She made physiology fun and easy to learn.",
        "course": "EEOB232"
      },
      {
        "index": 194,
        "rating": 5,
        "difficulty": 3,
        "comment": "Dr. Bronson is one of my favorite profs I've had at OSU. She presents the material in an easy-to-understand way with lots of analogies and is genuinely interested in helping students do well. Going to lecture and UNDERSTANDING the material makes studying MUCH easier. If you simply memorize and regurgitate, the tests will be very difficult.",
        "course": "EEOB232"
      },
      {
        "index": 195,
        "rating": 4,
        "difficulty": 4,
        "comment": "232 is an intro but not easy. Lectures are pretty clear and organized fairly well with the exception of the abbreviations she uses during class. Tests are veryyyy detailed orientated but straight from the notes. But if you can get the tests from the previous quarters, the questions are the extremely similar if not the same, so pay attention.",
        "course": "EEOB232"
      },
      {
        "index": 196,
        "rating": 1,
        "difficulty": 5,
        "comment": "I wrote that proteins &quot;exits&quot; instead of &quot;were transported&quot; and I got marked off. Everybody has some story like that &quot;make&quot; instead of &quot;generate&quot; etc etc. Memorize every word of her list.",
        "course": "EEOB415"
      },
      {
        "index": 197,
        "rating": 1,
        "difficulty": 5,
        "comment": "Dr. Bronson is a nice person, but I can't stand her teaching style.  Her lectures are comprised of list after list of names and functions, and her quizzes/exams are a binging/purging exercise in memorization.  Not to mention that the test and essay questions are poorly written and harshly graded.  Thank god this is my last class with her.",
        "course": "EEOB415"
      },
      {
        "index": 198,
        "rating": 1,
        "difficulty": 3,
        "comment": "You must memorize her &quot;lists&quot; to do well. Deviate 1 word from her lecture notes, and you will get marked off on the exam. Her explanations are completely unhelpful, and her lecture notes are very confusing. The only saving grace in her class is the insane amount of extra credit.",
        "course": "EEOB415"
      },
      {
        "index": 199,
        "rating": 3,
        "difficulty": 5,
        "comment": "way too early! the tests are hard!! you basically have to know every single word of the notes she changes one little word which confuses you even more!",
        "course": "EEOB232"
      },
      {
        "index": 200,
        "rating": 4,
        "difficulty": 4,
        "comment": "This class is way too early. She's an overall good prof, but if you go in with a bad attitude because it's so early and you're tired, it's hard to like her. She doesn't use the book at all and you really don't need it at all. Overall, she's ok.",
        "course": "EEOB232"
      },
      {
        "index": 201,
        "rating": 4,
        "difficulty": 5,
        "comment": "Very Organized and helpful.  The class was very challenging but Bronson did everything to help.",
        "course": "EEOB232"
      },
      {
        "index": 202,
        "rating": 2,
        "difficulty": 5,
        "comment": "Cynthia Bronson is a worthless instructor. She has managed to take what would ordinarily be an interesting but challenging course and turn it into arbitrary memorization of terms and concepts. Her lecturing lacks explanation for her unposted slides. Prepare yourself for the exam questions, they are ambiguous in their content and expected answer.",
        "course": "EEOB415"
      },
      {
        "index": 203,
        "rating": 4,
        "difficulty": 5,
        "comment": "The best prof that I have ever had.  Was a lot of fun, which was important becasue this class was not easy and took a lot of time.  Do not wait till the last night for the quizes, or they will kill you.  If you go to class and study often, you will enjoy this class.",
        "course": "EEOB232"
      },
      {
        "index": 204,
        "rating": 4,
        "difficulty": 5,
        "comment": "CINDY IS AWESOME!! I took cindys class last year and consider her one of the best teachers I have ever had!There is alot of information and it is be overwhelming but GO TO LECTURE and GO to the study hours given by the TA's. Also always take the practice quizes. Overall, if you have to take this class and you get cindy as your prof.U R LUCKY!",
        "course": "EEOB232"
      },
      {
        "index": 205,
        "rating": 4,
        "difficulty": 4,
        "comment": "Dr. Bronson is a great teacher. Unfortunately, her class is extremely hard. She was very helpful and very funny. I went to class every day, took notes, and studied and her quizzes killed me. They're extremely tricky and one work will make the question wrong. Good luck with the class.",
        "course": "EEOB232"
      },
      {
        "index": 206,
        "rating": 5,
        "difficulty": 4,
        "comment": "I took her class a year ago and still remember material because of her dry humor and analogies.  She got the class involved.  She was one of the best lecturers I had.  I also quickly found it helpful to study for quizes to play back taped lectures.",
        "course": "EEOB232"
      },
      {
        "index": 207,
        "rating": 4,
        "difficulty": 2,
        "comment": "DON'T BUY THE BOOK, all you will need is from the lecture and cindy can clarify any confusion, ALWAYS ATTEND LECTURE, it's early but it will help you score big and study less, just make sure you right down EVERYTHING she says,not just off the slides, 2 quizzes dropped but keep up with it, beware,no curve, overall an excellent prof,i'd say go for it",
        "course": "EEOB232"
      },
      {
        "index": 208,
        "rating": 3,
        "difficulty": 4,
        "comment": "Quizzes every tuesday.  Complicating, and a bit tricky,you def. have to know what your talking about because she puts answers that could be right if you over look one word!  She is very helpful if you go to office hours and reviews (of which I recommend)  You also drop 2 quizzes, but do not depend on this because as class goes it goes more in depth",
        "course": "EEOB232"
      },
      {
        "index": 209,
        "rating": 3,
        "difficulty": 5,
        "comment": "this class sucks..the concept sucks and the teacher tries to make it entertaining but its just not. The exams are very difficult and the graders dont grade very easily..i loved all my other eeob classes, this was the worst of them all",
        "course": "EEOB413"
      },
      {
        "index": 210,
        "rating": 2,
        "difficulty": 3,
        "comment": "Got an A in the class and only went to half the lectures.  She refuses to post ppt slides online but u can go to office hours and write them out if you miss lecture.  Students posted typed out notes for every lecture in the carmen student forum.  This class gets really easy in the second half of the quarter...",
        "course": "EEOB232"
      },
      {
        "index": 211,
        "rating": 5,
        "difficulty": 3,
        "comment": "Prof. Bronson is an excellent professor. She will help you a lot if you ask. Tries to make class fun. Makes you think and apply what learn. Lectures are key - skip them and you could have trouble. Quizzes aren't as easy as they may first appear, so watch for trick answers. Altho not needed for class, book is a good investment. Helps fill in holes.",
        "course": "EEOB232"
      },
      {
        "index": 212,
        "rating": 5,
        "difficulty": 5,
        "comment": "Physiology is meant to be hard and it was, but with a good teacher you can learn it.  Dr. Bronson is great for such a cause.  The tests are hard, but nothing on them is very something in which you have never seen (as long as you went to class).",
        "course": "EEOB410"
      },
      {
        "index": 213,
        "rating": 1,
        "difficulty": 3,
        "comment": "At first she'll kind of wierd you out, but then you get used to it and appreciate her wierd ways. I think it makes class kind of refreshing to have someone so interested in it. She presents it in an interesting way as well. The material from her class could have made the class the most boring ever. But she presented it well and made the best of it.",
        "course": "EEOB410"
      },
      {
        "index": 214,
        "rating": 5,
        "difficulty": 3,
        "comment": "She's a great teacher, very helpful and cares about students. Class starts at 7:18 AM, but going to class really helps you do well. Make sure you don't mess up the weekly quizzes because they weigh a lot. I like the materials we learned. I really didn't study much, ended up with B+. Wish I had gone to class more often than 12 times.",
        "course": "EEOB232"
      },
      {
        "index": 215,
        "rating": 5,
        "difficulty": 3,
        "comment": "I thought the class was hard, but it was because the material wasn't that interesting to me, not because cindy wasn't a good teacher.  She gives detailed notes in class and takes the test questions right from them.  She was INCREDIBLY willing to help if anyone asked or went to see her.  She is a really nice lady!!",
        "course": "EEOB410"
      },
      {
        "index": 216,
        "rating": 5,
        "difficulty": 1,
        "comment": "Personally I think this class is awsome.  If you've ever taken anatomy, honors biology, and chemistry this class should be cake.  If you haven't taken many sciences, be prepared.  The class average sits at a D on quizzes and exams.  Dr. Bronson is very willing to help and tries to make the class fun despite the fact it is so early in the morning.",
        "course": "PHYSIOLOGY232"
      },
      {
        "index": 217,
        "rating": 3,
        "difficulty": 4,
        "comment": "This class is hard and early in the morning so it's even harder to focus.  I think her quizzes are difficult. She does an ok job of explaining but I thought she moved a bit fast.  Prepare to spend alot of time on this class!! Quizzes every week and a midterm and final.",
        "course": "EEOB232"
      },
      {
        "index": 218,
        "rating": 5,
        "difficulty": 3,
        "comment": "Very clear as to her requirements, really willing to help students outside of class.  Be prepared for a LOT of memorization.  Must attend lecture or get notes to receive a good grade.",
        "course": "EEOB410"
      }
    ],
    "SEI": []
  }
]